{"id":"00063229-34dd-4247-a7d8-1aba314b5e0a","article_link":"https://cointelegraph.com/news/south-korea-stops-short-allowing-crypto-donation-laws","website_source":"Cointelegraph","article_type":"News Article","summary":"Department store gift vouchers, stocks and loyalty points from tech giants can be donated to charities, but not crypto.","title":"South Korea stops short of allowing crypto in updated donation laws","detailed_content":"Digital currencies have been excluded from newly amended donation legislation in South Korea, which could be a blow to the country’s charities and donation drives. \nOn May 5, local media outlet Kyunghyang Shinmun reported that the Ministry of Public Administration stated that some amendments to South Korea’s Donations Act have been filed but restrict the use of crypto assets for donation.\nStarting in July, those wishing to donate to charitable organizations or causes will be able to use various new methods, such as department store gift vouchers, stocks and loyalty points from Korean internet giant Naver, but not crypto assets, such as Bitcoin\nBTC\n$63,046\n.\nThe act on the collection and use of donated goods was first enacted in 2006 when there were fewer types of payment methods and smartphones were not widespread, it noted.\nMethods of donation were also expanded from bank transfers and online methods to include automated response systems, postal services and logistics services.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe ministry didn’t provide reasoning for excluding digital asset donations despite their popularity in South Korea; however, the legislation is set to permit donations in local government-issued, Korean won-pegged stablecoins and blockchain-issued gift vouchers.\nMore than $2 billion is estimated to have been donated globally using cryptocurrency as of January 2024, according to The Giving Block, a market that local charities would not be permitted to take. \nTop donated cryptocurrencies in 2024. Source: The Giving Block\nMeanwhile, across the pond, it was recently reported that more than half of American charities now accept donations in digital assets.\nRelated: Blockchain improves charity transparency — But is it right for everyone?\nIn late April, it was reported that South Korea was aiming to promote its temporary crypto crime investigative unit into an official department to tackle increasing crypto-related crimes and financial fraud.\nIn related news, Singapore-based crypto exchange Crypto.com is struggling to find inroads into South Korean markets due to regulatory hurdles.\nIn April, Cointelegraph reported that South Korean authorities found Anti-Money Laundering-related problems in the data submitted by the exchange and launched an “emergency on-site inspection” to monitor its activities.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-06","tags":["#Blockchain","#Donations","#Charity","#South Korea","#Regulation"],"author":"by Martin Young","category":null}