{"id":"00d21b89-4361-451d-98f6-28cc2d9b4d70","article_link":"https://cointelegraph.com/news/paypal-opens-pyusd-stablecoin-us-dollar-conversions-cross-border-transfers","website_source":"Cointelegraph","article_type":"News Article","summary":"The cross-border payments will be handled via PayPal’s Xoom subsidiary.","title":"PayPal opens PYUSD stablecoin to USD conversions for cross-border transfers","detailed_content":"PayPal will allow all United States users outside the state of Hawaii to fund money transfers to family and friends abroad using U.S. dollars converted from its native stablecoin PayPal USD (PYUSD).\nAccording to the April 4 announcement, the service, powered by PayPal’s Xoom, is able to fund money transfers via PYUSD to more than 160 countries with no Xoom transaction fees. “By introducing the option to fund cross-border money transfers with USD converted from PYUSD, Xoom now offers an easy and reliable way for U.S. users to send money abroad using PYUSD as a funding source,” the company wrote, adding: \n“When this option is selected, Xoom will convert the PYUSD in a U.S. user’s PayPal Cryptocurrency Hub to USD currency with no crypto sale fee, and recipients will receive funds in the fiat currency selected by the sender.\"\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThrough the service, funds can be sent abroad either to a recipient’s bank account, a mobile wallet address or a financial institution for pickup. Transactions not denominated in U.S. dollars will be subject to currency conversion, which includes a spread. All U.S. users can use the service except in Hawaii, where the holding of cryptocurrencies with PayPal is prohibited by state law.\nThe issuance of and custody of PayPal USD is performed by Paxos Trust Company in New York. Since its launch last August, close to $200 million PYUSD has been issued, a number well below USD Coin’s\nUSDC\n$1.00\nmarket cap of $32.9 billion and Tether’s\nUSDT\n$1.00\n$110 billion. Jose Fernandez da Ponte, senior vice president of PayPal’s Digital Currency Group, said that the firm’s goals surrounding PYUSD are to create “a stable value to maximize user confidence and ensure it had utility for commerce and payments.”\nThe same day, Ripple announced it would launch its own U.S. dollar-backed stablecoin to rival the $150 billion stablecoin market. Similarly, on April 3, Nick van Eck, the son of investment management maestro Jan van Eck, is set to launch a new U.S. dollar-backed stablecoin after closing a $12-million funding round.\nRelated: What is PayPal USD, and how does it work?\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-04","tags":["#Blockchain","#PayPal","#Cryptocurrencies","#Business","#Adoption","#PayPal USD"],"author":"by Zhiyuan Sun","category":null}