{"id":"023f7a61-cd59-4fa6-bc03-00d00763ccff","article_link":"https://cointelegraph.com/news/securitize-blackrock-47m-funding-round","website_source":"Cointelegraph","article_type":"News Article","summary":"Crypto firms Aptos Labs, Paxos and Circle also took part in the funding, which bodes well for the future of real-world asset tokenization.","title":"Securitize raises $47M in strategic funding led by BlackRock","detailed_content":"Digital securities platform Securitize has raised $47 million in a new strategic funding round led by BlackRock. Blockchain developers Aptos Labs and Paxos and stablecoin issuer Circle were also among the investors.\nProceeds from the funding round will be used for product development, global expansion and strengthening partnerships in the financial services ecosystem, Securitize said in a statement.\nBlackRock global head of strategic ecosystem partnerships Joseph Chalom will join the Securitize board of directors. Chalom called the investment in Securitize “another step in the evolution of our digital assets strategy […] that will help meet the future needs of our clients.”\nSource: Securitize\nSecuritize partnered with BlackRock as a transfer agent, tokenization platform and placement agent on the March launch of the BlackRock USD Institutional Digital Liquidity Fund (BUIDL) on the Ethereum blockchain. BUIDL is BlackRock’s first tokenized fund.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nBUIDL invests in cash, United States Treasury bills and repurchase agreements and pays dividends accrued daily through a monthly deposit of tokens stably worth $1. BUIDL holders have the option to transfer their shares to Circle in exchange for USD Coin\nUSDC\n$1.00\nstablecoin.\nIn the six weeks of its existence, BUIDL amassed a market cap of $375 million to become the largest tokenized treasury fund, surpassing the Franklin OnChain U.S. Government Money Fund (BENJI) by $7 million. There is currently $1.28 billion locked in tokenized U.S. Treasurys and bonds, according to RWA.xyz.\nRelated: Securitize issues tokenized assets in Spain, plans September trading start\nInvestment manager Hamilton Lane, which has worked with Securitize since 2022, also contributed to the fundraise, along with ParaFi Capital and Tradeweb Markets. Aptos Labs co-founder and CEO Mo Shaikh told Cointelegraph:\n“Aptos Labs is […] a key participant in closing the gap between traditional finance and open finance in a very real and globally accessible way. With leaders like BlackRock and pioneers like Securitize at the helm, there’s no doubt that a significant piece of the future of finance will play out on-chain.”\nSecuritize is registered with the Securities and Exchange Commission as a broker-dealer and transfer agent and is a member of the Financial Industry Regulatory Authority self-regulatory organization.\nMagazine: Crypto City: Guide to San Francisco Bay Area\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-02","tags":["#Blockchain","#Ethereum","#Tokens","#Digital Asset","#Asset Management","#Digital Asset Management"],"author":"by Derek Andersen","category":null}