{"id":"0429de1e-2fb5-4fcd-95ff-569bb722e8cf","article_link":"https://cointelegraph.com/news/crypto-industry-investor-education-ftx-collapse","website_source":"Cointelegraph","article_type":"News Article","summary":"“What I preach for is regulation that protects and prevents but does not cripple and destroy [innovation],” the senior adviser told Cointelegraph.","title":"Post-FTX crypto industry needs education before regulation — Former Biden adviser","detailed_content":"The cryptocurrency industry needs to prioritize investor education over stringent regulations as it recovers from the downfall caused by the collapse of the FTX exchange, which resulted in $8.9 billion in user funds lost — according to Moe Vela, former senior adviser to United States President Joe Biden and senior adviser to Unicoin.\nFinancial education, especially regarding risk management, should be the fundamental concern of the crypto industry, Vela told Cointelegraph in an exclusive interview.\nHe said:\n“Education is the fundamental key to empowerment. […] We will not have equality in any form until we have economic parity. We’re not going to have economic parity until we teach people to be, instead of unsophisticated at anything, sophisticated, and that comes through education.”\nThe senior adviser’s comments come a week after FTX’s new amended proposal was released on May 7. The proposal promises “billions in compensation” for the users and creditors of the bankrupt exchange who have been unable to access their funds since November 2022.\nThe meltdown of FTX and its over 130 subsidiaries forced regulators to take action and develop investor-safety-oriented regulations, while the United States Securities and Exchange Commission started a crackdown on crypto exchanges to avoid another FTX-like meltdown.\nHowever, instead of regulatory efforts that may stifle digital asset innovation, the industry would benefit more from educating unsophisticated investors, argued Vela:\n“To my fellow Democrats a bit to my left who are a little overzealous on regulation: Stop it. You’re not doing anybody any favors. It might make you feel good because you think you’re protecting the unsophisticated investor, but rather than then having to overregulate to protect the unsophisticated investor, why don’t we make the investors sophisticated?”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nVela also serves as an adviser for Unicoin, an asset-backed cryptocurrency that aims to reduce the volatility associated with traditional cryptocurrencies. During the launch of the token, Vela learned that risk mitigation is among the most important factors for both traditional and crypto investors. He explained:\nMoe Vela interview with Cointelegraph. Source: Cointelegraph\nRelated: Regulators are cracking down on financial privacy, but ZK-proofs can help\nThe crypto industry is here to stay, and regulators should take note\nSince the crypto industry is becoming an integral part of our future, innovation-friendly regulations remain a key priority, according to Vela:\n“How do we create regulation that empowers, protects and educates, but does not hinder the growth of this sector? Because this industry is here to stay. It is an integral part of our global future. […] So, let’s foster smart growth and safe growth.”\nFollowing the collapse of FTX, crypto exchanges worldwide have been striving for more transparent operations, spearheaded by Binance, the world’s largest exchange, which could not escape the SEC’s hawkish stance.\nIn June 2023, the SEC sued Coinbase and Binance for alleged securities violations. In the lawsuit against Binance, the SEC alleged that the company and its founder, Changpeng Zhao, had misappropriated billions of dollars of user funds.\nBinance was charged with violating Anti-Money Laundering laws and settled to pay $4.3 billion, one of the largest criminal fines in history.\nThis type of regulatory enforcement is in contrast with the innovation-friendly approach advocated by Vela, who said:\n“What I preach for is regulation that protects and prevents but does not cripple and destroy [innovation].”\nRelated: GameStop tops Bitcoin's yearly gains in one day — Will GME spark an altcoin rally?\nExchange or buy FTT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-15","tags":["#Blockchain","#Law","#SEC","#Bitcoin Regulation","#United States","#FTX","#Regulation"],"author":"by Zoltan Vardai","category":null}