{"id":"042a0504-15ff-491d-9b5b-82ba1b8d8330","article_link":"https://cointelegraph.com/news/halving-2024-where-bitcoin-heading-next","website_source":"Cointelegraph","article_type":"News Article","summary":"In our latest Cointelegraph video, we explain everything you need to know about the imminent Bitcoin halving, assessing its impact on both the mining industry and BTC's value.","title":"Halving 2024: Where is Bitcoin heading next?","detailed_content":"The most awaited event in the crypto world is just around the corner  — the Bitcoin (BTC) halving, a pre-programmed event that cuts the new supply of BTC in half approximately every four years. The halving will generate a revenue shock for miners and reduce the amount of new BTC issued in the market.\nIn the latest Cointelegraph video, we delve into the potential impact of this event for both miners and investors.\nMost industry participants do not expect the halving to be a cause for concern for the mining industry but rather view it as an opportunity for miners to become more efficient.\nMiners have had four years to prepare for this event by upgrading their mining rigs and seeking out locations where electricity is cheap.\n“We'll see a lot of miners start to diversify energy wise”, predicts Will Baxter, SVP at Business Strategy and Development at Braiins, a Bitcoin mining company.\n“They go to landfills, and they’ll use that trash for mining Bitcoin [...] A lot of miners are going to migrate towards stranded energy,” he continued.\n“I don’t think we will see a very large drop in hash rate after the halving, maybe around 10% or less,” said Jaran Mellerud, co-founder and CEO of Hashlab Mining.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAt the same time, the Bitcoin halving will likely impact the price of Bitcoin as it has in the past. In the months following the halving, the supply shock may cause prices to spike, assuming that demand remains constant or increases in any meaningful way. \nPrice predictions range from $120,000 by the year's end to $250,000 by the end of 2025.\nHowever, the halving does not occur in a vacuum: the macroeconomic landscape will play a major role in determining the price of Bitcoin in the short to medium term. \nAccording to Mike McGlone, senior commodity strategist at Bloomberg, a downturn in the stock market may put pressure on Bitcoin despite the halving.\n“We just have to see if Bitcoin can trade more like gold when beta goes down then more like beta,” said McGlone. “And I suspect with a high volatility, it's still at risk of a decent drawdown.”\nTo find out more about how this Bitcoin halving may play out differently than previous ones, check out the full video on our YouTube channel and don’t forget to subscribe!","creation_date":"2024-04-16","tags":["#Bitcoin","#Blockchain","#Bitcoin Price","#Bitcoin Analysis","#Bitcoin Mining","#Halving","#Bitcoin Halving","#Supply","#Hash Rate","#Total Supply"],"author":"by Marco Castrovilli","category":null}