{"id":"04c52c39-0e8a-4a1d-9d4f-2cc0472c1c22","article_link":"https://www.wired.com/sponsored/story/how-the-uks-south-west-became-a-deep-tech-powerhouse-hsbc-uk/","website_source":"Wired","article_type":"News Article","summary":"The region is called ‘Silicon Gorge’ for good reason – and that reputation didn’t emerge by chance…","title":"How The UK’s South West Became A ‘Deep Tech’ Powerhouse","detailed_content":"WHEN A SILICON Valley giant expanded to the UK forty years ago, it sparked a quiet revolution. It chose Bristol for its home-from-home, and in the coming decades, a huge influx of tech companies decided to follow suit. So much so that the Bristol-Swindon-Gloucester triangle acquired a new moniker: ‘Silicon Gorge.'\nIt all started in 1972, when the top team at Fairchild Semiconductor International – a San Jose-based microchip pioneer whose founders later created Intel – found themselves attracted to Bristol for its reputation as a place of innovation. Not microchip innovation, admittedly, but aeronautical innovation – an industry that stretched back to 1910. There was a certain poetry at play: the organisation to which Fairchild Semiconductor belonged had started life as Fairchild Aircraft.\nIn 1978, as a direct result of Fairchild’s move to the city, the pioneering silicon chip developer Inmos launched in Bristol. It went on to attract over £200m of investment from the UK government over the following six years, and shone a light on the region as a serious, up-and-coming tech player. Today, the South West’s tech scene is in rude health – for “deep tech” in particular. Take XMOS, a semiconductor company specialising in intelligent processor solutions for the Internet of Things. “Inmos was to Bristol what Intel was to Silicon Valley,” reflects XMOS’ chief executive, Mark Lippett. “The creation of that company sparked a long running ecosystem that now feeds off itself. It is always looking ahead and moving forward.”\nAs defined by Boston Consulting Group, deep tech focuses on “large and fundamental issues,” that often tackle scientific or engineering challenges requiring lengthy periods of research and development plus large sums of capital. Chip design is archetypal “deep tech” because of the huge impact these products have on our everyday lives. But the sector is far broader than that. It spans advanced materials and manufacturing, artificial intelligence, biotechnology, blockchain, robotics and electronics.\nThe tech credentials of Bristol and the surrounding region are clear from the participants in WIRED’s Trailblazer programme. In partnership with HSBC UK, this initiative focuses on medium-sized companies making an impact across the globe. And it’s no surprise that tech-driven firms are well represented. Alongside XMOS, you’ll find Rovco, for example, which provides underwater surveying for science and industry, and Immersive Labs, which trains organisations to take on cybersecurity threats.\nCentral to the South West’s innovation scene are the universities that feed it and the hubs and incubators that sustain it. In many cases the two are intrinsically linked. Science Creates, for example, is a deep tech incubator partnered with the University of Bristol. With a physical footprint of 45,000 sq ft, it supports more than 100 companies that collectively raised £18.4m in 2021 alone. Or take SETsquared, a start-up accelerator run collectively by the universities of Bristol, Bath, Exeter, Southampton and Surrey which has supported over 4,000 entrepreneurs. TechCrunch reports that since 2002 it has raised a funding total of £1.8bn.\nFive of WIRED’s Trailblazers – Rovco, XMOS, aerospace company Space Forge, touchless tech pioneer Ultraleap and data intelligence firm RipJar – were founded by University of Bristol and Bath alumni. XMOS’ Mark Lippett sees this as an important trend. “The deep tech scene fuelled by the universities here has become a catalyst for business growth,” he says. “There is a legacy of interesting and successful companies set up by alumni from local universities. This, among other things, means that people want to stick around the area after they have finished their degrees, resulting in a lot of talent retention and recycling.”\nLippett also highlights the city’s other major talent draw: its parallel reputation as a creative hub. “There is so much untapped potential at the intersection of creativity and science here,” he says. “Bringing some of the region’s creativity into the tech side of things and vice versa will result in a cross-fertilisation of ideas and an opportunity to think more creatively when it comes to using and applying technology.”\nIndeed, Bristol and the South West is an epicentre of creativity. As HSBC UK’s Deputy Regional Director for the South, Matt Wesley, points out: ‘‘Beyond its entrenched artistic spirit – famously it’s the region that produced Massive Attack and Banksy – it is the chosen location for some of the best-known creative brands and businesses in the UK. This makes it a hugely exciting region to find some of the UK’s most pioneering firms.’’\nThis creative legacy stems in large part from the BBC’s Natural History Unit having based itself in Bristol since its formation in 1957. It kickstarted a surge of digital, branding and design enterprises putting down roots in the region. One of the best known is Aardman, the award-winning animation studio famed for hit films, series, advertising, and now games and interactive entertainment. Its roster includes much-loved productions such as Chicken Run, Wallace & Gromit, Shaun the Sheep and Morph, all made using clay models and stop-motion. The studio continues to innovate with digital projects such as its first in-house CGI series, Lloyd of the Flies, and The Grand Getaway; a new Wallace & Gromit VR adventure for Meta Quest launching in 2023. “There is a great culture here of tapping into local ideas and innovation,” says Aardman managing director, Sean Clarke. “But when you talk to founders in this space about Bristol, there are additional factors attracting them here. It has long been an appealing location for the film and TV community thanks to the BBC’s Natural History Unit. And the transport links are very good. We are close to London and Bristol airport connects us to Europe. We are also seeing a lot of artistic people relocating to areas like Bristol from London to get more bang for their buck, so it is an increasingly good location in terms of access to a creative and diverse workforce. And as a values-led organisation, attracting and nurturing talent from all backgrounds is incredibly important to us.”\nThe maturation of Bristol’s creative sector, bolstered by the deep tech scene it has been cultivating for the past four decades, has furnished the city with a bright outlook. It’s now the fifth-fastest growing tech city in the UK according to the Digital Economy Council’s Levelling Up Power Tech League report. A 2021 government forecast named three companies in the area that are likely to achieve unicorn valuations. One of them was the ecommerce fulfilment business Huboo, which says that it only sees the region going from strength to strength. “This area has always been a success story, but until recently certain industries tended to dominate,” says its CEO Martin Bysh. “Now, it has a diverse tech scene that spans multiple sectors and has an incredible sense of momentum. But what hasn’t changed is something that has served the area well for decades: it’s simply a great place to live.”The WIRED Trailblazer programme was created by WIRED Consulting and sponsored by HSBC UK.\nTo discuss your business ambitions with HSBC UK, click here \nTo find out more about WIRED Consulting, click hereThis article was originally published by WIRED UK","creation_date":"2022-11-04","tags":["","PROMOTION","WIRED TRAILBLAZERS","WIRED CONSULTING"],"author":null,"category":null}