{"id":"0672f731-2ea4-495a-9e88-89b5f1b4c4c6","article_link":"https://cointelegraph.com/news/friend-tech-airdrop-largest-recipient-sells-tokens","website_source":"Cointelegraph","article_type":"News Article","summary":"The largest Friend.tech whale has sold all their holdings, causing the new token to fall over 50% in value while other users can still not claim the airdrop.","title":"Biggest Friend.tech whale dumps tokens as users struggle to claim airdrop","detailed_content":"The largest airdrop recipient on Friend.tech has sold all their tokens just hours after the airdrop, leading to concerns over the token’s price action.\nJust hours after the Friend.tech airdrop went live on May 3, the largest whale, known as “Murphys1d,” sold over 55,000 of the newly-issued Friend tokens, blockchain data shows.\nBeyond the sell-off, some users were unable to claim their airdrop tokens, including crypto investor Luke Martin, who wrote in a May 3 X post:\n“Watching the value of my airdrop go from 7 figures to 5 figures in the span of 2 hours while I keep refreshing the page trying to claim....still can’t claim. Adds insult to injury.”\nMartin added that the whale wallet seems to be linked to a fake X account with no activity, enabling it to farm over 500,000 Friend.tech points risk-free.\nThe new Friend.tech (FRIEND) token has fallen over 52.5% since its launch, from $3.26 to just $1.32 as of 9:50 am UTC. The token’s price fell over 32% in the last hour before publication, according to CoinGecko data.\nFRIEND/USDT chart. Source: CoinGecko\nWhile the selling by the largest Friend.tech whale may impact the market in the short term, it doesn’t necessarily dictate a token’s long-term trajectory, according to Anndy Lian, intergovernmental blockchain expert and author of NFT: From Zero to Hero. Lian told Cointelegraph:\n“While it might cause a short-term dip in price due to increased supply and potential panic selling, it doesn’t always mean a long-term downtrend. To me, it is a good thing […] The sell-off would mean a more decentralized distribution of tokens. A broader distribution reduces the risk of a single entity having excessive control over the project.”\nHowever, Lian noted that the token’s value will mainly rely on the community’s trust in Friend.tech and how the team manages the current situation.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: LayerZero cross-chain interoperability protocol completes first airdrop snapshot\nAirdrop farmers continue to plague token launches\nThe mysterious Friend.tech whale is another example of a professional airdrop farmer (squatter) who interacts with emerging protocols solely for the airdrop rewards, often with multiple wallets to compound rewards.\nThe main issue with airdrop farmers is that they tend to market sell all their airdropped tokens, creating significant sell pressure and resulting in more panic selling by legitimate protocol users.\nAn example of this came at the end of April, when the Omni Network’s OMNI token fell 55% in less than 18 hours following its airdrop, losing over half its market capitalization.\nIn March 2023, it was revealed that airdrop hunters consolidated $3.3 million worth of tokens from Arbitrum’s ARB airdrop from 1,496 wallets into just two wallets they had controlled.\nRelated: ‘Mr. 100’ buys the Bitcoin dip for the first time since halving — Is the BTC bottom in?\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-03","tags":["#Blockchain","#Cryptocurrencies","#Social Media","#Airdrop","#DeFi","#Whale"],"author":"by Zoltan Vardai","category":null}