{"id":"0672561d-b648-44bc-9a18-0ac536e4cc02","article_link":"https://medium.com/@efeng/rational-optimism-for-crypto-968104c08e7f","website_source":"Medium","article_type":"Blog Post","summary":"On March 10th, 2000, the NASDAQ Composite Index hit an all time high of 5,048, signaling the peak of the dotcom bubble after growing 6x…","title":"Rational optimism for crypto","detailed_content":"On March 10th, 2000, the NASDAQ Composite Index hit an all time high of 5,048, signaling the peak of the dotcom bubble after growing 6x over the past 5 years. That milestone would unfortunately begin a three year downturn across the entire Internet sector. The NASDAQ would go on to fall 50% by the end of 2000, and continue dropping before bottoming out at 1,114 on October 9, 2002.During the dotcom bubble as the NASDAQ was soaring, usage of the technology powering the dotcom bubble — the Internet — was also soaring. The number of Internet users doubled from 150 million at the beginning of 1999 to 300 million in March 2001 as the NASDAQ peaked. But when the NASDAQ crashed, Internet usage did not follow suit. During the period when the NASDAQ plummeted to its low point in October 2002, the number of Internet users doubled again to 600 million.So for the runup of the dotcom bubble, pricing of Internet technology (as measured by the NASDAQ) and usage of Internet technology (as measured by the number of Internet users) was directly correlated. As the NASDAQ went up, so did the number of Internet users. But when the dotcom bubble popped, pricing and usage became uncorrelated. As the NASDAQ fell, the number of Internet users actually grew. This growth would go on to fuel and even greater peak for the NASDAQ many years later.The lesson here? Pricing is only one measure of success.On November 8, 2021, the global cryptocurrency markets reached an all time high of a combined $2.9T in market capitalization. Like the dotcom bubble, cryptocurrency also grew an astounding 6x during this crypto bubble, but accomplished that feat not in 5 years but in only 1 year. It was the equivalent of the entire inflating of the dotcom bubble happening in just 12 months.Over the next 8 months, the crypto bubble would pop sending the cryptocurrency market cap plummeting by two-thirds to below $1T, and triggering disastrous events like the crash of the Terra stablecoin, the bankruptcy of Three Arrows Capital hedge fund, and the bankruptcy of crypto lender Celcius along the way. Across the board, the prices for all the major Layer 1 blockchains fell significantly from their highs from November 2021: Bitcoin from $68.7k to $20k, Ethereum from $4.9k to $1.5k, Solana from $260 to $30, and so on.But as the crypto bubble popped, what has happened with usage of the blockchains, which is the technology that powered the crypto bubble in the first place? As the price of blockchain technology (as measured by cryptocurrency market cap) has fallen, has usage of blockchain technology fallen too? Let’s find out.First, let’s look at usage of the Bitcoin blockchain, which represents almost 40% of the entire cryptocurrency market cap. During the runup of the crypto bubble from 2019 to 2021, Bitcoin payments per day (which is one measure of Bitcoin usage) was directly correlated with the price of Bitcoin — as price went up and down, so too did the number of payments. But starting this year as Bitcoin price has fallen by half, the number of Bitcoin payments has held steady. In 2022, Bitcoin price and Bitcoin usage have become uncorrelated.A similar trend is also happening with Ethereum, the second largest blockchain representing almost 20% of the entire cryptocurrency market cap. Before 2022, Ethereum price and Ethereum usage (this time measured by active addresses, which is similar to active users of Ethereum) were directly correlated. But despite the crash in Ethereum’s price in 2022, the number of active addresses has not fallen this year. Again, usage becoming uncorrelated with price.There are more signs of price and usage becoming uncorrelated in other crypto markets. Crypto development company Alchemy published a recent blog post observing that developer usage of blockchains (as measured by downloads of popular development libraries Ether.js and Web3.js) is up 178% this year, the fastest rate of growth ever. And that’s despite the crypto pricing downturn.According to DappRadar, leading Solana NFT marketplace Magic Eden has seen rapid growth in transaction volume this year, growing from an average of 230k daily transactions in January to over 880k daily transactions now. As the price of Solana has dropped over 80% this year, Solana usage (as measured by NFT trading activity on Magic Eden) is up 280%, another sign of blockchain pricing and usage becoming uncorrelated.This is not to say that all is well with the cryptocurrency market. There has been a lot of real pain caused by the downturn, and there is still a lot of uncertainty ahead. But so was the case in the year 2000 with the Internet when pricing crashed. Yet from that crash, usage of the Internet, uncorrelated from pricing of the Internet, would grow and from that growth spark a rebound. It would take 15 years before the NASDAQ recovered to its dotcom bubble highpoint. But when the NASDAQ did eventually reach those highs again, it would then go on to triple them over the next 6 years.Like with the Internet, it may take years if not a decade for crypto pricing to recover. But in the meantime, there are signs that cryptocurrency usage, uncorrelated from cryptocurrency pricing, is continuing on or even growing. Usage that may lead to exciting new products, services, and scenarios for cryptocurrency. Usage that provides a reason for some much needed rational optimism for cryptocurrency.","creation_date":"2022-11-05","tags":[],"author":"Eric Feng","category":null}