{"id":"0686eb08-15ff-4d99-bf71-521172af956c","article_link":"https://cointelegraph.com/news/move-to-earn-protocol-stepn-30-million-airdrop-users","website_source":"Cointelegraph","article_type":"News Article","summary":"Loyal users of the popular Solana-based lifestyle app can claim rewards by the end of April.","title":"Move-to-earn protocol StepN announces $30M airdrop for users","detailed_content":"Move-to-earn lifestyle app StepN, built on the Solana blockchain, is airdropping 100 million FSL points, worth approximately $30 million, to its users.\nAccording to the April 10 announcement, the FSL points are redeemable at a 1:1 ratio for StepN’s GMT\nGMT\n$0.23\ntoken and can also be used in upcoming StepN nonfungible token (NFT) mints alongside obtaining exclusive prizes. “We have decided to launch this huge airdrop campaign as a token of gratitude to our most loyal community members,” said Shiti Manghani, CEO of StepN. \n“The first airdrop of this week, for our Badge Holders, was dedicated to our core players,” StepN wrote, continuing: “Those who are truly playing the hard way. For them, we airdropped an FSL Points allocation based on the complexity of their in-app achievements.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nTo claim the points, users must sign up for an FSL ID, which is created by the namesake developer that also manages the StepN ecosystem. From there, users can also spend the FSL points in the ecosystem’s NFT marketplace Mooar and strategy game Gas Hero. The $30 million airdrop will be ongoing until the end of April.\nCreated by FSL in 2021, StepN allows users to earn rewards for walking, jogging or running. Rewards are available after users purchase a virtual Sneaker NFT and link their smartphones. Rewards are issued in the form of GMT tokens, which have an inflationary mechanism, supply cap of 6 billion and current diluted market capitalization of $1.57 billion.\nGMT tokens earned by players can then be used to mint new sneakers or level up in the game. On the in-app marketplace, players can lease or sell their NFT sneakers, and their GMT revenues are saved in the in-app wallet, which features a built-in swap function. The lifestyle app currently has more than five million users. \nRelated: Solana's STEPN hits record high as GMT price skyrockets 34,000% in over a month\nExchange or buy GMT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#Airdrop","#Solana","#NFT","#STEPN"],"author":"by Zhiyuan Sun","category":null}