{"id":"082c0184-2eef-4870-b947-d2c77f1368cd","article_link":"https://cointelegraph.com/news/does-wine-age-better-on-blockchain","website_source":"Cointelegraph","article_type":"Tweet","summary":"GrtWines is taking the $441 billion fine wine market and putting it on-chain through Web3 tokenization, with the aim of opening new doors for investors of all generations.","title":"Does wine age better on the blockchain?","detailed_content":"In an effort to redefine the world of fine wine investment a new Web3 marketplace aims to uncork the next era of market accessibility. \nGrtWines, co-founded by former CLSA Chairman Jonathan Slone and acclaimed wine critic James Suckling, is a digital platform that allows collectors and investors of vintage and fine wines access to the market via digital asset tokenization.\nEach digital certificate issued is tied to a real, investment-grade bottle of wine sourced directly from prestigious wineries. They are sourced directly from renowned wineries and stored in optimal condition until ready to be redeemed and delivered.\nAccording to data from Statista, the wine industry is a multi-billion dollar market with a combined revenue from supermarkets, convenience stores, bars and restaurants to amount to $60 billion in 2024, in the United States alone.\nVictor Yin, the CTO and co-founder at GrtWines called the creation of the platform a “significant milestone” in the maturation of the digital asset industry and blockchain technology and a new way to “democratize” the wine industry. He said:\n“With the use of smart contracts, we double down on proof of ownership and provenance, effectively enhancing the overall transparency and security in the persistent counterfeit market.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: Data NFT platform enhances security and user participation with XP system\nThe platform is launching alongside a new collection, “The Jefferson Collection,” which serves as a tribute to one of history’s most famous wine enthusiasts, Thomas Jefferson.\nJonathan Slone, the CEO and co-founder at GrtWines, said as a wine connoisseur, he feels passionate about the platform for preserving the rich heritage of wines while building a “transparent and connected community” driven by the consumers. He said:\n“Traditional alternative assets such as well-aged wines, fine art and luxury watches have gained significant traction among younger buyers, serving as both portfolio diversification and elevated lifestyle.”\nLuxury items as a whole have gained significant traction as tokenized assets on the blockchain over the last few years.\nExamples can be seen with luxury brand blockchain platform Arianee, which recently launched a Polygon CDK-powered layer-2 to issue and manage digital product passports for various luxury brands and companies.\nAdditionally, in the fashion industry, fine artists, luxury brands and watchmakers have been utilizing on-chain assets like nonfungible tokens (NFTs) to verify ownership, track history of products and foster community.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-10","tags":["#Blockchain","#Adoption","#Food","#Digital Asset","#Web3"],"author":"by Savannah Fortis","category":null}