{"id":"08fb9f2f-b0e2-4b5d-98d5-8c75f6fc9352","article_link":"https://cointelegraph.com/news/vc-roundup-gaming-investments-surge-94-in-q124-as-market-rebounds","website_source":"Cointelegraph","article_type":"News Article","summary":"This edition of Cointelegraph’s VC Roundup highlights Tevaera, AVALON, Uncharted, Contango, and Movement Labs.","title":"VC Roundup: Gaming investments surge 94% in Q124 as market rebounds","detailed_content":"Venture capital is seeing a strong comeback in the gaming industry, with a surge in both funding and deal volume. \nAccording to Konvoy Ventures, a venture capital firm specializing in the video gaming industry, the first quarter of 2024 saw $594 million in gaming VC funding, marking a 94% increase from the previous quarter. Deal volume also rose 28%, with 124 deals completed.\nKonvoy predicts the gaming market is projected to reach $225 billion by 2029, from $189 billion in 2023.\nThe Web3 industry is also being driven by blockchain games. According to DappRadar, Web3 games accounted for 30% of all DApp activity in the first quarter of 2024, attracting 2.1 million active wallets every day. During the quarter, Polygon drew in over 1.1 million new wallets, an increase of 429% from the quarter before.\nVenture capital firms are gearing up to keep pace with the bull cycle. In April, some of the VCs raising capital for funds included Andreessen Horowitz, Paradigm and Pantera Capital.\nCointelegraph’s VC Roundup features some of the startups that raised capital in April.\nLaser Digital leads $5M investment in gaming firm Tevaera \nTevaera has completed a $5 million funding round led by Nomura’s Laser Digital. The funding will support the development of a gaming ecosystem utilizing zkSync’s ZK Stack. Investors backing the startup also include Hashkey Capital, Fenbushi Capital, Matter Labs, Draper Dragon, Faculty Group, Crypto.com Capital, Cogitent Ventures, Selini Capital, DWF Labs, Morningstar Ventures, and others. The company has been working on the zkSync platform for nearly two years, focusing on a game-IP-first strategy to address challenges in the Web3 gaming infrastructure. According to a statement, Tevaera has expanded its community to include over 850,000 Soulbound Gamers from more than 100 countries over the last year.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nSource: Tevaera\nAVALON raises $10M for debut title\nIndependent game studio AVALON has secured $10 million in a funding round co-led by BITKRAFT Ventures and HASHED. Additional participants include Coinbase Ventures, Spartan Capital, Foresight Ventures, LiquidX, and Momentum6. The investment will fund the development of their inaugural game, also named AVALON, a multiplayer game that allows players to traverse various worlds while retaining their assets and progress. Founded in 2021, AVALON’s leadership team includes former members of Microsoft, Sony, Capcom, Infinity Ward, and Ubisoft, who contributed to franchises like Call of Duty, EverQuest, and Assassin’s Creed. AVALON is currently under development for PC and cloud streaming.\nUncharted raises $1.7M in seed round\nUncharted has secured $1.7 million in seed funding to develop the ‘gamification layer of crypto.' The funding round was led by Shima Capital with contributions from The Spartan Group, Double Peak Group, Devmons, 32-bit, D64 Ventures, Trinity Labs, LiquidX, and several individual investors, including Immutable’s brothers Robbie and James Ferguson. Uncharted seeks to create a GameFi ecosystem where financial incentives are integrated into gameplay. The company’s first game, “Gangster Arena,” reportedly generated 150 ETH in-game transactions during its first season. Plans are underway for the release of “Gangster Arena 2” and other projects, according to a statement. The funds raised will be used for the development of Uncharted’s games and supporting ecosystem. \nContango secures $5M to blockchain, AI seed fund\nVenture capital firm Contango Digital Assets has announced the initial close of the Contango Blockchain x AI Fund, raising $5 million in capital. The fund aims to invest up to $10 million in North American seed round companies at the intersection of blockchain and artificial intelligence. The new fund’s investors include XVentures, Quantstamp’s Richard Ma and previous backers of VANTA DAO, Digital Currency Group and Polychain Capital. Founded in 2020, Contango is a Canadian firm focused on promoting global decentralized systems, especially decentralized artificial intelligence. “By decentralizing governance and layering in open-source development with native blockchain incentives, we may witness the emergence of the first global Artificial General Intelligence. Our goal is to ensure we are backing projects that are building in this direction and providing a counterweight to the centralized, monopolistic alternatives,” said managing partner Mike Grantis.\nBinance Labs becomes an investor in Movement Labs\nBinance Labs has made an undisclosed investment in Movement Labs, a blockchain development company. The startup has recently closed a $38 million Series A funding round. Movement Labs is building an ecosystem of Modular Move-based blockchains. According to a statement, the funds will be used to expand its range of open-source tooling, frameworks, and protocols to promote the adoption of the Move programming language across blockchains. Movement Labs was founded in 2022 by Rushi Manche and Cooper Scanlon, early builders in the Move ecosystem. Movement Labs is also focusing on expansion in the Asia-Pacific region.\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-02","tags":["#Blockchain","#Business","#Venture Capital","#Games","#Blockchain Game","#Web3","#Gaming"],"author":"by Ana Paula Pereira","category":null}