{"id":"09d6899f-e495-49a2-94fe-22b996f7648d","article_link":"https://www.wired.com/story/digital-nomad-village-madeira-portugal/","website_source":"Wired","article_type":"News Article","summary":"A Portuguese island created a village for remote workers, promising community to the newcomers and prosperity to the locals—then delivered on neither.","title":"Welcome to Digital Nomadland","detailed_content":"SEEN FROM AFAR, the parish of Ponta do Sol looks as compact and picturesque as a postcard. There’s a small roundabout at the center, a gas station, a tiny shopping complex, and a cluster of modest buildings topped by terra-cotta roof tiles. Rippling green slopes of banana, palm, and pine fan out behind, houses dotted among the hills. All of this is surrounded by dramatic escarpment and made subtropically lush by the many small waterfalls that gurgle from the rock face, filling centuries-old irrigation canals. When Gonçalo Hall first drove through the area in September 2020, the words that came into his mind were: “What the fuck is this?”\nPonta do Sol is on the southern coast of Madeira, the main island of the Portuguese archipelago of the same name. Hall had visited Madeira once as a kid, but he didn’t remember it being so beautiful, so wild. Now, as he put it in an interview, he was seeing the place “with the eyes of a digital nomad.” He had returned to help run a conference about remote work in Madeira’s regional capital, Funchal. The day after his long drive through the countryside, he approached the regional secretary of economy and asked point-blank: Why are you sleeping on digital nomads?\nHall, 35, is tall and husky, with blond hair, blue eyes, a jovial demeanor, and a proclivity for speaking in hashtag mantras like “life is good” or “be happy, make millions.” He grew up in Lapa, the poshest area of Lisbon, but now keeps an apartment in Ponta do Sol with his wife, Catarina: Lisbon, he complained when we first met, had become too much of a melting pot. Hall had long dreamed of finding a lifestyle where he could show up to work in flip-flops and shorts rather than the suits and ties of the bankers in his family. In early 2019, the couple moved to Bali for two months, where Hall picked up his first remote contracts, including a marketing gig for a firm called Remote-how, and amassed a hefty contact list in the process. Then they went to Thailand, Malaysia, Vietnam, and Bali again, spending a month or two in each before returning to Europe.\nFEATURED VIDEO\nWhy Billionaires Are Actually Ruining the Economy\nBack in Lisbon, after less than a year of the digital nomad lifestyle, Hall was organizing conferences about remote work and digital nomadism, self-identifying as an expert on both. When he landed in Madeira, he took in its low cost of living, fast internet speeds, surfable beaches, and Instagrammable beauty—the pillars of digital nomad marketing. He recognized something else as well in the pastoral pace. A small nomad project that he had visited in rural Spain, just before his arrival in the archipelago, had impressed him; it was charming, more intimate than the bustling urban hubs he had experienced so far.\nEstablished digital nomad hot spots, like Chiang Mai, Thailand, or Canggu, Bali, tend to be bubbles where wealthy and overwhelmingly white foreigners cluster at coffee shops, coworking spaces, and other businesses that cater to their wants and comforts in English. If he built a destination for digital nomads in small-town Madeira, Hall thought, things would be different. Itinerant remote workers could live just like locals, alongside locals: They could reside in the same neighborhoods, eat at the same restaurants, and mingle at gatherings coordinated by a “community manager.” Hall decided to pitch his idea to the Madeiran government.\nIt was an easy sell. Tourism in the archipelago had plummeted due to the Covid-19 travel bans that had barred travelers from outside of Europe’s Schengen Area, and so Hall framed digital nomads as the cure. Portugal’s urban centers were already saturated with remote workers, but Madeira, less than a two-hour flight from Lisbon, was still under the radar. High-earning professionals could pour money into local businesses, Hall told regional officials. All they needed to welcome them was an inviting infrastructure and a ready-made network to land in. If he built it, Hall promised, they would come. A meeting was arranged with Madeira’s regional president, Miguel Albuquerque, and “after two or three beers,” Albuquerque recalled later, “the deal was sealed.” StartUp Madeira, a regional business incubator, was enrolled to manage the project, Hall was hired to lead, and the coastal parish of Ponta do Sol, population 4,300, was selected as the location for an experiment that looked a little bit like tourism, a little bit like a future-of-work demo, a little bit like selective immigration—and a lot like a test for a strained local housing market. The project was perhaps an inevitable extension of mainland Portugal’s eager embrace of foreign remote workers, itself part of a global expansion of digital-nomad-friendly legislation and of the private industries attending to their needs. It was ironic, in a way: While the pandemic had closed borders for so many, it had created financial incentives to open them to others. \nWHEN THE DIGITAL Nomad Village officially launched in February 2021, there were a small handful of inaugural residents. They included Kamil Kokot, a Polish software developer; his sister; two German men they’d arranged to rent a house with via Slack; and Hall himself. There was a local 7 pm curfew then, but after months of being grounded by Covid, the newcomers were thrilled to be in a new place among new people. By spring, the Village had swelled to 50, and Kokot felt he had begun to make a tight-knit group of friends. They threw him a surprise birthday party in May, then celebrated out-of-season Christmas, Halloween, and New Year’s Eve together in the weeks that followed. They set off fireworks on the beach just before curfew one warm spring night, giddily sipping on champagne while bewildered residents of Ponta do Sol watched from their homes. At the end of June, a group of these newfound friends traveled to the Azores for a happy holiday together, then scattered. Some, like Kokot, returned the following winter. Madeira, he told me, was the first place outside Poland where he could imagine making a home.\nPHOTOGRAPH: KYLE JEFFERSBy the time I visited in February 2022, the pilot project was a year old. An estimated 200 international remote workers were staying in rentals in the Ponta do Sol parish and larger municipality. At least 1,000 more had snapped up rooms, apartments, and villas elsewhere on the island—in some cases because the stock had been exhausted or priced too high in Ponta do Sol. Many came through town to cowork or attend the yoga classes, workshops, and other events that pack the Digital Nomad Village’s calendar.\nThe ocean views from the outdoor workspace are stunning, but even in the shade, it’s often too bright to see your screen.\nOne of those events, a weekly “community lunch,” is held every Wednesday at a restaurant near the coworking space. The day I joined, some 30-odd remote workers gathered at Steak & Sun, where the kitchen staff have learned to make vegetarian and vegan dishes for their new clientele. Submitting a 🐠 on a Slack post claimed an order of bacalhau a bras, a non-alcoholic beverage, and an espresso for €9. At my table were Hall and his wife, an arts administrator from Lithuania, a startup cofounder from the UK, several software developers from Germany, and one from Scotland.\nMelissa and João Cabral, siblings from Calheta, the next town over, approached the group and introduced themselves in English. “We’re locals,” Melissa said, “would it be OK if we joined?” The people seated around me let out an enthusiastic yes, motioning for them to sit, sit, please sit. As the siblings settled into their seats, Hall announced that they were the very first locals to join community lunch. The Cabrals couldn’t hide their surprise.\nBoth Cabrals were in marketing and worked remotely. They had visited the coworking space that morning, when Hall told them about the lunch. Melissa was initially hesitant. “You see the word ‘digital nomads’ so you think, ‘it’s not for us,’” she said, a sentiment later echoed by several other locals I spoke with. But she was a remote worker in Madeira too, and networking with entrepreneurs and people with international connections could be useful, so she decided to come. Melissa posed a question to the table: “Do you think it’s important to connect with locals?” Hall responded with a quick and firm yes, absolutely. That would be the next phase of the project, he said. Covid, he offered, had so far made it impossible.\nThe siblings later told me that they were floored by the warm reception. A cluster of curious travelers surrounded them after lunch, asking questions, extending dinner invitations, encouraging them to use the coworking space, and insisting that they return. They said they would. Still, Melissa said, if she and her brother were the first locals to join, then clearly “something is not working that well.”\nTHE DIGITAL NOMAD Village is not a physical village, of course. It is a marketing pitch and a virtual infrastructure that facilitates the mutual interaction of international remote workers, superimposed and dependent on the actual, centuries-old village of Ponta do Sol. The closest the Digital Nomad Village has to a physical structure is the free coworking space, an area on loan at the John Dos Passos Cultural Center, one of the few modern buildings in town. Downstairs, locals meet up for film screenings, dance rehearsals, and photo exhibitions. Upstairs, foreign remote workers gather to gaze at their laptops and take Zoom meetings in the courtyard. On my visits, I noticed that the desks inside were always claimed first: The ocean views from the outdoor workspace are stunning, but even in the shade, it’s often too bright to see your screen.Very few people I met in the Village embraced the term “digital nomad.” The label is taken up most enthusiastically by those who make their money off it. In this definition, digital nomads are freelancers and entrepreneurs who explore the world, untethered to corporate offices, long apartment leases, and car payments, and who stay for weeks or months or longer—just not long enough to be liable to pay taxes. In Portugal, the lines that divide digital nomads from foreign remote workers from expats from immigrants from working holidayers are often fuzzed: Portuguese officials don’t hide their desire to transform this particular class of wanderers into settlers.\nThe national government has so far had very little basis for guessing how many itinerant remote workers pass through the country each year, where they come from, what they do, how long they stay, how they live, or even what measurable impact or contributions they make to the broader economy or social life of the country. StartUp Madeira started compiling its own statistics after the launch of the Digital Nomad Village experiment, counting the arrival of more than 8,000 remote workers to the archipelago so far—but that’s still little more than an estimate, and likely a low one. The numbers are based solely on the number of people who register through StartUp Madeira's website.\nPonta do Sol is sold as a place you can call home, while ushering in the displacement of the people who have called it home for generations.\nThe Madeira Islands Slack, the virtual dimension of the Nomad Village, is by turns awkward, dull, and chaotic. Nomads who work as coaches regularly offer circles and paid workshops for breath work, bodywork, shadow work, heart opening, and chakra meditation. I saw advertisements for a photo-hiking workshop to shoot models in the forest, a combination photoshoot-therapy session in the mountains, and an NFT-themed connection retreat for women. Every week a new flyer announces the DJ lineup for Purple Friday, a raucous party at a cliffside hotel that keeps separate invite lists for international and local guests. (“Madeira,” Kokot told me, “was the first place for me to have party social fatigue.”)\nAfter the community lunch I attended, the Scotsman tagged all 6,000-plus Slack users in a note asking who was up for a coffee, inviting an intercontinental pile-on. A year into the project, the few pinned posts were outdated, leaving a gaping blank where documentation or collective memory should have gone. A central FAQ was posted more recently, but for the first year and a half the same questions were posted again and again: Does anyone know of a room to rent? Is there a bus to Funchal? Where do I rent a car? How do I book a desk at the coworking space? Any recommendations for vegan food? How can I find an apartment? Hey, anyone know if there’s a bus to Funchal?\nPHOTOGRAPH: KYLE JEFFERSSeveral of the temporary residents of Ponta do Sol told me they’d looked forward to the Digital Nomad Village’s potential for small-town community but were disappointed after they arrived by how little meaningful interaction there was with Madeirans. They tried to find their own ways to seek out connection with locals: getting to know café and restaurant staff by name, riding public transportation, volunteering at the dog shelter, learning Portuguese, joining pickup soccer games. Some contemplated settling in Madeira longer term. A couple of them initiated meetups with Madeiran social entrepreneurs. But these were outliers.\nDespite Hall’s stated intentions, the design of the Village, the itinerant core of its lifestyle, and the consequences of bringing in so many people so quickly have made the promised “community” complicated to deliver. StartUp Madeira’s promotional video for the project sells Ponta do Sol as a place you can call home—a shallow vision of belonging that demands no commitments and carries no burden or history—all while ushering in the displacement of the people who have called it home for generations before your arrival. In this telling, guests don’t owe their hosts a thing. It is a familiar story.\nIN THE 15TH century, when the Portuguese first landed on Madeira’s shores, the island was uninhabited by humans, thick with forest cover, and abundant with life. The conquistadors didn’t name Madeira after what they saw growing there: trees, green, woods, forest, jungle—árvores, verde, bosque, floresta, selva. They named it after the commodity those trees could become once they were razed: wood, timber, lumber—madeira, madeira, madeira. Fires were set to clear land for settlement and cash crop agriculture, burning for seven years straight, as the legend goes.\nMany of Ponta do Sol’s residents still work in agriculture; sugarcane has been grown here from its earliest settlement, though banana cultivation now dominates. People here are, on average, poorer than the rest of the island, which is itself poorer than the rest of Portugal, the poorest country in southwestern Europe. During my visit, I perused an exhibition at the John Dos Passos Cultural Center featuring photos taken during the miserable four-decade-long Estado Novo dictatorship: dirt roads, shoeless peasants, grass-thatched huts, aching poverty. When the colony of Madeira won its autonomy in 1975, after the fall of the fascist regime, 60 percent of the archipelago’s population was illiterate.\nMadeira has built a robust tourism industry in the decades since. Most of the bookable beds in Ponta do Sol are in private homes called “Alojamento Local,” which are subject to different regulations than the long-term rentals sought by locals, and exponentially more profitable. Hall says he wants 100 beds in the area to be secured exclusively for digital nomad rentals, and he and his business partner Dave Williams are trying to incentivize property owners—including the growing numbers of foreigners who have invested in real estate here—to jump on board.\nWilliams, who started NomadX, originally a midterm accommodations business, with help from StartUp Lisbon, now partners with Airbnb rival Flatio. I attended one of the Flatio info sessions Hall and Williams cohosted for prospective landlords—held entirely in English—where Hall waxed on about the desirable demographic profile of these medium-term tenants: young, high-paid, driven, and fit. To illustrate his point, he cajoled Funchal’s community manager into performing burpees. Ponta do Sol currently has the highest density of Alojamento Local homes on the island, tripling in recent years, and the intense demand from remote workers is driving residents to either reallocate existing rental and tourism properties to this market, or build more.Even on a casual tour through town, I saw construction everywhere. On a steep road that’s been nicknamed Nomad Street by foreigners, a build site advertises its final form on a placard: Platinum Villas VIII, all glass and sharp angles. High in the hills, I paused to chat with a local man working a sloped patch of garden. He put down the banana plant he’d been carrying on his shoulder and told me he’d just come from his day job in construction. He worked on a property owned by a wealthy American who’d ordered the fruit plantation next to his house razed to make space for new rental apartments. The man had rescued as many trees as he could, to replant on his own plot.\nMadeiran residents now pay among the highest percentage of their salary on rent in Portugal. \nLocal government representatives assured me that the itinerant young workers attracted by the Digital Nomad Village were valuable and welcome additions to the region. But when I talked to João Campanário, Ponta do Sol’s parish council president, he told me he had never actually met one. Not even Hall had stopped by to introduce himself before installing a coworking space across the street from his office. Still, he said, “we’d like them to stay here.”\nPHOTOGRAPH: KYLE JEFFERS\nCélia Pessegueiro, the head of Ponta do Sol’s municipal council, described the arrival of digital nomads during the pandemic as “a kind of ray of sunshine in the middle of a cloudy day.” After the streets had been so quiet for months, there was a certain joy in spotting young people in backpacks and sandals wandering, dazed, through the tiny village.\nHall praised the regional president, Albuquerque, as a politician who “thinks like a CEO”—where others see an empty building, he sees opportunity for investment. Hall described his relationship with Pessegueiro as friendly but confided that he was disappointed by the lack of similar thinking on her part. Though he had hardly engaged the municipal and parish governments at any level of planning, he felt he was not being supported. (For instance, he had asked Pessegueiro to install workout equipment by the beach. “There’s no room,” she explained, seeming surprised.)When I brought this up with Pessegueiro, she paused and chose her words carefully. “This place is ready to receive visitors and new residents,” she said. “I want them to feel like they’re coming to a place where there are people living already, and to live well with them. I don’t want the people who are from here to feel excluded in any way.”\nHousing is one area where exclusion has been most sharply felt. The price of homes in Ponta do Sol has jumped 30 percent in the past year, and the rental stock in Madeira has dropped by 42 percent in approximately the same period. Nearly two-thirds of the apartments on offer were priced over €1,000—in a region where the monthly minimum wage is €723. In Funchal, rents are even higher: The small city is second only to Lisbon in lack of affordability. Madeiran residents now pay among the highest percentage of their salary on rent in the country. \nMadeira also has the highest density of social housing in Portugal, double the national average. Five thousand families are on the waiting list for housing support, and the regional government’s response has been to announce the construction of housing units that are even more affordable. Edgar Silva, an opposition politician in Funchal, has publicly lamented how the city’s working-class heart is being gutted. In a local news outlet, he blasted what he called “a perverse mechanism of social segregation,” as unfettered price increases push more and more locals to the periphery.\nPessegueiro had visited Lisbon recently and observed how its most iconic neighborhoods had been emptied of their residents—drained of the living memory of the capital’s historic center. To protect the character of her own town, she outlined community-rooted solutions: supporting families with renovations of old properties, the recuperation of abandoned houses, building homes on inherited land. “The question of housing support is fundamental to keep people here, so that they don’t feel like they’re being forced out of their homes,” she told me. “That’s the balance.”\nLISBON IS A case study for how a sweeping invitation to the world—at least, to the parts of the world with money and relaxed visa agreements—can look like a rousing success and a catastrophe at the same time, depending on what you measure. Following a devastating economic meltdown in 2008 that left 40 percent of millennials unemployed, Portugal’s government introduced two measures to attract foreign investment: the Non-Habitual Resident (NHR) tax scheme in 2009, and the Golden Visa program in 2012. Portuguese people earn among the lowest salaries in Europe, work some of the longest hours, and pay some of the highest income taxes. A local who earns the average monthly wage of €1,500 loses nearly a third of it to tax, with the sliding scale topping out at 48 percent for annual salaries above €75,000. By contrast, a foreign resident who qualifies for the NHR scheme pays a flat tax of 20 percent for 10 years. The Golden Visa program, meanwhile, had been billed as a pathway to job creation, fast-tracking citizenship in exchange for an investment of at least €250,000. An audit last year found that more than 90 percent of all visas issued in the past nine years were for a real estate purchase. \nIn the past year, Lisbon has earned the dubious distinction of being ranked the third most financially unliveable city in the world.\nThis year the investment requirement was increased, and a restriction imposed on Golden Visa residential real estate purchases in Lisbon, Porto, and Portugal’s coastal region. There are no such restrictions in Madeira, however, which is autonomously governed. Madeira also has its own tax scheme to attract foreign investment, in particular a highly competitive 5 percent corporate rate. Multiple investigations by the European Commission found Madeira’s tax cuts were violating EU rules to illegally benefit companies, with no clear contribution to Madeirans, who experience the highest unemployment rate in the country. Many of the jobs these companies had claimed to create on the island were based either outside the region or outside the EU altogether, or even fabricated.\nPortugal has also sought to draw foreign spending via an aggressive tourism campaign. In 2022, the country brought in more money from tourism than in any year prior. This summer, the capital’s iconic electric tram 28 became utterly unusable as public transportation, due to the long lines of tourists eager for an Instagrammable ride. And while the government credits tourism for helping to reduce unemployment, the reality is that the bulk of those new service-oriented jobs are painfully precarious.The tourism boom and rampant real estate speculation has precipitated an ongoing evictions crisis in the capital, where renters receive patchwork legal protections. After a wave of evictions between 2014 and 2016, in which more than five households were evicted per day, the National Rental Desk reported in 2022 that evictions are on the rise once more, up 36 percent over the past year. Some activist groups say the number of illegal evictions carried out—including well-documented intimidation campaigns by owners against elderly tenants and the razing of informal housing—makes the scope of the crisis much larger. In the parish of Santa Maria Maior, where the historic neighborhoods of Alfama and Mouraria are located, 61 percent of homes are now registered as AL properties—meaning the majority of what were once family homes have been emptied of their residents. Earlier this year, the Lisbon city council put a freeze on new AL licenses, and in an extraordinary ruling, the country’s Supreme Court voted to restrict short- and medium-term rentals in residential buildings. Still, real estate speculation continues to wreak tremendous damage. In the past year, Lisbon has earned the dubious distinction of being ranked the third most financially unliveable city in the world, just behind London and just above Mexico City, another beleaguered digital nomad hot spot. \n“Friends tell me, ‘Lisbon suffered a perfect storm,’” Antonio Gori, a member of the housing rights collective Habita, told me. “But it wasn’t a storm. It’s the fruit of political decisions.”\nFor the past seven years, Ana Mendes Godinho, formerly the country’s secretary of state for tourism and now its minister of labor, solidarity, and social security, has set her sights on drawing temporary and long-stay foreign remote workers to Portugal. The relocation of Web Summit, a massive annual technology conference, to Lisbon in 2016 “was a very important turning point,” Godinho told me. She inaugurated dozens of coworking spaces in the interior of the country and expanded a financial incentive program to encourage relocation to the region—initially open only to citizens—to remote workers of any nationality. At last year’s Web Summit, she promised to personally reply to emails from remote workers who were interested, and in the weeks leading up to the 2022 summit, her government announced a new visa, widely referred to as a Digital Nomad Visa. (The visa is renewable for five years, the same amount of time necessary to become eligible for citizenship.) “We feel that this is the perfect moment, and we have the perfect conditions for digital nomads to choose Portugal for their lives,” Godinho told me.\nA common narrative employed by the champions of foreign remote workers is that Portugal needs people. Advocates cite underpopulated rural communities and point to the brain drain precipitated by the economic crisis, when millennials, the highest-educated generation in Portuguese history, left the country in droves. In both instances, most people left in search of employment; remote work, they argue, could solve all of that. Hall described his repopulation plan as a “funnel”: First draw the digital nomads, then entice the ones who will buy houses and settle. Pieter Levels, the proprietor of The Nomad List, one of the first sites dedicated to nomad hubs, recently launched a residency-consulting business for remote workers in Portugal. His sales pitch painted a portrait of a country “in dire need of foreigners to live, work, and spend money there to recover” and then went on to list the various ways you wouldn’t spend money there: 0 percent tax on income, 0 percent on crypto, 0 percent on dividends, 0 percent on wealth. StartUp Madeira has claimed that itinerant remote workers, as a whole, inject €1.5 million each month into the region. Immigrants, meanwhile, contributed €1.3 billion to the country’s social security fund last year. Yet so many of these foreign-born workers—particularly those from Brazil, Cape Verde, Angola, Nepal, Bangladesh, and Venezuela—are not received with the same fanfare. From discrimination and racist treatment to allegations of torture by the national guard, human trafficking, and outright slavery in the agricultural fields of the Alentejo, the distinctions between who is welcome and who isn’t couldn’t be starker. Just as Uber and Airbnb bypassed regulations by branding themselves as innovators of a “sharing economy,” the private and public hype around “digital nomads” makes an easy cover for propping up a hierarchy of migration.\nNearly every Madeiran I spoke with had something to say about their region’s sudden rise in popularity among remote work visitors and settlers. But Madeira is small. The uneasy memory of Portugal’s long dictatorship still lingers here; plus, everyone seemed to know someone who worked for the government or in tourism. Most asked that I keep their comments, even innocuous ones, off the record, or protect their identity: the teachers on their smoke break who balked at the nearly €1,700 rent foreigners were willing to pay at a new digital nomad hotel; the farmer who pointed out various foreign-owned rental properties on a nearby hill; the young doctor who loved the energy of the newcomers but lamented that it was all happening too fast; the woman in Funchal who laughed over how they had flooded Tinder, earning them the nickname “genital nomads.” \n“People say outright that they only want to rent to digital nomads,” one resident of a small town near Ponta do Sol complained. “It’s maybe the worst thing about this project.” Another described an American friend who had fled California because of the annual wildfires and was renting a rustic apartment in the hills above Ponta do Sol for €800—two or three times higher than it would have cost a few years ago, by her estimation. “Many of them are running away from something—from climate change, from real estate speculation, from Brexit,” she said. While her island was a refuge for them, she bemoaned that young Madeirans had nowhere left to flee—not Venezuela, not the UK, and certainly not the mainland.\nBeverly Yuen Thompson, a sociologist, describes these wandering remote workers as “canaries in the digital coal mine.” Despite the branded imagery of freedom, leisure, and good-vibes-only positivity—discussion of anything political, for example, was not allowed on the Madeira Slack channel—Thompson writes that the lifestyle is undergirded by uncertainty, inequality, and abandonment by both governments and workplaces. Digital nomads have “strong passports and resources,” she points out, “just not enough to live as comfortably in their own land as in someone else’s.”\nPHOTOGRAPH: KYLE JEFFERSFor a sector that so loudly proclaims its devotion to quality of life, the failure of the global leaders in the digital nomad space to consider the losses of host communities is astounding to behold. It is as though those living communities don’t matter beyond the abstract role they fulfill as backdrop. Lumber, not trees. In April, a video circulated on social media of 50 police officers with their batons out in the streets of Beato, a rapidly gentrifying parish in eastern Lisbon, grabbing and striking a group of women and children who were protesting a mass eviction. A few weeks later, the massive Creative Hub of Beato on the waterfront, home to Lisbon’s newest “unicorn factory,” hosted a hackathon to find innovative solutions to the capital’s housing crisis. The winning answer: blockchain.\nWhen I spoke to some of the local architects of Portugal’s digital nomad boom—Hall, StartUp Madeira CEO Carlos Soares Lopes, minister Godinho, and tourism authority president Luís Araújo—earlier this year, they were either reluctant to acknowledge its impact on long-term residents, dismissed housing as a separate issue, or pointed to coliving as the solution. As harms have compounded, however, public criticism has become impossible to ignore. This fall, the Portuguese press documented a distressing shortage of student housing, with report after report of undergraduates dropping out or sleeping in pantries because 80 percent of the rooms that had long been available to them were rented out. In November, Portugal’s secretary of state for tourism at the time, Rita Marques, admitted that “we have been the victims of our own success, and that’s true for digital nomads and for tourism too.”\n“I like to say that 500 years ago, Portugal discovered the world by sea,” Godinho said, “so now we are being discovered in this digital world.”\nHall now concedes there is some “short-term pain” for locals but insists that the payoff will be worth it. Not long after the launch in Madeira, he began pitching the Digital Nomad Village model to governments elsewhere in Portugal, then in Cape Verde, and most recently in Brazil. He purchased the NomadX brand from Williams to act as an umbrella for his rapidly expanding roster of projects, and this summer he launched a nonprofit with his wife and their friends: the Digital Nomads Association Portugal. They promptly elected him president. He believes he can “fix” what’s wrong with each of these places using his model; maybe 10 years to fix Cape Verde, possibly a little longer to figure out Brazil.\nIN PONTA DO Sol, Melissa Cabral did return to the Digital Nomad Village. Some weeks after the group lunch, she got a call from StartUp Madeira, offering her a temporary part-time contract as community manager. She became the first Madeirense in charge of helping orient new arrivals, organizing events, and facilitating day-to-day functioning in Ponta do Sol. When she started in July, of all the people who’d enthusiastically received her at lunch five months earlier, only one remained. \nSign Up Today\nSign up for our Longreads newsletter for the best features, ideas, and investigations from WIRED.\nCabral reached out to her own local friends and contacts on the island, inviting them to events and to use the free coworking space, but soon found that many of them simply weren’t interested. Even her brother refused her offers of a ride to the coworking space, where she happily sets up shop each day—he preferred working from home. Perhaps, she mused, it was the fact that “the digital nomads were not really at home” that made the coworking space and constant events appealing to them. While she has felt energized working closely with the international visitors in Ponta do Sol these past few months, her perspective on bringing more locals into the Digital Nomad Village fold has changed. “They have different lifestyles,” she told me.\nI recalled a story Pessegueiro had shared with me about a public garden in the village. At first, plants were purchased from a greenhouse, but these quickly withered because they weren’t acclimated to the local conditions. But then, she told me, “people started giving us plants from their gardens.” This time, the garden flourished. Like the town, Pessegueiro emphasized, it could not be prepared and made beautiful only for the eyes and photographs of tourists.I spent my last afternoon in Ponta do Sol on a Slack-organized hike along the Levada do Moinho, one of the oldest irrigation canals in the area. We climbed Nomad Street, past a colorful parade of brightly painted houses fringed by lush flower gardens, and paused briefly at the top of the hill in the shadow of a large pink building, the Esmeraldo house. In the 1400s, Flemish sugar baron João Esmeraldo presided over a vast, profitable sugarcane plantation from up here.\nPortuguese politicians often draw parallels between the country’s current popularity and its past glories. Disappointingly, the version of history they present is divorced from its brutal reality, emptied of any lessons it could possibly impart. “Just as it was in the 15th century,” Rui Miguel Barreto, Madeira’s secretary of economy, said in a speech earlier this year, “Madeira can become a gateway, a platform for development, for business on a global scale.” When we spoke on Zoom, Godinho called it “another time of discovery,” without a trace of irony. “I like to say that 500 years ago, Portugal discovered the world by sea,” she continued, “so now we are being discovered in this digital world.”\nThe island colony of Madeira experienced the world’s most spectacular cash crop boom in the 15th century, followed by an epic crash a few decades later as its sugar economy collapsed alongside the deforestation that fueled such rapacious expansion. This capitalist pilot project, environmental historian Jason W. Moore has noted, was cosmopolitan from the start. Settlers from mainland Portugal hauled timber and planted cane while enslaved people trafficked from the Canary Islands and the African coast took on the dangerous work of building mountainside irrigation canals, and bankers and traders from Flanders and Genoa circulated the product and profits. This included João Esmeraldo’s dear friend Christopher Columbus, who pivoted from the sugar business to maritime exploration during his time in the archipelago.\nMadeira was an early testing ground for the slavery-based island plantation economy, a place named by some scholars as the birthplace of global racial capitalism. But on my visit, I did not see any outward trace of this explosive role in history. Even in Funchal, at the sugar museum that doubles as a monument to Columbus, I did not find a single use of the words “enslaved,” “slave,” “slavery,” or “exploitation.” A few minutes away, in the harbor, a replica of Columbus’ ship the Santa Maria takes visitors on twice-daily tours along the southern coast. For €35, the tour company promises, you too can feel exactly how this great discoverer felt, exploring new corners of the world.\nLet us know what you think about this article. Submit a letter to the editor at mail@wired.com.","creation_date":"2022-12-16","tags":["","LONGREADS","REMOTE WORK","IMMIGRATION","EUROPE","HOUSING"],"author":"BY SUSANA FERREIRA","category":null}