{"id":"0a2300af-a03e-4556-b146-eaf1aaab753f","article_link":"https://cointelegraph.com/news/doge-image-kabosu-rights-dao-meme","website_source":"Cointelegraph","article_type":"News Article","summary":"Individuals behind the project said by acquiring the license to the iconic Shiba Inu image, they hoped to “unify the whole Doge community.”","title":"DAO acquires rights to the image behind the Doge meme","detailed_content":"Own The Doge, the decentralized autonomous organization (DAO) associated with the Shiba Inu meme behind the Dogecoin\nDOGE\n$0.15\ntoken, announced that it had secured legal rights to the iconic image.\nSpeaking to Cointelegraph on April 17, Own The Doge project leaders John Monarch and ‘Tridog’ said they had negotiated a deal with Sato Atsuko, the owner of the 18-year-old Shiba Inu Kabosu that became popular for her confused expression while sitting on a couch. The group purchased exclusive licensing and rights for the Doge image, seemingly giving them control over merchandise and other uses for the meme in the crypto space.\n“I think [the deal] unlocks a lot for corporations, where there’s confusion around copyright,” said Tridog.\nOwn The Doge said that with more clarity around the doge image copyright — which had seemingly been a free-for-all for years — there were opportunities for partnerships with big brands. The project said they reached out to Sato roughly three years ago and were able to negotiate a deal to purchase the rights to Kabosu’s image by working with legal experts in Japan and the United States.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nSource: Own the Doge\nWorking with Sato and others, the project has already released a documentary on the history of doge and the evolution of the image in and out of the crypto space. According to Tridog, the group was not “looking to enforce” its copyright claim on users and certain brands already using the image to spread its ‘doing only good everyday’ mantra.\n“We want to unify the whole doge community,” said Monarch. “We feel like Dogecoin and a lot of the others, like NFT [nonfungible token] side of things, and people who are into memes and the Reddit world, have always kind of diverged [...] it’s all about bringing the tracks together under one cultural umbrella.”\nRelated: Coinbase to launch DOGE futures, says it ‘transcended’ meme origins\nThe basis for the Doge image dates back to 2010 when Sato took a casual picture of Kabosu sitting on a yellow sofa in her home in Japan. Monarch suggested he had been the first person to use the term ‘Doge’ on social media, eventually leading to additional memes, the Dogecoin token, and various crypto-themed merchandise.\nTridog said the purchase of the licensing rights likely wouldn’t impact the Dogecoin Foundation or the meme token, which continues to use the image. Kabosu will celebrate her 19th birthday on Nov. 2 at a celebration in Japan. Though old for a dog, she has some catching up to do: the world’s oldest Shiba Inu lived to be more than 26 years old.\nMagazine: Real-life Doge at 18: Meme that’s going to the moon\nExchange or buy DOGE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Dogecoin","#Law","#Business","#Copyrights"],"author":"by Turner Wright","category":null}