{"id":"0a2aff38-7d53-48f7-8d0e-8b69a9c7829b","article_link":"https://cointelegraph.com/news/de-pins-connecting-farmers-businesses-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"With more than 160,000 farmers already onboarded in Indonesia and Colombia, Farmsent taps the Peaq blockchain as its layer-1 backbone to revolutionize the global food commodity trade.","title":"How DePINs are connecting farmers and businesses via blockchain","detailed_content":"In a bid to revolutionize the global food commodity trade and empower farmers, farmer-centric blockchain Farmsent has revealed a new partnership with the layer-1 decentralized physical infrastructure network (DePIN)-focused blockchain, Peaq. \nThe collaboration, announced on April 9, marks a step forward in Farmsent’s goal of decentralizing the agricultural supply chain to enhance transparency in the global food trade and build a global Web3 marketplace that connects farmers directly with consumer-facing businesses worldwide.\nBy leveraging a DePIN of sensors to track product quality and provenance, Farmsent claims it can eliminate centralized intermediaries and reduce costs for all stakeholders, all while ensuring transparency across the supply chain.\nCointelegraph talked to Yog Shusti, the co-founder and CEO of Farmsent, about the use case of DePINs in the agricultural sector.\nConnecting commerce \nShusti called Farmsent’s DePIN use case “particularly exciting for agriculture” because the technology is leveraged to benefit farmers and consumers.\n“It provides farmers with secure digital identities for better market access but also empowers them with real-time data about their crops. This includes crucial details like soil moisture, pH content, and humidity.”\nHe said this information allows farmers to make “data-driven decisions” to optimize crop health and yields. Meanwhile, the DePIN system allows consumers to access information about the food they purchase:\n“This could include details about the farm’s practices, the origin of the food, and how it was grown. It empowers consumers to make informed choices about the food they put on their tables.”\nRelated: Weather forecasting for developing regions: Here’s how Web3 can help\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nCurrently, the state of the global food trade highlights the urgent need for change. Farmers, despite being the backbone of the industry, often receive a disproportionately low share of the value captured in the market.\nScaling for the world\nAccording to Farmsent, it plans to address this by bypassing traditional intermediaries and enabling direct transactions between farmers and consumers and already has over 160,000 farmers onboarded in Indonesia and Colombia.\nThe platform, currently still in beta, is being used to track coffee, avocados and palm sugar between Indonesia, Colombia, the United Arab Emirates — where it already has a license to operate — and the United States. Farmsent said it is currently working on securing three additional licenses.\nShusti said that storing large amounts of data from sensors, farms and partners can become expensive on traditional blockchains:\n“As Farmsent expands its reach to new markets and connects with more farmers and consumers, the volume of data and transactions within the network will inevitably surge.”\nTherefore, he said that Peaq was chosen for its ability to cost-effectively store data and scale at large. The Peaq network has been gaining traction, and it recently secured $15 million in a Series A round led by Generative Ventures and Borderless Capital.\nIn the past, it has worked on DePIN projects alongside major companies such as Bosch and even worked to tokenize 100 Teslas in a decentralized Web3 ride-sharing initiative across Europe.\nData and security \nHandling the transactions and data of farmers and business owners worldwide is not only a big feat for scaling purposes but also in keeping all that information safe and secure. \nAccording to the Farmsent CEO, its DePIN network gathers information from three sources. In one, it is entered by humans and then validated. Information on farm practices, harvest details and initial processing can be manually entered by authorized personnel and validated for accuracy.\nIt can also be collected through Internet of Things (IoT) sensors placed throughout the supply chain (farms, storage facilities, transport) that can continuously monitor conditions like temperature, humidity and freshness.\nLastly, data is procured from third-party partners like logistics companies that provide data relevant to transport and storage conditions.\nTo keep this data secure, Shusti told Cointelegraph that Farmsent leverages Peaq decentralized identifiers (DIDs) to enhance data privacy further:\n“DIDs act like unique identifiers on the blockchain that can be linked to data without revealing the actual data itself. ”\nHe said that this allows for data verification and controlled access while protecting sensitive information.\nTill Wendler, the co-founder of Peaq, said this use case within the agriculture industry is not just exciting but also one of the “most important ones” due to its promise to push back global food insecurity and “deliver cheaper and more quality produce to people around the world” — and in a secure manner. \nMagazine: Memecoins make millionaires, Terraform and Do Kwon liable for fraud, and more: Hodler’s Digest, March 31 – April 6\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Business","#Decentralization","#Adoption"],"author":"by Savannah Fortis","category":null}