{"id":"0a42f617-e9ef-4240-a91b-fdc6d45ac477","article_link":"https://cointelegraph.com/news/public-blockchain-ledgers-not-fit-purpose-jpmorgan","website_source":"Cointelegraph","article_type":"News Article","summary":"Despite the criticism, TradFi institutions still prefer using public blockchains for real-world asset tokenization.","title":"Public blockchain ledgers ‘not fit for purpose,’ says JPMorgan exec","detailed_content":"Public blockchains are still not adequate for executing large amounts of transactions, according to a JPMorgan ex.\nDuring the BIS Innovation Summit on May 7, Umar Farooq, CEO of JPMorgan’s Onyx blockchain-based payment platform, said:\n“I think you almost need something like [a Unified Ledger]. I mean, it’s actually almost a necessity because if you look at […] public blockchain ledgers, they are not fit for purpose for large transactions today.”\nThe CEO’s comments came in response to the Unified Ledger, a concept introduced by the Bank of International Settlements (BIS) last year that aims to support central bank money flows, tokenized deposits and digital assets on its network.\nFarooq further explained that if a $100 million transaction were to fail, public blockchain validators can’t be held accountable. Farooq said:\n“Who do I sue? [...] You need to get somewhere where people can do trusted transactions between financial institutions with some sort of accountability in the system.”\nDespite the CEO’s criticism, JPMorgan’s bank-led Onyx platform is built as a private, permissioned version of Ethereum, the world’s second-largest public blockchain network. Unlike public blockchains, Onyx’s permissioned chain enables institutions to reverse transactions.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nMoreover, JPMorgan’s Farooq argued that the cryptocurrencies issued on public blockchains create false incentives aiming to drive more users to the networks to push the price of the coin up. He noted that blockchains, like the internet, should be considered a public good: \n“We need to get to an evolution point where the technology starts to be seen as a public good versus as a means to enrich.”\nRelated: Solana could flip Ethereum in transaction fees within a week: Report\nTradFi firms prefer public blockchains, says ex-Grayscale executive\nDespite widespread criticism, traditional financial (TradFi) institutions prefer tokenizing assets on public blockchains.\nSpeaking with Cointelegraph, Celisa Morin, who served as vice president of platform distribution at Grayscale until mid-2022, said that BlackRock’s recent initiative could lead to more TradFi institutions tokenizing assets on public blockchain rather than private ones. She said:\n“I think we see a preference for private chains with JPMorgan’s Onyx. But I do think that this was the narrative a few years back. Now, I think it’s very much the public blockchains.”\nMorin was referring to BlackRock’s $100 million tokenized “BUIDL” fund, which was launched on the Ethereum network on March 18.\nBlackRock’s BUIDL fund currently holds over $382 million and is the world’s largest tokenization fund, according to Dune data.\nSource: Dune\nRelated: Trader loses 7-figure sum due to 0L Network hard fork","creation_date":"2024-05-08","tags":["#Blockchain","#Ethereum","#Adoption","#BIS","#JPMorgan Chase"],"author":"by Zoltan Vardai","category":null}