{"id":"0a62249d-81cf-43b4-a43e-774f6a97e67c","article_link":"https://cointelegraph.com/news/arkham-top-doxed-crypto-hodlers-own-3-billion","website_source":"Cointelegraph","article_type":"News Article","summary":"Around $1.2 billion worth of crypto in the top five holders’ wallets have been flagged as ‘inaccessible’ due to lost private keys.","title":"Arkham’s top 5 doxed crypto hodlers own $3.5B, but 35% is untouchable","detailed_content":"The top five identified crypto whales with publicly known wallet addresses hold around $3.5 billion in crypto, according to a dashboard from blockchain intelligence firm Arkham.\nHowever, due to lost passwords and private keys, a large chunk of it is inaccessible. \nOn April 15, the on-chain intelligence platform announced the updated dashboard revealing the holdings of some of the world’s on-chain-verified richest crypto holders and whales, including Tron’s Justin Sun and Ethereum’s Vitalik Buterin.\nThe top five crypto holders on its list currently own an aggregate of $3.47 billion in digital assets, according to the data. However, around 35% or $1.21 billion of that total has been flagged as ‘inaccessible.’\nSource: Arkham Intelligence\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nArkham’s crypto top five\nJustin Sun tops the list with a reported $1.06 billion in his crypto wallet. The Tron network founder’s wallet is heavy on his own stablecoin, Decentralized USD (USDD), with $275 million in holdings, followed by the network’s native token, Tron\nTRX\n$0.1249\n, of which he holds $237 million worth.\nRain Lõhmus, the founder of Estonia-based LHV Bank, is second on Arkham’s list with $769 million worth of Ether. However, it has been flagged as inaccessible, as it was reported in November that he lost access to his private key.\nEthereum co-founder Vitalik Buterin comes third with a wallet containing $757 million, primarily in\nETH\n$3,030\nof which he holds 245,425 tokens.\nThe Bitcoin wallet of the former chief technology officer at Ripple, Stefan Thomas, shows up as fourth on the list. However, his $442 million worth of Bitcoin\nBTC\n$62,974\nhas also been flagged inaccessible.\nThomas lost access to more than 7,000 Bitcoin in 2011 after losing the password to the encrypted hard drive holding the details of his cryptocurrency.\nIn October, crypto recovery firm Unciphered offered to unlock the IronKey hard drive.\nRelated: Ethereum’s next hard fork could make lost private keys a thing of the past\nCrypto venture capitalist James Fickel rounds out the top five with $436 million worth of digital assets in his wallet, according to Arkham.\nOther notable crypto wallets in the top ten include early adopter Patricio Worthalter, who holds $219 million worth, primarily in ETH. General Partner at Cluster Capital, Winslow Strong, is listed as holding $27.5 million worth of digital assets.\nFor those included, the dashboard displays public wallets tagged by Arkham, their current token holdings and balance history, a breakdown of portfolios across chains and historical daily balances, and recent activity.\nHowever, the list doesn’t contain whale wallets that are linked to unknown or pseudonymous owners, such as Bitcoin’s creator Satoshi Nakamoto whose BTC holdings are estimated to be worth tens of billions across multiple addresses, or other crypto titans that currently aren’t linked to a particular wallet address.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-16","tags":["#Blockchain","#Wallet","#Private Keys"],"author":"by Martin Young","category":null}