{"id":"0acd5b57-37ad-48eb-a6e5-30691f462592","article_link":"https://cointelegraph.com/news/figment-staking-dutch-exchange-bitvavo","website_source":"Cointelegraph","article_type":"News Article","summary":"Institutional staking platform Figment will become an additional infrastructure provider to Dutch exchange Bitvavo.","title":"Dutch exchange Bitvavo taps Figment to expand staking services","detailed_content":"Update (May 1 at 3:00 pm UTC): This article has been updated to include additional information about Figment’s partnership with Bitvavo.\nNetherlands-based cryptocurrency exchange Bitvavo will tap into staking platform Figment’s institutional-grade infrastructure to stake a variety of tokens on behalf of its users.\nFigment, which attracted significant investments from the likes of Galaxy Digital in 2021, announced that it would provide staking infrastructure for the Dutch exchange. Bitvavo will stake user assets across multiple proof-of-stake protocols, including Ethereum, Solana and Near.\nA statement from Bitvavo CEO and co-founder Mark Nuvelstijn highlighted the exchange’s efforts to review and enhance its products and services. The company also confirmed that Figment is an expansion and diversification of its pool staking service providers, which include Coinbase, Copper and Kiln.\nNuvelstijn added that staking has become an integral part of the cryptocurrency industry and that the provision is an essential service for its customer base of more than 1.5 million users across the Benelux region.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe Bitvavo CEO said that working with Figment would allow the exchange to provide additional security and safety around staking and expand the offering:\n“Figment is one of the staking infrastructure leaders in the market, and we continue to be impressed by their staking- and up-to-date market knowledge.”\nFigment's head of Europe, the Middle East and Africa, Eva Lawrence, said the two teams have been working together for six months with the view of spearheading the exchange’s staking services across Europe.\nThe partnership is set to provide access to staking rewards on Bitvavo on newly launched networks. Figment is also establishing dedicated validator nodes for Bitvavo to provide high-quality network performance and security.\nThe Dutch exchange has continued a steady approach to expanding its footprint into Europe. In November 2023, it announced the launch of services to French users after successfully registering as a digital asset service provider with France’s Autorité des Marchés Financiers.\nThe expansion into France followed Bitvavo’s regulatory approval to offer its services in Austria. The exchange expanded its offering to Italy in 2022 and has filed registration applications for other major European markets.\nNuvelstijn previously spoke exclusively to Cointelegraph during the European Blockchain Convention held in Barcelona in October 2023, highlighting his belief that Europe’s Markets in Crypto-Assets framework will allow cryptocurrency companies to offer financial services and vice versa.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Netherlands","#Adoption","#Cryptocurrency Exchange","#DeFi","#Staking"],"author":"by Gareth Jenkinson","category":null}