{"id":"0b9a78bf-fac3-4d15-9359-776ce27f5346","article_link":"https://cointelegraph.com/news/qanplatform-quantum-resistant-blockchain-testnet","website_source":"Cointelegraph","article_type":"News Article","summary":"Quantum computers will be able to crack today’s main cryptographic algorithms employed by the whole internet, including banking applications, email providers and social media platforms.","title":"QANplatform launches world’s first quantum-resistant, EVM-compatible testnet","detailed_content":"QANplatform launched the world’s first quantum-resistant blockchain testnet compatible with the Ethereum Virtual Machine (EVM), enabling the development of quantum-resistant smart contracts.\nThe new testnet will enable developers to write smart contracts using any programming language, according to QANplatform’s announcement shared with Cointelegraph.\nThis marks the first EVM-compatible testnet with quantum-resistant cybersecurity, according to Johann Polecsak, co-founder and chief technology officer of QANplatform, who told Cointelegraph:\n“Centralized authorities like governments, companies, and organizations can switch their IT security to post-quantum cryptography much more easily than blockchain platforms.”\nPost-quantum security has become a pressing concern since December 2023, when the second-largest quantum processor, IBM Condor, was launched with 1,121 qubits.\nDue to their inherent decentralization, most of the top existing blockchain networks such as Bitcoin, Ethereum or Solana are unable to adopt quantum-resistant security measures without significant negative impact, explained Polecsak:\n“Pseudonymity of blockchain will backfire at post-quantum migration because it will be impossible to tell legitimate owners migrating their funds and data or hackers stealing all of it apart. In this case, billions of dollars worth of ‘free money’ and data could land in hackers’ hands if they start migrating on the real owners’ behalf, making the affected blockchains immediately worthless.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHowever, the new QANplatform testnet will enable EVM-compatible protocols to test their migration process for a quantum-resistant alternative, without risking user funds on the mainnet.\nThe testnet announcement comes nearly two months after the first European country adopted QANplatform’s quantum-resistant technology in March. The tech stack protects against quantum computing attacks on government-owned cybersecurity infrastructure.\nRelated: Robinhood crypto business slapped with SEC Wells notice\nQuantum security is already a significant concern in 2024\nGovernments worldwide are already preparing for a post-quantum era. In 2018, the European Commission launched the Quantum Flagship research initiative with a budget of at least 1 billion euros ($1.078 billion) and a duration of 10 years.\nThese efforts are justified, considering that quantum computing is already presenting a significant security threat for everyday internet users, according to QANplatform’s Polecsak. He said:\n“Quantum-resistant technology is important already today because of the ‘store now, decrypt later’ cybersecurity threat that involves attackers collecting encrypted data with the intention of decrypting it later using more powerful computing methods, such as quantum computers.”\nLarge companies are also gearing up for a post-quantum future. Apple unveiled a new update in February that aims to future-proof iMessages with post-quantum cryptography, making Apple the first among a handful of quantum-proof messaging providers.\nThe Signal messaging app also launched a “quantum-resistant” encryption upgrade in September 2023, but Apple says it’s the first to reach “level 3” encryption.\nWhile quantum computers may take more time to develop, post-quantum security needs to be ahead of the curve, as quantum computers with stable qubits will be able to break today’s main cybersecurity algorithms, according to Polecsak:\n“Today’s asymmetric cryptographic algorithms like RSA and EC used by the whole internet — including governments, banks, email providers, social media, blockchain platforms, etc. — will be cracked by quantum computers.”\nRelated: Crypto options desk QCP Capital wins Abu Dhabi license: Report\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Security","#Ethereum","#Cybersecurity","#Quantum Computing","#Ethereum 2.0","#Quantum Computing"],"author":"by Zoltan Vardai","category":null}