{"id":"0ca6401c-511e-4a6f-a6c1-0cdf115f03a0","article_link":"https://cointelegraph.com/news/worldcoin-world-id-unverify-iris-age-check","website_source":"Cointelegraph","article_type":"Tweet","summary":"Sam Altman’s Worldcoin is taking measures to improve the protection of user data and ensure that its platform is available only to people over 18.","title":"Worldcoin tightens privacy checks, allows users to unverify World ID","detailed_content":"Worldcoin, the digital identity and cryptocurrency project built by OpenAI CEO Sam Altman, is adding new features to increase the protection of personal data and improve age verification.\nOn April 9, Worldcoin announced two updates: The ability to unverify World IDs via permanent iris code deletion and in-person age verification checks.\nWorld ID holders can now unverify their World ID, which serves as a digital passport that verifies an individual’s humanness using “orbs,” which are devices that scan users’ eyeballs to confirm that they are real humans.\nOpenAI CEO Sam Altman being scanned for Worldcoin. Source: Vulcan Post\nUnverifying the World ID includes permanently deleting the user’s iris code, a numeric representation of their unique iris texture. The iris code ensures that individuals can only verify one World ID.\nOnce deletion is requested, the individual‘s World ID will become invalid. To protect against fraud, the procedure will require a six-month “cool-off” period to ensure that individuals cannot immediately re-verify humanness.\nBy the end of the cool-off period, users will have their iris code permanently deleted and made unrecoverable.\nWorldcoin’s new unverify option was developed in consultation with third-party privacy and security experts, including the Bavarian State Office for Data Protection Supervision (BayLDA).\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAccording to the startup, BayLDA is Worldcoin’s lead supervisory authority in the European Union.\nThe second update — Worldcoin in-person age verification checks — are introduced to help ensure that the platform is available only to humans above the age of 18 years old.\nThe update includes an on-site age verification check at all orb locations before World ID verification. Third-party personnel will perform the check before entering the venue, the announcement notes.\n“Worldcoin has always required that individuals be a minimum of 18 years old to obtain a World ID,” a spokesperson for Worldcoin told Cointelegraph, adding:\n“Individuals have always been asked to confirm they meet this requirement in the app, similar to other apps in wide use today.”\nAltman, the creator of OpenAI — the firm behind the natural language processing chatbot ChatGPT — launched Worldcoin in July 2023 with the goal of providing a “global financial and identity network based on proof of personhood.”\nWorldcoin received mixed reactions from the community as many questioned its centralization, privacy and security.\nRelated: TON’s $5M incentive program aims to drive digital ID verification\nSome governments have also been skeptical about Worldcoin’s security and privacy. Worldcoin’s European Union supervisor, BayLDA, reportedly began an investigation into Worldcoin due to privacy concerns months before its official launch.\nIn late 2023, Worldcoin paused the offline orb verification function for users in India and aims to reinstate the service later in 2024.\nIn August 2023, Worldcoin was banned in Kenya, with the government halting all local activity associated with the platform, including biometric identification. Worldcoin has been working with the Kenyan government to resume operations.\nIn March 2024, Worldcoin declared that it operated lawfully in all of the locations in which it is available and fully complies with related laws.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Privacy","#Identity","#Adoption","#Worldcoin","#Verification"],"author":"by Helen Partz","category":null}