{"id":"0d556fd9-fc6e-4f91-96ef-f76bc12f601c","article_link":"https://cointelegraph.com/news/ethereum-l2-movement-labs-38m-move-evm-adoption","website_source":"Cointelegraph","article_type":"News Article","summary":"Through Facebook’s Move-based Ethereum virtual machines, Movement Labs aims to enhance smart contract security and transaction throughput within the Ethereum ecosystem.","title":"Ethereum L2 Movement Labs raises $38M for Move-EVM adoption","detailed_content":"Movement Labs’ vision to build a network of blockchains based on Facebook’s Move programming language bagged a $38 million boost through a Series A funding raise.\nThe San Francisco-based blockchain development team secured the funds in a round led by Polychain Capital and supported by Aptos Labs, Bankless Ventures, OKX Ventures and eight other venture capital firms.\nThrough Move-based Ethereum virtual machines (EVMs), Movement Labs aims to enhance smart contract security and transaction throughput within the Ethereum ecosystem. \nSpeaking to Cointelegraph, Rushi Manche, the co-founder of Movement Labs, said that reentrancy attacks, arithmetic errors stemming from incorrect math within a contract and faulty input verification are some of the most common vulnerabilities impacting smart contracts.\nAccording to Movement Labs, Move-EVM can help protocols fend off common reentrancy attacks, which previously affected major protocols like Curve and KyberSwap. The team estimates that smart contract exploits alone resulted in losses of over $5.4 billion between 2022 and 2023. Manche said:\n“Move eliminates reentrancy vulnerabilities by ensuring resources are uniquely accessed, preventing recursive exploits. It also ensures that transactions are completed before another can start, blocking approximately as much as 90% of attack vectors found in Solidity.”\nThe team launched M2, a Move VM-based layer-2 for Ethereum, in November 2023, which introduces an execution environment designed for more than 30,000 transactions per second (TPS).\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWith Move-EVMs, Movement co-founder Rushi Manche wants to set the stage for developers to build “the next Facebook” on-chain. He added:\n“Move addresses the shortcomings of Solidity (smart contract programming language) and we are bringing it to market in a crypto-native way.”\nThe company also plans to introduce a cross-compatible execution layer framework called Move Stack, allowing rollup frameworks from companies like Optimism, Polygon, and Arbitrum to interact. \nAdditionally, MoveVM supports localized fee markets which can help mitigate gas spikes and further reduce resource expenditure. “Our aim with Movement is to deliver the speed and affordability needed for mass adoption of Web3 applications,” Manche added.\nThe latest fund injection will be redirected to global hiring efforts and investing heavily in Move developer tooling and education.  \nRelated: OKX launches Ethereum layer-2 network for lower fees & interoperability\nPrior to the $38 million Series A funding, Movement Labs had raised $3.4 million in the pre-seed round to aid the upcoming launch of its public testnet, Parthenon.\nDegen Chain, a new Ethereum layer-3 network, recently recorded the highest TPS count in the Ethereum ecosystem.\nOn April 19, Degen’s TPS count increased 62% over the last day to notch 35.7 TPS — beating out the blockchain it was built on, Base, at 29.7 TPS, according to L2BEAT.\nTPS by Ethereum-based blockchain over the last 24 hours. Source: L2BEAT\nMultiplying Degen’s 35.7 TPS by 86,400 seconds in a day means the memecoin chain processed 3.08 million transactions over that timeframe.\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Smart Contracts","#Ethereum","#Hackers","#EXP Attack","#Hacks","#Layer2"],"author":"by Arijit Sarkar","category":null}