{"id":"0e27bb1a-d3b7-4057-a997-996eeaa04242","article_link":"https://www.wired.com/story/have-a-nice-future-podcast-24/","website_source":"Wired","article_type":"News Article","summary":"We talk with Michael Casey, the chief content officer of CoinDesk, almost one year after the news site brought down Sam Bankman-Fried’s cryptocurrency empire FTX.","title":"Where Does Crypto Go From Here?","detailed_content":"ON THIS WEEK’S episode of Have a Nice Future, Gideon Lichfield and Lauren Goode talk to Michael Casey, chief content officer of the cryptocurrency news site, CoinDesk. Almost a year after a CoinDesk report kicked off a series of events that led to the collapse of Sam Bankman-Fried’s cryptocurrency exchange FTX, is there anyone who still believes in crypto?\nShow Notes\nFollow our live coverage of Sam Bankman-Fried’s FTX trial. If you need a primer on the trial—or the blockchain, we’ve got you covered. Or maybe you just want to read all things crypto.\nLauren Goode is @LaurenGoode. Gideon Lichfield is @glichfield. Bling the main hotline at @WIRED.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Have a Nice Future podcast and our huge library of narrated articles.\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nIf you're on an iPhone or iPad, just tap this link, or open the app called Podcasts and search for Have a Nice Future. If you use Android, you can find us in the Google Podcasts app just by tapping here. You can also download an app like Overcast or Pocket Casts, and search for Have a Nice Future. We’re on Spotify too.\nTranscript\nNote: This is an automated transcript, which may contain errors.\nLauren Goode: I'm gonna say that once more 'cause it sounded like I said, “I'm Morin, I'm Morin Goode.” Three, two.\nGideon Lichfield: Morin Goode.\nLauren Goode: I'm Morin. That's a Morin. Three, two, one. Hi, I'm Lauren Goode.\nGideon Lichfield: And I'm Gideon Lichfield. And this is Have a Nice Future, a podcast about how terrifyingly fast everything is changing.\nLauren Goode: Each week, we talk to someone with big, audacious, and sometimes unnerving ideas about the future, and we ask them how we can all prepare to live in it.\nGideon Lichfield: Our guest this week is Michael Casey, the chief content officer of CoinDesk, the cryptocurrency news site that almost exactly one year ago brought down Sam Bankman-Fried’s multibillion-dollar crypto empire.Michael Casey (audio clip): What I find extremely frustrating is that the debate is about ‘look how many bad people there are over here; we need to just shut this industry down’ as opposed to thinking hard and intelligently about the technology itself and how we might actually create a safer system so that those bad people don't take charge of it.\nLauren Goode: Alright Gideon, I'm going to ask the question that's on a lot of people's minds: Is crypto dead?\nGideon Lichfield: Dead as in like nobody using it anymore?\nLauren Goode: Well, I mean, obviously people are still using it, but as you mentioned, I think the meltdown of FTX was a real wake-up call for crypto believers. It was so hyped up, and it ended up losing customers and billions of dollars. SBF was the poster boy of crypto, and now he's on trial for fraud, which we are covering at WIRED. And I feel like pretty much every crypto story I've read since then has been about other crypto companies or exchanges struggling because of the ripple effects of that collapse.\nGideon Lichfield: Right. And everyone's talking about crypto winter for—I dunno, like the fourth or fifth time, and yet as SBF's trial was starting, the price of bitcoin was up something like 30 percent on what it was right before FTX collapsed, so a lot of people still believe in crypto.\nLauren Goode: Which still doesn't make sense to me at all.\nGideon Lichfield: And it didn't to me either, so that's one of the reasons I wanted to talk to Michael Casey.\nLauren Goode: Did you know that I used to work with Michael Casey at Dow Jones?\nGideon Lichfield: I did not.\nLauren Goode: Yeah, I used to. I used to bug him to join me on a livestreaming video show that I was doing at The Wall Street Journal. I had no idea he was a crypto guy or became one.\nGideon Lichfield: Yes, he absolutely still thinks crypto is the future of financial systems, and he's in this interesting, unique position because CoinDesk is a media company whose very purpose hinges on the existence of crypto and indeed the success of crypto as a technology. But it also did the reporting that took down SBF and caused all this turmoil that we've seen in the industry.\nLauren Goode: Yeah, they actually won a big award for that recently. Did you happen to see that?\nGideon Lichfield: Oh, actually I didn't.\nLauren Goode: They won a Loeb, which is one of the most prestigious awards in business journalism, so kudos to them. But I also saw that CoinDesk was put up for sale.\nGideon Lichfield: Yes.\nLauren Goode: Was that in any way related to the FTX collapse?\nGideon Lichfield: Well, indeed it was and that's another part of what makes their situation so interesting. So CoinDesk's parent company, DCG, owns a bunch of crypto companies and assets, and the fallout of FTX forced it to put a lot of those assets up for sale, including CoinDesk itself. So Michael's challenge now is how to make CoinDesk a thriving business during this latest crypto winter.Lauren Goode: Ah, so you're saying the future of journalism is not to put all of your assets in crypto?\nGideon Lichfield: Well, maybe the future of crypto journalism is not to put all your assets in crypto, that's for sure.\nLauren Goode: OK, fair enough.\nGideon Lichfield: Anyway, I wanted to talk to Michael both to have him explain how he still believes in crypto after everything that's happened, but also to understand how a news organization that's covering this industry walks the line between being an advocate for it and also a critic of it.\nLauren Goode: Well, I'm so curious to hear what he has to say.\nGideon Lichfield: And that conversation is coming up right after the break.\n[Music]\nGideon Lichfield: Michael Casey, welcome to Have a Nice Future.\nMichael Casey: Thank you for having me, Gideon.\nGideon Lichfield: Are you having a nice future?\nMichael Casey: Ask me tomorrow. I don't know.\nGideon Lichfield: Ask you in the future?\nMichael Casey In the future.\nGideon Lichfield: OK. Well, we're speaking because it's coming up to a year after one of the world's biggest cryptocurrency exchanges, FTX, went bankrupt and billions of dollars worth of its customers’ money went missing, and we're here basically to talk about how the crypto world looks a year after that and how it will look in the future. But I wanna start with you. How did you start covering crypto? What made you interested in it, and what made you believe in it?\nMichael Casey: Yeah, so I was at The Wall Street Journal at the time, and I had covered currencies. I saw this strange thing called bitcoin everyone was talking about. This is in 2013. I was writing a column at the time called “Horizons” for The Wall Street Journal. And I don't know. I wrote some pretty basic, \"Hey, don't touch this thing. It's probably a tulip bubble\" kind of story. And then I got called in by a few people who—some of whom are still in the industry, some who aren't, some prominent names, some of them big venture capitalists and others, taken out for dinner—explained what it was all about. And I think because of the fact that I'd spent six years of my life in Argentina, a country that just has perpetual crises—it's just never resolved it's monetary problems throughout a very long 100-year history of ups and downs—and suddenly this alternative to how a monetary system could run was presented in front of me, something that didn't need a government, and it just dawned on me as just a phenomenal idea.\nGideon Lichfield: Right, so you saw crypto as a kind of an answer to the brokenness of existing financial systems.\nMichael Casey: And also just a different—just fascinating that you didn't—you could construct it without an institution in the middle of it. This idea that money didn't have to be issued by a government, that was just a revelation that just became a never-ending quest to explore.Gideon Lichfield: So you wound up as chief content officer at CoinDesk, which famously published the story last November that brought down FTX, and we'll talk more about that in a second. But maybe just for our listeners who don't know, describe really briefly what CoinDesk is.\nMichael Casey: We describe ourselves as the leading media events and indices company in the crypto and digital asset space.\nGideon Lichfield: Right, and so a lot of media companies that cover a particular industry, you have this sort of joint role of being a watchdog for it and also, to an extent, a cheerleader. You are interested in growing and promoting the existence of the industry itself and making it better. Does that seem fair? And I think—\nMichael Casey: I think so. I always flinch a little bit, and I think you as a journalist would do as you hear the word cheerleader. Like, it's just not something we ever wanna describe ourselves as. I think that it's pretty hard to be in crypto journalism if you don't have some belief in the power of the technology. That's obviously quite different from cheerleading any particular company or even cheerleading the industry as it currently is, right? Like the two things are different.\nGideon Lichfield: Right. The thing that I think is interesting is, any industry media publication has to strike this balance, but it's an especially delicate balance in an industry like crypto where there are so many scams and grifts. So what are your guiding principles for being honest about what is going on in the industry whilst also fundamentally believing that it's a worthwhile industry?\nMichael Casey: So many scams. There are a lot, without a doubt. Like I think it would be naive to say that there are not a lot of scams. It is obviously something that we are constantly reporting on. You just have to look at CoinDesk coverage. If you truly believe, as I do, for example, that we have an a fundamentally broken internet with Google, Facebook, and these massive platforms controlling our data and manipulating us via that, and you'd love to see a system that no longer had that dependency, and people had control of their data, then you're gonna cover this industry for the sake of holding it to account so that it does improve.\nGideon Lichfield: So speaking of that—speaking of holding an industry to account—let's go back to the day November 2 when CoinDesk published this report on problems at FTX. Maybe just begin by very briefly describing what those problems were for anyone who doesn't remember.\nMichael Casey: OK. So the first company that now I named—that everybody would be familiar with—Sam Bankman-Fried had created before he created the exchange FTX, was called Alameda Research. Alameda was a trading firm, and there was always known that there was a relationship between the two companies, but we didn't really have any idea about how deeply intertwined they were until our reporter Ian Allison got ahold of a balance sheet. This is a private company that the balance sheet was not formally released, and this was Alameda's balance sheet. And it showed that a lot of the assets that it recognized on its books were actually FTT, a token that was issued by FTX. What that showed was this very circular relationship that the assets that this company held were actually completely defined by the institution of which it depended for a lot of business, and essentially it exposed a house of cards and front-running, misuse of customer funds, and an absolutely enormous number of breaches of the fiduciary duty that any exchange has to its users.Gideon Lichfield: Do you think that you could have predicted when FTX first collapsed that it would have so many ripple effects in this way, such a domino effect?\nMichael Casey: We could have. I don't think we did. I'm not sure many people did. There were certainly people that were looking at the prevalence, and let's remember that these problems existed in traditional finance as well, right? The intertwined structure of Wall Street was a defining feature of the financial crisis of 2008, but I don't think anyone really was out there just predicting how dramatically affected everybody would be.\nGideon Lichfield: So overall, how would you say the crypto world looks today in the wake of all of that?\nMichael Casey: So there's been two phases of what people in this industry describe as the crypto winter. The first is this massive unwind—a load of bankruptcies—then what we've seen in each of these winters, a departure of interest in the sector from the kind of retail enthusiasts who were the fly-by-night folks who would come in and out, not sort of long-term investors, but just had gotten excited at the top of the market. And as always, when these things happens, they're the ones who lose their shirts. When it comes down, those people had disappeared. There was no more—the search queries on Google for “crypto,” for example, have just plummeted. What's different about this time is it has also come with a very aggressive set of enforcement actions by the US regulatory apparatus, most notably by the Securities and Exchange Commission, the SEC. It's my belief, others might say otherwise, that the extraordinarily large extent to which my former colleague at MIT, Gary Gensler, has gone to to really attack a lot of firms here—\nGideon Lichfield: This is Gary Gensler, the SEC chairman.\nMichael Casey: That's right, the chairman of the SEC. It feels very motivated by payback, right, a very large number of lawmakers who had received donations from Sam Bankman-Fried and from FTX. He'd spread his largesse across both sides of the house, and then it turned out that he was just a crook, a—\nGideon Lichfield: Just as bad as the rest, yeah.\nMichael Casey: I would say he was far worse, actually.\nGideon Lichfield: Well, worse than worst of them even.\nMichael Casey: Far, far worse, because it is this idea that you have breached everybody's trust. You don't go into Washington and make this sort of a mess without expecting some payback, and it is conceived as a payback against all of crypto, which is pretty unfair, I would say.\nGideon Lichfield: I'm gonna challenge you on that in a bit, because I wanna talk about what the SEC is actually doing. So in June, it sued Binance and Coinbase, which are two of the world’s biggest crypto exchanges. A large part of its lawsuit against both exchanges is that it thinks most crypto assets should be regulated like securities, like stocks and bonds, for example. But then there's a second issue, and that's where it's really suing—where the SEC is suing Binance, which is a bunch of violations for mismanaging its customers funds, which are not unsimilar to some of the charges that were leveled against FTX. So let's take these two things in.Michael Casey: Or MS Global or HSBC or Standard Chartered or any single bank that has been in this. I'm not trying to shun or forgive them, but those things happen throughout finance, because finance is full of crooks. It always has, always has been. I've been covering it for 20 years, and trust me, there are a lot. You could look through a Wikipedia page on something like this, but anyway, carry on.\nGideon Lichfield: Alright. Well, let's go back to these two separate issues as they relate to crypto. So let's start with the regulatory question, should most crypto assets be regulated like securities as the SEC is claiming? What's your position on that?\nMichael Casey: If you just treat every token as a security, it ceases to be able to function for what it does. And so if you created a system that was purely securities, then anybody owning one, anybody who wants to participate—this is supposed to be an open system, it's supposed to solve things like financial inclusion so that people in the developing world can gain access to payment systems and so forth—every one of those people would have to be an accredited investor. That doesn't make any sense. You can't run a decentralized system with that level of bureaucracy in the middle of it.\nGideon Lichfield: OK, so it sounds like you're basically saying that regulating crypto assets as securities would limit far too much the ability of people to participate in this system and to use it to solve the kinds of financial problems that you think crypto currencies can solve.\nMichael Casey: I'm not at all saying that this shouldn't be regulated. I'm saying that we need a smart way of trying to deal with this.\nGideon Lichfield: So I think part of the reason that the SEC is trying to enforce these assets or securities is that regardless of what you say should ideally be happening, people aren't treating them as speculative investments. Like Ethereum I think is up 20 percent for the year. Is there a way to square the circle? Is there a way to have it not become just a speculative asset than—\nMichael Casey: Sure, it's called consumer finance, it's called—there's a whole lot of laws for —what Sam Bankman-Fried did was allegedly illegal. Let's see how the case that started now plays out. I think many people are pretty convinced that it was. And there's laws that don't require necessarily securities laws to do so. Like there's a breach of a whole host of consumer finance and fiduciary duties. There is all sorts of ways to stop people from doing bad things. Like the risk that an investor faces, which is what you are trying to protect against, comes down to who controls it? Is there a system in which some company, some entity, some person controls your assets? And under a pure decentralized crypto system, you control the assets, not Sam Bankman-Fried. And so there's a lot out there that would make this a safer system, but it's really not being contemplated by the current administration.Gideon Lichfield: You said just now that what Sam Bankman-Fried did was allegedly illegal. Is there a world in which it wasn't illegal?\nMichael Casey: I think we all—I know. I'm trying to be a good journalist here, Gideon. I'm just trying to like—\nGideon Lichfield: Just because he hasn't been found guilty yet.\nMichael Casey: Innocent before proven guilty, yes, but I think he did.\nGideon Lichfield: Fair enough.\nMichael Casey: That's it.\nGideon Lichfield: Alright. So, let's go back to something else that you said, 'cause I started talking about how the SEC is also suing Binance over allegedly misusing its customer's funds, or mismanaging them, and how that was similar to what FTX did, and you jumped in and said, well, also a whole bunch of banks, also large parts of the truth about the financial system.\nMichael Casey: Which sounds like whataboutism maybe, yeah? But—\nGideon Lichfield: It sounds a little bit like whataboutism, but I think more interestingly than that, my question is this, some of the promise—I think, well, the promise of crypto was that it was gonna be decentralized, was that it wasn't gonna be captured by institutions or by individuals, and yet that is the fact of what has happened, because it turns out that even when you run a decentralized system, you need some things like exchanges or you need trading spaces for NFTs, for example, and those end up being dominated by, on the whole, a handful of parties. So I feel like the problem of corruption or mismanagement that we've seen in the crypto industry is to a large extent for that reason. In other words, it doesn't seem like it is actually immune from the same kind of challenges that face the financial system. So how would you get past that?\nMichael Casey: Well, I think that's a fair criticism, and I think that that's on crypto, that's on this industry for defaulting to the simple solutions.\nGideon Lichfield: Is it on crypto, or is it just on human beings?\nMichael Casey: I think it's on human beings as well. I think actually it's very difficult to build the decentralized system. They are inherently complicated, and it's very, very difficult to do it by snapping your fingers, but bitcoin achieved it. There is nobody in charge of bitcoin and it runs this way day in, day out.\nGideon Lichfield: But there are people in charge of the exchanges when bitcoin is traded.\nMichael Casey: Sure, sure.\nGideon Lichfield: I think that's my point, is that—\nMichael Casey: No, it is and we can—\nGideon Lichfield: It ends up centralizing somewhere.\nMichael Casey: But there are decentralized exchanges, Gideon. There are, and they function. Some of them, Uniswap for example, has really never had any problems. It works. It's very complicated for the average person to use. So it's still on crypto. Crypto needs to develop better UX, be easier systems, et cetera, et cetera. The point I'm just simply making is that it's possible to build these things, and if there were the right framework within which to do so, I think innovation would go in that direction.Gideon Lichfield: Can you give maybe just one example of a piece of regulation that you think would help make crypto safer?\nMichael Casey: There are laws around the separation of trading operations and investment. A variety of things that are just the norm for now for exchanges in the TradFi world should be applied in crypto, and that would just be one very effective way to, I think, protect investors and consumers from malfeasance.\nGideon Lichfield: Has the past yet changed your own thinking about the future of the crypto industry in any way?\nMichael Casey: It's made it apparent that we have to figure this out as a political process. There has to be public debate about, there has to be engagement with politicians. We've got to figure out a regulatory transition somewhere that enables this in the right way. So I think there's a—\nGideon Lichfield: What do you think makes that difficult?\nMichael Casey: Oh, it's lack of education. I think it is characters like Sam Bankman-Fried, who have just shed such a negative light on this industry. So what I find extremely frustrating is that the debate is about, “look how many bad people there are over here; we need to just shut this industry down” as opposed to thinking hard and intelligently about the technology itself and how we might actually create a safer system so that those bad people don't take charge of it. I don't know. It's frustrating.\nGideon Lichfield: To me who's always been something of a crypto skeptic, I think the past year has just reinforced my sense that—\nMichael Casey: I'm sure it has.\nGideon Lichfield: It's going to be—it's gonna be confined to a fairly niche group of users, because as you say, there are problems with making it usable and accessible and then difficulties in explaining to people how to regulate it or how to have a sensible conversation about regulation. And it still seems to be beset by volatility and by risk, and by risk of insight and seeding and all of these things.\nMichael Casey: Bitcoin's been a stable asset around for the last month by the way, but you're right. In general, you're right. Yes.\nGideon Lichfield: You're obviously a still big believer—still a big believer. So what is it that can convince me that I should think differently?\nMichael Casey: I'm a believer in the underlying technology. I'm a believer in the underlying technology. I believe that we—I literally believe we have no choice but to create some sort of decentralized system.\nGideon Lichfield: Why?\nMichael Casey: Well, because, Google. The monopolization of our lives. It's the idea that our data is controlled by these algorithms, and we're moving into an AI world in which those centralized entities, profit-motively driven to literally manipulate us with that data, are now going to get even more powerful. So that is what's at stake here. We can just talk about Sam Bankman-Fried and like whether or not we need a fancy way to play some sort of insurance scam. It's really about how is the digital economy going to function going forward. We need this thing to be fixed, I'm telling you.Gideon Lichfield: Alright, let's talk about the future since this is called Have a Nice Future. What do you think crypto looks like in—I don't know, 10 to 15 years from now?\nMichael Casey: I think it's going to be normalized through the financial system. I'm not sure that that's great, by the way. I think you're going to have a lot of traditional finance actors. If you know, we now—we have BlackRock, Fidelity, Franklin Templeton, VanEck, all these sort of big institutions, very, very far down the path of developing their own digital asset strategies. They are looking to have ETFs and the like regulated, and I think they're going to be the big players in this space.\nGideon Lichfield: And that's bad why?\nMichael Casey: It's bad if it normalizes the idea that the only way to actually participate in this is through a old 1933 Securities Act, which means that if you are wanting to own or trade bitcoin and you are not an accredited investor or you're not a big institution, then the only way to own it is through some ETF that is controlled by so and so. You can't—that idea of monetary freedom that it represents is not possible if this has to be heavily, heavily regulated. I—\nGideon Lichfield: But you're not against regulation. It sounds like you're against—\nMichael Casey: No, no, but I'm—\nGideon Lichfield: The old institutions—\nMichael Casey: I have a problem with—\nGideon Lichfield: Getting their fingers in it.\nMichael Casey: Yes. And what I'm trying to say is like by the institutions coming along and validating it, they're all regulated, right? They're essentially endorsing the system. The general public is just not going to think about they're all gonna buy their ETFs and so forth. It's not going to be the same sort of decentralized system. But look, I don't think that's the end of the world because I've never been a believer that the most valuable thing was everybody owning bitcoin. That's going to sound like heresy to a lot of Bitcoin Maxis but I don't think that's it, right? I actually do think that creating decentralized mechanisms for things like data for—again, I go back to the internet. I think those are the most important things. And so what I'm actually most encouraged by, what I would like to think is going to be the most interesting thing happening in the next 10 years, is that self-sovereign identity solutions are going to become the norm.\nGideon Lichfield: So CoinDesk parent company DCG also obviously suffered some fallout from the FTX collapse, and in July, it was announced that CoinDesk is being sold to outside investors. Does that change anything for CoinDesk?\nMichael Casey: Oh, inevitably. A change of ownership does, the new phase. I think DCG has had a very, very tough last year and a half, and it's difficult when your parent company is going through that. We have a whole host of things that we want to do. We still believe there's huge growth opportunities. The deal as it's structured would have a wider variety of investors as part of a consortium and that's I think a constructive structure for a news organization that is striving to be independent.Gideon Lichfield: Other than the future of CoinDesk, what keeps you up at night?\nMichael Casey: I think we could very well go rapidly into a dystopian world in which humanity is reduced to a bit player in a system run by machines and that the worst of human instincts will now be adopted by machines, which will basically carry out the work. That's the dystopian path, right? If we get it right and really focus on taking power away from the centralized entities that control these massive data-driven models, and figure out how there's a collective ownership in that, then of course AI could just be a wonderful driver of a bright future, a better future, that your podcast is looking for everyone to have.\nGideon Lichfield: And so the flip side of that is what keeps you optimistic?\nMichael Casey: I'm going to sound a little hokey, but I actually think that at their core, human beings want to do well by each other. And we need systems that enhance that, that encourage that, that actually are built to protect against the worst instincts that we have and encourage the best ones.\nGideon Lichfield: And it sounds like you think that crypto could be one of those systems even though it hasn't been—\nMichael Casey: Crypto could be part of it. Again, I'm not going to be this—I'm not the naive “it fixes everything.” This is not a “there's a blockchain for that solution” kind of guy. I believe in government and regulation and all those things but I think that we need to think hard about where there's a good intersection between existing systems and certain centralized solutions, government and these decentralized alternatives that brings us to that happier place.\n[Music]\nGideon Lichfield: Well, Michael, thank you very much for making the case for believing in crypto in these systems despite all of the events of the last year and few years. So thank you for joining us on Have a Nice Future.\nMichael Casey: Thank you for having me, Gideon.\nLauren Goode: So do you own any crypto?\nGideon Lichfield: I still own no crypto. I do own an NFT of some piece of art that I was given, but no, I've never bought or sold a piece of cryptocurrency. What about you?\nLauren Goode: Wait, hold on. You own a piece of an NFT or a piece of art that's an NFT?\nGideon Lichfield: A piece of art that's an NFT or rather an NFT—\nLauren Goode: What is that?\nGideon Lichfield: Of a piece of art? You know what, I haven't even looked at it in a while. I don't remember. It was a freebie. It was a freebie at some event about NFTs. You know how these things go.\nLauren Goode: Wow. Have you checked the value of it lately?\nGideon Lichfield: I'm not even sure it has value.Lauren Goode: OK. I wrote a story last year for WIRED about a Steph Curry NFT that I had been, I guess, gifted. It was on loan to me, and I think at the time that I acquired it, which is February of 2022, and by the time I wrote about it, which was the spring or maybe summer of 2022, [laughter] it had declined in value from like $1,000 to $6.\nGideon Lichfield: Wow. OK. I mean, I feel like we're just exposing our Luddite tendencies here by talking about how we don't own any crypto. And it used to be this thing that journalists shouldn't own cryptocurrency because it was like having a conflict of interest. I think definitely we should be past that by now. Certainly if you're going to write about cryptocurrency, I think it makes sense to at least own a token amount of it so you understand how it works.\nLauren Goode: Well, that's good that I own some then.\nGideon Lichfield: Yes, indeed. It is. You have more authority than I do.\nLauren Goode: I'm looking at my Robinhood app right now, and according to this, on the day of taping, I am $15.27 in a hole on my sliver of a bitcoin. So I'm doing really well here. I mean, I bought—\nGideon Lichfield: When did you buy the sliver of a bitcoin?\nLauren Goode: Let's see if I can tap on it and see my history. Well, I'm checking my positions right now. It's actually up 43 percent over the past year according to this. Why am I down? I don't know. I don't understand it. I quite really don't understand it.\nGideon Lichfield: Just wait long enough and you'll be up again. That is the nature of these things.\nLauren Goode: I can tell you that even if we emerge from this trough, this crypto winter and this surges, I'm still not going to be able to retire.\nGideon Lichfield: So you're saying you're not giving up the day job?\nLauren Goode: No, not giving up the day job. And I would say that I'm still a crypto skeptic like you, and I'm wondering, did your conversation with Michael Casey make you any less skeptical?\nGideon Lichfield: I don't think it did. I mean, I think the argument that I was having back and forth with Michael at some level was about whether the potential for cryptocurrency to be a well-regulated, well-run, largely fraud-free industry depended on the technology itself, on the ability of the technology to provide decentralized systems, or whether it is really entirely dependent on the human beings and human beings tendency to find graft opportunities wherever they can. And so Michael was saying to me, look, the traditional financial industry is full of fraud as well and the crypto industry has a chance to be better because it has this decentralized technology.\nLauren Goode: I guess I'm still wondering whether or not you're convinced.Gideon Lichfield: I want to not be quite as skeptical as I am, and maybe I should just buy some crypto and get into it so that I can ease my skepticism that way. But for me, the thing that is fundamental here is when you look at the crypto industry, the promise of crypto was supposed to be the decentralization that no one person or entity was going to have power over these systems. And as I was saying to Michael, what you've seen emerge again and again is that even when you have decentralized currencies on a blockchain, you still need some centralized entity somewhere along the line for it to work. You need an exchange where cryptocurrency is turned into conventional currency, you need a marketplace where NFTs are bought and sold, you need some system for, let's say, blockchains have been used for land registries, for example, but somebody needs to authenticate that you actually own that land before you can put it on a blockchain. So no matter where you are in the system, there is an opportunity for humans to insert themselves, for power to be centralized and for fraud to happen, and I'm just not convinced that that can ever be overcome. But Michael was arguing if we only regulate things well enough, and if the crypto industry itself somehow gets its act together, despite having been so fraud-ridden up to now, then maybe things can get better.\nLauren Goode: He seemed to be implying that the SEC's efforts to regulate crypto are inspired by vengeance rather than motivated by a real desire to protect investors. Do you agree with that?\nGideon Lichfield: Not really. I mean, he was saying that lots and lots of lawmakers took money from Sam Bankman-Fried, which is true. He was spreading his largesse left and right and that therefore the SEC's enforcement against the industry was kind of payback for that, but I don't think that's true at all. I think the effort to regulate cryptocurrencies as securities dates back long before most people had heard of Sam Bankman-Fried, and it is this debate that's been running for a while about whether these assets that can be much more than just a currency, like in the case of Ethereum, it's essentially the basis for an entire programming language, whether those should be regulated like securities that people trade in other ways or whether they should be dealt with as some kind of a new thing. And I agree, I suppose, with Michael that we need to not try to apply 100-year-old securities laws to these entirely new instruments. We ought to come up with something better. But on the other hand, I think that trying to protect investors from these very, very volatile markets is a sensible instinct. And much as people like Michael Casey would like cryptocurrencies to be treated as more than just a speculative investment, the fact is that they are being treated as a speculative investment and that is what the SEC is trying to protect people from.Lauren Goode: So Michael also talked about the \"monopolization of our lives.\" He said we're moving into an AI world in which decentralized entities, and he was talking about companies like Google and Meta are driven to manipulate us with that data, our data, and are going to get even more powerful. That really resonated with me. But how do you think he meant crypto is supposed to solve that?\nGideon Lichfield: I can't say that I understand this argument very well, but it's one I've encountered in the past, which is if we own our data, if we have access to or control data about us, or data about our customers, for example, or our followers on social media, if we have that data and we control it and it's on a blockchain rather than being held by a centralized company like Google or Facebook, if we have that control, then we have power over that data, then we can decide what happens to it, we can find ways to make money off of it, we can decide who to transfer it to, but it's never going to be in the hands of a company that can take it away from us. How exactly that's supposed to work is the stuff that I don't understand very well, but that's the kind of the principle that a lot of crypto and blockchain enthusiasts talk about.\nLauren Goode: So what's actually a better solution here? Introducing a decentralized but potentially befuddling new form of internet or regulating the monopolies as they currently exist?\nGideon Lichfield: So I think that is the key question. Michael and I actually got into a discussion on this that was too long to include in the podcast. But a few weeks ago, you interviewed Cory Doctorow here on the show and Cory's belief, like Michael's, is that we need to strip away the power of these gigantic tech companies that control all our data. But they come at it from very, very different ways of how to do it. And so Michael is saying if we use blockchains and cryptocurrency, we can give people ownership of their data in such a way that it is decentralized, no single entity controls it, and then that gives people the power. Cory takes a rather different view and he says what we need is interoperability. We need to force the big tech companies to let us move our data back and forth between them to if we decide we want to take our contact or our social media graph or all our photos and videos and whatever off of Meta and put them onto some other company's platform, we should be able to do that. And if regulation forces the tech companies to let us do that, that will put power back in the hands of the people.\nLauren Goode: How to build a better internet—that's what it is, that's sort of what we're getting at. In fact, we should probably just rebrand the show that.Gideon Lichfield: Yeah, how to build a better internet. But if you're asking me which of those approaches I believe in more, I suppose I probably lean more towards interoperability. I feel like it's going to be easier to introduce regulation that forces companies to let their users move their data around than it is to build an entire new system for data management and ownership based on blockchains and make that system easy to use and understandable to everybody 'cause right now it's really confusing, but of course Michael would disagree with me on that.\nLauren Goode: So what do you think that means for the future of the blockchain then? I mean, does it mean that 10 years from now we're still talking about it as something that like the folks over at Andreessen Horowitz are using and [laughter] maybe a few outliers around the world and we're still just battling for a better internet based on the infrastructure we currently have?\nGideon Lichfield: I actually think that despite my skepticism, I'm relatively bullish for the future of the blockchain and crypto 'cause I think so many people are invested in it at this point. So many people are working on different variations of this technology. That there is still going to be an industry in five or 10 years time. I've no idea what it's going to be doing. Perhaps I will be proved wrong on a lot of the things I've said about how susceptible it is to fraud and corruption or how difficult it is to use. Maybe those problems will be solved and Michael is right. Most revealing and possibly most realistic is that crypto does have a future, but it's one in which it's basically been co-opted by the existing big tech platforms and by the existing big banks and they all issue their own ETFs for crypto, and we end up in a similar—\nLauren Goode: The Vanguards of the world and Fidelity's of the world. It's not very sexy.\nGideon Lichfield: It's not very sexy, but it's like the Occam's razor prediction that things will change less than you expect. And so we will end up with crypto, but it will still be run by big banks.\nLauren Goode: And at that point, I will be retired on my crypto earnings.\nGideon Lichfield: I very much hope so for your sake.\nLauren Goode: My sliver of bitcoin. That's a very optimistic view of the future.\nGideon Lichfield: In that case, let's end on that note.\nLauren Goode: Alright, that's our show for today. Thanks so much for listening.\nGideon Lichfield: Have a Nice Future is hosted by me, Gideon Lichfield.\nLauren Goode: And me, Lauren Goode. And if you like the show, we would love to hear from you. You can leave us a rating and a review wherever you get your podcasts. And don't forget to subscribe so you can get new episodes each week.\nGideon Lichfield: You can also email us your comments at nicefuture@wired.com. Tell us what you're worried about, what excites you, any questions you have about the future, and we'll try our best to answer them with our guests.\nLauren Goode: Gideon in particular is looking for crypto stock tips, so if you have those, please send them to him.\nGideon Lichfield: Yes, to nicefuture@wired.com. Thank you.\nLauren Goode: You know where it's at. Have a Nice Future is a production of Condé Nast Entertainment. Danielle Hewitt from Prologue Projects produces the show with help from Madeline Kaplan and our assistant producer is Arlene Arevalo.\nGideon Lichfield: We'll be back here next Wednesday and until then, have a nice future.\nLauren Goode: Have a nice future.\n[Music]","creation_date":"2023-10-11","tags":["","HAVE A NICE FUTURE","PODCASTS","CRYPTOCURRENCY","BLOCKCHAIN","BITCOIN","FINANCE","SAM BANKMAN-FRIED"],"author":"BY GIDEON LICHFIELD","category":null}