{"id":"0eba3982-c327-4dc0-abff-d4adbcc82f83","article_link":"https://cointelegraph.com/news/starknet-brings-autonomous-giza-ai-agents-to-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"The Web3 and AI firm Giza plans to bring autonomous bots onto Starknet by the end of June.","title":"Starknet to bring on AI agents that can carry out on-chain activity","detailed_content":"Ethereum layer-2 blockchain Starknet will soon allow artificial intelligence (AI) agents on its blockchain that can autonomously perform on-chain activities for users, such as optimizing yield and re-allocating portfolios.\nGiza — a firm aiming to bring AI to blockchains — raised $3 million in a pre-seed round led by CoinFund in July 2023 and is spearheading the effort. Co-founder Renç Korzay told Cointelegraph that AI agents would be deployed on Starknet by the end of June, with other chains to follow.\nKorzay said the agents could take over four activities, the first being yield aggregating — finding “where the highest return is and depositing to different yield avenues.”\nLater releases will see the AI agents also be a “robo-advisor and figure out the best portfolio allocation for a user given their risk appetite,” said Korzay.\nIn the beta phase, the Giza team will be auditing and approving agent strategies to ensure security. In the future, Agents will become completely permissionless through the Giza Protocol, which will provide both cryptographic and cryptoeconomic security to ensure a trust-minimized exchange between developers and users.\nThey can also autonomously provide liquidity on decentralized exchanges or make leveraged price bets and “predict price movements,” adjusting crypto holdings “based on the strategy set by the user,” he added.\nThe yield-optimizing AI agents will be the first to deploy, with the other types to follow, according to a May 9 press release shared with Cointelegraph.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIt’s billed as “low-cost and low-computation,” and it can max out returns by buying or selling assets so they stay at the same weighting in a portfolio on lending platforms that it can directly use and sign off on transactions.\n“As all accounts on Starknet are smart contracts — via the network’s native account abstraction features — this allows for proofs to be verified directly within the contract,” Giza explained.\nThree-month Starknet active users chart. March saw activity spike as it conducted a token airdrop. Source: Starkscan\nThe AI models are built with the Starknet programming language Cairo and “verify complex computations” using Zero-Knowledge Scalable Transparent Argument of Knowledge and zero-knowledge proofs (ZK-proofs) created by Starknet development firm StarkWare.\nZK-proofs allow for information to be shared and authenticated while maintaining user privacy.\nRelated: Philosopher Yuval Noah Harari warns of AI’s risks in finance\nGiza co-founder Cem Dagdelen said in a statement the company expects agents will “become the new application layer for Web3, abstracting away smart contract risks and complexities from users.”\nHowever, the agents aren’t limited to just crypto and blockchain. According to Giza, they can also help “highly regulated sectors” cut oversight costs by using models to check “the validity of their outputs.”\nAva Labs founder Emin Gün Sirer said at a recent blockchain conference he thinks AI-backed smart contract coding is five to 10 years away and, when it arrives, could “onboard billions of new [blockchain] users.”\nMeanwhile, Ethereum co-founder Vitalik Buterin has cautioned developers that it’s “worth treading carefully” when adding AI to blockchains, saying AI can help humans understand what is happening on-chain, but it shouldn’t be tasked with enforcing smart contract rules.\nMagazine: How to control the AIs and incentivize the humans with crypto\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#AI","#DeFi","#zk-STARK"],"author":"by Jesse Coghlan","category":null}