{"id":"0f9b1bcf-24b1-4190-bcc3-ae0f4fe811b0","article_link":"https://cointelegraph.com/news/hashing-it-out-rwas-future-crypto","website_source":"Cointelegraph","article_type":"News Article","summary":"In episode 54 of Hashing It Out, Micah Yeackley, the co-founder of Kula DAO, discusses how tokenizing traditional illiquid assets opens up investment opportunities to a broader audience.","title":"Hashing It Out: Are RWAs the future of crypto?","detailed_content":"In this episode of Cointelegraph’s Hashing It Out podcast, host Elisha Owusu Akyaw interviews Micah Yeackley, co-founder of Kula DAO — a project tokenizing a diverse collection of real-world assets (RWA) on the blockchain — about the prospects of the sector in the Web3 space and what it means for developing markets.\nThe episode also touches on other significant topics, such as regulation and what RWAs on the blockchain mean for retail and institutional investors.\nYeackley explains that tokenizing real-world assets can span across multiple asset types beyond what most people expect. He highlights that even though Kula started out by focusing on natural resources, the project quickly realized that anything with real-world value could be tokenized, including water resources, agricultural projects and real estate developments.\nBased on the wide variety of RWAs that can be tokenized, Yeackley suggests that projects are more likely to benefit from having a diverse pool of assets, which is Kula’s approach. He explains:\n“Well, when you talk to any savvy investor, anybody that’s investing money for a long time, they’re experienced at it. They’re always going to say diversification is key.\"\nYeackley breaks down the “DoubleDAO,” a component of the Kula DAO governance structure, which aims to collate the best of Web2 and Web3 governance, ensuring checks and balances during the decentralized autonomous organization’s (DAO) decision-making process. The Double-DAO provides asset-layered protection so that the voices and participation of key stakeholders are protected.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe Double-DAO includes a “RegionalDAO,” where local communities affected by the assets can actively participate in decision-making.\nHe also highlights how the project’s rollout in Zambia has led to changes at a partner mine in areas such as equal pay for women and the construction of social amenities through the voting process.\nMoving to regulation, Yeackley says it’s difficult for projects in the sector to be regulated. Kula has received pre-approval from the Virtual Assets Regulatory Authority in Dubai and is set to become the first regulated RWA DAO to tokenize natural resources and commodities.\nYeackley believes that regulation should be the first step and not the last in a sector with extensive regulation in the traditional financial landscape.\nListen to the latest episode of Hashing It Out on Spotify, Apple Podcasts or TuneIn. You can also explore Cointelegraph’s complete catalog of informative podcasts on the Cointelegraph Podcasts page.\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-11","tags":["#Blockchain","#Assets","#Real Estate","#Digital Asset","#Podcast","#Hashing It Out"],"author":"by Elisha Owusu Akyaw","category":null}