{"id":"0fbd2ce3-afe9-45ab-a4ea-0b7cfff2be13","article_link":"https://medium.com/@obligate/obligate-drives-blockchain-adoption-in-emerging-markets-through-strategic-lisk-deployment-91d24ebbda90","website_source":"Medium","article_type":"Blog Post","summary":null,"title":"Obligate Drives Blockchain Adoption in Emerging Markets Through Strategic Lisk Deployment","detailed_content":"In a major step towards enhancing blockchain accessibility and adoption, Obligate is gearing up for its upcoming deployment on the Lisk network, a prominent Layer 2 solution and member of the Optimism Superchain.As part of the collaboration, Lisk and Obligate aim to address challenges in emerging markets by enhancing access to decentralized financial services.\nObligate will utilize Lisk L2’s network, known for its high efficiency, speed, and scalability secured by Ethereum within the Optimism Superchain. This strategic initiative aims to empower businesses in emerging markets by offering more accessible capital solutions through blockchain technology, circumventing the typical issues and high interest costs often encountered with traditional banking intermediaries.— Dominic Schwenter, CPO of Lisk— Benedikt Schuppli, co-founder and CBDO of ObligateThe deployment of Obligate on Lisk L2 is particularly significant for its potential effects on real-world assets. By facilitating more straightforward and efficient capital access, Lisk L2 and Obligate will assist businesses in leveraging their physical assets for funding, thereby fostering economic growth and stability.This collaboration also capitalizes on Lisk L2’s technological strengths, including enhanced scalability and user experience, which are essential for adopting blockchain solutions in markets with varying degrees of technological infrastructure.Lisk provides a cost-efficient, fast, and scalable Layer 2 (L2) network that is secured by Ethereum. As a long-standing Web3 infrastructure project, Lisk has been democratizing blockchain accessibility for developers and end users globally since 2016. Its core focus is to solve local problems in Emerging Markets by bringing solutions around real-world assets (RWA), off-chain assets (OCA), and DePIN onchain. As a member of the Optimism Superchain Lisk is contributing to onboarding the next 1 billion people to Web3.Obligate AG is a member of VQF, a Swiss FINMA regulated AML SRO, and a financial intermediary. Standing at the forefront of institutional adoption in on-chain capital markets, Obligate is providing a secure, transparent, and regulatory compliant platform for the issuance, trading, and lifecycle management of debt instruments natively issued on the blockchain. The platform’s unique architecture caters to the complex needs of institutional investors whilst lowering the barriers of entry for issuers by providing efficient access to multilateral financing. Featuring their proprietary eNotesTM, ledger-based securities based on the most advanced DLT-legislation, a comprehensive dispute resolution framework, and global enforceability of the debt securities, Obligate demonstrates its commitment to meeting institutional standards.","creation_date":null,"tags":[],"author":"Obligate","category":null}