{"id":"11696351-547d-4267-a805-171632a08b0b","article_link":"https://cointelegraph.com/news/ghana-post-crypto-stamps-king-anniversary","website_source":"Cointelegraph","article_type":"News Article","summary":"Ghana Post launched a crypto stamp collection to showcase its king’s 25-year-long journey of persevering in traditional values and adopting new-age technology.","title":"Ghana’s crypto stamps honor king’s Silver Jubilee","detailed_content":"Ghana’s national postal service is ensuring that its king’s 25th coronation anniversary will be remembered forever, unaltered, on the blockchain.\nGhana Post released a new stamp collection, “Crypto Stamp,” in honor of His Majesty Otumfuo Osei Tutu II. The crypto stamp collection pays homage to the king’s 25-year-long contribution to Ghana’s development and cultural integrity.\nSignaling this blend of traditional values and new-age technology, the physical crypto stamps are linked to unique nonfungible tokens (NFT) that are verifiable over the blockchain.\nRead this Cointelegraph crypto guide to learn more about how NFTs work.\nGhana’s new crypto stamp collection. Source: Ghana Post\nAccording to the listing, crypto stamps are limited to 7,200 pieces and cost 250 Ghanaian cedi ($18) per stamp. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWhen attempting to make a purchase, the website failed to provide any information regarding shipping charges for international destinations.\nUpon purchase, users need to manually link their physical collectible to its digital twin over the blockchain to claim its exclusivity. The physical stamps come with an integrated near-field communication (NFC) chip to help this pairing.\n“Through a simple smartphone scan, collectors can verify the stamp’s authenticity in real-time, with each scan generating a unique, one-time authentication message, safeguarding against tampering and counterfeit attempts.”\nCrypto stamp is the most expensive stamp collection the Ghana Post offers, with others costing less than half its crypto counterpart. However, the store currently offers a one-of-one exclusive gold frame stamp that costs roughly 100,000 cedi ($7,200).\nGhana Post’s stamp collections sorted by price. Source: Ghana Post\nGhana claimed its position as the first African country to introduce a commemorative NFT-based stamp collection.\nRelated: Nigeria launches first multilingual large language model in Africa\nThe South African Reserve Bank recently decided to amp up efforts toward regulating and adopting cryptocurrency and central bank digital currency (CBDC).\nRead Cointelegraph’s guide to learn more about CBDCs.\nThe roadmap looked at high-level plans to increase the accessibility of financial technology, modernize payment infrastructure and remove barriers to use. The plan’s scope is strictly domestic.\nMagazine: What do crypto market makers actually do? Liquidity, or manipulation\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Government","#Africa","#Ghana","#Crypto Collectibles","#NFT"],"author":"by Arijit Sarkar","category":null}