{"id":"1216a985-88d8-4e23-92b6-87c577c49328","article_link":"https://medium.com/qanplatform/qanplatform-launches-its-multi-language-quantum-resistant-testnet-d12269deec34","website_source":"Medium","article_type":"Tweet","summary":"QANplatform has rolled out the world’s first quantum-resistant and Ethereum-compatible blockchain testnet, where developers can code smart…","title":"QANplatform Launches its Multi-Language, Quantum-Resistant Testnet","detailed_content":"QANplatform has rolled out the world’s first quantum-resistant and Ethereum-compatible blockchain testnet, where developers can code smart contracts in any programming language.The introduction of this testnet follows the successful implementation of QANplatform’s quantum-resistant technology by a European Union member state. Building on the success of the QAN Private Blockchain or QAN Enterprise Blockchain launched in September 2023, the new QAN TestNet is a precursor to the QAN MainNet Beta and signifies a leap in the Web3 ecosystem’s evolution. It is the world’s first platform that combines three outstanding features: quantum-resistant security, compatibility with Ethereum’s EVM, and the ability to code smart contracts in any programming language.Enabled by the QAN Virtual Machine (QVM), the platform welcomes smart contract creation in a diverse array of programming languages compatible with the Linux Kernel. This approach aims to democratize access to Web3 technology, potentially drawing in more than 28 million new developers by moving beyond the traditional blockchain platforms that support only a few programming languages. QAN lowers the entry barriers for non-developers with its no-code smart contract studio, allowing users to generate smart contracts interactively within minutes.In alignment with the US National Institute of Standards and Technology (NIST)’s primary recommendations, QANplatform incorporates CRYSTALS-Dilithium algorithm into QAN XLINK. The QAN XLINK cross-signer ensures post-quantum transaction security while maintaining Ethereum EVM compatibility, safeguarding QANplatform and its users against the looming threat of quantum computing.QAN TestNet Docs: https://docs.qanplatform.com\nQANscan Blockchain Explorer: https://testnet.qanscan.com\nQAN Smart Contract Studio: https://build.qanplatform.comhttps://cointelegraph.com/news/qanplatform-quantum-resistant-blockchain-testnet— — — — —About QANplatform:QANplatform is the quantum-resistant hybrid blockchain platform that allows developers and enterprises to build quantum-resistant smart contracts and web3 solutions on top of the QAN blockchain platform in any programming language. Alpine Esports, a Group Renault brand, and inter alia in the Formula 1 Esports Series signed QANplatform as its Official Blockchain Partner. QANplatform was selected for the EY (Ernst & Young) Global Startup Academy 2023 Program, and it is backed by Qatar’s MBK Holding. The first EU country implemented QANplatform’s quantum-resistant technology in 2024.Website: https://www.qanplatform.com\nTwitter (X): https://twitter.com/QANplatform\nTelegram: https://t.me/QANplatform","creation_date":null,"tags":["Qanplatform","Qanx","Blockchain","Blockchain Technology","Cryptocurrency"],"author":"QANplatform","category":null}