{"id":"124a1019-95b4-4607-8f9f-52f74e6b7d81","article_link":"https://cointelegraph.com/news/bitcoin-miner-profits-squeeze-hash-price-drops-lowest-since-october-2023","website_source":"Cointelegraph","article_type":"Tweet","summary":"After enjoying record profits during Bitcoin’s recent halving, miners now face a sharp decline in hash prices.","title":"Bitcoin miner profits get squeezed as hash price drops to lowest since October 2023","detailed_content":"After posting record-breaking earnings on the day of the Bitcoin halving, miners now face another reality: a high network hash rate and lower revenues pushing down profits.\nThe average revenue a Bitcoin\nBTC\n$63,026\nminer earns per performed hash, known as the hash price, has reached its lowest level since October 2023. According to crypto analytics firm CryptoQuant, the hash price for miners dropped from nearly $0.12 in early April to $0.07 post-halving, following a $0.19 peak on halving day.\nBitcoin’s halving event slashed miners’ block reward from 6.25 BTC to 3.125 BTC, while the sector’s operational costs remain steady. CryptoQuant’s CEO, Ki Young Ju, estimated that the cost of mining with Antminer S19 XPs would increase from $40,000 to $80,000 following the halving.\nBitcoin hash price. Source: CryptoQuant\nRelated: Bitcoin halving will have to battle with ‘weak time of year’ — Coinbase\nDespite the reduction in rewards, the total network hash rate has remained stable since the halving event, suggesting that BTC mining is still profitable at Bitcoin’s current prices. Cointelegraph Markets Pro shows Bitcoin holding above the $64,000 mark since April 19.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“Although it is still too early to see any long-term effects of the halving on the network hashrate, miners seem to be running operations at the same rate as before the halving,” CryptoQuant noted in a report. The total network hash rate held flat at 617 EH/s post-halving.\nOn the day of the halving, transaction fees reached record levels relative to the total revenue generated by miners. Transaction fees represented 75% of total miner revenue on the halving day, which amounted to roughly $80 million. Since then, it has dropped to about 35% of total miner revenue.\nWhile the immediate effects show stability, the long-term impacts on the hash rate and overall miner activity could still change. In the past, post-halving periods have seen miners exit the market due to high operational costs. Factors like Bitcoin price movements and changes in electricity costs are likely to play crucial roles in the mining business.\nMagazine: Creating ‘good’ AGI that won’t kill us all — Crypto’s Artificial Superintelligence Alliance\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-25","tags":["#Bitcoin","#Blockchain","#Mining","#Bitcoin Mining","#Halving","#Bitcoin Halving"],"author":"by Ana Paula Pereira","category":null}