{"id":"13dd055f-28fd-4182-9d91-30c26753dbbd","article_link":"https://cointelegraph.com/news/ore-creator-incentives-tackle-solana-congestion","website_source":"Cointelegraph","article_type":"Tweet","summary":"Hardhat Chad clarified that he isn’t looking for funds from the foundation; his goal for Ore is to establish a currency, not develop testnet tools.","title":"Ore creator proposes rewards to tackle Solana congestion","detailed_content":"Hardhat Chad, the pseudonymous creator of the Ore project, has suggested that the Solana Foundation offer a reward if it intends to incentivize testnet activity.\nThis suggestion comes after the Solana network faced congestion issues for nearly a week with a transaction failure rate as high as 75%.\nIn a post on the X social platform, Hardhat Chad said that if Solana blockchain platform wishes to encourage users to participate in testnet activities, such as testing new features or protocols, the Solana Foundation should provide an incentive in the form of SOL\nSOL\n$153\ntokens.\nThis incentive could motivate users to actively engage in testing, which can improve the platform’s performance and identify potential issues before deployment to the mainnet.\nThe community’s response to Hardhat Chad’s suggestion was divided. Some supported it, while others disagreed. One user, TheSoftwareJedi, disagreed, advising Chad to focus on building his project first and demonstrating goodwill to the foundation.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe user proposed that Hardhat Chad could apply for funding via a grant from the foundation but stressed the significance of preserving autonomy from foundation incentives.\nSource: Hardhat Chad\nHowever, Hardhat Chad clarified that he isn’t looking for funds from the foundation. His goal for Ore is to establish a currency, not develop testnet tools. He’s reassessing incentives to combat spam, questioning the need to prioritize building testnet spam bots.\nThis proposal comes after Hardhat Chad announced via social media that the immediate cessation of mining operations was essential for the well-being of the Solana network and Ore’s stakeholders. Hardhat Chad emphasized the need for an overhauled smart contract framework amid recent network difficulties.\nRelated: Withdrawals from real estate betting platform Parcl hit $74M after airdrop\nThis strategic move also aligns with the project’s roadmap for developing Ore’s second version (v2), emphasizing a commitment to long-term sustainability.\nOre, a blockchain-based project launched on Solana, is exploring the proper distribution method by using a proof-of-work (PoW) token distribution mechanism. The project is experimenting with combining PoW’s security with Solana’s fast transaction capabilities.\nSince its introduction, Ore’s activity has contributed significantly to Solana’s network congestion, impacting transaction scheduling and leading to a high rate of failed transactions, especially from the memecoin frenzy on the network.\nHowever, Solana developers have released a mainnet beta update, v1.17.31, to address the ongoing network congestion on the Solana blockchain.\nThis patch contains enhancements that will help with some of the ongoing network congestion, and further improvements will follow in v1.18.\nMagazine: Bitcoin ETFs make Coinbase a ‘honeypot’ for hackers and governments — Trezor CEO\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Cryptocurrencies","#Business","#Tokens","#Solana"],"author":"by Amaka Nwaokocha","category":null}