{"id":"140f0faf-5974-4f9f-92c7-a10afa6b2f73","article_link":"https://cointelegraph.com/news/ethereum-pectra-hard-fork-upgrade-smart-wallets-eip-3074","website_source":"Cointelegraph","article_type":"Tweet","summary":"The update would add an improvement proposal inclusive of new operating instructions for wallets that give them smart contract-like features.","title":"Ethereum’s Pectra upgrade to make normal wallets ‘smart’ and improve UX","detailed_content":"Ethereum’s Pectra upgrade, slated for late 2024 or early 2025, is bringing with it a host of more functionality for crypto wallets and upgrades to their user experience (UX).\nEthereum Improvement Proposal (EIP) 3074 was approved for inclusion in the next update, which allows normal crypto wallets to work like smart contracts.\nOne of EIP-3074’s functions gives standard externally owned accounts (EOAs), normal wallets such as a MetaMask wallet, smart contract capabilities.\nThis allows functions such as transaction bundling, so users only have to sign once, and sponsored transactions where a wallet can delegate funds for use by another, similar to account abstraction that was introduced in ERC-4337.\nAnonymous DefiLlama developer 0xngmi claimed in an April 11 X post that the EIP’s downside is “now it’ll be possible to fully drain an address (all tokens, all NFTs, all DeFi positions...) with only one bad signature.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nGaslite co-founder Harrison Leggio wrote on X that while there are security concerns with the update, “people will always find a way to lose their money.”\n“People literally GIVE THEIR PRIVATE KEYS TO TRADING BOTS,” he added.\nSoftware engineer Laurence Day wrote that the EIP’s “most obviously useful application” was its sponsored transactions, as it allowed users to “store assets in a wallet that doesn’t hold Ether,” and they could sponsor the gas from a contract controlling the wallet.\nOther slated functions of EIP-3074 include a social recovery feature that negates the need for the typical 12-to-24-word seed phrase.\nAnonymous Web3 adviser Cygaar explained on X that the EIP turns wallets into smart contracts by adding two new operating instructions — AUTH and AUTHCALL.\nRelated: History of Crypto: Crypto winter and Ethereum landmarks\nAUTH verifies signatures and actions. AUTHCALL then “calls the target contract(s) with the originator address as the caller” rather than the message sender, Cygaar wrote.\nSource: Cygaar\nThe planned Pectra update comes after Ethereum developers pushed through the Dencun update last month, which lowered layer-2 transaction fees.\nEthereum co-founder Vitalik Buterin also shared in early April the next steps for the “Purge,” which would remove old and excess network history in order to simplify it.\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-12","tags":["#Blockchain","#Wallet","#Ethereum","#Upgrade"],"author":"by Jesse Coghlan","category":null}