{"id":"1531386f-454c-4203-bbed-8393c7fc3314","article_link":"https://cointelegraph.com/news/bitcoin-halving-2024-institutional-impact-price-surge","website_source":"Cointelegraph","article_type":"Tweet","summary":"Since the previous halving, the number of crypto users has surged 400%, not including the impact of the spot Bitcoin ETF launch in the United States.","title":"Bitcoin halving 2024: 5 ways it’s different this time","detailed_content":"Another Bitcoin halving has come and gone, the fourth so far, and this one was like no other before it, with institutional investment playing a key role for the very first time.\nBitcoin halvings have been historically associated with one essential similarity — a subsequent spike in BTC price, which often occurs some time after the halving.\nWhile the community has yet to find out whether the fourth halving will follow the same path, some things are already different about the Bitcoin halving 2024.\nCrypto user base up at least 400% since the 2020 halving\nWhile the speed of new Bitcoin generation has decreased since the first halving, the demand has not stood still.\nSince the previous Bitcoin halving — which occurred in May 2020 — the global crypto user base has added at least around 400 million users, based on various sources.\nIn 2020, the number of crypto owners worldwide counted around 100 million users, according to the Cambridge Centre for Alternative Finance (CCAF) estimations. By the end of 2023, the number of global crypto users surged to as high as 580 million people, as estimated by crypto exchange Crypto.com.\nGlobal cryptocurrency users from January 2023 to December 2023. Source. Crypto.com\nDespite Bitcoin being the world’s largest cryptocurrency by market capitalization and the oldest, it apparently has fewer users than the entire crypto ecosystem.\nAccording to data from Technopedia, approximately 2.7% of the global population is estimated to own Bitcoin as of 2024, which translates to around 219 million people. If accurate, the estimated figure is up around 208% from 71 million Bitcoin users four years ago, as calculated by Crypto.com.\nWith Bitcoin or most other cryptocurrencies, most user count estimations can not be 100% accurate, as on-chain transaction analysis is often incapable of differentiating between long-term holders and lost BTC, as well as other factors.\n2024 pre-halving Bitcoin rally has not been seen before\nOne of the biggest differences between the fourth Bitcoin halving and the three past halvings is that the price has seen extraordinary growth pre-halving in 2024.\nIn the previous cycles, Bitcoin price recorded breakouts after the halving rather than before, and new all-time highs came roughly one year following the halving date.\nFor example, Bitcoin didn’t break out above the previously set ATH of $20,000 before the 2020 halving. In that cycle, the Bitcoin price only crossed ATH 10 months after halving. The picture is much different this time around.\nIn the current cycle, Bitcoin reached all-time highs right before the halving event, setting a record of $73,600 on March 13, 2024.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nSuch a breakout has never been seen before, and multiple analysts agree, including eToro crypto analyst Simon Peters.\nMiners ‘better shaped’ for halving this time\nThe never-seen-before Bitcoin price appreciation pre-halving has potentially had a positive impact on the mining industry as miners obtained more control over mining costs.\n“In comparison to the previous halving, it appears miners are in better shape overall in terms of lower levels of debt and potentially better control over their costs, such as electricity,” Fidelity Digital Assets’ director of research Chris Kuiper told Cointelegraph, adding:\n“What’s also helping miners this cycle is the price appreciation before the halving — something that also hasn’t been seen in previous cycles.”\nSince the third halving in May 2020, Bitcoin mining energy consumption has significantly increased, surging from around 50 Terawatt hours (Twh) to 99 Twh on April 18, 2024.\nBitcoin energy consumption. Source: Digiconomist\nAt the same time, the amount of Bitcoin network’s energy consumption powered by renewable energy sources has also increased, with renewables accounting for 54.5% BTC mining consumption as of January 2024, according to Bitcoin ESG Forecast. As of September 2020, this figure stood at 39%, according to data from CCAF.\nFirst Bitcoin halving with spot BTC ETFs in the U.S.\nOne of the most straightforward things about Bitcoin halving 2024 is that this halving is the first ever with BTC exchange-traded funds (ETF) enabled in the United States.\nAfter many years of efforts, spot Bitcoin ETFs debuted trading in January 2024, opening exposure to Bitcoin for institutional investors.\nRelated: Not just the halving: Why analysts are bullish on Bitcoin in 2024\nAccording to Bloomberg ETF analyst Eric Balchunas, spot Bitcoin ETFs have seen “blockbuster success,” which apparently reflects a spike in demand for Bitcoin.\nSource: Eric Balchunas\nSince the first day of trading, all ten spot Bitcoin ETFs combined have increased their holdings by at least 220,000 BTC, which is worth around $14 billion at the time of writing.\nBlackRock's spot Bitcoin ETF has attracted the biggest amount of inflows among 10 BTC ETFs, with its holdings surging more than 10,000% from just 2,621 BTC on the trading debut to 273,140 BTC on April 18.\nM2 CEO Stefan Kimmel said:\nLooking at the broader landscape, while halving garners attention, we are cognizant that it's just a part of a larger narrative. The confluence of ETFs, quantitative easing, and halving will define the future contours of the market.\nBitcoin became more globally decentralized and secure\nBitcoin has also significantly improved in terms of network security and decentralization. Since 2020 — when most new Bitcoin was mined in Mainland China — Bitcoin has emerged as a more distributed network.\nJust four years ago, Bitcoin mining in China amounted to nearly 80% of Bitcoin’s total mining hash rate globally. As of February 2024, the biggest Bitcoin mining countries are the United States with 40% of the total hashrate, as well as China and Russia, accounting for 15% and 12%, respectively, according to Hashlab Mining founder Jaran Mellerud.\nGeographic distribution of Bitcoin hash rate between September 2019 and January 2022. Source: CBECI\n“This geographic decentralization is continuing as miners migrate to Africa and Latin America to take advantage of cheaper electricity prices,” Mellerud said.\nAdditionally, the Bitcoin blockchain has become more resistant to attacks as its hash rate has surged five times since the previous halving.\n“It now requires five times more computing power and associated electricity supply, electrical infrastructure, and mining hardware to attack the network,” Hashlab Mining founder noted.\nMagazine: Bitcoin Halving will pump games, Shrapnel’s ‘simple’ secret revealed: Web3 Gamer\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-20","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Bitcoin Price","#Bitcoin Halving"],"author":"by Helen Partz","category":null}