{"id":"15d3547d-be94-41c3-82e6-b2f46b5b6b70","article_link":"https://cointelegraph.com/news/blockchain-fraud-group-shifts-1m-to-blast-for-new-schemes","website_source":"Cointelegraph","article_type":"News Article","summary":"This group has a history of launching numerous projects that attract significant TVL but later abscond with the funds.","title":"Blockchain fraud group shifts $1M to Blast for new schemes","detailed_content":"A group with a history of blockchain fraud on platforms like Magnate, Kokomo, and Lendora is launching new schemes on Blast. They have recently moved around $1 million in laundered funds to finance their fraudulent activities.\nAccording to on-chain detective ZachXBT, the funds were initially moved from an Ethereum address linked to previous scams to another address on the Polygon network. Later, the assets were converted into Wrapped ETH (wETH) and moved across multiple blockchain networks via bridging services like Orbiter and Bungee.\nEventually, they were used on the Blast platform to purchase LEAP tokens, increasing liquidity in what appears to be another setup for unsuspecting victims. At the same time, ZachXBT suggests that the same individuals are probably responsible for another ongoing project called ZebraLending on the Base platform, boasting a current total value locked (TVL) of around $311K.\nSource:  Zachxbt\nThis group has a history of launching numerous projects that attract significant TVL but later abscond with the funds. Their tactics often involve fabricating Know Your Customer (KYC) documents and collaborating with less reputable auditing firms to give an appearance of legitimacy.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThis group has targeted a range of platforms, including Base, Solana, Scroll, Optimism, Arbitrum, Ethereum, and Avalanche, showcasing their operational flexibility and extensive presence in the blockchain sphere.\nRelated: Base hits $4B TVL as monthly txs outstrip Ethereum and Arbitrum\nThe repeated occurrence of these ripoffs creates the need for vigilance within the blockchain neighborhood. Investors are encouraged to exercise increased caution, specifically with new initiatives on platforms like Blast involving significant fund transfers.\nVerifying project qualifications, examining audit experiences, and comprehending the channels of fund transactions are vital steps people can take to safeguard their investments. In addition, local community customers are inspired to share data and guide each other in determining suspicious actions to avert further victimization.\nA nonfungible token (NFT) game called Munchables, built on Blast, suffered a $ 62 million exploit on March 26. Munchables announced it had been compromised and said it was tracking the exploiter’s movements and “attempting to stop the transactions.”\nAround $400 million in Ether (ETH) was taken out of the Ethereum layer-2 network Blast after the launch of its mainnet on Feb. 29, unlocking nearly $2.3 billion in staked crypto previously locked up on the network. Blast crossed $2.1 billion in total value locked (TVL) just days ahead of its newly announced mainnet launch — slated for the end of this month.\nMagazine: NFT Collector, DCinvestor: Is this the best NFT collection in the world?\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-14","tags":["#Blockchain","#Cryptocurrencies","#Fraud","#Decentralization","#Ethereum","#Cryptocurrency Exchange"],"author":"by Amaka Nwaokocha","category":null}