{"id":"15edf65e-8795-4a43-b94f-ec99bb3f3a80","article_link":"https://cointelegraph.com/news/ton-5m-digital-id-incentive-program","website_source":"Cointelegraph","article_type":"News Article","summary":"TON Society is offering one million Toncoin tokens to users who verify their identity using palm scanning technology.","title":"TON’s $5M incentive program aims to drive digital ID verification","detailed_content":"The Open Network (TON) ecosystem developers have set aside $5 million of Toncoin tokens to incentivize users to verify their identity using state-of-the-art palm scanning technology. \nTON Society, a community of developers and contributors building out the TON ecosystem, will distribute one million Toncoin to users participating in the voluntary proof-of-personhood program. The project aims to enable digital identity verification for Telegram users over the next five years.\nThe project uses HumanCode’s technology to allow users to verify their human identity on the blockchain. The application, available on Google Play and Apple Store, lets users scan their palms on a smartphone.\nAccording to information shared with Cointelegraph, the technology provides privacy protection and is hardware-agnostic, allowing the scanner to be used on various mobile devices.\nTON Foundation growth director Ekin Tuna said that supporting proof-of-personhood protocols like HumanCode is a step toward a practical reputation system with real-life use cases for TON’s ecosystem:\n“A scalable, private, and decentralized identity will help to onboard the first one billion users to the Web3 ecosystem in Telegram.”\nHumanCode founder Tim Zhang told Cointelegraph that the technology securely scans a human palm by extracting the pattern directly onto a user's smartphone device. \n“This local extraction ensures the pattern is non-reversible, meaning that even if someone were to gain unauthorized access to our server, reconstructing the palm images from the patterns would be impossible,” Zhang explains.\nThe founder added that the system maintains U.S. SOC2 data security and privacy certifications and implements a triple-layer privacy protection mechanism. The first step involves local extraction of the user’s unique palm pattern, preventing personal information from being transferred off the device.\nThe extracted feature is encrypted before being sent to HumanCode servers to secure the data during transmission. The verification process is conducted locally on a user’s device, removing the need to transfer sensitive data to external servers.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHumanCode incentives will be given to TON Society members who complete a palm scan and prove their personhood. A ‘soulbound' token is then minted to represent their verified digital identity before users are rewarded for participating.\nCointelegraph also highlighted the reality of increased skepticism for proof-of-personhood technology in conversation with Zhang, given that Worldcoin has received pushback for its iris-scanning technology.\nThe company’s iris-scanning devices and data collection methods have been subject to investigations and regulatory scrutiny in Hong Kong, Spain and France over the past six months. \nA Worldcoin iris-scanning orb on display at ETHGlobal in London in March 2024. Source: Gareth Jenkinson\nZhang said HumanCode’s use of robust security protocols and encryption is an important trust-bridging factor, while suggesting that users might feel less intimidated about scanning their hands instead of their eyes:\n“From our experience, palm recognition technology is inherently more acceptable. For most people, scanning your palm with a smartphone camera just feels less intrusive than eye-scanning.”\nZhang also said the technology can potentially combat bots and fraudulent accounts on any social media platform by verifying the authenticity of users through unique palm patterns. This allows a platform to effectively distinguish between real users and automated bots.\nIn March, the TON Foundation allocated 30 million Toncoin, worth around $115 million, for various community rewards to drive adoption.\nThe incentives are allocated to four different areas: $38 million worth of TON will go to token mining and user incentives, $22 million for airdrops, $15 million for the League developer ecosystem, and $40 million for liquidity pool boosts.\nThe Telegram Ad Platform, built on the TON blockchain, officially went live in March 2024. The platform allows Telegram channel owners worldwide to receive financial rewards, exclusively selling advertising and sharing revenue with channel owners in TON.\nMagazine: AI didn’t kill the metaverse, it will build it — Alien Worlds, Bittensor vs. Eric Wall: AI Eye\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Identity","#Adoption","#Telegram","#Identification","#TON"],"author":"by Gareth Jenkinson","category":null}