{"id":"16400df5-5274-4336-b491-71c7e7d0d3d7","article_link":"https://cointelegraph.com/news/ai-smart-contracts-ava-labs-blockchain","website_source":"Cointelegraph","article_type":"Tweet","summary":"Imagine if ordinary people could write smart contracts in their native language. It could bring in “billions of new [blockchain] users.”","title":"AI-powered smart contracts could be ‘transformative’ — Ava Labs founder","detailed_content":"“Smart contract programming is hard,” said Emin Gün Sirer, founder of Ava Labs, which built the Avalanche blockchain. Capturing “intent” is difficult. Coding is tricky. Verification remains a challenge. \n“This is the main problem that is keeping smart contracts from flourishing,” added Sirer, speaking at the recent Cornell Blockchain Conference in New York City.\nBut imagine if artificial intelligence (AI) “agents” like ChatGPT or Llama could do all that smart contract coding for you. Lawyers, as opposed to coders, might soon become the dominant writers of smart contracts.\nEven more interesting, everyday people would be able to write smart contracts in their native language — peer-to-peer — almost as easily as they write bank checks today.\nThat is the future, suggested Sirer at the April 26 event held at Cornell Tech’s stunning Roosevelt Island campus in New York City, further explaining:\n“All of you are familiar with writing checks, right? That’s the maximum complexity instrument that my retail bank offers to me. At present, you have few options. You can write a check to ‘John’ that essentially says ‘I hereby transfer to John $5,000’ — and that’s about it.”\nBut suppose that you could do the same thing but add additional instructions, Sirer continued, for example:\n“‘I hereby give John $5,000 if and only if he can collect $5 million by the end of September to film a movie. And if he can’t do it, then I want my money back.’ I can just write this.”\nSirer said the scenario he envisions is still five to 10 years away, but if and when it does come, it will be “transformative.”\nWe would “be able to onboard billions of new [blockchain] users.”\nAt present, most smart contracts are written in Solidity, a computer language that remains obscure even among programmers.\nBut Avalanche has begun building a new virtual machine at the intersection of AI and blockchains, Sirer said, which is “programmed in a natural language. You write your programs in English, German, French, Tagalog, Chinese [...] a natural language that your mother taught you in your mother’s tongue.”\nQuestions remain\nBut is all this just pie in the sky? Many issues need to be resolved before these “coin-operated agents,” as Sirer calls them, can be widely deployed.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nLegalities need to be worked out. Keywords and terms will have to be defined unambiguously. A word like “software,” for instance, might have to be very carefully defined before it can be used in smart contracts involving software licenses. All this could take some time.\nRecent: EU crypto regulations undermined by lack of enforcement, say observers\nThen, too, AI “agents” may not be quite ready to write legally binding documents. Large language models (LLMs) can “hallucinate,” after all.\n“Everybody has seen [AI-generated] pictures of seven-fingered people,” Sirer noted.\nBut there are short-term solutions for some of these problems. One could submit transactions to both ChatGPT 3.5 and Llama, for example, requiring both agents to agree before a smart contract solution is accepted. “So that way, at least, you get two trusted executors, and you are taking the intersection of their actions.”\n“Plain English instructions” for smart contracts\nOthers suggest that smart contracts that can handle “natural” language are already here — or at least close at hand.\n“The capability to allow every individual to be their own programmer exists in the world today,” Sam Friedman, principal solutions architect at Chainlink Labs, told Cointelegraph.\nFriedman cited Council, the AI agent framework developed by ChainML, a project in the Chainlink BUILD program, that “enables developers to provide plain English instructions immediately converted into executable code. Today, that code is mostly Python or SQL. But enabling smart contracts is an upgrade away.”\nHe also mentioned Chainlink Developer Hub’s “Ask AI,” which can return a fully formed smart contract when a user submits a request in plain English, something on the order of: “Show me an example smart contract that enables a user to request a random number between one and ten. It should use Chainlink VRF.”\nToday’s offerings probably don’t have the full functionality that Sirer envisions, however, and Friedman told Cointelegraph that a lot of work lies ahead.\n“While AI agents writing smart contracts are already here, this isn’t their final form,” he said. They will still need to improve in terms of quality and complexity. “AI models need to be trained with ever-newer content for this to happen.”\nStill, Friedman can imagine use cases where multiple AI “agents” with distinct roles collaborate to complete the lifecycle management of a smart contract. For instance:\n“One agent helps define the requirements, another writes the smart contract, another performs quality and security testing, another deploys the contracts, and the last one performs ongoing maintenance or tuning of the parameters or global variables in the contract after it’s deployed.”\nThere are still “big unknowns,” Sirer acknowledged at the Cornell Tech conference, and moving the needle forward will require guidance from all sorts of individuals, “people with both a technology and an ethics and a humanities background.”\nA place for lawyers, too?\nIn a question period following his presentation, Sirer was asked who would write smart contracts if Solidity was no longer required and coding could be done in ASCII text.\nSource: SV\n“Who are going to be the best programmers for this?” At first glance, software programmers would seem to have the edge. They are already skilled in defining and specifying conditions in precise language, after all.\nRecent: Where to store your crypto: Wallets provide diverse options for holders\n“But the people who know how to use regular language for specifying contracts are the lawyers. So they are going to be the kings and queens of that universe […] the ones who really figure out how to flourish in this system.”\nAnd average users? “I think they are quite capable of specifying basic transactions,” Sirer said. Indeed, he foresees these new capabilities being built on “democratic, open platforms” that “anyone can use on an equal footing.”\nOverall, this new approach to smart contracts is so interesting and full of promise “that we can’t just leave it on the table,” Sirer concluded.\nExchange or buy AVAX\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-08","tags":["#Blockchain","#Smart Contracts","#AI","#Avalanche"],"author":"by Andrew Singer","category":null}