{"id":"16d19057-a828-4455-82b7-ad0824921660","article_link":"https://cointelegraph.com/news/epic-sat-mined-bitcoin-halving-block-sells-two-million","website_source":"Cointelegraph","article_type":"News Article","summary":"One satoshi is currently worth $0.00065 — but some sats hold inherent “collectible value” in the Bitcoin ecosystem, cryptocurrency exchange CoinEx Global explained.","title":"'Epic sat' mined from fourth Bitcoin halving block sells for $2.1M","detailed_content":"An “epic sat” — an exceptionally rare satoshi mined from the fourth Bitcoin halving block — has sold for 33.3 Bitcoin (BTC), worth about $2.13 million.\nThe sale of the satoshi — the smallest unit of Bitcoin — took place on cryptocurrency exchange CoinEx Global on April 25 — roughly five days after one of its partners, Bitcoin mining pool viaBTC, mined it in block 840,000 on April 20.\nThe auction, which commenced on April 22, saw 34 bids before an unidentified bidder won ownership rights to the epic sat — with “sat number 1,968,750,000,000,000.”\nThe next closest competitor bid 20 Bitcoin for the rare sat.\n“The auction has concluded successfully, with the FIRST & ONLY epic sat selling for 33.3 $BTC (≈$2,134,000),” CoinEx posted to X on April 25.”\n“This auction isn't just a bidding event; it marked the community recognition, media attention, & widespread embrace of #Bitcoin.”\nAuction of the epic sat mined in the fourth Bitcoin halving block on April 20. Source: CoinEX\nAn epic sat refers to the first satoshi mined in the first new Bitcoin halving block. Given there’s been four halvings, only four of these rare sats exist.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThese sats are allocated a unique sequence number under the Ordinals number system, which is based on mining timestamps.\nSource: Ord.io\nAs there are one hundred million sats in a Bitcoin, an ordinary satoshi is currently priced at $0.00065.\nBut certain sats have a special meaning within the Bitcoin ecosystem, CoinEx explained.\n\"Given that satoshis are assigned unique identifiers, they inherently possess higher collectible value. As periodic events occur within the Bitcoin network, some more frequently than others, scarcity is naturally promoted.”\nBitcoin Ordinals explorers like Ordiscan and OrdinalHub can be used to find out whether a Bitcoin wallet owns a rare sat by verifying the exact UTXO and output number. Users that own a rare sat can then transfer it to an Ordinals-supported wallet.\nRelated: El Salvador’s Bitcoin wallet gets sats, cats and a cypherpunk manifesto\nViaBTC mined the fourth halving block, block 840,000, at 12:09 am UTC on April 20.\nIt received the new block subsidy of 3.125 Bitcoin, in addition to an eye-popping 37.6 Bitcoin in reward fees, worth $2.4 million at the time.\nThe next Bitcoin halving event is expected to occur sometime in 2028 at block 1,050,000, which will see mining rewards halved to 1.5625 Bitcoin.\nBig Questions: How can Bitcoin payments stage a comeback?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-26","tags":["#Bitcoin","#Blockchain","#Mining","#Business","#Adoption","#Bitcoin Mining","#Cryptocurrency Exchange","#Mining Pools","#Bitcoin Ordinals"],"author":"by Brayden Lindrea","category":null}