{"id":"16eaeee6-80fd-439b-926d-701697c08477","article_link":"https://cointelegraph.com/news/rwanda-bnr-retail-cbdc-feasibility-study","website_source":"Cointelegraph","article_type":"News Article","summary":"The African country is eyeing a tokenized retail CBDC with offline transfer capabilities as it heads toward a cashless economy.","title":"Rwandan central bank proceeds with ambitious retail CBDC project","detailed_content":"The National Bank of Rwanda (BNR) has opened up its recently completed feasibility study on a retail central bank digital currency (CBDC) to public comment. The BNR is considering a national digital currency that incorporates the latest innovations in the technology and is highly tailored to local conditions.\nA retail CBDC would advance Rwanda’s cashless economy national initiative and increase the resilience of the financial system, which is still subject to frequent power outages, the BNR found. The central bank expects to spend $35 million on printing and maintaining its cash supply in the next five years despite its cashless goal.\nThe BNR is proposing an interest-free, intermediated CBDC with interoperability with all the country’s existing payment systems and potentially other CBDCs after the appropriate amendments to the country’s Central Bank Act are made. It recommended a token-based, rather than account-based, model with open programmability and smart contracts.\nTokenization would allow digital cash to be transferred offline using Bluetooth or near-field communication (NFC) technology and would not require a smartphone. This is in contrast to current electronic payment options.\nProgrammability would be a mixed blessing, the study noted:\n“The advantages of open programmability, which facilitates value-added innovative products and services, are expected to outweigh the arguments of privacy and security.”\nThe BNR foresaw no more than “partial pseudo-anonymity” for the CBDC.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: BIS issues comprehensive paper on offline CBDC payments\nPayment service providers currently make up less than 0.9% of the Rwandan financial sector. The sector is challenged by low financial literacy, high remittance costs and a large informal economy, among other things. The BNR noted that reducing the amount of cash in circulation could formalize more of the economy.\nThe study recommended the imposition of user fees and holding limits without sorting out details. Public acceptance of a CBDC was also left an open question.\nSource: Central Bank of Rwanda\nThe BNR favored a distributed database model over a distributed ledger for increased reliability. Its analysis used the World Economic Forum’s CBDC Policy-Maker Toolkit.\nTokenized wholesale CBDC projects have been undertaken by Mastercard and Ripple, as well as the European Central Bank and the Bank for International Settlements’ new Project Agora. Tokenization in a retail CBDC may be an innovation. Offline CBDC transfers is also a subject of current research. China’s digital yuan features solutions similar to those proposed by the BNR.\nMagazine: Powers On… Biden accepts blockchain technology, recognizes its benefits and pushes for adoption\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Africa","#Money Transfers","#Tokens","#CBDC","#Regulation"],"author":"by Derek Andersen","category":null}