{"id":"178bab34-0bb9-4b9e-b7b1-13bf82e98ac4","article_link":"https://medium.com/@gorillamoverz/gorilla-moverz-the-most-epic-gorilla-community-on-movement-9600b831dd38","website_source":"Medium","article_type":"Blog Post","summary":"For those who have been following the Movement Labs project, you may have come across this lovely face several times. But what is it all…","title":"Gorilla Moverz: The most epic gorilla community on Movement","detailed_content":"For those who have been following the Movement Labs project, you may have come across this lovely face several times. But what is it all about? And why is there so much talk about bananas and booty shaking?Gorilla Moverz is a community that has emerged during the early stages of Movement Labs. They are an iconic part of Movement Labs and together with Moveus Jr, they dominate the Discord and X scene of Movement Labs. It’s hard to explore the Movement Labs ecosystem without encountering a Gorilla Moverz. Everywhere you look, there are gorillas asking for potASSium or shaking their booties. Through memes and clever wordplay, they have quickly gained popularity. They have even started to create their own langauge. Do you know how Gorillas greet each other ?The Gorilla Moverz Discord role was introduced for the fun-loving primates in the Movement Discord. Soon, this meme group evolved into a social infrastructure project. There are even rumors of possible NFTs coming soon... In the meantime, the Gorilla Moverz Discord Server is actively working on ways to enhance the interaction between the community and mods to a new level. Whether it’s Scribble tournaments, surveys, or meme templates, they are constantly brainstorming new ideas.The latest brainchild of Gorilla Moverz is the organization of a talent show for the community. Yes, you heard it right, a crypto Discord group is hosting a talent show, and the interest is immense. The days of simply retweeting, liking, and mindlessly spamming are over. Gorilla Moverz is actively seeking new ways to build a strong community. We value quality over quantity and want to end the ASSLICKING behavior of typicall Mod-Member Relationship in typical crypto Groups. Stay tuned for more exciting updates from Gorilla Moverz as they continue to shake things up and make their mark in the crypto world.","creation_date":null,"tags":["Gorilla","Movement","Nft","Blockchain","Life"],"author":"Gorillamoverz","category":null}