{"id":"184d1e60-67dc-4b1e-9fdc-dec7d2803e89","article_link":"https://cointelegraph.com/news/starknet-details-bug-reorganization-blockss","website_source":"Cointelegraph","article_type":"News Article","summary":"Blockchain data from Starkscan indicates that Starknet’s system stopped producing blocks for four hours on April 5.","title":"Starknet explains reasons for 4-hour block outage","detailed_content":"Ethereum layer-2 protocol Starknet suffered a block reorganization that led to a backlog of transactions. The protocol’s block monitoring tool, Starkscan, showed an outage of four hours in block production. \nStarkscan shows a gap between the creation of blocks 630028 and 630029 on April 4, while Starknet’s status page did not reflect any outages on the network on the same day.\nStarkscan’s block monitor reflects a four-hour gap between locks 630028 and 630029. Source: Starkscan\nStarknet subsequently released a statement on X, explaining that a rounding error bug led to a reorganization of blocks. The company said block production continued as usual, but the reorganization caused a transaction backlog that prevented it from reaching full capacity.\nSource: Starknet\n“Consequently, there were a few minutes during which new transactions could not be accepted for processing and were therefore rejected. Moreover, some transactions were reverted due to changing parameters (e.g., timestamps),” the post explains.\nCointelegraph contacted Starknet to confirm the details of the incident but has not received additional information and if block production was halted as per block data.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nStarknet’s status page last reflects a major outage on March 13 when its network experienced slow block creation due to Ethereum’s Dencun upgrade. \nStarknet’s status page shows the last major incident on March 13 during Ethereum’s Dencun upgrade. Source: Starknet Status\nStarknet’s outage is the latest in a series of hiccups for some of the ecosystem’s largest blockchain networks. \nSolana suffered a significant outage in early February 2024. Downtime in block production on its mainnet halted the network’s block progression for over five hours.\nIt was not the first time Solana had gone down. Since January 2022, Solana has seen around half a dozen significant outages and 15 partial or major outage days.\nSolana-focused software development firm Anza released a postmortem report of the recent outage on Feb. 9.\nThe report revealed that Solana’s Just-in-Time (JIT) compilation cache, which compiles all programs before executing a transaction, encountered a bug.\nRelated: Starknet anticipates significant impact from Ethereum’s Dencun hard fork\nAustin Federa, head of strategy at the Solana Foundation, told Cointelegraph that a process was underway to replace the old loader system with a new motor system, but it was scheduled to be disabled with an updated version.\n“It looks like someone intentionally called that old instruction set, which hadn’t been used in quite a long time but was still around in the codebase. The JIT compiler ran into issues where it couldn’t find what it was looking for. And that’s what created the infinite loop,” Federa told Cointelegraph.\nSolana encountered problems again in early April, with close to 75% of all transactions on the network failing amid a deluge of activity brought by the recent memecoin mania.\nAnalysts suggest that these failed transactions are mainly due to bot activities on Solana, which look to carry out arbitrage trades.\nMagazine: Ethereum’s ERC-20 design flaws are a crypto scammer’s best friend\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-05","tags":["#Blockchain","#zk-STARK"],"author":"by Gareth Jenkinson","category":null}