{"id":"185332d4-0d2c-4f3b-803b-29bdb1ec42c7","article_link":"https://medium.com/@aarkdigital/1000x-trading-competition-win-from-320-000-prize-pool-31939676b1d9","website_source":"Medium","article_type":"Blog Post","summary":"Mark your calendars for the ‘1000x Trading Competition’, which will begin on April 29th at 00:00 UTC. All Moon Mode users can participate…","title":"1000x Trading Competition: Win from $320,000+ Prize Pool!","detailed_content":"Mark your calendars for the ‘1000x Trading Competition’, which will begin on April 29th at 00:00 UTC. All Moon Mode users can participate with a minimum margin balance of just $10.This competition is an opportunity to showcase your trading skills and win a prize pool of up to $320,000+, which will be based on the total trading volume.So, gear up and get ready to dive into this exciting competition.Competitors will battle across 4 distinct categories, which have their corresponding leaderboards:The variety of competition types ensures a fair environment for all competitors with different preferences. Depending on your strategy, you may focus on increasing your winning rate with a small budget or dominating the volume share regardless of your PnL.The total prize pool grows in correlation with the total volume in cascade. Please refer to the table below for details:Each category is allocated with different shares of the total prize:Exciting rewards to brave degens of MOON MODE. Claim what you deserve.1 Moon Credit is instantly usable as a $1 margin for MOON MODE.The table below shows the amount of Moon Credits you can earn from each market at the specific leverage ratio of your position.Get your strategy ready! The 1000x Trading Competition is about to begin. You need $10 to jump in, but guess what? The rewards are through the roof, with a prize pool of up to $320,000+.Enjoy the limitless capital efficiency Aark offers with its advanced UI/UX, powered by its innovative LP and trading structure.","creation_date":"2024-04-24","tags":[],"author":"Aark Digital | Leverage Everything Perpetual DEX","category":null}