{"id":"18fffd92-704b-455f-9134-8eb16735daef","article_link":"https://cointelegraph.com/news/de-fi-booms-daily-active-wallets-7-m-van-eck-bullish-ethereum-l2s-finance-redefined","website_source":"Cointelegraph","article_type":"News Article","summary":"Market analysts predict layer-2 blockchains are set to capitalize on Ethereum’s primary challenge to process, store and compute data, which might propel it to a $1 trillion market cap by 2030.","title":"DeFi booms as daily active wallets hit 7M, VanEck bullish on Ethereum L2s: Finance Redefined","detailed_content":"Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\nThe surge in DeFi in recent months saw decentralized application (DApp) activity increase by 77% in the fourth quarter of 2023, with a total daily active user wallet count of seven million.\nThe European Commission is evaluating the DeFi industry and could require protocols to obtain a license in the near future.\nAccording to analysts from investment manager VanEck, Ethereum layer-2 scaling networks could hit a $1 trillion market capitalization in the next six years.\nThe top 100 DeFi tokens had a bearish week, with most tokens trading in red on the weekly charts, while the total value locked in DeFi protocols remained below $100 billion.\nAverage daily active unique wallets reach seven million — DappRadar\nThe latest report from DappRadar highlights several bullish indicators in the DApp and Web3 sectors for the first quarter of 2024.\nDApps saw a quarter-over-quarter usage increase of 77%, with a total daily active user wallet count of seven million. This shows an increase of approximately 40% since February 2024, indicating the highest adoption rates since 2022.\nContinue reading\nUpcoming DeFi rules in Europe could ban non-decentralized protocols\nDecentralized finance protocols in Europe could soon fall under new regulations as the European Commission evaluates the space.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAccording to the Markets in Crypto-Assets Regulation (MiCA) — the regulatory framework that will govern digital assets within the region — the European Commission is required to prepare a report by Dec. 30 evaluating the decentralized finance market and the feasibility of specific regulations for the sector.\nContinue reading\nEthereum layer 2s to hit $1 trillion market cap by 2030 — VanEck\nEthereum’s layer-2 scaling networks will hit a $1 trillion market capitalization in the next six years. According to analysts from investment manager VanEck, they will comprise thousands of use case-specific chains.\nLayer-2 blockchains are set to capitalize on Ethereum’s “primary challenge” — its “limited capacity to process, store, and compute data,” VanEck’s senior digital assets investment analyst Patrick Bush and digital assets research head Matthew Sigel said in an April 3 report.\nContinue reading\nAssangeDAO’s crypto activities suspicious, analysts urge caution\nAnalysts at SlowMist raised concerns about a possible “soft rug pull” on March 10 when a 100 Ether\nETH\n$3,030\ntransaction from an AssangeDAO address went to a recipient seemingly associated with the decentralized autonomous organization (DAO).\nThe blockchain forensics firm emphasized that while the true intentions of AssangeDAO are unclear, investors should proceed with caution and conduct comprehensive due diligence before interacting with the organization.\nContinue reading\nDeFi market overview\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most trading in the red on the weekly charts. The total value locked in DeFi protocols remained below $100 billion.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-06","tags":["#Blockchain","#Ethereum","#DApps","#DeFi","#NFT","#Layer2","#Ethereum Price","#Regulation"],"author":"by Prashant Jha","category":null}