{"id":"19acfbd6-1fea-4862-b33d-6f6f1021047b","article_link":"https://cointelegraph.com/news/tokenization-unlock-interoperability-across-payments-investments","website_source":"Cointelegraph","article_type":"News Article","summary":"During the TokenizeThis 2024 event, executives from Ripple and Stellar discussed the latest trends in tokenization, including the blending of payments and investments.","title":"Tokenization to unlock interoperability across payments, investments","detailed_content":"The lines between payment and investment assets are becoming increasingly blurred. In the near future, it may be possible to split a dinner and pay using shares of tokenized funds, a blend made possible by tokenizing assets.\nRob Durscki, senior director of tokenization at the Stellar Development Foundation, shared the prediction during the TokenizeThis 2024 event in Miami on May 9. According to him, the bridge between payments and investments will unlock new utilities across financial products. Durscki noted:\n“What we’re seeing now with partners like Franklin Templeton, WisdomTree, and others issuing this new round of assets on-chain is that they want to unlock yield, [...] but they also want to make it almost seamless to use as a payment tool as well.”\nTokenization is the process of converting rights or ownership of an asset, like real estate or stocks, into a digital token on a blockchain. This enables a digital representation of the asset, allowing for fractional ownership, increasing liquidity and making some financial products more accessible to small investors.\n“Nothing prevents us here from splitting the check on the dinner, and I’ll pay with Franklin Temple funds because I can send you $20 in 3.6 seconds on Stellar. [...] If you forget about that, you’re still getting 5%, 6% a year on that dinner. [...] This positive blur between investment and payment because it’s ultimately value, right? And we’re unlocking the movement of value.”\nTokenizeThis 2024. Source: Sam Bourgi/Cointelegraph\nRipple’s vice president of engineering, Bradley Chase, also participated in the panel and spoke about customization trends emerging from enterprise customers. According to Chase, more and more enterprises are seeking to receive stablecoin payments and hold tokens on-chain as a way of generating additional revenue.\n“Those customers now have their own customers that want to pay in stablecoins and they want to hold those stablecoins. So that’s kind of the simplest on and off-ramp gateway for them into the space.”\nMore than $1 billion worth of U.S. Treasurys has already been tokenized across Ethereum, Stellar, and other blockchains. A recent estimate from Ripple forecasts tokenized markets to reach $16 trillion in the coming years, a figure eight times larger than the total market capitalization of the entire cryptocurrency sector.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Business","#Tokens","#DeFi"],"author":"by Ana Paula Pereira","category":null}