{"id":"1a6fd619-edda-46de-947a-b58e8ec1637f","article_link":"https://medium.com/quantum-economics/10-highlights-from-messaris-epic-crypto-theses-2024-part-1-1998ca5f915c","website_source":"Medium","article_type":"Blog Post","summary":"Published December 19, and clocking in at 193 pages (a 23% increase from 2023’s Theses), Messari’s “Crypto Theses 2024” is (IMHO) the…","title":"10 Highlights From Messari’s Epic ‘Crypto Theses 2024\" — Part 1","detailed_content":"Published December 19, and clocking in at 193 pages (a 23% increase from 2023’s Theses), Messari’s “Crypto Theses 2024” is (IMHO) the industry’s most insightful overview of the crypto ecosystem, and a must-read for every crypto enthusiast. TL;DR “Crypto remains inevitable”.The report is authored by Ryan Selkis, Co-Founder and CEO of web3 data provider and research powerhouse Messari, While Ryan was supported by the accomplished Messari research team, the report is written in the first person by Selkis. I’ve been a Selkis fanboy since Jan. 2020 when he spoke at CryptoMondays NYC and mesmerized us with his discussion of his Crypto Theses 2020 and tales of breaking the Mt. Gox hack in 2014. I also believe that Messari Pro, a “one-stop shop for all your crypto data and research needs”, is an essential tool for any serious crypto investor.The report provides a comprehensive state-of-the-state of crypto coupled with thought provoking predictions about 2024 and beyond. Each chapter is overflowing with insight:Given the length, I broke this post in to two pieces, each covering five chapters. I write this every year to force myself to read the entire Theses, go down rabbit holes, and LEARN. But, as educational as the report is, few will read it’s entirety. So below are my most intriguing highlights in each of the first five entertaining and sagacious chapters of this prodigious report.In the same way that crypto is inevitable, so is AI. And the two, in combination, will prove world changing, providing solutions problems vexxing humanity.In an age of infinite deep fakes, crypto tech will provide “mathematically guaranteed provenance” via “timestamping and verifying devices and data”. Generative DDOS attacks can be muted via “.. ”the fees required by public blockchains”. Crypto tech is the solution for a world where AI is generating trillions (?) of micro-payments a day.Video of a CryptoMondays Palo Alto I hosted in October on the intersection of AI & Web3 is a great primer on te topic:Also, shoutout to Messari for popularizing DePIN (Decentralized Physical Infrastructure) as a moniker last year. Nomenclature is important!Cathie Wood is the epic Founder, in 2014, of ARK Invest ($20B+ AUM), the first institutional fund to invest in Bitcoin (via the Grayscale Bitcoin Trust). While Ark invests in a broad range of innovation sectors, Cathie’s thought leadership and bullish stance on crypto has been unwavering for years. Shortly after I saw the crypto light on 6/29/17, I sought out Cathie as she was the smartest institutional investor on bitcoin, and I wanted to learn. Cathie couldn’t have been nicer and more giving of her time.Now, ARK is poised to be the first Bitcoin ETF approved by the SEC given the January 10 deadline by which “… regulators must either reject or approve her company’s ETF.”Amazingly, ARK open sources their research, which includes an incredible YouTube channel (544,000 subscribers):Cathie also hosts legendary Twitter Spaces:I’m a fan boy, and honored to be one of just 389 people Cathie follows on X.This is a NEW section to enable Ryan “… to share the killer product experiences that I had this year”. I learned a lot in this section. I had never even heard of “Project Guardian”, the tokenization joint venture between JP Morgan and Apollo, among others.I think of the products Ryan highlighted, the most impactful one, to date, is “USDT (Tether) on Tron”, because, as Ryan put it, USDT on Tron is “…. crypto’s first truly globally important app”.Tether has long been the main settlement currency for crypto exchanges outside the U.S.. But today, per Tether CEO, Paolo Ardoino, “… 40% of USDT demand was now coming from store of value and payment use cases, particularly in developing countries”. As the use cases expanded, so has Tether’s dominance of the stablecoin market, which now stands at 70%:I think of Tron as the AOL of crypto in Asia. Just like AOL wasn’t the internet, but it made accessing the internet easier. And while Ethereum is the leading blockchain in terms of total stablecoin marketcap on chain, it’s not surprising that Tron is a dominant second:In fact, Tron has 26X more stablecoin assets onchain than Solana.Tron transactions are largely in Asia for gaming and gambling apps. Asians users prefer Tron over Ethereum because it’s cheaper, faster, and better optimized for use in Asia. That’s why Tron processes more transactions at a fraction of the fees:This was another super dense chapter. I would have chosen USDT if I hadn’t already gone in depth on USDT in #3. I’m a huge fan of FRAX, the algorithmic stablecoin. And like many, privacy is a focus, and I’ve been intirgued with Privacy Pools, an innovative, regualtory compliant, Tornado-like, privacy solution proposed by Ameen Solemani and Vitalik:But I chose CBDCs because, as opposed to Ryan, I think they’re going to be a big thing, sooner rather than later. I’m less concerned than Ryan about the dystopian possibilities of CBDCs because we already have dystopian financial surveillance. It could get worse, but the upside if CBDCs onboard billions of people to digital currencies, outweighs the downside risk.As Ryan an highlights, most CBDC pilots have been “wholesale” CBDCs, involving transactions between financial institutions. Ryan doesn’t think retail CBDC will be relevant “… anywhere before 2030”, even though he highlights numerous CBDC trials underway. Even Ryan thinks China’s e-CNY is one to watch given it’s scale, having processed over $250B of transactions across 120 million wallets created since 2020. CBDC pilots Ryan highlighted coming 2024 CBDC pilots from the Bank for International Settlements, the Bank of Korea and Russia. But the CBDC tracker below, via the Atlantic Council, reveals that CBDCs have been launched in 11 countries with another 21 either running pilots or planning one in 2024. In total, 90% of countries are exploring, developing or implementing CBDCs:Even Ripple got into CBDCs in May via the launch of a CBDC platform by forking it’s XRP Ledger. The Ripple CBDC Platform “offers a comprehensive platform for minting, managing, transacting, and destroying CBDCs and stablecoins”.I’m in crypto because I think our fiscal systems are broken, beyond repair. I’m here because we finally have decentralized financial tools that enable us to “exit the system” if we choose.I joke that I want to think about the regulators as much as the regulators think about me. Now, that said, I appreciate that the more favorable the regulations are, the better. I applaud and support the Herculean efforts made by CoinCenter and other industry lobby groups in D.C.. But Google and Facebook aren’t allowed in China, and they’re still doing great. As Ryan says, crypto is inevitable. And I think the best way to get favorable U.S. crypto regulations is to build great products that people want because it makes their life better. The more successful we are, the more jobs we have the potential to create, the more D.C. will embrace us. I believe time spent building has a far higher ROI for the industry than time spent lobbying.While much of this section is a lesson in civics, I appreciate Ryans wit:As Ryan highlights, the government lied about the failures of SVB and Signature Bank earlier this year. It’s now been well documented the 2023 bank insolvencies were greatly exacerbated by the regulators’ implementation of Operation Chokepoint 2.0. We now know there was a “… multi-step, multi-month, multi-agency effort to de-bank major crypto platforms from Silvergate, SVB, Signature Bank, and First Republic Bank”.Following the collapse of SVB I wrote a post “The One Great Thing To Come Out Of The Tragic Collapse of SVB” where I posited that many wealthy people in Silicon Valley just learned :It makes so much sense. But like most things in life, most humans have to learn things the hard way.It’s not a coincidence that Bitcoin was up 50% the month following the collapse of SVB!Ryan highlighted an insightful talk I saw this year on The Swamp in D.C., Bill Gurley’s epic take on regulatory capture at “The All In Summit”:While Ryan believes “We can’t walk away from all “engagement” in DC when many leaders are ready to legislate punitively on our industry”, I believe “The Way To Get Better U.S. Crypto Regs Is To Leave The U.S.”.— — —Stay tuned for Part 2 to be published imminently.Here are five other insightful outlooks for crypto 2024:4. 2024 Blockchain Predictions — From crypto fund-of-fund Blockchain Coinvestors (where I’m a Partner)5. 10 Crypto Predictions for 2024 — From crypto asset manager BitwiseClick here to subscribe to our crypto newsletter. Follow me on Twitter.If you got at least 0.00000001 bitcoin worth of value from this post please “Clap” below (up to 50 times), so others will see the post. Thanks!!This content is for educational purposes only. It does not constitute trading advice. The author of this article may hold assets mentioned in the piece.","creation_date":"2024-01-01","tags":["Bitcoin","Blockchain","Crypto","Cryptocurrency","Ethereum"],"author":"Lou Kerner","category":null}