{"id":"1b53a281-b314-45b4-a734-e121b0b9d7f0","article_link":"https://cointelegraph.com/news/new-telegram-mini-apps-convenient-users-crypto","website_source":"Cointelegraph","article_type":"News Article","summary":"TON Foundation’s Justin Hyun tells Cointelegraph about the benefits of Tether’s launch on the TON chain.","title":"New Telegram mini-apps will be so convenient users won’t know it’s crypto","detailed_content":"Telegram’s 900 million users will be able to make peer-to-peer interactions seamlessly as the messaging app incorporates mini-apps and the Tether\nUSDT\n$1.00\nstablecoins. Many users will interface with crypto for the first time and not even notice it. \nDevelopers will also benefit as they launch ecommerce, paywalled content, games and other business activities on top of The Open Network’s (TON’s) layer-1 blockchain more smoothly thanks to the stablecoin, TON Foundation director of investments Justin Hyun told Cointelegraph’s Ezra Reguerra at the Token2049 conference in Dubai. TON is also continuing the rollout of its wallet.\nThe launch of Tether on TON “really unlocks the creator economy that is already happening in TON and Telegram” as users “no longer need to jump through the barriers of having to acquire a different type of crypto or token,” Hyun said. He added:\n“The most interesting use cases are the ones that engage in social viral mechanics. So there are games that are being created on a daily basis that are powered through Telegram mini-apps.”\nThose products will be available without downloading outside apps. The advantages of that are clear. Hyun gave the Catizen game as an example. When the developers came to TON from a different blockchain, they gained 2 million users in two months, compared to 600,000 in a year and a half previously.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: Telegram commits to TON blockchain, plans to support tokenized emojis and stickers NFTs\nOther social media are highly regionalized. “We have seen the rise of super apps which were not able to break through the barriers,” Hyun said, pointing to WeChat in China, Line in Japan and KakaoTalk in South Korea. TON’s global reach and native USDT remove the need for local payment gateways. Tether also makes it possible for Telegram to circumvent the payment restrictions imposed by Google and Apple.\nSource: TON\nTON is thus returning to the original vision that was scuttled by the inability of The Open Network to hold an initial coin offering in 2020 due to United States Securities and Exchange Commission’s opposition, Hyun said. The TON Foundation was created in 2021 by open-source developers who took over the project.\nMagazine: Shanghai Man: Hack of little-known Poly Network highlights East-West crypto divide\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-20","tags":["#Blockchain","#Business","#Telegram","#TON","#Tether"],"author":"by Derek Andersen","category":null}