{"id":"1bb18e34-0062-4241-aa5b-2d2bdbc98940","article_link":"https://www.wired.com/story/no-one-will-escape-the-ftx-fallout/","website_source":"Wired","article_type":"News Article","summary":"Try as they might, crypto companies pressured by the trading platform’s collapse are failing to bail themselves out.","title":"No One Will Escape the FTX Fallout","detailed_content":"GENESIS GLOBAL TRADING, one of crypto’s oldest and most storied institutions, is in dire straits. In November, in the wake of the implosion of the crypto exchange FTX, the company’s lending unit was forced to freeze customer withdrawals—never a good sign. Almost two months later, Genesis is reportedly on the brink of bankruptcy.\nAlthough Genesis has not said publicly that bankruptcy is imminent (Derar Islim, interim CEO, says he remains “focused on finding a solution”), the firm is reported to have laid off 30 percent of its workforce this week—the latest sign of its financial ill-health.\nFounded in 2013, Genesis has become central to the crypto industry’s day-to-day operations. In 2021 alone, the company issued $131 billion in loans and set up $116.5 billion in trades. To fund these loans, Genesis borrows from individuals and institutions that own large quantities of coins, also known as whales, who receive a cut of profits in return. \nWhile the crypto hype train barreled on unchecked, Genesis was on a hot streak—but its luck ran out in 2022. The lender has been in trouble since July, when hedge fund Three Arrows Capital collapsed, taking with it $1.2 billion of the $2.36 billion it had borrowed from the firm. Genesis again found itself on the wrong side of a collapse in the autumn; when FTX filed for bankruptcy on November 11, the firm lost $175 million stored with the exchange.\nDigital Currency Group (DCG), parent company of Genesis, swooped in with bailouts on both occasions. Despite the assistance, the “unprecedented market turmoil” created by the FTX situation forced Genesis to freeze withdrawals and begin to hunt for emergency funding. But just like FTX, a rescue package for Genesis has not materialized.\nThe frothiness of the crypto market in 2021 spread fear of missing out among investors that attracted huge sums of money. But that FOMO is now long gone, replaced by a suspicion of both the promises and accounting practices of large crypto companies in light of the allegations of fraud at FTX.Venture capital investment in crypto is drying up, according to a recent paper released by market data house PitchBook. After a “breakout year” in 2021, in which $21 billion of capital flooded into the industry, appetite for crypto investment is collapsing rapidly. By Q3 2022, funding was down 34.3 percent year-on-year, and the volume of deals had fallen to a two-year low.\nIn Genesis’ case, investors have been put off by a lack of clarity over the size of the cash injection necessary to plug the hole, says David Bailey, CEO at Bitcoin Magazine, who also leads an activist group that represents the interests of investors in Grayscale Bitcoin Trust, a DCG subsidiary. He describes the shortfall as “massive and unknown in scope.”\nBrad Harrison, who leads the team behind decentralized lending protocol Venus, paints a similar picture. A Genesis bankruptcy would come as no surprise in the aftermath of the “tectonic” events that shook the crypto industry over the past year, he says. But as for the specifics, “we’re all just guessing what happens behind closed doors.”\nBailey also claims potential white knights have been spooked by the murky financial relationship between Genesis and DCG. Specifically, the “inappropriate intercompany loans” that were “only disclosed after everything went sideways.” These loans mean that “DCG has direct exposure to Genesis,” he explains. The parent company is “on the hook,” making it “tough to raise the funds it needs.” (DCG has been approached for comment; Silbert has previously suggested these intercompany loans are nothing out of the ordinary.) Genesis declined to comment.\nAlso “on the hook” is Gemini, the crypto exchange founded by Cameron and Tyler Winklevoss. The company’s yield farming service, which allows customers to earn interest on their crypto, sits on top of the Genesis platform. But when the lender halted withdrawals, $900 million of Gemini customers’ assets were left stranded—and will remain so if Genesis declares bankruptcy.\nOn January 2, having grown frustrated with the lack of progress, Cameron Winklevoss delivered an ultimatum to Barry Silbert, founder of DCG. In an open letter published on Twitter, Winklevoss accused Silbert of “engaging in bad-faith stall tactics” and implored him to “commit to working together to solve this problem by January 8.” Silbert fired back, asserting that Winklevoss had misrepresented the situation, but did not acknowledge the ultimatum. Neither Gemini nor Winklevoss returned a request for clarification over what might happen if this deadline is missed.\nBack in November, Max Galka, founder of blockchain analytics company Elementus, told WIRED that Genesis is “an order of magnitude less intertwined than FTX” with other large industry players. The implication was that the ripple effects of a bankruptcy would be less severe, and fewer regular people would be caught up. But he also warned that the FTX fallout would not end with Genesis.\nHis prediction was confirmed yesterday when the NYSE-listed Silvergate Bank revealed in early quarterly filings that it was forced to offload $8.1 billion in assets to cover a surge in withdrawals triggered by the FTX debacle. The bank, which stores funds for many crypto companies—including FTX and its subsidiaries—said it had suffered losses of $718 million as a result of the forced sale. It will also have to “substantively reduce its workforce” in order to mitigate its new “economic realities.”\nUS regulators have made unsympathetic noises since the implosion of FTX. In an unprecedented joint statement on January 3, the US Federal Reserve, Federal Deposit Insurance Corporation, and the Office of the Comptroller of the Currency told banks they serve cryptocurrency customers at their own peril.\nThe trio pointed to risks from “fraud and scams” to the potential for crypto firms to misrepresent their financial health. They also claimed that tokens stored on decentralized networks are “highly likely to be inconsistent with safe and sound banking practices.”\nGenesis has tangled itself in its own financial gymnastics, while Silvergate has been caught in the crypto crossfire—and tarnished by association. The plight of both suggests that few in the crypto industry will escape the FTX saga unscathed. “Whenever there’s a hole like this,” Bailey says, “someone has got to eat shit.”","creation_date":"2023-01-06","tags":["","BITCOIN","FINANCE","CRYPTOCURRENCY","BLOCKCHAIN"],"author":"BY JOEL KHALILI","category":null}