{"id":"1c037698-c6cc-4513-9657-1c4d62945fee","article_link":"https://cointelegraph.com/news/this-is-how-metaverse-can-become-a-5-trillion-business-by-2030","website_source":"Cointelegraph","article_type":"News Article","summary":"Backed by Web3 heavyweights, layer-1 blockchain aims to become the “metaverse computer” by unifying a scattered landscape.","title":"This is how metaverse can become a $5 trillion business by 2030","detailed_content":"Since coming to prominence in 2021, metaverse has become a key component of introducing Web3 and crypto to the masses. While the concept of experiencing the same connected virtual world predates the Web3 era, the blockchain made it possible for the participants to become governors and stakeholders of the same virtual universe they live in.\nFueled by mainstream tech giants’ attempts to make metaverse popular in a Web2 fashion and technological advancements—such as high-speed internet and smartphones becoming tiny supercomputers—metaverse is expected to become a $5 trillion business by 2030.\nThe consumer and enterprise use cases for the metaverse. Source: McKinsey & Company\nDespite its massive potential, metaverse lacks a unified landscape to offer users a friendly experience. Over 160 companies are building their own metaverses across different blockchains and layers, and the lack of interoperability between networks creates a highly fragmented landscape for the metaverse.\nCreators and developers are shackled by fragmentation\nAs it stands, the metaverse is divided into myriad separate, incompatible worlds — each functioning as its own closed ecosystem. This segmentation stifles the flow of innovation from the developers’ side while confining users and creators within the boundaries of individual platforms. Key assets like nonfungible tokens (NFTs) and Web3 game elements are locked within these siloed environments.\nThe consequences of this fragmentation extend beyond creative limitations, imposing substantial financial burdens on those who wish to build and offer experiences within the metaverse. Developing these digital landscapes and interactions requires a hefty investment, yet the primary financial benefits disproportionately favor platform holders rather than creators.\nAs the metaverse continues to evolve, the necessity for a framework that supports seamless interconnectivity and empowers creators becomes increasingly evident, suggesting a pivotal area for innovation and collaboration in the digital frontier.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n‘Metaverse computer’ for unified ecosystems\nSomnia is a layer 1 (L1) blockchain and a suite of omnichain protocols designed to create a scalable virtual society that can potentially attract millions of users into a unified metaverse. By unifying the fragmented metaverse, NFT and gaming landscape, Somnia seeks to give value and creative control back to the users and creators.\nUnlike decentralized finance-focused blockchains, which are slow and expensive, Somnia is built from scratch to provide a unified metaverse experience. This results in an Ethereum Virtual Machine (EVM) compatible L1 network that supports hundreds of thousands of transactions per second at minimal costs.\nDeveloped by the Virtual Society Foundation (VSF), a nonprofit organization initiated by Improbable and received initial funding from MSquared to operate as the “metaverse computer,” Somnia utilizes Improbable and Msquared’s experience to host the next wave of users in the metaverse.\nA full breakdown of the Somnia ecosystem. Source: Somnia\nCreators can utilize Somnia’s toolkit to move assets, commerce and avatars across different experiences. The omnichain protocol enables creators to participate in a decentralized economic structure where accrued value benefits the actual innovators, incentivizing the development of new use cases while opening the door for community-driven governance.\nSomnia helps users recompose or remix content and build on previous creations to make metaverse accessible to a broader audience. The project’s approach makes hefty projects like organizing a new metaverse event more affordable by enabling the reuse of components from previous events, such as stages, light shows or firework displays. The original creators of the used components can earn royalties through microtransactions, rewarding all stakeholders in true Web3 fashion.\nUpgrading NFTs for metaverse\nSince NFTs were born in a two-dimensional environment, many ultra-popular collections were not in the metaverse conversation besides standing as static profile pictures. Somnia addresses this by “upgrading” 2D NFTs to metaverse-friendly 3D objects. It allows NFT collectors to explore the metaverse as their favorite NFT character, potentially opening up the way for Pudgy Penguins and Cool Cats running around in a unified virtual space. Developers can also design metaverse themes based on ultra-popular NFT collections.\nSomnia hosts a metaverse browser to offer an interconnected experience for users.\nSomnia launched its betanet on Ethereum’s Sepolia testnet while developing an EVM L1 for millions of users. During the betanet phase, users can bring their digital identities into the Somnia Protocol by creating personalized avatars through a collaboration with Avaturn. These avatars will be compatible with worlds or experiences built on Somnia, empowering users to attend massive MSquared events like the Twice listening party and MLB Virtual Ballpark.\nVirtual worlds, real economy\nSomnia envisions the metaverse as a sprawling, borderless virtual society where opportunities for creators are limitless, and collaboration is no harder than having a conversation. According to the Somnia team, metaverses should be compatible and interoperable for better collaboration and a user-friendly experience without losing individual platforms’ independence.\nSource: Twitter\nSomnia aims to set the groundwork for more democratic, open and interconnected virtual worlds where users and creators have an influence on governance and future development. The main goal is to empower the creator economy by building a virtual society where creators can thrive by fostering trade, commerce and innovation.\nLearn more about Somnia\n#Blockchain\n#Decentralization\n#Metaverse\n#Web3\n#NFT\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-26","tags":["#Blockchain","#Decentralization","#Metaverse","#Web3","#NFT"],"author":"by Mike Kara","category":null}