{"id":"1c1bea19-2854-45d4-adea-e3cd666fefb0","article_link":"https://cointelegraph.com/news/sony-bank-tests-yen-backed-stablecoin-gaming-sports-ip-payments","website_source":"Cointelegraph","article_type":"News Article","summary":"Sony Bank says it is experimenting with the possibility of issuing its own yen-backed stablecoin as a form of payment for businesses that use intellectual property owned by the Sony Group.","title":"Japan’s Sony Bank tests yen-backed stablecoin for gaming and sports IP payments","detailed_content":"Japan’s Sony Bank — the financial business unit of the Sony Group Corporation — said it has begun experimenting with issuing its own stablecoin pegged to fiat currencies, such as the Japanese yen. \nAccording to a report from local media outlet Nikkei on April 4, the trial is set to occur on the Polygon blockchain and in collaboration with the Belgium-based blockchain company SettleMint.\nThe reports were confirmed by Jun Watanabe, the president and representative director of Sony Network Communications, in a post on X.\nSource: Sota Watanabe\nSony Bank said it will assess any legal issues that may be tied to transferring yen-backed stablecoins. It anticipates these experiments will stretch out over the next few months. \nThe banking firm said by utilizing stablecoins, it could potentially take advantage of lower fees for individuals when sending money and making payments.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIt also said it would consider it as a form of payment for businesses that use intellectual property (IP) owned by the Sony Group, including games and sports.\nThe Sony Group has recently been experimenting with incorporating other Web3 technologies in its operations, as its video game division filed a patent in March 2023 to adopt nonfungible tokens (NFTs) in an initiative it called “NFT framework for transferring and using Digital Assets between game platforms.”\nThis move was in an effort to provide its gamers with more opportunities associated with their in-game assets.\nRelated: Sony developed an AI system to create fantasy NPC personas from dialogue\nIn September 2023, Sony Network Communications entered into a venture with Singapore-based Web3 infrastructure developer Startale Labs to build Sony’s own blockchain network. \nAt the time, Watanabe said the company aspires to create a global infrastructure that “underpins the Web3 era” and drives innovation across existing industries. The blockchain is anticipated to launch sometime in 2024.\nIn a post on X on April 5, Watanabe said that the fastest way to onboard “billions” into Web3 is to work with existing assets.\nSource: Sota Watanabe \nJapan, Sony’s home country, has also been leaning into the Web3 community in the last year. In February, the Ministry of Economy, Trade and Industry said that it is aiming to increase strategic domestic investments into Web3 startups by allowing limited partnership firms to acquire and hold crypto assets. \nMagazine: Google sues crypto app scammers, Crypto.com in Korea: Asia Express\nExplore more articles like this\nSubscribe to the Cointelegraph Research Newsletter\nSelect the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays\nSubscribe","creation_date":"2024-04-05","tags":["#Blockchain","#Japan","#Business","#Adoption","#Sony","#Stablecoin","#Web3"],"author":"by Savannah Fortis","category":null}