{"id":"1c353e83-2bd0-446f-9ca8-f04d30d7a52c","article_link":"https://cointelegraph.com/news/omni-token-dumps-after-airdrop-as-scammers-rug-fake-token","website_source":"Cointelegraph","article_type":"Tweet","summary":"Omni Network’s token price has halved just 18 hours after its test net users and some NFT holders were airdropped the token.","title":"Omni Network token falls 55% after airdrop, fake token completely rugs","detailed_content":"The Omni Network’s ERC-20 token OMNI dropped over 55% nearly 18 hours after its airdrop, shaving off over half its market capitalization.\nMeanwhile, a fake token sporting the same name has just been “rug pulled,” with its price dumping 100%.\nThe layer-1 testnet blockchain aiming to connect Ethereum rollups doled 3 million OMNI — 3% of its 100 million token supply — to its community contributors on April 17, starting at 11 am UTC. OMNI, market cap was $560 million.\nWithin half an hour, OMNI dropped nearly 30% from $53.80 to under $39 and has continued to slide to around $24 — an over 55% drop.\nThe current market cap is $267.5 million, giving it a fully diluted valuation of about $2.57 billion, according to CoinGecko.\nOMNI’s price since its airdrop over 16 hours ago has continued to slide. Source: CoinGecko\nThe airdrop saw early testnet users, builders and community participants get 50% — 1.5 million OMNI — of the latest airdrop, worth about $36.2 million. Eligibility was determined via a snapshot on April 3.\nThe remaining tokens were split variously between EigenLayer restakers and some nonfungible token (NFT) projects including Pudgy Penguins, among others.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nOMNI’s airdrop split, some tokens went to Pudgy Penguin NFT holders. Source: Omni Network\nOmni Network outlined on April 15 that 9.27 million OMNI — 9.27% of the total supply — was being set aside as public launch tokens used for “launch pools and liquidity.”\nOMNI’s full token distribution plan. Source: Omni Network\nThe largest chunk of OMNI — 29.5 million at 29.5% of its supply — will be set aside for “ecosystem development” and handed out initially at the discretion of the blockchain’s backing firm, the Omni Foundation.\nNearly a quarter of all OMNI — 23.3 million — was earmarked for investors and advisers.\nAdvisers today received 625,000 OMNI worth $15 million — another 875,000 OMNI will come after a year, then 437,500 OMNI every six months for two years.\nInvestors’ tokens were on a three-year unlock schedule, with nearly 6.7 million tokens — worth almost $161 million today — to come after 12 months, with the rest unlocking every six months until their allocation is exhausted.\nRelated: Withdrawals from real estate betting platform Parcl hit $74M after airdrop\nMeanwhile, the developers of a fake OMNI token using the same ticker have pulled a $398,000 exit scam.\nBlockchain security firm PeckShield wrote in an April 18 X post that a fake token dropped 100% after the deploying smart contract dumped over 1.7 quadrillion tokens for 132 Wrapped Ether (WETH).\nSource: PeckShieldAlert\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Tokens","#Airdrop","#DeFi"],"author":"by Jesse Coghlan","category":null}