{"id":"1df654a6-f876-4239-8225-bca9a888dcf5","article_link":"https://cointelegraph.com/news/binance-labs-focus-bitcoin-defi-marginfi-200-m-outflows-finance-redefined","website_source":"Cointelegraph","article_type":"News Article","summary":"Solana-based DeFi protocol MarginFi saw hundreds of millions in outflows after its CEO rage-quit amid growing controversies and accusations of failed promises.","title":"Binance Labs shifts focus to Bitcoin DeFi, MarginFi sees $200M of outflows: Finance Redefined","detailed_content":"Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\nLike Ethereum’s peak era in 2017, Solana is facing a similar hurdle in network congestion that has lasted almost a week, leading to a high transaction failure rate.\nSolana developers have now set April 15 as their target date to resolve the issue, calling it a bug rather than a design flaw.\nBinance Labs has shifted its DeFi focus toward Bitcoin by investing in Bitcoin-native restaking protocol BounceBit.\nIn other news, withdrawals from the Solana-based DeFi protocol MarginFi grew over $190 million amid an apparent management meltdown and claims from competitors that it hasn’t met its promises.\nSolana devs target April 15 for failed TX fix — It’s “not a design flaw”\nSolana developers are targeting April 15 to implement a fix for an “implementation bug” that recently caused the transaction failure rate on Solana to skyrocket.\n“Solana’s current issue is not a design flaw; it’s an implementation bug,” stressed Mert Mumtaz, the CEO of Helius Labs, a blockchain infrastructure firm that provides back-end support exclusively to the Solana network.\nContinue reading\nArkham accuses competitors of spreading “false rumors” amid token sell-off\nBlockchain analytics firm Arkham has accused its fellow competitors of “spreading false rumors” to create fear, uncertainty and doubt (FUD) after questions arose regarding the firm’s transfer of its native ARKM tokens.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAlthough Arkham did not name the dissenting competitors, just a few days prior, a post published by fellow blockchain analytics firm Nansen claimed that Arkham “moved over 25.2m ARKM ($56 million) over the past two days” to unlabeled wallets and cryptocurrency exchange Binance.\n“Let’s take a look at what’s going on because they won’t show you,” wrote Nansen, noting that the ARKM was sent to different Binance addresses with no prior activity and to a fresh wallet address.\nContinue reading\nBinance Labs shifts investment focus to Bitcoin DeFi\nBinance Labs, the venture capital arm of the world’s largest cryptocurrency exchange, has invested in Bitcoin-native restaking protocol BounceBit.\nBounceBit merges centralized finance and DeFi features to create more utility for Bitcoin\nBTC\n$62,997\n, wrote co-founder of Binance and head of Binance Labs,\nContinue reading\nMarginFi outflows $190 million as CEO rage-quits amid token controversy\nNearly $200 million of user funds have exited Solana-based lending protocol MarginFi over the last two days amid an abrupt resignation of the platform’s CEO, which was followed by accusations of wrongdoing by its competitors.\nOn April 10, the now-former CEO of MarginFi, Edgar Pavlovsky, suddenly announced he had resigned from MarginFi, citing disputes arising from both within his firm and outside of it.\nContinue reading\nDeFi market overview\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most trading in the green on the weekly charts. The total value locked in DeFi protocols rose above $100 billion.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-13","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Adoption","#Binance","#DeFi","#Solana"],"author":"by Prashant Jha","category":null}