{"id":"1e2412d9-076a-4fd7-820c-06adb5c2c0c1","article_link":"https://cointelegraph.com/news/bancolombia-group-wenia-crypto-exchange-copw-stablecoin","website_source":"Cointelegraph","article_type":"News Article","summary":"The Colombian bank behind the crypto exchange claimed the platform was created after nearly a decade of study and research.","title":"Leading Colombian bank launches crypto exchange and peso stablecoin","detailed_content":"Colombia’s largest bank, Bancolombia, has entered the crypto business by launching a crypto exchange called Wenia. The crypto platform aims to on-board 60,000 users in its first year and compete with Binance and Bitso.\nAlong with a crypto exchange, the Colombian bank also launched a stablecoin called “COPW,” which is pegged to the Colombian peso.\nThe stablecoin will act as an onboarding solution for exchange users. Apart from the COPW stablecoin, Weina will allow the trading of Bitcoin\nBTC\n$63,046\n, Ether\nETH\n$3,033\n, USD Coin\nUSDC\n$1.00\nand Polygon’s\nMATIC\n$0.6990\n. To access Weina, traders must be Colombian nationals residing in the country.\nThe banking giant aims to consolidate the high usage of cryptocurrency in Colombia by catering to both amateur and experienced crypto traders through its platform.\nColombia ranks third among Latin American countries in crypto adoption, according to the 2023 Global Crypto Adoption Index from Chainalysis.\nSource: Chainalysis\nIn an interview with Forbes, Juan Carlos Mora, president of Bancolombia, said it has been working for almost a decade to create the crypto platform that “facilitates the adoption and use of digital assets and blockchain technology.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: Arrested Binance exec pleads not guilty to charges in Nigeria\nThe official announcement from Bancolombia also cautioned traders about the risks of trading digital assets. The bank said the listed crypto assets are not securities or backed by any government.\n“They are not protected by deposit insurance and have associated risks such as volatility and price loss of the digital asset. It should be noted that no entity of the Bancolombia Group will be exposed to digital assets,” Bancolombia states.\nA lawyer on a LinkedIn post said that Weina is an independent entity registered outside the country in “Las Bermudas” and is subject to the legislation of that country, meaning any dispute or claim will be directly with Wenia (not Bancolombia) before the courts of Bermuda.\nMagazine: Meme coins: Betrayal of crypto’s ideals… or its true purpose?\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Cryptocurrencies","#Banks","#Adoption","#Colombia","#Regulation"],"author":"by Prashant Jha","category":null}