{"id":"1e2a3f19-5609-42d1-983b-789f2e5d219a","article_link":"https://cointelegraph.com/news/solana-projects-delay-launch-network-congestion","website_source":"Cointelegraph","article_type":"News Article","summary":"New projects, especially those planning token launches, have been put on hold until the technical difficulties around Solana’s network congestion and transaction errors are resolved.","title":"Solana project launches delayed due to extended network congestion","detailed_content":"Intermittent congestion on the Solana blockchain has forced several crypto projects to postpone their launches. Solana developers say they are working on a fix by April 15. \nUsers of the Solana blockchain reported increasing issues around network congestion and transaction errors over several weeks. New projects, especially those planning token launches, decided to hold off until the technical difficulties were resolved.\nSource: Suit up, DuckCoin and Surge Finance\nSome Solana projects that waited for a congestion resolution included a nonfungible token (NFT) project, Suit Up, altcoin project DuckCoin and Solana staking rewards platform Surge Finance.\nOn April 6, Anza, a Solana-focused software development shop, laid out its plan to address the network congestion on its Solana validator client implementation, Agave.\nInitial investigations pointed to issues around QUIC implementation, a general-purpose transport layer network protocol, as the root cause. The developers said:\n“Anza engineers, with other core contributors, have been working around the clock to diagnose and remedy bottlenecks and increase network performance. Expect more improvements and changes to roll out over the coming months.”\nAt the time of writing, users have reported experiencing delayed sends for Solana’s SOL\nSOL\n$154\ntokens on the crypto exchange Coinbase.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAccording to the incident report, Solana has been investigating the issue for over eight hours. However, the issues do not impact the trading and fiat withdrawal and deposit functionality.\nSolana incident report for Coinbase. Source: status.coinbase.com\nSolana co-founder Raj Gokal previously said that “the failed transactions on Solana blockchain have nothing to do with scalability.”\nRelated: Solana struggles: Record 75% of user txs are failing... or are they?\nAmid growing criticism around transaction failures, Fantom network creator Andre Cronje has expressed support for the Solana network.\nSource: Santiago Roel Santos\nAccording to Cronje, the ongoing congestion on Solana stems from the ecosystem’s rapid growth, which has increased demand for block space. Cronje stated that performance issues are technical challenges, not consensus mechanism flaws.\nCronje referred to the Solana network as a victim of success. The uptick in transaction failures was followed by a recent uproar from Solana users on social media, who complained of failed transactions and a degraded user experience.\nMagazine: 1 in 6 new Base memecoins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Developers","#Solana"],"author":"by Arijit Sarkar","category":null}