{"id":"1e2c9137-a6cd-4906-8771-4e8d7ce8336b","article_link":"https://medium.com/@zulu_network/earn-zulu-genesis-points-zgp-now-phase-1-lwazi-c69323fd3ea1","website_source":"Medium","article_type":"Blog Post","summary":null,"title":"Earn Zulu Genesis Points (ZGP) Now! Phase 1: Lwazi ⏫⭐","detailed_content":"The Zulu Testnet Point Event is called Zulu Lwazi. Join now and earn Zulu Genesis Points (ZGP) for completing different activities and quests!Link to the Zulu Testnet Point Platform: https://testnet.zulunetwork.io/lwaziLink to the Zulu Testnet Bridge: https://testnet.zulunetwork.io/bridgeLink to the Zulu Testnet block explorer: https://testnet.zuluscan.io/The Zulu Network testnet represents a big step towards realizing our mission of expanding the capabilities of the Bitcoin Network with new and exciting innovations!Join us in our Testnet activities and become part of the Zulu Nation.We welcome you to the Zulu Nation! We are looking for strong warriors that can help us conquer the Bitcoin Ecosystem.Zulu Network aims to create a new second-layer Bitcoin network and is the first to introduce a two-layer architecture:We want to revolutionize the Bitcoin Ecosystem and bring so many exciting innovations to the crypto space, but we can’t do it alone.Join now: https://testnet.zulunetwork.io/lwaziNetwork name: Zulu TestnetRPC URL: https://rpc-testnet.zulunetwork.ioChain ID: 90104Symbol: ZULUJoin now: https://testnet.zulunetwork.io/lwaziGo to https://testnet.zulunetwork.io/lwazi and join the Zulu quests!All our daily activities will refresh at UTC 0:00. Come back every day for more opportunities to earn.You will be able to see your total points, your referral code, and all the people you have referred so far!Just below that, you will be able to see the nice stuff.The list of quests, history of every action you have performed, and a leaderboard that will be explored in this guide.There are many different quests you can complete in the Zulu Lwazi Point System, from blockchain related tasks to social media activities.When you a quest is yet to be completed, it will look like this:However, when you complete a quest it will show at the right end!You can also click on the expand button to get further information about how to successfully complete the quest:Description: Attention Zulu Warriors! Please follow Zulu’s twitter, join our discord and telegram groups and after successfully joining our social media groups, you will earn a one-time welcome reward of 200 points. Let’s begin your journey in Zulu Lwazi started!Points: 200 ZGP once.Description: Via connecting your wallet on this page to sign in (top right corner), you can earn sign-in points daily.You will earn 10 points on the first day of signing in, 20 points on the second day, up to 70 points on the seventh consecutive day, and then 70 points every day thereafter.If the daily sign-in is discontinued (i.e., if you skipped one day), then the daily sign-in reward will start again from 10 points.Points: Up to 70 ZGP/Day.Description: Users can connect to Zulu’s discord and claim ZULU test tokens from our “faucet”. Upon successfully claiming the Zulu test tokens, you can earn an additional 50 points per day.Points: Up to 50 ZGP/Day.Description: Users can transfer assets/tokens between different addresses on the Zulu testnet, via using Zulu’s official cross-chain bridge for supported asset transfers. Users can earn 20 points for completing one transaction, and can earn up to a maximum of 200 points reward per day (via completing 10 transaction/day).Please note: Only the sender will receive points, the receiver does not earn any points.Points: Up to 200 ZGP/Day.Description: By using Zulu’s cross-chain bridge to transfer assets (BTC and BRC20), completing a transfer each day, users can earn 100 points. Users can repeat this task 10 times per day and earn up to 1000 points reward per day.Points: Up to 1000 ZGP/Day.Description: Users who initiate an asset withdrawal with Zulu’s official Bridge can earn an additional 200 points reward. By repeating this task 10 times, users can earn up to a maximum of 2000 points per day.Points: Up to 2000 ZGP/Day per user.Description: Users can earn 100 points for each swap using AdamSwap. By repeating this, users can earn up to a maximum of 300 ZGPs per day.After completing a task all three times, click the “Refresh” button, the completion icon will be displayed in the lower right corner, and the refresh button will disappear.Points: Up to 300 ZGP/Day per user.Description: Users can earn 200 ZGPs by adding or removing liquidity on AdamSwap.When you complete the task, click the “Refresh” button, the completion icon will be displayed in the lower right corner, and the refresh button will disappear.Points: Up to 200 ZGP/Day per user.Description: Just click on “Copy Link” and share the code on your social media to invite your friends to join!Your friends will automatically start the registration on the platform with your code!Alternatively, you can also share your referral code so they can copy and paste it when they register:There is a new Leaderboard where the top 100 users in terms of points are ranked! You can also see your ranking at the top of the page!The top ten users on the leaderboard can share an additional 10,000 points every day.Whenever your points reach 10,000, you can unlock a treasure chest that is filled with a special Zulu Reward Card!There are 10 different Zulu Rewards Cards in total and users will get one chance to get a random card when reaching each 10,000 ZGPs milestone.After opening the Treasure box, you will see the back of your card! Click on flip (or flip all if you have accumulated 3 or more cards) to show which card you got!Lwazi, Thando, Mpilo, Sipho, Nkosi, Khaya, Jabulani, Themba, Dumisani, and Bheki.Also, click on History to display the reward history list.Lastly, you will be able to see a list of recent people that have joined the quests!If you click on the “History” button, you will be able to see all the actions you have performed in a given date. Time, action, ZGP points received, and Tx.The Zulu point system will be expanded to reward those who are the most active, and contributing their time and effort to learn & promote Zulu Network!We are going to have an exclusive tier system.1. Lwazi (meaning knowledge).\n2. Thando (meaning love).\n3. Mpilo (meaning life).\n4. Sipho (meaning gift).\n5. Nkosi (meaning king).\n6. Khaya (meaning home).\n7. Jabulani (meaning happiness).\n8. Themba (meaning hope).\n9. Dumisani (meaning praise).\n10. Bheki (meaning protector).How to climb ranks and what is required TBD.Link to the Zulu Testnet Point Platform: https://testnet.zulunetwork.io/lwaziZulu Network is the first Bitcoin Layer 2 with 2-layer architecture. ZuluPrime is EVM compatible, for scaling and BitFi; ZuluNexus offers UTXO programmability, a unique solution to continuously support Bitcoin native innovation (cheaper, fast, extendable and programmable).Zulu’s other innovations also include its decentralized bridge and its unique hybrid PoS / PoW mining design.Twitter | Telegram | Discord | BlogWebsite | Whitepaper | GitHubZuluScan: https://testnet.zuluscan.io/Lwazi Testnet Marketing Campaign: Lwazi Points System⏫⭐Bridge: https://testnet.zulunetwork.io/bridge/Bridge Guide: Zulu Bridge Testnet Guide ⏫🌉Gitbook: https://docs.zulunetwork.io/","creation_date":"2024-04-04","tags":["Bitcoin","Layer 2","Bitfi","Testnet","Blockchain"],"author":"Zulu Network","category":null}