{"id":"1f0e5aa8-ea10-40c1-b705-fa0d291f2b3a","article_link":"https://cointelegraph.com/news/decentralized-ai-key-unbiased-ai-algorithms-masa","website_source":"Cointelegraph","article_type":"News Article","summary":"Google’s Gemini AI has faced recent outrage after generating historically inaccurate imagery and biased results. Decentralized AI development could be the key to creating more transparent and unbiased results.","title":"Decentralized AI is key to more unbiased AI algorithms — Masa co-founder","detailed_content":"Decentralized artificial intelligence (AI) development is crucial for creating safer and unbiased AI algorithms.\nWhile centralized AI solutions have been receiving the lion’s share of funding, decentralized AI solutions will be key for creating more transparent and unbiased AI solutions, according to Calanthia Mei, the co-founder of Masa Network. Mei told Cointelegraph:\n“Decentralized AI attempts to address the existential flaws in AI, ensuring a more unbiased and safer AI.”\nThe key benefits of blockchain-based decentralized AI include more transparent decision-making, enhanced data privacy, and user-owned models that enable people to contribute their data or computing resources in exchange for token incentives, explained the founder.\nSome of the most popular centralized AI models produced significant inaccuracies and social media outrage in the past. Back in February, Google pulled its AI image generator after it produced historically inaccurate and “woke” images, causing widespread concerns over the application’s decision-making process.\nDecentralized AI will be key in addressing similar biased output, as seen with Gemini AI, by creating a more transparent decision-making process for the algorithms, Mei told Cointelegraph:\n“Centralized AI amplifies pre-existing power imbalances, privacy concerns and biases at an unprecedented pace, as exemplified by the Google Gemini AI incident where the AI depicted U.S. founding fathers as people of color, possibly as an overcorrection to long-standing racial bias problems in AI.”\nRelated: Google to fix diversity-borked Gemini AI, ChatGPT goes insane: AI Eye\n Blockchain-based, decentralized AI protocols offer transparency to verify the data provenance of the AI output, which is crucial for improving the algorithms, as the AI is only as good as the data it is trained on. According to Mei:\n“The quality, diversity and representativeness of the data directly influence the performance and fairness of AI systems. Biased or limited data can lead to skewed and biased results, compromising the reliability of AI-driven decisions.”\nMasa Network is among the largest decentralized AI data and large language model protocols aiming to offer more reliable data to AI applications.\nOver 1.58 million unique wallets have contributed personal data to Masa Network, according to Dune.\nMasa unique wallets. Source: Dune\nMasa Network unveiled the first 13 AI developer partners building on its decentralized infrastructure on April 25. The network has committed $100,000 in MASA tokens for its decentralized AI developer to help builders advance the capabilities of decentralized AI.\nThe network and its MASA token launched on the mainnet on April 11. The first 13 projects on Masa include the decentralized social network CharacterX; Pond, a graph AI model for on-chain trading; and RootData, an AI-powered Web3 data layer.\nAI vs. crypto: Will it make a real difference? Source: Cointelegraph\nRelated: Hong Kong Bitcoin and Ether ETFs officially approved to start trading on April 30\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Google","#Decentralization","#AI"],"author":"by Zoltan Vardai","category":null}