{"id":"1f71ec29-8ad7-4c11-bd4a-dab6411fc5c8","article_link":"https://cointelegraph.com/news/fbi-warning-crypto-money-transmitter-appears-aimed-samouri-wallet","website_source":"Cointelegraph","article_type":"Tweet","summary":"A recent FBI announcement urging Americans not to use unlicensed money-transmitting services misses “a great deal of nuance” about how crypto services operate, says Piper Alderman Partner Michael Bacina.","title":"FBI warning against crypto money transmitters ‘appears’ to be aimed at mixers","detailed_content":"The Federal Bureau of Investigation’s recent warning to Americans from using unregistered cryptocurrency money-transmitting services might be aimed at smart-contract-driven privacy tools, according to a crypto lawyer.\nIn an April 25 public service announcement, the FBI urged Americans only to use registered Cryptocurrency Money Services Businesses that comply with existing Know Your Customer (KYC) and Anti-Money Laundering (AML) laws.\nThe FBI warned Americans against using unlicensed money-transmitting services. Source: FBI\nIn its announcement, the FBI wrote that it had recently conducted law enforcement operations against cryptocurrency services that were not licensed in “accordance with federal law,” adding that anyone using unlicensed services could “encounter financial disruptions” during law enforcement actions, particularly if the money is intermingled with illegally obtained funds.\nMichael Balcina the Digital Asset Partner at Piper Alderman lawyers told Cointelegraph that the FBI’s announcement seemed to be directed at warning users against using crypto mixing services but noted that the “broad” warning missed much of the finer details.\n“While this appears an attempt to warn consumers away from smart-contract driven privacy tools like Samouri or Tornado Cash, it’s a very broad warning which misses a great deal of nuance in how decentralized systems operate.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“The sooner fit-for-purpose regulation and clear guidance for cryptocurrency replaces regulation by enforcement, the better the outcomes for consumers will be,” Bacina added.\nOn April 25, the co-founders of Bitcoin wallet and crypto mixing service Samourai Wallet were arrested on charges of money laundering.\nSamourai Wallet CEO Keonne Rodriguez and CTO William Hill were charged with money laundering and operating an unlicenced money-transmitting business, and currently face a maximum sentence of up to 25 years in prison.\nSeveral other commentators on X also noted the hazy definition of what could potentially be considered an MSB and questioned what it could mean for crypto service providers.\nRelated: Crypto market stumbles amid arrest of Samourai Wallet founders\nDescribing the FBI’s announcement as “eerie,” Bankless co-founder Ryan Sean Adams, drew attention to what kind of services would technically fall under the designation of an MSB in an April 25 post to X. \n“Oh and is your code or wallet a MSB? maybe, maybe not — but we're arresting privacy devs right now & calling them MSBs so…”\nThese developments come amid a broader escalation of legal tensions between crypto firms and regulators in the United States.\nOn April 25, Ethereum development firm Consensys sued the SEC, alleging the regulator had orchestrated a campaign to “seize control over the future of cryptocurrency” with enforcement actions aimed at deeming Ether\nETH\n$3,032\nas a security.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-26","tags":["#Bitcoin","#Blockchain","#FBI","#Cryptocurrencies","#Government","#SEC","#United States","#Regulation"],"author":"by Tom Mitchelhill","category":null}