{"id":"20644819-2fdc-491d-99ec-9d37ff936b31","article_link":"https://medium.com/@deepbluesteeve/the-bar-at-the-edge-of-the-metaverse-9d1cee2b90c7","website_source":"Medium","article_type":"Blog Post","summary":"What We Built, What I Learned, and What’s Next for Fin’s Beach Bar and Back Patio","title":"The Bar at the Edge of the Metaverse","detailed_content":"Over the last 10 weeks, I’ve been moonlighting as a bartender — not in real life, but in a bar in the metaverse called Fin’s.Not long ago while traveling for work, I sat at the hotel lobby bar for a late dinner. I ignored the Monday Night Football game on TV and the conversation next to me about the day’s writers’ conference workshop because I was glued to a Twitter group chat called Fin’s Beach Bar and Back Patio. The person sitting next to me must have noticed how much I was snickering as I scrolled my phone. “You look like you’re having a great time,” they said. “What’s so funny?”Do I even try and explain? I wondered. “Just my friends,” I replied. I left out the part about the imaginary bar by the beach.In sociology, the term “third places” describes the places people spend time between home (“first” place) and work (“second” place). Third places are where people gather primarily for social reasons and to build relationships. For many of the 200+ people across 3 group chats, our shared memes, creations, and inside jokes make Fin’s a third place. We’ve grown into a community with a unique culture and identity and we’re ready to evolve. But before Fin’s opens it’s doors to more people, it’s a good time to reflect and share:For the most part, Twitter group chats are spam: if you can DM someone, you can add them to a group chat without them having to accept the request. The feature itself is also hard to use — there’s no search or reply context for example. Pretty quickly it became clear our chat needed a purpose — a reason to exist.Ultimately, the goal was to help connect people in the doodles’ community with each other. But meaningful connections don’t magically happen when you put people in a group chat together, so I needed something more — a structured approach that would help people come together. I set out to create an experience, based on a smart contract on the blockchain.Because the majority of the group came from the doodles community, I decided to “reward” everyone who stayed in the chat with a series of ERC1155 collectibles related to both the doodles’ universe and the bar. I announced I’d be air-dropping NFTs to people in the chat and began to collect wallet addresses. Interest grew, and before long a second group chat had formed — the line to get in to the bar.Belonging to a Fin’s chat meant acting the part — for folks in the bar, they celebrated like VIPs who skip past the velvet rope at the hottest clubs. Fictitious drink specials were announced nightly. The people in the line complained about the wait, the rain, and the lack of food options. So far, the project was an improvisational exercise and everyone seemed into it.While I was writing a smart contract to effectively govern the rules of our social game, the group was vibing and memeing. One of the earliest group efforts was editing everyone’s profile picture into a template of the doodles shark suit holding a Fin’s sign. We also temporarily adopted the phrase “IYKYK”, adding them to our tweets with a shark emoji. The template was shared between both chats and resulted in a proliferation of shark-themed profile pictures on Twitter:With help from the geniuses at West Coast NFT, I developed a smart contract on the ethereum blockchain that effectively set up the rules for the game. The contract made it possible for me to send a maximum of 150 tokens each round for ten rounds. These tokens were designed to be “burned” as a full set in order to redeem one final, ultimate token.This feels like a good time to emphasize how much it really helps to have a creative friend and partner. NFTSantana helped scheme out the possible evolutions of this project at every step of the way. He is the reason this was not all a complete flop by week 2.Because Fin’s had two group chats of 75 people, we decided to gamify the distribution of the 150 tokens in a way that rewarded trust, cooperation, and helped people make new connections. Each week, I changed the mechanics of the airdrop:Because the distribution was unpredictable but the goal of obtaining one of each had been made clear, people found trading partners, made deals, and maneuvered their collections to accumulate full sets of these collectibles. (There was even a google spreadsheet created by the community to track token trades!) I didn’t use rarity or scarcity to drive speculative value, which made it entirely possible to accumulate a full set by simply trading and participating and without spending any money (although there was a small amount of sales volume on secondary).After the first ten tokens had been issued, I designed a burn-to-redeem function that allowed people to submit a full set—exactly one of each token — in exchange for a final, ultimate token.Over the 10 weeks Fin’s was officially running, we had collaborations/partnerships with a couple of different artists in the web3 space, including:These partnerships emerged organically, they weren’t just allowlist spots. We worked with these teams to connect the creators and artists with the people in Fin’s. Some brought templates; others airdropped NFTs to everyone in the bar and line. Many weeks, we welcomed the artists as guests to the chat and got to know them and learn about their work. Check out our zipsharks collab:For a while, I considered a future where Fin’s was focused on launching and marketing projects. Would it be possible to tokenize grass-roots, organic marketing? It felt like a good idea — but this isn’t what REALLY made Fin’s a success. It was the relationships and sense of belonging that our shared purpose had helped grow and made us an effective partner. People weren’t here to participate in a coordinated marketing campaign — they were here to have fun.I made a lot of adjustments over the course of the project. For example, one early goal was to create a 3D space that people could visit in their browser or in VR. Getting the exact details right was hard, and so I had to really reduce the scope of the art. I was also tempted to lean into the early hype and considered accelerating the project’s timetable a lot.The initial concept was to “build” Fin’s in sections. Over a period of ten weeks, I’d airdrop 10 different sections as NFTs. Together, they’d assemble the full bar. This process ended up being a lot more difficult than I anticipated, because it was really hard to convey the concept of doodles-themed objects and get it done in a compressed amount of time.For example, one of the first pieces I commissioned was a single alley scene. But the more I gave feedback around color and perspective, the more the artist increased the project’s scope. I had been very clear that I wanted a single wall in an alley — but what I got was a full city block:I also attempted to build a full composite of Fin’s. And while I thought this artist was excellent at taking feedback, the scene just felt like it was missing something.I started to feel the hype kicking in. People were filling my DMs with requests to join Fin’s. We had secondary sales after the first drop, and the art was well-received. I resisted leaning into the hype for a couple of reasons:Ultimately, I built the experience into an episodic series of weekly art drops and collaborations. Having a scheduled start and end helped set clear expectations. Spacing our project over 10 weeks had an affect on our art, too: because we weren’t rushed, there was time to review and revise art with artists on a reasonable schedule and incorporate the emerging culture of the bar into some of the pieces.When I look back at the memory of eating dinner while I scrolled Fin’s group chat, I realize that while I was physically in a bar lobby I was also in Fin’s. But what made it a “third place” for so many of us?This is the closest we are to the metaverse today: it’s possible to be one place physically while making memories with friends who are scattered around every corner of the globe at that same moment.So many NFT projects never end. They raise a lot of money and make large promises about utility or other products they’ll deliver, which in turn drives the speculative value of their tokens. But Fin’s was designed as a fun, social experience with an endgame in mind — because every good story eventually comes to an end.If you’re curious about what’s next for Fin’s or would like to join us, you can get more information here:www.fins.wtf","creation_date":"2022-11-18","tags":["Nft","Blockchain","Nft Collectibles","Social Media","Twitter"],"author":"deepbluesteeve","category":null}