{"id":"20dfdf6b-6cce-4018-b5a2-981353adda07","article_link":"https://www.wired.com/story/best-books-of-2023/","website_source":"Wired","article_type":"News Article","summary":"From a rollicking crypto investigation to an unexpectedly moving novel about poetry-spouting AI, these are the best books we read in 2023.","title":"The 16 Best Books of 2023","detailed_content":"It’s hard to find something pithy to say about 2023, a year of dissonant extremes, when wildfires devoured Canadian forests, Twitter withered into X, the Titan submersible imploded into infamy, Silicon Valley’s power players rejoiced over the rise of generative AI, scientists cheered Crispr treatment breakthroughs, peace activists became terrorist-attack victims, and the world despaired over the thousands of children killed in Gaza. It’s not a tidy time. It is, frequently, a painful one.\nAppropriate, then, that this was a year for unwieldy, searching, big-swing books. Doorstoppers and sagas rose to the moment, providing insight into an increasingly inscrutable world even when they couldn’t provide comfort. As always, this is an idiosyncratic, incomplete, and subjective list, the result of one person’s avid but disorganized reading schedule. But these are WIRED's best books of 2023. Here’s hoping this list helps you find your next great read.\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\nCobalt Red: How the Blood of the Congo Powers Our Lives\nby Siddharth Kara\nCOURTESY OF ST. MARTINS PRESS\nElectric is the enlightened alternative to climate-killing oil … right? Moving away from fossil fuels remains necessary, but Siddarth Kara captures a painful truth in Cobalt Red: The electric revolution has an underbelly, too. Rechargeable batteries, including those within phones and electric vehicles, are usually manufactured with cobalt, a metal plentiful in the Democratic Republic of Congo.\nFEATURED VIDEO\n Cobalt Red is a grim investigation into the conditions workers experience within “artisanal” cobalt mines; child labor is rampant, and death on the job is commonplace. It’s a call to arms to push companies using these batteries to clean up their supply chains, and for those of us who buy consumer devices to interrogate how they’re made and how we treat those who make them.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nDo You Remember Being Born?\nby Sean Michaels\nCOURTESY OF ASTRA HOUSE\nJust as there was a rush of lockdown-themed novels following the first wave of Covid-19, it’s a near-certainty that readers are about to get hit with a deluge of fiction about large language models. It’s too bad, because Canadian novelist and music critic Sean Michaels has already written the definitive novel about art in the age of AI, one that incorporates machine-generated phrases and sentences in an unexpectedly moving way.\nDo You Remember Being Born? follows a 75-year-old poet after she accepts an invitation to spend a week cowriting a poem with an AI trained on her work. A novel about the value of writing must clear a very high stylistic bar to succeed, and Michaels produces some of the most beautiful sentences published this year.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nNatural Beauty\nby Ling Ling Huang\nCOURTESY OF PENGUIN RANDOM HOUSE\nAfter her mother and father are severely injured in a car accident, a piano prodigy finds work at a wellness startup called Holistik, where affluent customers indulge in gloriously weird beautifying treatments like pubic hair transplants. Natural Beauty is a delightfully baroque grotesque about wellness culture—Goopcore, if you will.\nLing Ling Huang’s debut novel can achieve a folkloric power in its creepiest moments; it’s a scary story you’d tell in a posh spa’s sauna instead of around a campfire. Recommended for anyone with mixed emotions about the rise of cosmetic Ozempic use.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nFire Weather: A True Story from a Hotter World\nby John Vaillant\nCOURTESY OF ALFRED A. KNOPF\nThe day John Vaillant’s book about Canadian wildfires came out in the US last summer, Canadian wildfires became a temporary American obsession. Skies in the northeastern United States turned orange, hazy, and hazardous as the result of more than 400 infernos in Canada’s vast boreal forests in early June. New York City’s air quality became the worst in the world, choked with smoke blown down from Quebec. Philadelphia urged residents to stay indoors. Fire weather, indeed. Great publicity, but so bleak—like releasing a history of terrorist attacks in September 2001.\nUpon its release, I recommended Vaillant’s gripping account of the 2016 Fort McMurray fire as the best thing to read to understand this particular crisis, and that recommendation stands. It’s vital context for how our forests got so flammable.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nNumber Go Up: Inside Crypto’s Wild Rise and Staggering Fall\nby Zeke Faux\nCOURTESY OF PENGUIN RANDOM HOUSE\nThe month after Bloomberg reporter Zeke Faux’s Number Go Up came out, disgraced crypto bigwig Sam Bankman-Fried went on trial. It was good timing for Faux, as he’d opened his rollicking crypto-world travelogue with an account of meeting SBF. In fact, the opening line is a quote from Bankman-Fried: “I’m not going to lie,” SBF promises Faux. “This was a lie,” Faux writes. This accomplishes two things. First, it signals immediately to the reader that Faux gets it, that he knows Bankman-Fried was full of it. Second, it’s funny.\nNumber Go Up is definitely the best book to read for anyone who wants to understand what happened with SBF and FTX; I’d argue it’s also the best book to give any general-interest reader who wants to learn more about why crypto has crashed and burned.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nTokens: The Future of Money in the Age of the Platform\nby Rachel O’Dwyer\nCOURTESY OF VERSO\nIrish writer Rachel O’Dwyer’s Tokens also came out shortly before the SBF trial, and it’s also an excellent book to pick up for anyone interested in crypto. It didn’t get as much attention as Number Go Up, in part because it has a more diffuse focus—O’Dwyer considers crypto as part of a larger movement into tokenized payment, including Twitch bits (the virtual goods used to reward Twitch streamers) and Axie Infinity’s doomed “Axie” NFTs. It’s an important addition to the growing blockchain canon, written with wit and generosity.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nAnimal Spirits: The American Pursuit of Vitality from Camp Meetings to Wall Street\nby Jackson Lears\nCOURTESY OF FARRAR, STRAUS AND GIROUX\nAnimal Spirits is a hard book to summarize without making it sound boring or esoteric—it’s an examination of American vitalist beliefs, ranging from philosophies promoted by self-help literature to Adam Smith’s invisible hand of the market—but it’s fascinating, broadly relevant, and yet another book you should read to grasp all the finance world madness of the past decade.\nThis gorgeously written cultural history isn’t about cryptocurrency at all—I don’t think historian Jackson Lears mentions it once in a nearly 400-page book—and yet I found myself returning to Animal Spirits repeatedly this year while watching the crypto world convulse, because it distills the psychology driving boom-and-bust cycles in tech and finance better than anything else.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nWellness\nby Nathan Hill\nCOURTESY OF PENGUIN RANDOM HOUSE\nThe opposite of a “slim volume,” Nathan Hill’s second novel is a brash, shaggy, and warm-blooded love note to Gen X. (And a gentle satire of internet culture: Downloaded porn, fitness wearables, and Facebook radicalization all figure prominently into the plot.)\nWellness is also an old-fashioned, occasionally overstuffed throwback of a book. Over 600 pages long, it centers on the love story of Jack and Elizabeth, two artsy students in 1990s Chicago who settle down together and find themselves straining toward happiness in middle age. Long live the social novel!\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nDoppelganger: A Trip Into the Mirror World\nby Naomi Klein\nCOURTESY OF FARRAR, STRAUS AND GIROUX\nYou know Naomi Klein, right? Leftist journalist? Climate activist? Decidedly not the former liberal feminist writer turned conspiracy theorist Naomi Wolf? Somehow, people confuse the two Naomis. Klein gets mixed up with Wolf so much, in fact, a Twitter mnemonic was born: “If the Naomi be Klein you’re doing just fine / If the Naomi be Wolf, oh, buddy. Ooooof.”\nThus the basis of Klein’s new book, Doppelganger. Writing hundreds of pages based on Twitter discourse is, of course, a questionable choice. As she is quick to point out, though, Doppelganger is not really about Wolf. She’s merely an entry point to dissect the “intellectual and ideological mayhem” of the Covid era. How wellness entrepreneurs demonize medicine. How the far right appropriates and warps leftist talking points. How parents see their children as reflections of themselves. In all this, Klein writes, there’s a new doubling going on—distortions of what used to be more straightforward realities. It’s a wholly vital work, one only Klein could write.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nAnansi’s Gold: The Man Who Looted the West, Outfoxed Washington, and Swindled the World\nby Yepoka Yeebo\nCOURTESY OF BLOOMSBURY\nTry as we might to move past it, we’re still living through the golden age of grifters, so Anansi’s Gold is another timely read for 2023. Reporter Yepoka Yeebo unravels the riveting tale of big-time conman John Ackah Blay-Miezah, an audacious, globe-trotting Ghanaian who convinced investors from Philadelphia to Accra that he could access a gold fortune allegedly lost by Ghana’s first president, Kwame Nkrumah.\nYeebo pulls off something near-magical here. She excavates an overlooked historical narrative as juicy as any true-crime blockbuster, where every detail is both fastidiously researched and completely over-the-top—one of Blay-Miezah’s major adversaries in his quest to scam? Former child star Shirley Temple Black, of course!—while also conveying how the colonial system nurtured and turbo-charged this dysfunction.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nYour Face Belongs to Us: A Secretive Startup’s Quest to End Privacy as We Know It\nby Kashmir Hill\nCOURTESY OF PENGUIN RANDOM HOUSE\nI dare you to read this alternately amusing and horrifying account of the rise of an oddball startup selling the world’s most powerful facial recognition tools without, at least one time, putting it down to google how to move to a remote location without Wi-Fi.\nShortly after starting a new job at The New York Times, longtime privacy reporter Kashmir Hill got a tip about Clearview AI, a tiny company that had quietly scraped photos from the internet to become a Shazam for people. In addition to providing the fullest account of how this company’s tech is used to undermine our privacy, Your Face Belongs to Us is also a finely-drawn portrait of the type of people who would sell this type of product, especially founder Hoan Ton-That, an intelligent misfit who seems driven more by personal insecurities than any genuine ideological commitments.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nOur Hideous Progeny\nby C. E. McGill\nCOURTESY OF HARPERCOLLINS\nI was not expecting to love this book so much. It seemed like it could be a Pride and Prejudice and Zombies-ish cash grab, trading on the enduring popularity of Frankenstein. (It is billed as an update and sequel of sorts to Mary Shelley’s classic.) It’s not. Our Hideous Progeny might start as a Frankenstein spinoff, following Victor Frankenstein’s grand-niece in 1850s London, but then it pivots into something that could reasonably be described as “bizarro queer feminist prequel to Jurassic Park.”\nThis is cozy horror perfected, the literary equivalent of spending a weekend storm-watching in a leaky castle in northern Scotland.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nThe Book of Ayn\nby Lexi Freiman\nCOURTESY OF CATAPULT\n“Cancel culture satire” might be the most cursed phrase in the English language, but somehow Lexi Freiman wrote a cancel culture satire and it’s funny and tough and generous without ever being sentimental.\nThe Book of Ayn follows Anna, a horny contrarian novelist who gets ostracized by her lit-world pals after writing a poorly-received comic novel about the opioid crisis and subsequently becomes obsessed with Ayn Rand, then moves to a commune to destroy her ego. A meaner writer might’ve let Anna sour into a full-blown villain, but Freiman turns her into something more interesting: a narcissistic millennial writer character who defies cliche and always feels human.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nThe Palestine Laboratory: How Israel Exports the Technology of Occupation Around the World\nby Antony Loewenstein\nCOURTESY OF VERSO BOOKS\nWhat does the Jeff-Bezos-phone-hacking incident have to do with the plight of the Palestinians? Australian-German journalist Antony Loewenstein connects the dots in this compelling, horrifying investigation. The Palestine Laboratory provides crucial context about the Israel–Hamas war, and the reality of life in the occupied Palestinian territories prior to October 7. Loewenstein examines how Israel tests weapons and surveillance technology on Palestinians living in Gaza and the West Bank, then sells these tools and services to other countries—including places like Saudi Arabia, which has used spyware from Israel’s NSO Group.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nPalo Alto: A History of California, Capitalism, and the World\nby Malcolm Harris\nCOURTESY OF LITTLE, BROWN AND COMPANY\nIf you knew anything about Malcolm Harris before picking up Palo Alto, you’d probably guess that Palo Alto isn’t a starry-eyed hagiography of the region. Harris is one of the most widely-published left-wing journalists today, and he’s upfront about how repulsive he finds the tech oligarchy nurtured in his northern California hometown. But don’t mistake Palo Alto for a polemic: It’s a panoramic, deeply researched, and fundamentally truth-seeking history, one that brings even its most repugnant characters—Leland Stanford, Herbert Hoover—to three-dimensional life.\nRequired reading for anyone interested in the technology industry, Silicon Valley psychology, the development of photography, or American history.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG\nBlood in the Machine: The Origins of the Rebellion Against Big Tech\nby Brian Merchant\nCOURTESY OF LITTLE, BROWN AND COMPANY\nThere’s no shortage of interesting nonfiction out right now about artificial intelligence and how it will change the world, our lives, the future, and more. But the most important book to read about the AI boom is about a completely different technological revolution, way back in the early 19th century.\nLos Angeles Times technology columnist Brian Merchant’s Blood in the Machine is a spirited and thoughtful recounting of the Luddite uprising in response to the Industrial Revolution, one that draws parallel after parallel to the present. Read it and prepare to understand the current moment better. Also prepare to quell the urge to pick up a hammer.\nBUY ON AMAZON\nBUY ON BOOKSHOP.ORG","creation_date":"2023-12-22","tags":["","YEAR IN REVIEW","BOOKS"],"author":"BY KATE KNIBBS","category":null}