{"id":"216eb97c-cd9f-4ad2-aee2-201ce9a11680","article_link":"https://cointelegraph.com/news/coinbase-base-tvl-4-billion-transactions-beating-ethereum","website_source":"Cointelegraph","article_type":"News Article","summary":"Coinbase’s layer-2 network, Base, was the only top-five Ethereum layer 2 to see a value-locked gain over the past seven days.","title":"Base hits $4B TVL as monthly txs outstrip Ethereum and Arbitrum","detailed_content":"Crypto exchange Coinbase’s Ethereum layer-2 blockchain Base has seen its total value locked (TVL) surge by over 13.2% in the past week to surpass $4 billion for the first time as its 30-day transactions beat out Ethereum and its top rival, Arbitrum.\nL2Beat data updated on April 7 shows Base’s total TVL at $4.15 billion, including $1.45 billion of canonically bridged value — assets locked on Ethereum to be represented on Base — and $2.7 billion in natively minted assets.\nBase is the third-largest Ethereum layer 2 by TVL, beating fourth-place rival Blast by around $1.4 billion and $3.5 billion behind the second-place Optimism and $14.6 billion behind leader Arbitrum.\nBase’s total TVL chart with the split between canonically bridged funds (purple) and natively minted (pink). Source: L2BEAT\nBase is the only layer 2 of the top five by TVL to have posted a gain in the past week. Starknet saw the biggest TVL loss at 10.2%, while Optimism was down 9.1%, Arbitrum declined 5.5%, and Blast shrunk 2.4%.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe Ethereum scaler’s TVL bump comes amid an activity surge that’s seen its 30-day transaction count hit 50.34 million, surpassing Arbitrum’s 40.1 million and Ethereum’s 37.9 million.\nBase’s average daily transactions per second (TPS) jumped by 29.7% over the week and over the past day has averaged 35.19 TPS — higher than the combined TPS of rival layer-2 Arbitrum and Ethereum, which saw respective scores of 16.61 and 13.91.\nBase’s TPS (red) has consistently outstripped Ethereum (blue) for over two weeks. Source: L2Beat\nMeanwhile, Base has been one of the main beneficiaries of recent memecoin activity. Its meme token market capitalization has reached over $1.6 billion, a 13% jump over the last day, according to CoinGecko.\nRelated: Coinbase partners with Lightspark for Bitcoin Lightning payments\nHowever, Base’s popularity has also attracted scammers, as the network saw an 18-fold increase in successful phishing scams from January to March — with $3.35 million stolen last month.\nEthereum has focused its development efforts on improving the blockchain’s ability to process layer-2 transaction data, as exampled by its March 13 Dencun upgrade, which has lowered layer-2 transaction fees.\nMeanwhile, layer 2’s like Base could gain further from Ethereum’s shortcomings, with VanEck analysts estimating the network’s scaling ecosystem could hit a $1-trillion market capitalization by 2030.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Coinbase","#Ethereum","#Base","#Layer2"],"author":"by Jesse Coghlan","category":null}