{"id":"221a0f93-d351-46d2-b152-bd26e6761f05","article_link":"https://cointelegraph.com/news/degen-chain-l3-tops-transaction-tps-charts-ethereum-ecosystem","website_source":"Cointelegraph","article_type":"News Article","summary":"The average value transacted on Degen Chain is rather small at $0.27, however, compared to Ethereum and Base at $1,867 and $170, respectively.","title":"Degen Chain L3 now tops the TPS charts within the Ethereum ecosystem","detailed_content":"Degen Chain, a new Ethereum layer-3 network, has recorded the highest transaction per second (TPS) count in the Ethereum ecosystem over the last 24 hours.\nDegen’s TPS count increased 62% over the last day to notch 35.7 TPS — beating out the blockchain it was built on, Base, at 29.7 TPS, according to L2BEAT.\nArbitrum One, Ethereum and zkSync Era rounded out the top five.\nTPS by Ethereum-based blockchain over the last 24 hours. Source: L2BEAT\nMultiplying Degen’s 35.7 TPS by 86,400 seconds in a day means the memecoin chain processed 3.08 million transactions over that timeframe.\nBut Degen Chain has only notched $819,600 in trading volume over the last day, placing it 35th out of 44 blockchains tracked by CoinGecko.\nThis means the average value per transaction was a mere $0.27 — which is much lower compared to Ethereum and Base at $1,867 and $170 respectively.\nWhile TPS is widely used to measure a blockchain’s scalability limits, several industry leaders say it is a flawed metric — as it fails to consider the computational size of each transaction.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“[It] is a bit like counting the number of bills in your wallet but ignoring that some are singles, some are twenties, and some are hundreds,” explained Steven Goldfeder, a founder at Offchain Labs who recently spoke with Cointelegraph Magazine.\nRelated: Memecoin sector’s continued growth hinges on long-term utility\nThe memecoin turned chain is powered by the Degen (DEGEN) token, which initially started out as a tipping token for users interacting with Degen’s channel on Farcaster — a decentralized social media platform.\nThis is a textbook example of how a memecoin can actually accrue social value, according to Thomas Tang, a vice president of investments at cryptocurrency venture capital firm Ryze Labs.\n“It’s gained massive mass popularity because everyone’s tipping each other, and everyone holds it,” Tang told Cointelegraph.\n“So they built a layer 3, based on that.”\nIan Lee of blockchain infrastructure firm Syndicate believes Degen Chain is paving the way for applications on layer 3s. Source: Ian Lee\nThere is currently $4.1 million in total value locked on Degen Chain, while the three-month-old DEGEN token boasts a market capitalization of $326 million, according to CoinGecko.\nDegen Chain is considered an ultra-low-cost, application-specific layer 3 blockchain which was built with Arbitrum Orbit and leverages the settlement layer of Base, an Ethereum layer-2 scaling solution.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Ethereum","#Transactions","#Base","#Scalability","#Layer2","#Memecoin"],"author":"by Brayden Lindrea","category":null}