{"id":"2313ad14-0baa-4ccb-96c2-01c1e87c1d2e","article_link":"https://cointelegraph.com/news/binance-tax-evasion-trial-moved-to-may-17-in-nigeria","website_source":"Cointelegraph","article_type":"News Article","summary":"Gambaryan’s lawyer, Chukwuka Ikuazom, objected, citing Nigerian law, stating he couldn’t plead until Binance, the primary defendant, was served.","title":"Binance tax evasion trial moved to May 17 in Nigeria","detailed_content":"The tax evasion trial in a Nigerian court involving cryptocurrency exchange Binance and two of its executives has been adjourned to May 17. This delay occurred because the exchange had not yet been formally served with the charges.\nAccording to local news agency BusinessDay, the Federal Inland Revenue Service (FIRS) has not served Binance with tax evasion charges. The FIRS lawyer argued that Gambaryan should represent Binance as the primary defendant, had been served, given that both Binance and its executives were charged together.\nHowever, Gambaryan’s lawyer, Chukwuka Ikuazom, objected, citing Nigerian law, stating he couldn’t plead until Binance, the primary defendant, was served. Judge Emeka Nwite adjourned the proceedings for May 17, when he will give a ruling.\nBinance and its executives, including Tigran Gambaryan, a 39-year-old U.S. citizen serving as head of financial crime compliance, and Nadeem Anjarwalla, a 37-year-old British-Kenyan regional manager for Africa, were arrested on Feb. 28, and charged with four counts of tax evasion during a visit to Nigeria.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe arrest came after the federal government banned cryptocurrency channels as part of a campaign to curb currency speculation. The court mandated that Binance give the Nigerian government access to data and details of Nigerian traders using its platform.\nThe charges involve Binance’s failure to register with Nigeria’s Federal Inland Revenue Service (FIRS) for tax remittance. Gambaryan was present in an Abuja court on Friday but did not enter a plea. However, Anjarwalla wasn’t present as he had escaped detention and left the country in March 2024.\nRelated: USA to forge AI partnership with Nigeria for economic growth\nApart from the tax evasion trial, Binance and its executives face charges of laundering over $35 million by Nigeria’s anti-graft agency, the Economic and Financial Crimes Commission (EFCC). The trial is set to resume on May 2.\nBinance, which was not represented in court and had no immediate comment, said on Thursday at the Token2049 crypto conference in Dubai, that it is working closely with Nigeria authorities following the detention of Gambaryan.\nMeanwhile, a federal high court in Abuja, Nigeria, has again postponed the bail application hearing for Binance executive Tigran Gambaryan, who remains in custody at the Kuje correctional center.\nHowever, Gambaryan is also suing the government for violating his fundamental human rights. Gambaryan’s motion claims that his detention in Nigeria and the confiscation of his passport violates the country’s constitution, which guarantees an individual’s right to personal liberty.\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-20","tags":["#Blockchain","#Law","#Government","#Nigeria","#Binance","#Regulation"],"author":"by Amaka Nwaokocha","category":null}