{"id":"237d4ed8-1ee7-48b2-b2b1-f716187d741f","article_link":"https://cointelegraph.com/news/gold-real-estate-and-more-legal-infrastructure-for-real-world-asset-tokenization-industry","website_source":"Cointelegraph","article_type":"News Article","summary":"Legally connecting physical assets with digital tokens can enhance global trade efficiency and asset liquidity by streamlining transactions and broadening access to asset markets.","title":"Gold, real estate and more: Legal infrastructure for real-world asset tokenization industry","detailed_content":"Mattereum provides a legal framework to bridge real-world assets with blockchain technology, potentially streamlining global trade and improving asset liquidity.\nCrypto is on the rise in 2024, and bull is a buzzword again. The approval of spot ETFs in the United States is also ushering in a new era of crypto adoption and putting a new emphasis on real-world assets (RWA).\nRWA tokens, which are essentially tokens with real-world representatives, promise to bridge crypto and TradFi, improving the liquidity, accessibility and efficiency of tokenized assets. Moving trade to the internet is estimated to generate $280 billion of savings annually, and RWA tokenization offers a blockchain-based solution to achieve this goal.\nAsset passport for borderless trading\nMattereum is a London-based RWA initiative founded by Vinay Gupta, who was also the Ethereum launch coordinator in 2015. The project’s system makes it possible to tokenize, fractionalize and trade real-world assets on-chain while providing a legal bond between the token and the asset in the real world.\nOperating as a legal hub for tokenized RWA developers, Mattereum’s legal tech solution creates a formal legal connection between an on-chain token and the physical asset it represents. It does so by issuing a Mattereum Asset Passport, which connects the token to the physical asset so that the owner of the token can be shown to legally own the respective RWA. The Asset Passport also provides money-back warranties on the accuracy of the information about an RWA (such as its description, authenticity and condition) that a buyer uses when making purchasing decisions.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMattereum’s legal infrastructure is based on the United Kingdom’s common law provisions for digital commerce. Owing to the 1958 New York Convention on arbitration, the provisions are enforceable in more than 170 countries, legitimizing and making Asset Passports available for use in all of them.\nBy carrying RWAs on-chain, Mattereum facilitates access to real-world assets, expanding and globalizing their market. The legal services provided by Mattereum eliminate national borders in RWA trading, aligning with blockchain’s fundamental ethos, such as decentralization and borderlessness.\nMattereum concentrates on high-value assets like gold, real estate, and fine art, as well as assets that lag behind in digitalization compared to the likes of stocks and bonds. However, the solution is applicable to almost any asset class.\nMattereum offers full legal protection for RWA projects. Source: Mattereum\nThe platform presents users with options for both fractionalized and nonfungible tokenization. Users may opt to produce a complete digital twin by minting an ERC-721 token — the Ethereum standard for nonfungible tokens (NFTs) — or fractionalize the real-world asset by minting ERC-20 representatives.\nTokenizing gold and real estate\nFounded in 2017, Mattereum has been working to get smart contracts on blockchain as legally accepted contracts. The RWA project began offering services in 2021 by tokenizing Hollywood collectibles, such as props and merchandise from top-rated movies. It then moved onto gold and real estate.\nMattereum is now focusing on its token sale. Launched by Mattereum’s German subsidiary Mattereum GmbH, the Mattereum Discount Token’s (MATR) proceeds will be used to fund company expansion and development. The platform will also feature tokenized and fractionalized gold and real estate on-chain.\nCommenting on the gap Mattereum fills between blockchain and traditional assets, Vinay Gupta, the founder and CEO of Mattereum, said:\n“Mattereum is providing a key service for the new real-world asset ecosystem on the blockchain by providing the legal layer that connects tokens with assets so that their properties are confirmed by warranties and their ownership can be proved in court almost anywhere in the world. We are fully live and ready to provide these services today to other RWA companies in the space. This is vital for bringing world trade on-chain and has the potential to make Mattereum bigger than Visa.”\nThe MATR token is available for purchase through Mattereum GmbH’s fully regulated German crypto exchange partner, Swarm. Buying MATR is subject to terms and conditions in eligible jurisdictions — in particular, residents of the United Kingdom and the United States are excluded from the public sale of MATR.\nCrypto’s resurgence will undoubtedly bring a new focus on RWAs, and Mattereum offers a comprehensive perspective on tokenization that prioritizes legality and compliance.\nFind out more about Mattereum\n#Blockchain\n#Law\n#Gold\n#Technology\n#Assets\n#Real Estate\n#Tokens\n#NFT\n#Regulation\n#Cointelegraph Accelerator\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-01","tags":["#Blockchain","#Law","#Gold","#Technology","#Assets","#Real Estate","#Tokens","#NFT","#Regulation","#Cointelegraph Accelerator"],"author":"by Ayse Karaman","category":null}