{"id":"23f3c021-1545-46e9-96ef-a402ed4c0d57","article_link":"https://cointelegraph.com/news/me-we-social-network-blockchain-solve-tik-tok-problem","website_source":"Cointelegraph","article_type":"News Article","summary":"CEO Jeffrey Edell laid out a six-point plan for social media companies planning the transition to blockchain.","title":"MeWe social network boss says blockchain can solve the TikTok problem","detailed_content":"MeWe chairman and CEO Jeffrey Edell recently penned an op-ed detailing how he believes the situation between the United States government and China’s TikTok could be avoided by implementing blockchain technologies.\nEdell is in the unique position of helming a social media company with reportedly more than 20 million users that’s made the leap from traditional Web2 to the blockchain.\nThe TikTok situation\nA slew of recent reports indicate that the U.S. is currently weighing an outright ban on China’s TikTok social media platform. There are allegations that ByteDance, the platform’s owner, has turned over sensitive user data to the Chinese government with potential negative implications for U.S. security.\nIn an op-ed penned for Rolling Stone, Edell wrote that the TikTok situation is, at its crux, a matter of user privacy that could have been averted through decentralization:\n“While the concerns surrounding TikTok are valid, I believe the focus should not solely be on one app or one country. Instead, companies should work toward creating and setting strict guidelines for handling personal data, digital identity and users’ privacy, regardless of their origin.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nEdell added that “one way to ensure that personal data is secure and protected is through the use of Web 3-based, blockchain technology.”\nTransitioning to blockchain\nAs Cointelegraph reported, MeWe made the transition from Web2 to the Frequency blockchain network, a Polkadot parachain, in April 2023.\nEssentially, the argument for blockchain-based user privacy hinges on who, exactly, has access to user data. On traditional social media platforms, such as X, user data is held and accessed through a centralized control method wherein the company itself retains ownership of all data.\nIn TikTok’s case, this ostensibly means that ByteDance — and, by legal extension, the government of China — owns all of the platform’s user data, including more than 150 million U.S.-based users.\nBy placing data on the blockchain and implementing specific privacy controls, a social media network can give users control over their data without compromising platform functionality.\nRelated: Worldcoin launches its own ‘human-centric’ blockchain network\nWhile MeWe’s user base doesn’t quite stack up to TikTok’s, the company’s transition to blockchain shows that it’s possible.\nTo that end, Edell shared six best practices for other companies considering the change in his Rolling Stone article: understanding the technology, starting small, choosing the platform that’s right for your organization, staying up to date with regulatory compliance changes, collaborating with stakeholders, and ensuring employees are educated and trained on blockchain.\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#China","#Business","#Decentralization","#Privacy","#United States","#Social Media"],"author":"by Tristan Greene","category":null}