{"id":"24ef1789-2e22-48b2-89ac-bdad3f929845","article_link":"https://cointelegraph.com/news/omnity-rolls-out-integration-for-no-fee-runes-trading","website_source":"Cointelegraph","article_type":"Tweet","summary":"The Omnity protocol is launching an integration for trading of Runes tokens without gas or transaction fees.","title":"Omnity rolls out integration for no-fee Runes trading","detailed_content":"Omnichain protocol Omnity has launched an integration that promises the trading of Runes tokens without gas or transaction fees or clogging the Bitcoin network.\nAccording to the protocol, the integration is based on the Internet Computer Protocol’s chain fusion technology, which enables the network to read and write to the Bitcoin network and other blockchains.\n“It differs from other Bitcoin interoperability protocols in many ways,” Louis Liu, founder of Omnity and the Octpus Network, told Cointelegraph, adding that support for Bitcoin Ordinals and Ethereum nonfungible tokens (NFTs) is expected in the coming months.\n“Omnity does not rely on wrapped tokens with trust assumptions or off-chain relayers that can be exploited. [...] To give an example, Wormhole relies on wrapped tokens and off-chain relayers, while LayerZero requires two off-chain entities, an Oracle and a Relayer.”\nThe integration targets the demand for solutions to scale the Bitcoin blockchain. The network has seen a surge in activity, fueled by the debut of Bitcoin\nBTC\n$63,041\nexchange-traded funds (ETFs) and novel technologies like Runes — a new protocol for issuing fungible tokens on the Bitcoin network.\nAverage transaction fees in USD on the Bitcoin network. Source: Blockchain.com\nOn April 20, the Bitcoin network recorded a new all-time high of 926,842 transactions, with Runes tokens making up 68% of the blockchain’s traffic. According to data from Dune, 3.6 million Runes transactions were executed on the day. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“With all of this buzzy development on Bitcoin, [...] developers are hustling for solutions to trade Bitcoin assets without bottlenecking the network, increasing users’ risks of outrageous network fees,” said Liu.\nBitcoin is expected to drive innovation in the crypto space in 2024. Among the trends surrounding the first blockchain are layer-2, rollups and its integration with decentralized finance (DeFi). “Most of the world is not able to access U.S.listed products, but will still need and want to borrow against their Bitcoin and earn interest with it,” Ledn CEO Mauricio Di Bartolomeo previously told Cointelegraph.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-29","tags":["#Bitcoin","#Blockchain","#Technology","#Bitcoin Industry"],"author":"by Ana Paula Pereira","category":null}