{"id":"24f0bc38-9e4d-4652-a5b4-790ac90b6d40","article_link":"https://cointelegraph.com/news/nigeria-interpol-trains-on-virtual-asset-forensics-to-combat-cybercrime","website_source":"Cointelegraph","article_type":"News Article","summary":"The training will enable officers to effectively address cybercrimes involving virtual assets, particularly stablecoins.","title":"Interpol Nigeria boosts cybersecurity with virtual asset training","detailed_content":"Nigerian Interpol, cybersecurity experts and other members of the local intelligence community met to brainstorm ways to tackle the rising wave of cybercrime in the country.\nThe meeting, which took place in Nigeria’s capital, Abuja, under a training platform organized by A&D Forensics in partnership with the Africa Stablecoin Consortium, was designed to position Nigerian Interpol to mitigate crimes involving digital assets, particularly stablecoins.\nAccording to blockchain specialist Chioma Onyekelu, the training session aimed to empower Interpol agents with the skills to leverage blockchain intelligence and analysis in tracing and prosecuting cybercriminals involved in cryptocurrency transactions, specifically those using Bitcoin\nBTC\n$62,406\nand stablecoins.\nSource: Africa Stablecoin Consortium\nOnyekelu stated that cybercrime has evolved beyond traditional fiat currency, with criminals now exploiting digital assets to commit various cyber offenses. He added that as Nigeria’s Interpol receives cybercrime requests from international partners, it is crucial to enhance its capabilities through targeted training sessions.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nGiven Nigeria’s growing involvement with virtual asset exchanges, Onyekelu explained that the training will enable officers to effectively address cybercrimes involving virtual assets, particularly stablecoins.\nAdedeji Owonibi, senior partner at A&D Forensics, told the press that the training was imperative due to the rising cybercrime trends in the country. He stated:\n“A significant gap exists between the evolving cybercrimes and the capabilities of law enforcement agencies in Nigeria. As responsible corporate citizens, we recognized the need to bridge this gap and support our law enforcement agencies in staying updated and effectively combating cybercrimes.”\nRegarding the controversies generated by the recent introduction of the cybersecurity levy, Owonibi argued that while cybersecurity may be controversial, the government has the authority to make decisions on matters that impact national security, emphasizing the importance of prioritizing the nation’s security interests.\nRelated: Ghana’s crypto stamps honor king’s Silver Jubilee\nOn Monday, the Central Bank of Nigeria (CBN) mandated banks and other payment service providers to begin deducting 0.5% of the total value of electronic transactions and remit to the National Cybersecurity Fund to be managed by the Office of the National Security Adviser (ONSA).\nNigeria’s Securities and Exchange Commission (SEC) is cracking down on cryptocurrency, banning peer-to-peer exchanges that use the naira, signaling a significant regulatory shift.\nThe International Monetary Fund (IMF) recently recommended that Nigeria embrace crypto adoption through licensing global cryptocurrency exchanges as a part of its economic reformation measures.\nMagazine: What do crypto market makers actually do? Liquidity, or manipulation\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-11","tags":["#Blockchain","#Cryptocurrencies","#Government","#Nigeria","#Cybercrime","#Cybersecurity"],"author":"by Amaka Nwaokocha","category":null}