{"id":"256ed65c-8297-441b-8beb-18b3f311d54a","article_link":"https://cointelegraph.com/news/china-crypto-dad-investigated-government","website_source":"Cointelegraph","article_type":"Tweet","summary":"Yao Qian, the first director of CBDC development at China’s central bank, is reportedly under investigation for suspected law violations.","title":"Chinese ‘Crypto Dad’ faces government investigation","detailed_content":"China authorities have reportedly launched an investigation into local pro-blockchain official Yao Qian on suspicion of legal violations.\nAccording to an April 26 report by the Shanghai Securities News, Yao is currently under investigation by the Central Committee of the Communist Party of China on suspicion of “serious violations” of discipline and law. The specific reasons for the investigation are not disclosed.\nCurrently serving at the China Securities Regulatory Commission as director of the Science and Technology Supervision Bureau, Yao is a significant figure in the Chinese blockchain community.\nHe is sometimes referred to as China’s “Crypto Dad” and is the first director of China’s central bank digital currency (CBDC) research department at the People’s Bank of China (PBoC), where he served from 2017 to 2018.\nYao Qian, director of the Science and Technology Supervision Bureau of the China Securities Regulatory Commission. Source: 21jingji.com\nAfter quitting active CBDC development at the PBoC, Yao still remained engaged in digital currency research and discussions.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nIn May 2021, the former PBoC head of CBDC research predicted that state-run digital currencies were set to become more “smart” and could one day operate on blockchain networks like the Ethereum blockchain.\nMainland China’s CBDC, the digital yuan, was piloted in late 2019, becoming one of the world’s first jurisdictions to complete real-world CBDC tests.\nSoon after launching domestic digital yuan testing, PBoC started cross-border CBDC pilots in collaboration with central banks in Hong Kong, Thailand and the United Arab Emirates in 2021.\nRelated: 'China is about to start bidding' — Will Hong Kong Bitcoin ETFs spark the halving rally?\nPBoC’s digital yuan launch came in line with China’s “blockchain, not crypto” approach, as China’s President Xi Jinping called for aggressive blockchain adoption in October 2019.\nBy contrast, the Chinese government has taken a hostile stance on crypto, banning all crypto transactions in 2021.\nWhile mainland China rejected cryptocurrency development, China’s special administrative region, Hong Kong, has been actively moving into crypto over the past few years.\nOn April 24, Hong Kong’s Securities and Futures Commission approved the first batch of spot Bitcoin\nBTC\n$63,041\nand Ether\nETH\n$3,032\nexchange-traded funds (ETF). With approval, Hong Kong is set to beat the United States in the launch of spot Ether ETFs as the trading launch in Hong Kong is scheduled for April 30.\nMagazine: Woman accused of $6B scam, China loophole for Hong Kong Bitcoin ETFs: Asia Express\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-26","tags":["#Blockchain","#Hong Kong","#China","#Government","#CBDC","#Regulation"],"author":"by Helen Partz","category":null}