{"id":"257bb876-2901-4961-bff7-016573afdaee","article_link":"https://medium.com/real-natsec/the-crypto-correction-shows-the-market-working-b0cdc3d0146f","website_source":"Medium","article_type":"Blog Post","summary":"By Jamil N. Jaffer, NSI Founder and Executive Director, and John Poulson, NSI Public Policy and Government Relations Manager","title":"The Crypto Correction Shows the Market Working","detailed_content":"By Jamil N. Jaffer, NSI Founder and Executive Director, and John Poulson, NSI Public Policy and Government Relations ManagerThis article originally appeared in Barron’s on September 23, 2022. Read the full piece here.This summer has seen chaos in the cryptocurrency market, with major corrections in digital currencies and key crypto institutions. Many looking at this scenario — like former Clinton-era Labor Secretary Robert Reich — believe these events highlight the need for extensive new regulation of this nascent market, including potentially treating cryptocurrencies as tradable securities. In our view, this is exactly the wrong time to be imposing massive new securities-style regulations. The result would be to strangle this new industry or worse, push it overseas.The right approach is to recognize the most recent correction for what it is: the appropriate — albeit belated — functioning of markets to address widespread overextension. The crypto market may be able to benefit from some broad regulatory guidance and basic guardrails to protect consumers and national security, but we ought not let our zeal for regulation drive this important industry into the ground.There can be little question, as many have noted, that crypto has long been dramatically overvalued relative to its fundamentals. As such, not only was the recent correction likely, but it is actually a much-needed remedy to overheated speculation. It demonstrates that traditional market mechanisms can still work well, and that the feverish increase in valuations of both cryptocurrencies and crypto companies was overblown.Crypto’s dramatic rise and disruptive impact also created challenges. The presence of unsavory early adopters — including nation-state actors bent on disinformation, hackers exploiting weak security to get paid, and those hiding illicit financing schemes by governments, terrorists, and other criminals — has sparked a valid backlash from many government officials when it comes to seeing crypto as a legitimate private store of value.However, if we do what many long-time regulators and academics like Reich and SEC Chairman Gary Gensler want — like applying ill-fitting securities laws to this new industry — we may severely stifle our nation’s ability to remain at the forefront of this transformative technology. Though there is little doubt that cryptocurrencies can, if misused, pose a critical threat to our economic and national security, it is also true that, if harnessed correctly, crypto can help maintain American leadership of free and open markets. Likewise, appropriately limited regulation can easily correct some of the excesses we’ve seen to date.To that end, Congress should initially set out a broad policy framework, ideally in bipartisan legislation, like the proposal by Sens. Cynthia Lummis and Kirsten Gillibrand. It sets out the key policy objectives for crypto regulation, including accounting for national security issues, and seeks input from the executive branch about which agencies, if any, ought to regulate in this space and what regulatory approaches they would propose in light of the congressional policy framework. Only after setting out such a framework and getting input back from the executive branch should Congress provide detailed and narrow regulatory authority to one or more federal agencies.Such a process might be longer and more involved than usual. But it is particularly important where, as is true of crypto, there are economic, national security, and innovation imperatives that cut in a range of directions. Moreover, given the speed of evolution in the crypto industry, taking a careful, more deliberate approach to regulation, including getting significant, detailed buy-in from Congress, seems like a better path forward.To be sure, any regulation will have to address the real problems of money laundering, sanctions evasion, terrorism financing, and other criminal behavior we’ve seen in the crypto market, as well as the implications of this new technology for the traditional nation-state monopoly on monetary policy. Many of these challenges can be seen in the Treasury Department’s recent decision to sanction the virtual-currency mixing service Tornado Cash for its use in money laundering and sanctions evasion. A vigorous debate has erupted over whether the use of property-based sanctions is consistent with the law.Ensuring that crypto innovation takes place in free economies and creates more financial inclusion, rather than being hijacked by authoritarian nation-states that seek to control their own people and export repression abroad, is critically important. The open, rules-based, private-market system built by the United States and our allies is the right home for this innovation, not the lands of digital authoritarians and human rights violators.It is more critical now than ever — as the crypto industry works through the correction — that we embrace and encourage its development as a transformative capability with the potential to promote important U.S. economic and national security objectives. Of all the areas in which the government might regulate, this is one where a strong bias in favor of innovation and against rash action is key.Jamil N. Jaffer is the founder and executive director of George Mason University’s National Security Institute. He previously served as a senior executive at a publicly traded cybersecurity company and in national security roles.John Poulson is manager of public policy and government relations at GMU’s National Security Institute. He previously served at the U.S. Department of Treasury as special assistant to the undersecretary for international affairs.","creation_date":"2022-09-29","tags":[],"author":"National Security Institute","category":null}