{"id":"25c39263-2ddf-41ec-a737-d54766231570","article_link":"https://medium.com/@0xOrbLabs/launching-orby-enable-chain-abstraction-on-any-wallet-any-application-any-chain-9d21c55fec07","website_source":"Medium","article_type":"Blog Post","summary":"Today, we are launching Orby, the Chain Abstraction Provider, to enable chain abstraction on any wallet, application, or dev tool. If you…","title":"Launching Orby: Enable Chain Abstraction on any wallet, any application, any chain","detailed_content":"Today, we are launching Orby, the Chain Abstraction Provider, to enable chain abstraction on any wallet, application, or dev tool. If you are interested in enabling a chain abstraction experience for your users, we are now onboarding a limited number of wallets and applications!With the surge in the number of rollups and chains, users need chain abstraction more than ever. In our previous blog post, we discussed the essence of chain abstraction and why current attempts at chain abstraction are incapable of meeting user needs. Orby is our answer to Chain Abstraction.Orby is a single integration that allows every wallet and application to enable chain abstraction. Upon integration, users can simply pull out their wallets, connect to applications anywhere, and seamlessly use all their assets everywhere to interact anywhere onchain. Users no longer need to understand the intricacies of different chains, tokens, and virtual machines. Nor learn new tools, onboard to new systems, or actively migrate assets to various chains.The below demo shows a chain-abstracted experience using an Orby-powered fork of Rainbow Wallet on Uniswap: A user who has 20 USDC on Ethereum, 6 USDC on Optimism, and 4 USDC on Arbitrum can now connect their wallet to Uniswap and swap for $30 worth of WETH on Base in one click.Orby is designed to maximize compatibility with the existing system and minimize the need for drastic changes to existing user behavior. Orby does not require the use of a new chain, account system, or token standard. It is just a simple integration that removes complexity from an already complicated system. Developers who want to enable chain abstraction can access Orby through the OrbyEngine or the OrbyKit.OrbyEngine is a Smart RPC endpoint that connects to all chains, unifies accounts, and formulates intents to fill in the gaps for user wants. In other words, users make requests, and OrbyEngine figures out how to make them succeed. This process of filling in gaps and figuring things out encompasses many things, including but not limited to:OrbyEngine supports all account types (i.e., External-Owned Accounts, Smart Contract Accounts), and account set-ups (i.e., embedded accounts, MPC wallets, etc.). Unlike other attempts at chain abstraction, it does not require an overhaul of the entire blockchain stack. It also does not require users to move to a new account system or migrate their assets, thereby minimizing the barrier to adoption. All it takes to integrate the OrbyEngine is to swap out your RPC endpoint and change a few RPC calls. For most developers, this is no more than a day’s worth of work.OrbyKit is a Chain Abstraction SDK designed to channel the powers of Orby to applications. It is a frontend integration that allows applications to provide a native chain-abstracted experience to their users, regardless of their wallet.OrbyKit:We are onboarding a limited number of wallets and applications to be the first to offer chain abstraction to their users. If you are interested in enabling a chain abstraction experience for your users, reach out to us here!Check out our website to learn more about Orby. Stay tuned for upcoming posts with more details on OrbyEngine and OrbyKit!","creation_date":null,"tags":["Crypto","Web3","Chain Abstraction","Infrastructure","Blockchain"],"author":"Orb Labs","category":null}