{"id":"26393598-d104-4c73-960d-29e0a54e1437","article_link":"https://cointelegraph.com/news/crypto-ai-adoption-microsoft","website_source":"Cointelegraph","article_type":"News Article","summary":"The symbiotic relationship between AI and crypto is still in its nascent stages, according to tech execs.","title":"‘We’re just scratching the surface’ of crypto and AI — Microsoft exec","detailed_content":"Microsoft believes that artificial intelligence (AI) is “the defining technology of our time,” and it has been on the cutting edge of both AI research and investment. \nBut that doesn’t mean the Seattle-based tech giant isn’t paying close attention to the cryptoverse too, including ways that blockchain technology and AI might one day support each other.\nAt the recent Cornell Blockchain Conference in New York, Yorke Rhodes, Microsoft’s director for digital transformation, blockchain and cloud supply chain, was asked how the company viewed this possible intersection of technologies.\n“I do think that as these two technologies progress, you can create agents that bring together the power of both. We’re just scratching the surface,” he said.\nIn a panel discussion titled “Crypto x AI,” Rhodes’ views were further probed by moderator Alex Lin, co-founder and general partner at Reforge, who asked: Will Microsoft have its own blockchain one day?\n“There’s already a massive amount of interesting stuff going on” in crypto, including in the open source community, responded Rhodes, so “why would we try to recreate something that [already] has so much investment?”\nRather, Microsoft’s focus today is more on optimizing existing technologies, such as layer-2 blockchain rollups. Rhodes added:\n“But would we [Microsoft] ever build an L1 blockchain? I don’t think so.”\nCrypto is “well positioned”\nRhodes and Lin were joined on stage at the April 26 event at Cornell Tech by Neil DeSilva, chief financial officer at PayPal Digital Currencies; Matt Stephenson, head of research at Pantera; and Jasper Zhang, CEO and co-founder at Hyperbolic Labs.\nStephenson opined that “crypto is pretty well positioned to be the ‘picks and shovels’ of a certain type of AI,” particularly transformer and diffusion models. This is especially so given the likelihood of a “decentralized, multiagent” AI future.\nStill, crypto may have to play a secondary role to AI’s lead. Rhodes acknowledged that a “massive trend” like AI tends to “suck a lot of the air out of the room” for other emerging technologies, including crypto/blockchain and Web3.\n“It’s a hot topic — intersection or symbiosis between blockchain networks and AI,” commented Lin. But it’s also susceptible to exaggerated claims, and it can be hard at times to separate what’s hype from what’s real.\nThere’s been a lot of talk about decentralized graphics processing units (GPUs), for instance, continued Lin, “but no one talks about latency,” i.e., the time it takes for data to transfer across a network.\nRecent: Does Trump care about crypto? Bitcoin is latest battleground in US election\nThese days, AI requests or recommendations from a centralized network can be obtained fairly quickly. However, due to “latency,” Lin said, decentralized networks won’t produce those results as quickly.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nHyperbolic Labs’ Zhang didn’t think this would be a problem for decentralized networks like blockchains, however. “Inference is doable,” he said.\nTake a centralized network with a data center based in Texas that receives a request from a user in the United Kingdom, for instance. That data request “needs to travel from the U.K. across the ocean to Texas and then back again. So that actually has a very huge delay,” said Zhang.\nBy comparison, with a reasonably sized decentralized network, a user could easily find a node in London to process that request locally, which would “actually reduce the communication overhead.”\nIndeed, Hyperbolic Labs recently launched an AI inference interface on the firm’s decentralized network and achieved latency results comparable to those from centralized solutions, Zhang recounted.\nA growing trend: Small language models\nMuch conversation in AI these days focuses on large language models (LLMs) that require massive amounts of computing power. However, according to Rhodes, “a lot is going on in what you could call edge AI — getting smaller language models that actually run efficiently on phones and on laptops.” That is:\n“There is much more compute available at the edge because the models are getting smaller for specific workloads, [and] you can actually take a lot more advantage of that.”\nMicrosoft has been developing small language AI models that require less training data and computational power to develop and run, including its Phi-3 family of open models. Its capabilities “are really starting to approach some of the large language models,” recounted Rhodes.\nRegulators have AI in their sights\nAI is likely to encounter intense scrutiny from regulators around the world in the coming years, much as cryptocurrencies have. What hurdles did panelists anticipate with regard to governmental rules and regulations?\n“I think the United States, in particular, is bad at it [regulation],” said Lin, who referenced the U.S. Securities and Exchange Commission’s heavy-handed approach to regulating cryptocurrencies. “Now, [SEC Chair] Gensler has come out and said we’re going to regulate AI even more aggressively than blockchain’s digital assets.”\nFintech powerhouse PayPal launched its own USD-pegged stablecoin, PayPal USD\nPYUSD\n$1.00\n, seven months ago, and so Lin asked DeSilva for his take on U.S. regulation.\n“I don’t think the U.S. is bad at regulation,” said DeSilva. “Look at all the innovation that’s here in the United States.”\nSure, it can be frustrating at times dealing with governmental authorities, but “regulators have a mission,” he explained: “Do no harm to customers.” They’re trying to protect consumers, and there’s nothing inherently wrong with that. Or, as he said from the stage:\n“If you want your technology, your innovation, to be used by millions or billions of customers, you’re going to have to engage with regulators.”\nStill, other jurisdictions, including the European Union, are becoming more welcoming to stablecoin issuers, and the U.S. needs to be mindful of that. “If the U.S. doesn’t move faster, that’s an advantage that will fritter away,” acknowledged DeSilva. “The U.S. has struggled with getting the right urgency level there.”\nFinding just the right amount of regulation could be even more challenging with artificial intelligence. It will be difficult for regulators to manage the potential harm to consumers given AI’s opaque decision-making process — the so-called black box problem — “and I think the regulators will struggle with that,” added DeSilva\nThat opaqueness could actually provide an opportunity for blockchain technology with its transparency, immutability and tracking capabilities. Lin said:\n“You [can] have blockchains coming in as a kind of lord and savior, saying: ‘Regulators, we have this mechanism that can clear up the opacity associated with these black boxes.’”\nWherefore AGI?\nLin concluded the session by asking panelists to share their visions of AI’s future. Will artificial generalized intelligence (AGI) become a reality within the next five to 10 years, for example? And what might one expect in the shorter term?\n“In the near future, AI can be powerful enough that everyone will start using it,” predicted Zhang. “Every company will be an AI company, just like every company is an internet company now.”\n“I think in five to 10 years, AGI will become possible,” continued Zhang. “Look at how fast AI models improve now, and with the help of decentralized infrastructure, we can aggregate the compute,” i.e., boosting the overall volume of available GPUs, which should also enable smaller players to participate.\nElsewhere, zero-knowledge proofs (ZK-proofs) “will be gone in three years,” predicted Rhodes, superseded by fully homomorphic encryption (FHE), a technology that achieves zero trust by “unlocking the value of data on untrusted domains without needing to decrypt it,” according to IBM.\nReader: MakerDAO and Aave’s DeFi conflict reopens over DAI’s perceived risk growth\nFHE will solve a lot of privacy problems, said Rhodes, and could be particularly useful for the healthcare industry, including clinical trials that involve sensitive personal data.\nRhodes, summarizing, recalled the words of the Wharton School’s Ethan Mollick: ”The AI that you’re using today will be the worst version of AI you ever use.” The same could be said with regard to ZK-proofs and fully homomorphic encryption. Overall, computing frameworks that secure privacy are going to get much better, he claimed.\nDeSilva has been working in tech and finance for several decades and has seen many concrete predictions come and go. “But I find that optimism [often] wins the day,” he told the gathering, adding:\n“So my prediction is you [will] get to AGI in time, and that it's a beneficial thing for people. That will take everybody’s work.”\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-16","tags":["#Blockchain","#PayPal","#Cryptocurrencies","#Technology","#Fintech","#Microsoft","#AI","#Web3"],"author":"by Andrew Singer","category":null}