{"id":"2646c0fc-2354-4466-99da-577dda2436f1","article_link":"https://cointelegraph.com/news/gamefi-tokenomics-airdrops-here-to-stay-blockchain-gaming-execs","website_source":"Cointelegraph","article_type":"Tweet","summary":"Blockchain gaming tokenomics may have got a bad wrap last cycle, but GameFi execs say it’s not going away anytime soon as it’s one of the key ways to build a player base.","title":"GameFi airdrops are here to stay but won’t save a bad game: Execs","detailed_content":"Despite lingering resistance from some gamers over “tokenomics,” gaming studios will most likely continue to use airdrops and other incentives to attract players, according to industry executives.\n“It’s a very easy way to get market share, said Kieran Warwick, founder of gaming studio Illuvium in an interview with Cointelegraph.\nHowever, games that fail to deliver on the fun, or gameplay aspect, are still doomed to fail, said Warwick.\n\"The problem with that is if you’re using it as a marketing tool and you don’t have a good product to back it up, then your retention is abysmal.\"\nShi Khai Wei, founder of venture capital firm LongHash Ventures, also stressed the importance of making the games fun.\n“Crypto is very good at acquiring users because of incentives — we have airdrops, play-to-earn mechanics and speculative elements, but to keep the players there, you need to have fun gameplay.”\nAxie Infinity was one of the best success stories among blockchain games thus far. However, a $650 million bridge hack, among other things, made it tough for its creator firm, Sky Mavis, to retain users after the last bear market.\n“Games that figure out sustainable economics, the right emission schedules, attracting the right kind of players and incentivizing the right kind of gameplay, those are the games that will survive,” said Wei.\nSource: Robbie Ferguson\nNot everyone is looking to make money\nWarwick acknowledged that token incentives will inevitably attract airdrop farmers rather than real gamers, but it's a necessary evil to grow the player base. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“It also gets us the attention that we need from people who are gamers in the space,” he added.\nHis comments come as Illuvium released 200,000 ILV tokens, worth approximately $25 million, for its six-month Play-to-Airdrop initiative last week.\nThe airdrops will be collectible in Illuvium Arena, Overworld, Zero, and Beyond, which will launch on IMX — an Ethereum NFT-focused layer 2 — at the end of May.\nMeanwhile, Gabby Dizon, co-founder of Yield Guild Games argues that while airdrops can play an important role in speeding up GameFi adoption, “not everyone is necessarily looking for a financial return.”\n“You could be buying an asset that gives you social status in the same way that you might be buying an expensive car or a watch or clothes.”\nGameFi standards still have a way to go\nDizon and Warwick believe GameFi is still about 14-15 years behind where traditional games are now — but they expect that gap to close quickly.\n“The rate of innovation in blockchain is much faster than what you see in the traditional gaming space,” Warwick noted, as a lot of people in blockchain studios came from mainstream ones which built games with “millions and millions of players.”\n“So we’re not starting from scratch, but also at the same time, we are building IP which is the thing that takes the most amount of time — like having people fall in love with the storyline, with the universe that you’re creating and how the characters interact with each other.”\n“All of these elements can’t be created overnight,” he added.\nRelated: ‘FOMO’ once drove GameFi funding, but VCs say it’s different this time\nBuilding IP can take anywhere between up to six or seven years, noted Warwick, adding that the leading gaming studios are about halfway through that process.\nUntil then, we’re still waiting for that dominant GameFi project to push the sector forward like Clash of Clans and Candy Crush with traditional gaming in the early 2010s, says Dizon.\nYield Guild Games is hoping it will see a future game of this caliber, having built a decentralized network of gaming guilds aimed at bringing blockchain games and gamers together within a single community.\nThe future of gaming is all about User-Generated Content. The trend of Players making their own characters, their own levels and expanding their favorite games is not going to stop.\n\nYet for the Digital Economy to take off, you need technologies that ensure the creators own that… pic.twitter.com/S9guU0IGG5\n— Sebastien (@borgetsebastien) March 20, 2024\nWei, however, remains confident that the GameFi industry will finally see a AAA-standard game released in 2024.\nMagazine: Web3 Gamer: Games need bots? Illivium CEO admits ‘it’s tough,’ 42X upside\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-23","tags":["#Blockchain","#Adoption","#Games","#Blockchain Game","#Gaming","#GameFi"],"author":"by Brayden Lindrea","category":null}