{"id":"2741cbe4-3a6b-48ee-8f7b-40806e1bdbae","article_link":"https://cointelegraph.com/news/telegram-ton-tokenizing-emojis-stickers-nfts","website_source":"Cointelegraph","article_type":"News Article","summary":"Founder Pavel Durov outlined plans for the decentralized messaging app to tokenize stickers and power blockchain functionality on The Open Network.","title":"Telegram commits to TON blockchain, plans to support tokenized emojis and stickers NFTs","detailed_content":"Telegram founder Pavel Durov has committed the messaging application's future to blockchain technology, announcing major plans to tokenize features, share ad revenue with users and onboard Tether’s stablecoin at Token2049.\nSpeaking in front of a packed house in Dubai, Durov sang the praises of blockchain’s ability to promote freedom and privacy before outlining ambition plans to build out functionality on The Open Network (TON).\n“The reason we love blockchain. It’s a technology of freedom. We care about freedom. Even our logo, the paper airplane symbolizes freedom to move in three dimensions,” Durov said.\nThe founder of the app, which reportedly has over 900 million monthly users, said the company strives to give its users the ability to build tools, apps and businesses on Telegram.\nRelated: TON continues to attract Web3 firms as Telegram Ad Platform goes live\nDurov said Telegram has adopted a different approach to monetizing user bases than other major messaging and social media platforms, which sell user data to advertisers. Telegram recently announced plans to share revenue with content generators on its platform through its Ad Network.\nDurov described the move as one of the most generous revenue-sharing models in the history of social media. He also said that 50% of the revenue Telegram receives from displaying ads and broadcast channels would be shared with channel owners and content creators using TON’s network:\n“All these transactions, the payments for ads, withdrawals of ads are powered by blockchain. We will use the TON blockchain exclusively for that.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nDurov estimates that the advertising market running on blockchain rails could be worth tens of billions of dollars and that users, from owners of large group chats to content creators, will get a decent share of the revenue.\nRelated: Crypto-like communication devices could break gov’t surveillance — Telegram founder Durov\nThe use of a blockchain protocol will also allow Telegram to mitigate the limited in-app purchase mechanisms enforced by Apple and Google regarding payment processing.\nDespite this, Telegram has allowed app developers and merchants to sell physical goods and services by integrating 40 payment providers, including the likes of Stripe.\nPavel Durov announced plans to allow the tokenization of stickers and emojis on Telegram using the TON blockchain. Source: YouTube\nDurov also said that Telegram has already experimented with tokenization, becoming the first social media platform to tokenize its user namespace. According to the founder, this in-platform market generated $350 million in sales and he said that tokenizing other elements of its platform is in the pipeline:\n“The next step that we are going to undertake is tokenizing Telegram stickers.”\nDurov said that Telegram needs the scalability afforded by TON’s network, which can process tens to hundreds of millions of transactions in the future.\nFollowing Durov’s address at the conference, stablecoin operator Tether announced the launch of U.S. dollar-pegged USDT\nUSDT\n$1.00\ntoken on the TON network. Tether also unveiled the launch gold-pegged Tether Gold (XAUT) stablecoin on TON.\nTON was initially developed by Telegram, but a subsequent legal battle with the United States Securities and Exchange Commission saw the messaging application abandon its development efforts in May 2020.\nA small group of open-source developers then took over the project, which led to the establishment of the TON Foundation in May 2021.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy TON\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Adoption","#Telegram","#Pavel Durov","#Social Media","#TON","#Tether","#NFT"],"author":"by Gareth Jenkinson","category":null}