{"id":"27ad4c3e-c0e0-45d1-a0cc-6a05002fd865","article_link":"https://cointelegraph.com/news/blockchains-money-like-email-stellar-ceo","website_source":"Cointelegraph","article_type":"News Article","summary":"Denelle Dixon believes the success of blockchain protocols will hinge on the ability of traditional finance to move value on- and off-chain.","title":"Blockchains should make money move like email — Stellar Development Foundation CEO","detailed_content":"Blockchain protocols must allow financial assets to move seamlessly across traditional and on-chain infrastructures to achieve mainstream adoption.\nDenelle Dixon, CEO of Stellar Development Foundation (SDF), hammered home this crucial point in a conversation with Cointelegraph during Paris Blockchain Week. \n“From the beginning, we’ve focused on making money move like email, but we really understood that to do that, you needed the on- and off-ramps and couldn’t rely on transacting with volatile cryptocurrencies,” Dixon said.\nThe SDF CEO is a former trial lawyer who went on to work at Yahoo and Mozilla. Reflecting on her journey into the blockchain ecosystem, Dixon credited Stellar founder Jed McCaleb for luring her to the layer-1 protocol.\nSource: Denelle Dixon\nThe former Mozilla chief operating officer added that her decision to work with Stellar was driven by the decentralized protocol’s focus on tokenization and fast, low-fee payments that can impact developing economies.\nRelated: Tokenized asset market could hit $16T on public blockchains — RippleX VP\nShe said that the ability to tokenize assets on Stellar and link seamlessly to fiat payment rails and gateways has been vital in allowing the protocol to provide utility to its users.\nDixon’s background at Mozilla also remains a guiding compass. She said that driving interoperability between major blockchain protocols is a motivating force behind her work:\n“I want this work to be not just for Stellar but to create an interoperability layer across chains and make it so that all blockchains benefit from the hard work that we’ve done.”\nThe blockchain ecosystem of 2024 is home to hundreds of different protocols that offer users varying and debatable degrees of utility. Communities of these various protocols have also become fervent defenders of their respective blockchains, a point that Dixon said detracts from advancing the utility of the underlying infrastructure. She said:\n“It’s really funny. There is tribalism, but sometimes, we continue to promote the tribalism instead of focusing on what’s really true.”\nShe pointed to recent network outages and congestion issues across major protocols, including the likes of Solana and various Ethereum layer-2 protocols, including Base, Arbitrum and Starknet.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“These challenges are actually bad for the blockchain ecosystem because it makes people look over and say, ‘Maybe we shouldn’t get into this,’” Dixon said.\nRelated: $250K Bitcoin? Tim Draper says halving, Bitcoin ETFs will drive demand\nSocial media platforms have become the vehicle upon which this tribalism continues, as users supporting different protocols take potshots at others from time to time. At a higher level, Dixon said there is more thought-share and support than people would realize.\n“There is less tribalism than people actually think at the executive level. Like, people are always saying, ‘You and Brad Garlinghouse from Ripple must not get along,’ but actually we do.”\nDixon added that individuals and organizations that are driving the adoption of decentralized protocols share a common belief that the industry is “not a winner-takes-all market.”\n“Anybody who’s spent any time on the internet understands that. Look what happened when we actually did have five winners take all the content side of the web. That didn’t play out well for anybody who’s trying to compete,” Dixon added.\nRelated: ICP’s Schnorr integration ushers in Bitcoin DeFi era\nThe Stellar Development Foundation launched smart contracts on the Stellar network in February 2024. Dixon said the launch of the Soroban platform was driven by a need for advanced programmability to create a “greenfield space” for developers on Stellar:\n“We really need more developers like developers to take the network from 1 billion operations a month to 10 billion a month, and that’s what I would love to see.”\nCool minds will prevail, Dixon concludes while stressing that utility needs to remain a core focus for blockchain and cryptocurrency proponents.\nMagazine: Ethereum’s ERC-20 design flaws are a crypto scammer’s best friend\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-19","tags":["#Blockchain","#Mozilla","#Event","#Stellar","#Paris","#Adoption"],"author":"by Gareth Jenkinson","category":null}