{"id":"28ab4b5f-faba-4548-88c8-9c5b202ecd05","article_link":"https://cointelegraph.com/news/uk-trade-association-experiments-regulated-liability-network","website_source":"Cointelegraph","article_type":"News Article","summary":"Eleven member organizations are taking part in the experiment focusing on the United Kingdom's RLN.","title":"UK trade association experiments with Regulated Liability Network","detailed_content":"UK Finance, a banking and finance trade association based in the United Kingdom, has announced the beginning of an experimental phase focusing on the U.K. Regulated Liability Network (RLN). Eleven member organizations are taking part.\nThe experimentation will examine technical and legal issues and customer benefits in three use cases. First, it will consider payment-upon-delivery for physical products with an eye to reducing fraud online.\nIt will also look at the homebuying process to improve customer transparency to reduce conveyance fraud — the practice of selling an asset to avoid paying a claim by a creditor. The final case study will use digital money for digital bond settlement.\nThe experiments will align with Project Rosalind, a joint effort of the Bank for International Settlements and the Bank of England that concluded in June. It studied the use of application programming interfaces (API) in banks’ interactions with central bank digital currency (CBDC). The functionality of the U.K. RLN will be examined in a technical sandbox.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: City of London, British trade groups form new digital currency advocacy alliance\nResults are expected to be published this summer. UK Finance released the results of its discovery-phase RLN experimentation in September.\nBarclays, Citi, HSBC, Lloyds Banking Group, Mastercard, NatWest, Nationwide, Santander, Standard Chartered, Virgin Money and Visa are participants in the experimentation.\nSource: Dagnum P.I.\nThe RLN was introduced in November 2022. It places assets and liabilities on the same ledger and focuses on interoperability between regulated forms of money using blockchain. Lloyds Banking Group head of digital and markets innovation Peter Left said in a statement:\n“As a commercially led approach, RLN can unlock new features for customers’ money across a range of retail and wholesale use cases.”\nIn July, the Federal Reserve Bank of New York Innovation Center, the SWIFT global messaging service and nine large financial institutions completed a proof-of-concept to exchange and settle commercial bank deposit tokens and central bank liabilities using a simulated United States CBDC. Participants included Citi, HSBC and Mastercard, which are participating in the UK RLN experimentation as well.\nMagazine: How the digital yuan could change the world… for better or worse\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Business","#United Kingdom"],"author":"by Derek Andersen","category":null}