{"id":"28e468bf-7b82-4efa-a080-960503db7a09","article_link":"https://cointelegraph.com/news/bitcoin-mining-difficulty-86-trillion-halving","website_source":"Cointelegraph","article_type":"News Article","summary":"Bitcoin mining difficulty and hash rate continue to increase ahead of the halving, a major industry event expected to occur in eight days.","title":"Bitcoin mining difficulty sets new high pre-halving","detailed_content":"Update April 15, 10:40 am UTC: According to the Hash Rate Index, the Bitcoin hash rate only reached a high of 630 EH/s in March.\nBitcoin mining difficulty has experienced another adjustment before the Bitcoin halving, hitting a new all-time high of 86.4 trillion, according to data from BTC.com.\nThe latest adjustment, which occurred on April 10, increased the Bitcoin mining difficulty by 3.4% from the previous difficulty level of 83 trillion, which was set on March 28.\nThe difficulty of mining Bitcoin\nBTC\n$62,997\ncontinues to grow ahead of the historic halving event, which is poised to cut miner rewards by 50%.\nThe past five Bitcoin mining difficulty adjustments as of April 10. Source: BTC.com\nThe latest Bitcoin mining difficulty adjustment is likely the last one before the halving.\nAccording to BTC.com, the next Bitcoin mining difficulty adjustment will occur in 13 days, or around April 24. In the meantime, the Bitcoin halving is expected to occur in eight days on April 19, according to data from M2.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nBitcoin mining difficulty measures how hard and time-consuming it is to mine a new block or solve mathematical puzzles under Bitcoin’s proof-of-work (PoW) consensus mechanism.\nBTC mining difficulty adjustment occurs every 2,016 blocks, or approximately every two weeks, as Bitcoin is programmed to self-adjust the difficulty level to maintain a target block time of 10 minutes.\nThe mining difficulty directly depends on the Bitcoin blockchain hash rate, a unit measuring miners’ computational power to produce new BTC.\nIn line with the increasing Bitcoin mining difficulty, the BTC hash rate has seen a significant rise recently, surging from around 619 exahashes per second (EH/s) on March 28 to 696 EH/s on April 10, according to BTC.com.\nRelated: Bitcoin miners may ‘fear’ the halving, but they cherish it too\nAccording to data from BitInfoCharts, the Bitcoin hash rate reached an all-time high of 727.9 EH/s on March 24. Other charts like Hashrate Index indicate that the Bitcoin hash rate didn't post such a high in March, only reaching a high of 630 EH/s in March.\nBitcoin hash rate three-month chart. Source: BitInfoCharts\nSome analysts predict that the BTC hash rate will likely drop after the upcoming Bitcoin halving in 2024.\nAccording to Galaxy’s mining analysts, as much as 20% of Bitcoin’s current hash rate could go offline after the Bitcoin halving, as many miners will likely turn off their mining rigs due to lowered efficiency.\nThe analysts said that more than 70% of the Bitcoin hash rate was churned out by eight ASIC miner models by the end of 2023.\nMagazine: Synthetix founder: It’s DeFi that’s wrong, not the market\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-11","tags":["#Bitcoin","#Blockchain","#Bitcoin Mining","#Halving","#Bitcoin Halving","#Hash Rate"],"author":"by Helen Partz","category":null}