{"id":"292711fd-7a53-47a2-b860-9c2a200bdada","article_link":"https://www.wired.com/sponsored/story/loro-piana-is-shepherding-the-future-of-fashion-thanks-to-blockchain-technology/","website_source":"Wired","article_type":"News Article","summary":"Its exclusive The Gift of Kings® wool collections will be certified and authenticated via the Aura Blockchain Consortium.","title":" Loro Piana Is Shepherding the Future of Fashion Thanks to Blockchain Technology","detailed_content":"THE LORO PIANA shirt in our writer’s hands is so soft they’re struggling to believe it’s real, even though they know that the fibers come from the rural region of Sidonia in Australia, that the yarn was spun in Verrone, Italy, and that it was woven in Sillavengo, Italy. This knowledge is all thanks to the QR code on the shirt’s label and hangtag.\nScanning the QR code takes them to the shirt’s entry on the Aura Blockchain Consortium—a blockchain that is equally owned by a who’s who of luxury companies: LVMH, OTB Group, Prada, Richemont, and Mercedes-Benz. \nA Loro Piana analyst assessing the quality of some fibers.\nYou’ve likely heard of the blockchain, but if you’re still in the dark about what it is, a blockchain network is essentially a shared, digital ledger of transactions which, once recorded, can’t be changed or tampered with—although they can be viewed by anyone. Take, for example, our writer’s shirt. They can claim ownership of it by using the pin code they were given on purchase, as well as see the details of how it was made and its care instructions—all by scanning the QR code on the label. And if they were to try and sell it, potential buyers could verify that it’s an authentic Loro Piana shirt—that the seller owns—by looking it up on the Aura Blockchain Consortium before its ownership is officially transferred—with this transfer being recorded on the blockchain for anyone to see.\nCreated in April 2021, the Aura Blockchain Consortium was built in an effort to innovate, push sustainability (it’s pledged to be carbon neutral by 2025), and give customers transparency.\nThe use of blockchain technology in luxury markets has two obvious upsides: It will be harder for scammers to try and pass off fake luxury goods as genuine items when they don’t have the proper QR code. Sellers of stolen luxury goods will also have a hard time when the blockchain shows that they don’t own what they’re selling.For Loro Piana, the use of the blockchain is a natural next step in its technical evolution, since it’s one of the few luxury fashion companies to be vertically integrated. It has grown over the years from a family of wool fabric merchants in the 19th century to the innovator it is today—a company that controls its entire production process. Today, Loro Piana sources its own raw materials, manufactures them, and retails its wears, offering its customers a unique end product that has been quality controlled all the way back to the fiber it’s made from.\nNot every Loro Piana item is certified via the Aura Blockchain Consortium—yet. The luxury brand is rolling out the technology starting with its most exclusive offering: those made from the finest merino wool there is, The Gift of Kings®. Specifically, its Spring/Summer 2023 The Gift of Kings® Ready to Wear collection, as well as 20 individual The Gift of Kings® pieces that will be sold at its new Palo Alto store to celebrate its launch—and which come with their own exclusive NFTs created by artist Charlotte Taylor, which can only be transferred if the garment’s ownership is transferred.\nProducts made with The Gift of Kings® wool fiber are highly sought after, seeing as there are just over 4,400 pounds of it produced every year by Loro Piana’s local breeding partners in Australia and New Zealand. Loro Piana holds its annual Record Bale event to award one of these wool breeders the title of “Finest Merino Wool in the World”—with the all-time record being 10.3 microns. The Gift of Kings® fibers are, on average, around 12 microns thick (our writer’s shirt fibers are 12.6 microns in diameter, according to its entry on the Aura Blockchain Consortium). Compare this to the red blood cell of a human, which is 5 microns, and the average human hair, which is 80-100 microns in diameter, and you can see why it’s so special—and worthy of digital authentication and certification.\nThe Gift of Kings® collection being added to the Aura Blockchain Consortium is just the start for Loro Piana—it plans to roll out the technology across its Excellences collections in the future. But, for now, it’s exciting to see how this new technology could revolutionize the fashion industry and give customers like our writer the transparency they crave in a digital world.\n1 / 5\nThe shorn wool is scoured to remove any dirt or dust before being packaged and shipped to the manufacturing facilities in Italy.\nThis story was produced by WIRED Brand Lab for Loro Piana.","creation_date":"2023-03-16","tags":[""],"author":null,"category":null}