{"id":"294ec1b6-3ff3-4dc7-ae2a-d6e8c8b3664b","article_link":"https://cointelegraph.com/news/okx-ethereum-layer-2-lower-fees-interoperability","website_source":"Cointelegraph","article_type":"News Article","summary":"OKX becomes the latest cryptocurrency exchange to launch an Ethereum-based layer 2 network.","title":"OKX launches Ethereum layer-2 network for lower fees & interoperability","detailed_content":"Cryptocurrency exchange OKX has joined the likes of Coinbase in launching an in-house Ethereum-based layer-2 network to provide lower fees and interoperability for users interacting with decentralized applications.\nOKX’s launched the public mainnet of X Layer, its zero-knowledge proof powered network, on April 15. The network was built using Polygon’s chain development kit (CDK) and enables shared state and liquidity across multiple blockchain networks using the Ethereum scaling protocol’s Aggregation Layer.\nAn announcement shared with Cointelegraph notes that X Layer provides faster, cheaper transaction capabilities when interacting with on-chain applications. The network uses ZK-proofs, the underlying technology used by various Ethereum layer-2 networks for improved security and scalability.\nRelated: Ethereum layer 2s to hit $1T market cap by 2030: VanEck\nX Layer is EVM-compatible, allowing developers to launch or migrate Ethereum-based decentralized apps (DApps) without having to rewrite the underlying code.\nA statement from OKX chief marketing officer Haider Rafique notes that X Layer and other layer-2 networks are set to become integral infrastructure for an interconnected Web3 ecosystem.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“We are building an ecosystem that is as seamless and interoperable as possible. We think X Layer has limitless potential thanks to our strong community and its connectivity with other Ethereum-based networks,” Rafique said.\nOKX launched the mainnet beta of X Layer in November 2023, which attracted more than 50 Web3 DApps to launch on the testnet. OKX notes that DApps including the Graph, Curve, LayerZero, QuickSwap, Galaxy and Timeswap are in the process of deploying on its proprietary layer-2 network.\nX Layer will allow OKX users to transfer assets, deposit and withdraw cryptocurrencies on OKX and access nearly 200 DApps offering token swaps, staking and smart contract functionality. OKX’s native OKB token acts as X Layer’s native token and is used to pay gas fees on the network.\nRelated: Ethereum ecosystem needs a major mindset shift for global impact, says Vitalik Buterin\nPolygon CDK is touted to provide symbiotic benefits for OKX, X Layer and other chains connected to Polygon’s AggLayer. X Layer essentially connects to other chains built on Polygon CDK through the AggLayer, which allows for the transition of liquidity between these chains.\nAccording to Polygon CEO Marc Boiron, this creates an interconnected network of liquidity across different blockchain protocols\n“X Layer’s connection to the AggLayer solves the fragmentation of liquidity and users across chains on the AggLayer so they can all grow together. OKX’s 50 million users now have an easy path to onboarding to X Layer and all the other chains connected to the AggLayer.”\nInvestment management firm VanEck estimates that Ethereum layer-2 networks could exceed $1 trillion in market capitalization by 2030. These networks have become integral to helping Ethereum achieve scale, powering low-fee, secure and decentralized transactions and applications. \nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-16","tags":["#Blockchain","#Ethereum","#Scalability","#Layer2","#zk-Rollup","#zk-STARK"],"author":"by Gareth Jenkinson","category":null}