{"id":"2bcd35b3-3478-453a-b190-0e3c9e9e8d1d","article_link":"https://cointelegraph.com/news/bitget-wallet-announces-ecosystem-fund-onchain-layer","website_source":"Cointelegraph","article_type":"News Article","summary":"The ecosystem fund is denominated in Bitget Wallet’s native token, BWB, which is scheduled for debut this quarter.","title":"Bitget Wallet launches $10M ecosystem fund alongside Onchain Layer","detailed_content":"Crypto exchange Bitget is looking to create its own on-chain ecosystem by following the footsteps of exchanges such as Binance, OKX and KuCoin. \n“The Bitget Onchain Layer will not only integrate a host of native DApps [decentralized applications] within Bitget Wallet through joint collaboration with builders,” according to a Bitget statement shared with Cointelegraph on May 15. “Concurrently, a $10 million BWB Ecosystem Fund has also been established, dedicated to accelerating the development of the Bitget Onchain Layer and supporting aligned projects,” it added.\nBWB is the native token of the exchange’s namesake self-custody wallet analogous to the Trust Wallet token (TWT). Meanwhile, the exchange itself also has a native token, BGB, which can be used to offset trading fees similar to Binance’s BNB\nBNB\n$574\ntoken, KuCoin’s KCS token and OKX’s OKB token. \nInitially, the Bitget OnChain Layer Ecosystem Fund will be dedicated to investing in and incubating various Web3 trading services. There are currently three pre-market price aggregators, an on-chain derivatives market and trading bots that will complement Bitget Wallet’s interchain swap service, according to the exchange. \nBitget Wallet is currently one of the more popular self-custody wallets in the Asia-Pacific region, with over 20 million users. The wallet’s native token, BWB, is scheduled for launch this quarter, with 5% of its 1 billion maximum supply reserved for community members in its pre-generation event. After launch, BWB will power the Bitget Wallet and OnChain Layer ecosystem through governance voting, eligibility for participation in Launchpad events, staking rewards and payment of multichain gas fees. \nThe Bitget OnChain Layer and its ecosystem. Source: Bitget\nThe move follows Bitget’s efforts to facilitate day-to-day trading and expand to all aspects of the crypto ecosystem. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBinance, the world’s largest crypto exchange, first launched its own BNB blockchain in September 2020. Around the same time, Trust Wallet — created by Binance and now a separate legal entity — launched its own TWT token, which has since surpassed a fully diluted market cap of $1 billion. In 2021, the decentralized exchange PancakeSwap became the first billion-dollar project on the BNB Chain. \nSimilarly, crypto exchange OKX has built its own self-custody wallet and Web3 Marketplace for trading nonfungible tokens, interacting with decentralized applications, and trading novel inventions such as Bitcoin Runes, Ordinals, Atomicals and BRC-20 tokens. On May 13, the OKX Web3 Marketplace became the largest exchange for trading Bitcoin Runes, with a 51.08% market share. \nRelated: Bybit to launch Notcoin trading and withdrawals next week\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Cryptocurrencies","#Business","#Cryptocurrency Exchange"],"author":"by Zhiyuan Sun","category":null}