{"id":"2be6af94-f451-4d12-ad6d-4b40b4ccb92e","article_link":"https://cointelegraph.com/news/google-sues-china-crypto-app-racketeers-report","website_source":"Cointelegraph","article_type":"News Article","summary":"Approximately 100,000 users have downloaded fraudulent apps from Google Play, but the amount of user funds lost remains unknown.","title":"Google sues alleged China crypto app racketeers: Report","detailed_content":"Google’s parent company, Alphabet, has filed a lawsuit against two people based in China for using the company’s platform for scam cryptocurrency apps that amassed over 100,000 downloads.\nAlphabet claims that scammers used its platforms, Google Play and YouTube, to upload and advertise fraudulent crypto apps.\nThe online giant alleges that the defendants engaged in a pattern of racketeering after committing hundreds of acts of wire fraud. The lawsuit was filed Thursday, April 4, in a federal court in New York, according to an April 4 Bloomberg report.\nThe scam apps were designed to look like genuine digital asset investments aiming to persuade users to deposit their funds, which users could never withdraw.\nDespite Google continually removing fraudulent apps, many have bypassed its fraud detection systems. The two scammers first started uploading the racketeering apps in 2019.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe lawsuit is a crucial step for safeguarding the platform’s users, wrote Halimah DeLaine Prado, Google’s general counsel:\n“This litigation is a critical step in holding these bad actors accountable and sending a clear message that we will aggressively pursue those who seek to take advantage of our users.”\nRelated: Funds hacked in 2024 increased by 15.4% vs. the same period in 2023 — Immunefi\nCrypto phishing scams up 50% in March\nApproximately $71 million was lost to phishing scammers in March across all chains from 77,529 victims, which is a 50% increase compared to February, according to an April 2 X post by Scam Sniffer.\nStolen funds from crypto scams in March. Source: Scam Sniffer\nA total of $173 million worth of digital assets were lost to phishing scams in the first quarter of 2024, with 90% of the stolen assets being ERC-20 tokens on the Ethereum network.\nPhishing scams are a form of social engineering scams where attackers convince victims to share sensitive information or install malicious software of their own accord.\nHacks and exploits have been a growing concern in the crypto industry, especially for decentralized finance applications. A total of $1.8 billion was lost to crypto hacks and scammers in 2023, of which 17% can be attributed to the North Korean Lazarus Group, according to a Dec. 28 report by Immunefi.\nRelated: Crypto.com expands in South Korea despite increasing regulatory scrutiny\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-04","tags":["#Blockchain","#Cryptocurrencies","#Google","#Fraud","#China","#Scams"],"author":"by Zoltan Vardai","category":null}