{"id":"2c479fe9-f354-4e16-9d7d-7cf771145a33","article_link":"https://cointelegraph.com/news/cosmos-patches-bug-ibc-protocol-saves-126m","website_source":"Cointelegraph","article_type":"Tweet","summary":"IBC has always had the bug, but it only recently became exploitable due to developments in the protocol’s codebase, Asymmetric Research said.","title":"Cosmos patches ‘critical’ IBC protocol bug, saving $126M","detailed_content":"Cosmos developers have fixed a “critical” security bug in its Inter-Blockchain Communication (IBC) protocol that put at least $126 million at risk, said a blockchain security firm that privately notified Cosmos of the issue.\n“We privately disclosed the vulnerability through the Cosmos HackerOne Bug Bounty program and the issue is now patched,” Asymmetric Research said on April 23.\n“No malicious exploitation took place and no funds were lost,” it added.\nSource: Asymmetric Research\nThe bug could have allowed a reentrancy attack, allowing a hacker to mint infinite tokens on IBC-connected chains such as Osmosis and other decentralized finance ecosystems on Cosmos.\n“We believe at least 126M+ in assets could have been stolen on Osmosis. However, rate limiting on Osmosis slows down the damage that could be caused.”\nRate limits serve to prevent or at least mitigate attacks that attempt to overwhelm a system by controlling the rate at which requests are made.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAsymmetric noted the bug has existed in ibc-go, a high-level programming language implementation of IBC, since it launched in 2021.\nHowever, the bug only recently became exploitable after Cosmos devs launched a new third-party application called IBC middleware, which allows tokens of the ICS20 interchain token standard to cross chains.\nRelated: Cosmos Hub greenlights ATOM inflation cut for security boost\n“This issue demonstrates how easy it is to break trust assumptions and introduce new vulnerabilities by adding new features and functionality. It is also another example of the importance of defense-in-depth,” Asymmetric emphasized.\n“This vulnerability highlights the critical need for more research into cross-chain security risks to protect the multichain ecosystem better.”\nThe bug was patched up by Cosmos dev Carlos Rodríguez about three weeks ago, a GitHub commit shows.\nAnother “critical” security vulnerability was identified in the IBC protocol in October 2022, which impacted all IBC-connected chains but was patched before any potential exploit.\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-24","tags":["#Blockchain","#Altcoin","#Research","#Business","#Security","#Hackers","#Cybersecurity","#Hacks"],"author":"by Brayden Lindrea","category":null}