{"id":"2c794d68-ce23-4ef1-872e-fdbb6531da85","article_link":"https://cointelegraph.com/news/bitkraft-launches-275-m-gaming-fund-web3-total-managed-assets-1-billion","website_source":"Cointelegraph","article_type":"News Article","summary":"The company’s latest investment round is its largest to date.","title":"Bitkraft launches $275M gaming fund, bringing total managed assets to $1B","detailed_content":"Bitkraft Ventures, a global investment platform for gaming and media projects, recently announced the launch of a $275 million investment round. Once completed, the added projects will reportedly bring the company’s total assets under management to around $1 billion. \nThe company’s previous rounds included investments in notable companies such as blockchain developer Jungle and Eve Online creator CCP. Its second funding round, dubbed Venture II, largely focused on Web3 and blockchain games.\nThe latest round will go toward early-stage gaming projects. Dealstreet Asia also reported that at least 15% of the funds have been earmarked for projects in the Asian sector.\nJens Hilgers, a founding partner at Bitkraft Ventures, told GamesBeat that the company was interested in the next generation of studios, developers and games. Per the article:\n“At Bitkraft Ventures, we are as committed to — and optimistic about — the future of the games industry as we were from the inception of Bitkraft in 2016. We’ve seen continued growth across all major game platforms, in metrics including user engagement, activity levels, and monetization. Newly formed game studios have seen substantial break out successes over the last years, and the advent of AI in game production further benefits new upstarts in the space.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nWhile the gaming industry experienced a notable global decline in revenues in 2023, Web3 projects have seen a substantial recovery since the fourth quarter of 2023 — a bump many analysts credit to the Bitcoin bounce.\nRelated: Bitcoin’s 2028 halving price target is $435K, historical data suggests\nIn a recent interview with Cointelegraph, Carlos Pereira, partner at BitKraft Ventures, said, “Web3 gaming has been a strong segment in the Q4 2023 recovery with positive launch activity, both recently and expected for 2024.”\nIf this latest funding round, Bitkraft Ventures’ largest to date, is any indication, then the private market appears to have recovered. As for publicly traded gaming and media companies, Pereira told Cointelegraph that when capital wasn’t abundant for venture capital deals, it was to be expected that there would be some divergence between the public and private markets.\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-05","tags":["#Blockchain","#Business","#Venture Capital","#Investments","#Games","#Web3","#NFT","#Gaming"],"author":"by Tristan Greene","category":null}