{"id":"2dbfcab6-ae97-426d-9dcd-db58a580d3b4","article_link":"https://cointelegraph.com/news/binance-backed-pstake-finance-launches-bitcoin-liquid-staking-solution","website_source":"Cointelegraph","article_type":"News Article","summary":"pSTAKE is among the most recent protocols making Bitcoin a yield-generating asset with more capital efficiency.","title":"Binance-backed pSTAKE Finance launches Bitcoin liquid staking solution","detailed_content":"Binance Labs-backed liquid staking protocol pStAKE Finance has unveiled its liquid staking solution for Bitcoin in the latest development for Bitcoin-native decentralized finance (DeFi).\npSTAKE Finance’s solution, built on top of Babylon’s Bitcoin staking protocol, aims to simplify the Bitcoin staking process and offer additional yield generation opportunities for Bitcoin (BTC) holders.\nThe protocol decided to build Bitcoin-based staking solutions from a fundamental belief in the world’s oldest cryptocurrency, aiming to make it a yield-generating asset, according to Mikhil Pandey, the co-founder and chief strategy officer of pSTAKE Finance.\nPandey told Cointelegraph:\n“Having fundamental faith and belief in Bitcoin, yields, and constantly identifying and solving crucial problems in this industry are some of the reasons behind moving in Bitcoin’s direction. The opportunity to make Bitcoin a yield-generating asset, something that hasn’t existed inherently, is very exciting. Yield-generating Bitcoin is powerful for all ecosystems and not just Bitcoin L2s.”\nThe initiative is part of a wider movement known as Bitcoin DeFi (BTCFi), which aims to bring DeFi capabilities to the world’s first blockchain network.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nInvestor interest in Bitcoin-native DeFi solutions started growing with the 2024 halving, which also saw the launch of Bitcoin Runes — a new protocol for issuing fungible tokens on the Bitcoin network.\nThe independent venture capital (VC) arm of Binance, Binance Labs, has also shifted its focus to BTCFi ahead of the halving after announcing an investment in Bitcoin-native restaking protocol BounceBit on April 11.\nRelated: BTCFi is an ‘enormous opportunity’ to make Bitcoin a productive asset — Stacks\nThe launch of the liquid staking solution marks pSTAKE’s first endeavor into Bitcoin-native DeFi, after building its liquid staking protocol on Cosmos for the past three years.\nBTCFi is making Bitcoin a yield-generating asset for the first time.\npSTAKE’s new solution is among many protocols aiming to make Bitcoin a yield–generating asset.\nAt the beginning of May, Hermetica announced the launch of the first-ever Bitcoin-backed synthetic United States dollar with yield-generating capabilities. Slated for release in June, the new synthetic dollar, USDh, will offer users yields of up to 25%.\nAccording to pStake’s co-founder, the BTCFi industry is seeing the culmination of various promising products that make Bitcoin more capital-efficient. However, he believes that there’s still more development needed before BTCFi could match Ethereum-level DeFi. Pandey explained:\n“Ethereum’s tech had to go through a lot of evolution before the actual DeFi Summer in 2020. The Bitcoin DeFi landscape will likely follow a similar journey of development and progress before we see a full-fledged BTCfi Summer.”\nHowever, making Bitcoin a more versatile asset holds a significant financial opportunity, added Pandey:\n“With less than 1% of the Bitcoin market cap in DeFi today, we could see huge growth as we develop more secure and reliable ways to generate yield on Bitcoin.”\nRelated: Stacks active accounts reach record high amid growing interest in Bitcoin DeFi\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-15","tags":["#Bitcoin","#Blockchain","#Decentralization","#Bitcoin Price","#Bitcoin Halving","#DeFi","#Staking","#Bitcoin Ordinals"],"author":"by Zoltan Vardai","category":null}