{"id":"2dd28448-b231-48fb-a20f-10574fb865a3","article_link":"https://cointelegraph.com/news/liquid-staking-bnb-smart-chain-millions-stuck-defi-bridge-contracts-finance-redefined","website_source":"Cointelegraph","article_type":"News Article","summary":"Arkham Research notified DeFi wallet owners to look at the addresses and try to retrieve their funds, which have been stuck for months in bridge contracts.","title":"Liquid staking on BNB Smart Chain, millions stuck in DeFi bridge contracts: Finance Redefined","detailed_content":"Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\nThe past week in DeFi saw BNB Chain announce native liquid staking on its BNB Smart Chain (BSC). The move is set to help ecosystem participants secure the network while keeping the liquidity of their assets.\nDeFi protocol Chainlink launched a cross-chain protocol that makes cross-chain smart contracts more interoperable across nine blockchain networks.\nIn other news, Arkham Research flagged nearly half a dozen DeFi wallets with millions in assets stuck in DeFi bridge contracts.\nBNB Chain will enable native liquid staking on BSC\nBNB Chain said it would enable native liquid staking on its BNB Smart Chain as part of its shift to migrate the BNB Beacon Chain’s functions to BSC as the former is wound down.\nIn an announcement sent to Cointelegraph, BNB Chain noted that the BNB Beacon Chain will be completely shut down by June 2024. However, the company said it will transfer its features to the BSC before it closes.\nBNB Chain said that enabling liquid staking on BSC will allow ecosystem participants to secure the network while keeping the liquidity of their assets. While the organization did not give a specific date for the rollout of the liquid staking feature, BNB Chain said it will happen in April or May.\nContinue reading\nChainlink debuts new protocol aimed at boosting cross-chain interoperability\nChainlink’s Cross-Chain Interoperability Protocol (CCIP) has entered general availability to foster more cross-chain connectivity. The protocol lets developers use CCIP permissionlessly for cross-chain token transfers and arbitrary smart contract messaging across different blockchain networks.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nDevelopers will also be able to send and trigger function calls on smart contracts deployed on other blockchains, making cross-chain smart contracts more interoperable.\nCCIP’s mainnet general availability will enable a faster and easier implementation for developers, bolstering cross-chain connectivity, according to Sergey Nazarov, co-founder of Chainlink.\nContinue reading\nEigenLayer on the brink of potential yield crisis\nEigenLayer, the largest restaking protocol on Ethereum by total value locked (TVL), could be facing a “major” yield crisis, according to industry watchers.\nDue to EigenLayer’s rapid growth in TVL, the protocol may be outgrowing its Actively Validated Services (AVS), which could lead to a major yield reduction, according to Chudnov, a pseudonymous builder at 3Jane derivatives exchange.\nEigenLayer removed the limits on all liquid staking tokens (LSTs) on April 16, according to an X announcement. EigenLayer launched on mainnet on April 10.\nWhen a user stakes an LST via EigenLayer, it is automatically delegated to a node operator, which uses the deposits to secure an AVS on EigenLayer while receiving staking rewards.\nPart of the staking rewards are passed on to the user. Yet AVS on the protocol require much less staked Ether for security, which could lead to issues in the future.\nContinue reading\nWallets linked to Coinbase and Vitalik Buterin have millions “stuck” in bridge contracts\nDozens of crypto whale wallets with assets ranging from six to seven figures are stuck on multiple DeFi bridge contracts.\nArkham Research reported that most of these bridge protocols are native contracts and thus require the users to manually retrieve funds, which many of these whales have forgotten. The firm also tagged and asked linked users to check if they could access and retrieve funds stuck for months.\nOne of these whale wallets is linked to Ethereum co-founder Vitalik Buterin, who has over $1 million worth of assets stuck for over seven months. Another wallet linked to Coinbase also appears to have been forgotten for several months, and some other wallets have assets unclaimed for over two years.\nContinue reading\nDeFi market overview\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most trading in the red on the weekly charts. The total value locked in DeFi protocols fell below $100 billion.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\nExchange or buy BNB\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-27","tags":["#Blockchain","#Coinbase","#Cryptocurrencies","#Binance","#Binance Coin","#DeFi"],"author":"by Prashant Jha","category":null}