{"id":"2e6a2ab6-f96a-43f4-8c34-31e6a6ae2d38","article_link":"https://cointelegraph.com/news/binance-gets-fiu-approval-india-return","website_source":"Cointelegraph","article_type":"News Article","summary":"Besides Binance and KuCoin, several other platforms received the regulatory notice in December last year followed by a ban in January this year.","title":"Binance obtains FIU approval for India return","detailed_content":"Global cryptocurrency exchange Binance has obtained approval to offer its services in India from an Indian financial regulator called the Financial Intelligence Unit (FIU).\nThe recent approval makes Binance the second off-shore crypto exchange to get a regulatory nod after KuCoin.\nAccording to a report published in CoinDesk, Vivek Agarwal, the head of FIU, said that Binance is now a registered entity.\nBinance and KuCoin were among nearly a dozen foreign crypto exchanges that received a notice of noncompliance in December 2023. Within 15 days of notice, the Indian Finance Ministry told its IT department to block URLs and mobile applications’ access to the banned crypto platforms in India in mid-January 2024.\nHuobi, Kraken, Gate.io, Bittrex, Bitstamp, MEXC Global, and Bitfinex also received the regulatory notice.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nFollowing the ban, several crypto platforms started working with the Indian regulatory body to obtain FIU compliance and offer their services to Indian customers. While KuCoin and Binance managed to find their way back, the likes of OKX and BitStamp have closed their services in the country.\nAlthough the FIU registration reports surfaced today, Cointelegraph reported in the third week of April that Binance will likely return to India after paying a $2 million fine for noncompliance.\nRelated: Taxman: India’s new tax policies could prove fatal for crypto industry\nAfter India imposed a hefty 30% tax on crypto gains and a 1% tax deduction at source on every crypto transaction, many Indian investors fled to foreign crypto exchanges to bypass the tax regime. At the peak of the tax drain, Binance reportedly accounted for 90% of the total trading volume from India.\nDespite having a thriving crypto market, with most of the major crypto exchanges looking to set foot in the country, India has cooled on the crypto heat map owing to its tax impositions and lack of regulatory clarity. A large chunk of crypto traders and crypto-centered businesses have shifted overseas, while the few crypto exchanges that have remained continue to struggle to garner investor trust due to a lack of banking facilities.\nCointelegraph reached out to Binance and FIU for comments but had yet to receive a response at publishing time.\nMagazine: Bitcoin Halving will pump games, Shrapnel’s ‘simple’ secret revealed: Web3 Gamer\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-10","tags":["#Bitcoin","#Blockchain","#Adoption","#India","#Binance","#Regulation"],"author":"by Prashant Jha","category":null}