{"id":"2fb7c60a-04f8-4324-8b56-75b7cb3221fb","article_link":"https://cointelegraph.com/news/paris-blockchain-week-recap-optimism-abounded-bitcoin-halving-approaches","website_source":"Cointelegraph","article_type":"News Article","summary":"From Tim Draper's $250K BTC prediction to Ubisoft’s newest web3 game, Paris Blockchain Week didn’t disappoint.","title":"Paris Blockchain Week recap: Optimism abounded as the Bitcoin halving approaches","detailed_content":"Paris Blockchain Week, a three-day insider event featuring panels, discussions, and presentations from a diverse group of global industry leaders, has now concluded its fifth annual gathering.\nCointelegraph was on site to capture the highlights, and there were plenty. As we turn the page in our calendars and begin preparing for the next big event — the Bitcoin halving predicted to occur on or about April 20 — here’s a recap of what you missed in France at Blockchain Week.\nBTC to hit $250K?\nVenture capitalist and Tim Draper, whose list of unicorn investments includes such noteworthy companies as Tesla, Baidu, Coinbase, and Twitch, believes Bitcoin could thrash its current all-time-high price of around $72K per coin by the end of the year.\n“If I had to predict, maybe we could see $250,000 by the end of the year; I mean, it’s looking pretty good,” Draper told Cointelegraph in an interview.\nCrypto market to hit $100T?\nIf Draper’s cool quarter-million prediction for BTC isn’t bombastic enough, eToro CEO Yoni Assia told Cointelegraph they believed the global cryptocurrency market would reach a capitalization of $100 trillion over the next decade. For comparison, gold, the precious metal, has a global market cap of about $16.18 trillion as of the time of this article’s publication.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBut that might not be the most interesting prediction Assia gave us. They also told us that “the crypto community will be the first to identify singularity,” a hypothetical point in future human history where an artificial intelligence (AI) entity becomes effectively more capable (or intelligent) than any human, “because it’s very hard to define what consciousness is.”\nBinance turns the page\nMany companies wouldn’t face having to pay a $4.3 billion settlement to the U.S. government with optimism and aplomb, but Binance has moved on.\nAccording to Binance executive Catherine Chen, the company is looking forward to the challenges it faces in the wake of the settlement. During a panel discussion moderated by Cointelegraph’s editor-at-large Kristina Cornèr, Chen said the monitoring restrictions placed on the company would ultimately prove to be a net positive for the industry:\n“It is a challenge, but it’s a welcome challenge, and we fully embrace it because we know that that would be great for the market.”\nChen on stage at Paris Blockchain Week discussing Binance’s settlement. Source: Paris Blockchain Week\nETF inflows uneven\nAround 90% of Bitcoin ETF inflows are still retail according to Jan van Eck, CEO of American investment management firm VanEck. The traditional banking and institutional investment sectors have, so far, been seemingly reluctant to dive into the BTC ETF market.\nJan van Eck on stage at Paris Blockchain Week. Source: Gareth Jenkinson\n“You’ve had some Bitcoin whales, and some other institutions move some assets in, but they were already exposed to Bitcoin,” van Eck told Cointelegraph, adding that the end of April might see some further inclusion by non-traditional investors.\nDubai to ease burdens for small investors\nMatthew White, CEO of Dubai's Virtual Asset Regulatory Authority (VARA) told Cointelegraph that the new system, if implemented, would place the bulk of the regulatory financial burdens on the largest players:\n“The cost of compliance is borne by the larger systemic players, and this allows the smaller players to come into the ecosystem, be regulated, but also not have to suffer the same sort of level of costs of compliance that we’ve got.”\nVARA CEO Matthew White discussing regulations at the Paris Blockchain Week stage. Source: Paris Blockchain Week\nUbisoft teases new game\nAAA gaming giant Ubisoft, the publisher behind Assassin’s Creed, Ghost Recon, Rainbow Six, and numerous other gaming franchises, took the stage to discuss its newest web3 title, a blockchain-based competitive PVP turn-based role-playing game called “Champions Tactics.”\n“We must understand the market and how we launch this kind of game,” he said. “That’s really what we want to achieve here. We want to give the players the power to populate the game with figurines and understand what it means to own your gaming assets.”\nUltimately, Paris Blockchain Week turned out to be another optimistic gathering of like-minded entrepreneurs and professionals highlighting the challenges, opportunities, and triumphs in our industry.\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-13","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Cointelegraph","#Business","#Bitcoin Price","#Cryptocurrency Exchange","#Tim Draper","#AI","#Games","#Bitcoin Halving","#eToro","#DeFi","#Blockchain Game","#Web3","#NFT","#Gaming"],"author":"by Tristan Greene","category":null}