{"id":"2fb93456-d30e-4212-854a-2e37236f1202","article_link":"https://cointelegraph.com/news/solana-network-nowhere-near-where-we-expect-solana-foundation-exec","website_source":"Cointelegraph","article_type":"Tweet","summary":"Austin Federa, head of strategy at the Solana Foundation, addresses concerns around the latest network outages in an exclusive interview with Cointelegraph.","title":"Solana network ‘nowhere near where we expect it to be’ — Solana Foundation exec","detailed_content":"The goal of the Solana project is to build the world’s fastest network that is open, permissionless and decentralized — but that goal is still far away, admitted Austin Federa, head of strategy at the Solana Foundation. \n“From a user experience perspective, the network is nowhere near where we sort of hope and expect it to be,” Federa told Cointelegraph during an interview on the sidelines of Paris Blockchain Week. \nAccording to Federa, the congestion that has plagued Solana is a byproduct of its success, which has been driving an unexpectedly high amount of activity to the network.\n“The charitable view of this is a failure of success, this huge demand for the Solana block space,” he said, adding that Solana is processing more transactions per second than Ethereum layer 1s and layer 2s combined. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nOn the other hand, he admitted that Solana developers should have been able to anticipate the demand spikes affecting the network by implementing the necessary upgrades in time.\n“The estimation between what the demand for Solana would be versus when this thing needed to be upgraded and fixed, those things did not line up,\" Federa explained. \nTo know more about Federa’s view on the future of Solana and possible solutions for network congestion, check out the full interview on Cointelegraph’s YouTube channel.","creation_date":"2024-04-17","tags":["#Blockchain","#Altcoin","#Business","#Transactions","#Adoption","#Solana","#NFT","#Layer2","#Transaction Fee","#Memecoin"],"author":"by Marco Castrovilli","category":null}