{"id":"30fe6e02-432f-46a9-8cd8-5dc2266c0159","article_link":"https://cointelegraph.com/news/libra-token-trader-loss-0l-network-hard-fork","website_source":"Cointelegraph","article_type":"News Article","summary":"“Forking out wallets without community input is theft,” according to the trader, who also claims to be part of 0l Network’s marketing team.","title":"Trader loses 7-figure sum due to 0L Network hard fork","detailed_content":"An unfortunate trader allegedly lost over a million dollars worth of cryptocurrency due to the 0L Network hard fork.\nPseudonymous trader NN lost the amount as a result of a hard fork that was not approved by the community, according to a May 8 X post:\n“The team behind @0LNetwork ($LIBRA) decided to hard fork because of a ‘rogue core’ member. This fork resulted in a wipeout of 4% of the total supply, also burning innocent people’s wallets, including tokens purchased almost 2 years ago.”\nThe pseudonymous trader said that he purchased 147 million Libra tokens back in February 2023, worth approximately $1.47 million at the time, before he joined the protocol to assist with marketing efforts.\nLibra’s value has fallen over 58% since May 3 to trade above $0.001 as of 12:35 pm UTC, according to CoinGecko data. \nLibra/USDT. Source: CoinGecko\nAccording to NN, the team had already been aware of the bug for over two years, with certain insiders abusing it. However, the team decided to ignore the issue due to the Libra token’s lack of value. The trader wrote: \n“The team allowed this ‘malicious’ act to persist for over 2 years. Only now, when the tokens gained significant value, did they decide to act. Meanwhile, many buyers, including myself, purchased OTC tokens fairly and are now suffering the consequences of unjust behavior by a team that did not take responsibility for their fault.”\nSource: NN\nThe hard fork was the result of a smart contract bug that enabled insiders to unlock vested tokens faster by distributing them across multiple wallets. However, the loophole is still present in the newest version of 0L Network, v7, according to the pseudonymous trader.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nInstead of fixing the loophole, the team decided to fork out all the wallets they considered to have exploited the loophole. NN claimed that the team was “fully aware that innocent wallets would be affected,” as tracing back all the tokens was impossible. NN wrote:\n“The blacklist was made internally, as a marketing team member, I couldn't see the fork list. The list was generated by an algorithm designed by one of their own, Hemulin (0D’s right hand), who ironically had also exploited the loophole in the past.”\nDespite buying tokens from six different validators, NN’s wallet was forked out due to a single validator that the team considered rogue. According to the trader, other victims have also been mistreated and kicked out of the Discord group.\nRelated: How Binance played a key role in arrest of ZKasino scam suspect\nWas the pseudonymous lead designer of 0L Network previously charged by the SEC?\nWhile the identity of 0D, 0L Network’s pseudonymous lead developer, is unknown, multiple validators told NN that they could be Lucas Geiger, the founder of the OpenLibra project. Geiger was previously charged by the United States Securities and Exchange Commission with fraudulent behavior.\nGeiger is also the co-founder of Wireline, which raised $20 million in March 2018 for a decentralized peer-to-peer developer and business network. Despite the raise, no network was developed, and the promised WRL ERC-20 tokens have yet to be distributed to investors. \nIn January 2021, the SEC levied a $650,000 fine against Wireline for an unregistered securities offering and alleged fraud involving Wireline Developer Fund, the firm’s Cayman Islands-based subsidiary.\nRelated: Solana could flip Ethereum in transaction fees within a week: Report\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-08","tags":["#Blockchain","#Cryptocurrencies","#Fraud","#Decentralization","#Scams","#DeFi"],"author":"by Zoltan Vardai","category":null}