{"id":"310d154c-f3d9-43e1-b7e1-f38c76d55c5e","article_link":"https://cointelegraph.com/news/binance-ban-philippines-sec-fund-retrieval-investors","website_source":"Cointelegraph","article_type":"News Article","summary":"SEC official Paolo Ong said that they’ve already given users three months and extended it a little to allow users to withdraw their funds from the exchange.","title":"Philippines SEC ‘can’t endorse’ ways to retrieve funds after Binance ban","detailed_content":"In a local news report, Paolo Ong, the officer in charge of the SEC’s PhiliFintech Innovation Office, said that the SEC couldn’t endorse ways to retrieve funds after Binance is blocked by internet service providers (ISP) in the country.\nOng said that the regulator has already given a three-month warning and extended the time before the ban is implemented to give investors enough time to remove their funds from the exchange.\nThe official hoped that investors would have already transferred their funds to either a local exchange or their wallets within the specified time frame.\nWhen queried about the fate of users unable to withdraw their funds in time, Ong stated that they do not have any suggested means for users to reclaim their money. He said:\n“Unfortunately, we can’t endorse any method on how to take out their money now that the blocking order is out.“\nOn March 25, the National Telecommunications Commission (NTC) ordered internet service providers (ISPs) in the country to immediately block access to Binance. The NTC gave local ISPs five days to complete the order.\nPhilippine NTC orders ISPs to block Binance immediately. Source: BitPinas\nWhen asked why the exchange is still somewhat accessible in the country even after the notice, Ong said they are still working to implement the ban fully.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nCointelegraph checked and found that the Binance website was still accessible in the country at the time of writing.\nRelated: SEC Philippines to investigate Binance over alleged illegal operations\nOn June 8, 2022, former Binance CEO Changpeng Zhao said in a press briefing in Manila that the exchange was seeking licenses in the country. \nHowever, Ong noted that the SEC received no applications from the exchange to formally register in the country. Ong said:\n“As far as the SEC is concerned, there is no official or formal application to register here in the Philippines.”\nThe official also noted in the interview that the SEC had warned the public several times before they proceeded with a ban. In 2022, the SEC published a notice warning the public not to invest in Binance. The regulator said the exchange does not possess the authority or license to solicit investments in the country.\nMagazine: Memecoins make millionaires, Terraform and Do Kwon liable for fraud, and more: Hodler’s Digest\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Philippines","#SEC","#Binance","#Exchanges"],"author":"by Ezra Reguerra","category":null}