{"id":"336acc56-0aa6-4dcf-9c42-849d6b355183","article_link":"https://medium.com/@thelemonking/i-was-a-crazy-crypto-miner-dabebc276306","website_source":"Medium","article_type":"Blog Post","summary":"A true story of how I went all-in mining cryptocurrencies during the first gold rush of Bitcoin in 2013.","title":"I was a crazy crypto miner","detailed_content":"It\nwas a cold March night in 2013 in the city of Ylöjärvi in Finland. I was a college student with no money for rent, food, bills, or anything really. I was waiting for the clock to turn midnight when the monthly student welfare would be paid to my bank account. When the day officially changed, I withdrew a couple hundred euros from an ATM. But it wasn’t for bills or food. That money was earmarked for gassing up the car and driving to another city in the middle of the night to buy a used graphics card. Getting that card ASAP was my top priority in life.F\nast rewind a couple of weeks back, a friend of mine asked me if I had heard of something called Bitcoin. There was supposedly this Internet currency that had been rapidly gaining value, and anyone could mine it on their computer. Bitcoin was trading at about 15 euros a piece and it got me interested enough to read up on it and to figure out how mining works. To mine Bitcoin, you must harness your computer’s processing power in the quest of solving extremely complex mathematical problems.Other miners in the network are doing the same and the Bitcoin protocol automatically rewards the first one to get to the correct answer with Bitcoins. Due to the difficulty of the calculations, every miner in the network is essentially trying to guess the answer. The more guesses your machine can do per second, the more likely you’ll get it right. As more miners join the network, the problems get more difficult and earning coins slows down. Here’s a more in-depth explanation of the process.After some rough calculations, my computer’s hashing power would have yielded only 0.05 Bitcoins (0.75€) per day, which would not be worthwhile considering the cost of electricity. But there was another cryptocurrency, Litecoin that stole our attention. It was marketed as the “silver for Bitcoin’s gold” with faster transaction times, cheaper price and much faster mining due to it’s lower popularity. There were Cryptocurrency exchanges online enabling you to trade Litecoins for Bitcoins, euros and dollars. Mining Litecoins was far more profitable and my computer was able to eke out almost two Litecoins (5€) in a day. I started thinking about ways to scale the operation up as much as possible!The main component used in mining was the computer graphics card. Motherboards, processors and RAM memory did not play an important role at all. As long as your hardware had a PCI-E slot for a graphics card and a power supply capable of running it at full power, you could efficiently mine cryptocurrencies. I used to buy and sell a lot of computer hardware, so I had extra motherboards and other components lying around, but only a few graphics cards.I whipped up an improvised secondary computer from spare parts and took it as a test to my friend’s student dormitory where the electricity was “free”. Upon returning home, I rounded up all my computer parts and concluded that I could immediately run a total of five graphics cards spread across three computers at home. I just needed more cards, but there was an issue: I was completely broke, with overdue bills and the rent a few weeks late.I\nwas living on student welfare, totalling to about 500 euros per month. I also owned a car which was a luxury I really couldn’t afford. At the end of the month I was always scrambling for money, late on my bills and hoping I could find a way out of it. Mining cryptocurrencies seemed like a real opportunity to finally “make it”. I firmly decided to spend all of my money not on the rent, nor on my overdue bills, but on more graphics cards from nearby online sellers. I now had a total of three cards mining Litecoins day in, day out, yielding about 12€ of profit per day. The income already almost equaled my student welfare and I had no intention to stop expanding!Next up, my eyes were firmly set on a very specific date: March 4th, 2013. At midnight that day, I would receive my next student welfare payment. I had arranged the pickup for a new card for that night at 1:00 AM, just an hour after the money would land on my account. With my car running on fumes, I drove to a gas station, pulled the money out of an ATM and gassed up my trusty steed for the nightly drive. One more card, check!I spent the rest of the money next day to buy that fifth card with a cash deal in the city center. I tried to set aside some money for food and bills, but knew very well it wasn’t going to get me even through the rest of the week. Having food to eat was a minuscule goal compared to maxing out my mining specs.Mining cryptocurrencies requires a lot of power, which equates to a lot of heat. Running my miners at full power caused extreme overheating and I didn’t want to limit their speed. I did what any crypto-crazy miner would have done: I stripped out all the components from the miner cases and laid them on a table, bare, with all wires connected. I shoved the table against my kitchen ventilation window so the components could bask in the chilly air flowing inside.It looked like a true fire hazard with no cases, cables hanging everywhere and everything exposed. Instead of being able to press the power button of a computer case, I was now turning the computers on and resetting them by short-circuiting the motherboard pins with a screwdriver. But man did they run cool. Even at peak power, the card temperatures were far below the max, making them work for prolonged periods without crashing.By\nnow I was making a profit of about 20 euros per day. To expand, I would have to acquire even more base components and graphics cards. I sold all my valuable belongings and the mined coins as soon as they were coming in. With these and the help of buy now, pay later services, I was able to buy new top-end motherboards, second hand graphics cards to fill them up and the hefty power supplies required to run them. I was also able to rack up a pretty admirable debt in the process!I crammed yet another miner on the kitchen table, one next to the backyard door and a third one in the middle of my living room floor. No cases, propped up on cardboard boxes and operated via my trusty screwdriver. There were a total of 14 graphics cards mining coins, yielding about 55 euros of profits every single day. The cash flow was hard to argue against so I kept reinvesting everything on mining.I upgraded all my cards to the newest HD7900 series, which brought about a 50% boost in hashing power. I then populated even my bedroom with a mining rig, shooting up my profits to 80 euros per day! I had installed TeamViewer on my smartphone to fine tune my miners, even when I wasn’t home. It felt like doing an on-call shift 24/7 with multiple incidents occurring every single day, just to maximize my profits.Upgrading the cards had raised my farm’s total power consumption to over 5 kilowatts. I had already distributed the miners to multiple areas in the apartment before to avoid blowing individual easy-to-replace fuses, but now it didn’t matter where the miners were located anymore. Mining at full power and flipping on the stove or going to the sauna could have blown the main fuse of the apartment. I couldn’t add a single card more.It\nwas July 2013 and the warmest month of the year in Finland. Ambient temperatures in my crib eventually crept up to a shocking 43 degrees celsius (109°F) during daytime. I didn’t have to worry about going to the sauna anymore, I was living in one.The combined noise of all the cards’ fans spinning at 100% was deafening and resembled the sound of operating a vacuum cleaner, times three. I asked my neighbors if they had heard any noise, just to be sure I wouldn’t bother them. I myself was already numb to it.To optimize my miners, I started running them slower during the day and cranked em’ up at night. I now kept switching between different cryptocurrencies, depending on which one was the most profitable to mine at any given moment. I may have woken up mining Litecoin and switched to Worldcoin or Feathercoin by lunch. It was the only way to maintain high profitability. I even set up an alarm system for any price changes and it sure kept me on the edge day and night.W\nhen the summer was nearing its end, the weather cooled down and the living conditions in my apartment became humane again. I was able to run my miners at acceptable speeds again, especially at night.The influx of new people entering the crypto mining game during the summer had dropped my daily mining profits to 30–40€ per day. Meanwhile, my monthly electricity bill was hovering somewhere around a thousand euros. I was barely breaking even, but I kept on going, hoping to mine the right coin at the right time.Once winter officially arrived, I cranked up my miners to full speed. Even so, the ambient temperature in my apartment was only 10 degrees celsius (50°F) with all doors and windows open. I was dressed in full winter clothing to fight the cold and wore shoes because the floor was close to freezing temperature.I slept my nights on the living room couch with the aforementioned alarms blaring in case a miner had crashed or if I had to switch the mined coin. I was enjoying some of my greatest profits so far, gaining a good 100 euros per day on average, but I was also battling a new foe: snow.Yes, the spring, summer and autumn rains were a blessing when it came to temperatures, but snow is floaty. Snowflakes of all sizes would fly in through the doors and windows and land on my mining clusters. Snow and electricity don’t mix well, so I devised various types of plastic and cardboard shelters, under which the miners could hide. But it wasn’t enough.I woke up to a crashed miner alert. It had been snowing heavily and the snow had landed on the miner shelter next to the backyard door. The melted snow accumulated into enough water to drip through the cover and crash the miner. I dried up the components and used my screwdriver to short-circuit the start button pins; maybe it could still work?My action was immediately met by a negating flash of fire originating from the miner’s 700 euro Radeon HD7990 dual GPU graphics card. It seemed as if someone had lit a big fat match inside of my crown jewel card, rendering it into trash metal. It cost me a big bunch of my profits, but times were good so I was able to recoup the losses in no time.E\nven though mining was extremely profitable, there were new FPGA and ASIC miners being developed in China, which would soon render graphics card mining futile. They were purpose-built pieces of hardware dedicated to mining cryptocurrencies, constantly driving down coin prices due to increased hash rates. I decided to hang tight as long as mining was even slightly profitable. There was still bread for the taking. And then something big happened: the release of Dogecoin.It was based on the wildly popular doge meme and had no real use cases or purpose. Being a huge fan of doge, I directed all my hashing power over to mine it, even though you couldn’t even sell it anywhere yet. I was betting hard on the fact that a useless meme coin had immense potential to go viral and end up precious.I managed to mine millions and millions of Dogecoins before it was inevitably listed on an online exchange. I welcomed the opening price with open arms and proceeded to unload them all for a profit of almost 10,000 euros. It was the big fish I had been waiting for. This was followed by a few more months of gradually lowering mining profits, after which I decided to call it quits.I sold whatever equipment I still could, trying to recoup as much money as possible from my battle-worn miner army. I paid off all my debts, bills and rent, and the cold realization hit me: I had nothing left over to show for it. A year of full-time effort spent, living in inhumane conditions, becoming a nervous wreck. And nothing?Back then it did indeed feel like nothing. But now those experiences are cherished memories of boldly jumping into the unknown, self-discovery and never staying stagnant in the progress of technology.And hey! At least I got a nice story to tell about it.If you enjoyed the story, feel free to follow my account for more goodness in the coming weeks ❤️","creation_date":"2022-10-18","tags":[],"author":"Lemon King","category":null}