{"id":"33781622-2047-402f-9ce5-1018d9d86d4a","article_link":"https://medium.com/@vechainofficial/vechain-tech-update-series-april-2024-4fc2f54f168f","website_source":"Medium","article_type":"Blog Post","summary":"Welcome to the April tech update, VeFam! Our fast-growing developer teams have been working tirelessly, building new and upgraded…","title":"VeChain Tech Update Series — April 2024","detailed_content":"Welcome to the April tech update, VeFam! Our fast-growing developer teams have been working tirelessly, building new and upgraded solutions for our ever-expanding platform in pursuit of our vision of a Web3-powered, tokenized and sustainable global economy.Looking ahead at Q2 of 2024, we’ve a packed tech roadmap, and, as always, lots to look forward to. VeChainThor, our battle-tested blockchain, continues building in preparation to onboard the inevitable tidal wave of real world blockchain adoption that lay ahead.On February 28th, we proudly launched a new ecosystem on VeChainThor — VeBetterDAO — a unique dApp and DAO platform that embodies the concept of ‘X-2-Earn’. At its core, activities logged on VeChain’s blockchain can be rewarded, incentivizing engagement with all kinds of sustainability-related decentralized applications, as well as platform governance.The launch of VeBetterDAO marks the culmination of a long evolutionary journey for VeChain, building on almost a decade of successes to launch a platform aimed at driving mass adoption across society, both for businesses and individuals. Upcoming regulations, most notably in Europe with MiCa and environmental regulations, present myriad opportunities for the future of our newest ecosystem.Ahead of mainnet launch, our teams are working on new dApp onboarding flows and enhanced ‘explore dApps’ UI. In parallel, Governance and Treasury mechanisms are being built, as are the quadratic voting and funding mechanisms that will ensure a fair and proportional voting environment for users.The Galaxy Membership (GM) program — our NFT-based user privilege/reward system — is being upgraded and the B3TR<>VOT3 swap UI design is being re-evaluated. These mechanisms, as well as others, are explained in the new VeBetterDAO Whitepaper, and expected by mainnet launch, targeting VeChainThor’s 6th anniversary.We’re excited to bring this game-changing platform to mainnet, and drive a new phase of Web3 adoption across the economy.A Beta of our white-label NFT marketplace platform (MaaS) recently launched, going live in collaboration with MotoGP world champions, Gresini Racing. Check it out, here!MaaS sees VeChain continue our pioneering approach to blockchain adoption, leveraging the no-code principle applied to VORJ. By removing the need for deployers to have Web3 developer experience, adoption becomes simple and seamless. Our devs teams are now busy integrating feedback to finalize various features ahead of its full public launch.MaaS features ‘social logins’, a method of wallet management that abstracts away seed phrases and private keys, instead offering users a more familiar ‘Web2’ experience, logging in and accessing assets through their username and password.MaaS will also support ‘phygitals’ (physical products with NFT/chip powered digital twins), helping VeChain accelerate the global tokenization movement. The MaaS team have onboarded an NFT checkout provider, and are in active discussions with a global payment service provider for direct fiat on/off ramps.We foresee a future where tokenization, NFTs and phygitals become a mainstay of commerce and community engagement. MaaS, VORJ and other VeChain-powered no-code tools are helping ‘take the blockchain out of blockchain’, creating a more seamless onboarding experience and accelerating the real world adoption of Web3.Our expanded core protocol team has issued a new update to Thor.Notably, the update increases the block gas limit from 30M to 40M, increasing default cache size to 4GB. From a user interface perspective we refactored our API from Swagger to Stoplight, improving usability and functionality. Alongside the aforementioned, the update is accompanied by various dependencies, code coverage and refactors.Upgrade your public nodes and Authority Masternodes to the latest version of Thor as soon as possible. See the release notes, here.The new X-Node Reward platform (found here) is considered functionally complete, with the team deploying the new X-Node marketplace, direct transfer functionality, upgrade functions as well as claim and historical claim overviews.The team is currently focused on delivering better performance and efficiency.We are in the process of releasing the third phase of our official website — with a launch target of May.We’re delivering a streamlined, optimal experience for users, whether enterprise, builder, or simply curious, making key resources readily accessible.We’ll announce its launch via our official Twitter/X account — stay tuned!We are working on upgrades to our Ledger Live application, further improving its quality and reliability.You can download VeChain’s Ledger Live application, here.Development on VeWorld, our home for all things VeChain, continues in earnest, with multiple streams of development underway, including updates to the VeWorld browser extension.VeWorld has a dedicated team constantly building, and providing support for users. Download VeWorld for mobile or desktop, here.The current upgrade pipeline includes:In terms of numbers, VeWorld is bordering on an impressive 900k installations, generating over 1.1 million transactions so far. We also recently launched VeWorld in France.VORJ allows users to deploy smart contracts, mint tokens, integrate APIs and more, without a need for coding, and without transaction or usage fees.We continue removing barriers to entry for new users, and, in tandem with MaaS, we are enhancing the potency of the platform even further.Current focuses for VORJ are mostly performance and infrastructure related.We recently released our new SDK, together with all required documentation. Our SDK is strongly aligned with Hardhat and ethers.js, aiming to offer builders a rich and familiar development experience all in one place.Download the packages here.While the team continues to iterate on additional features and enhancements, feel free to contribute any feedback on the repository.Building the future of Web3 mass adoption is no easy task, however, following the launch of our Technology Centre, we’ve been able to greatly accelerate the pace of tool and documentation development, better supporting both Web3 and business builders.In an era of institutional adoption, tokenization, and growing demand for sustainability from regulators, especially in Europe, VeChain’s rich experience, professional tech teams and close relationships with leading global partners position our blockchain, VeChainThor, as a major beneficiary of this new era of global economic development.As always, we welcome community feedback and input — join our social channels and communities, build with us and let’s march together, towards a Web3 world!Onwards, VeFam!VeChain, headquartered in San Marino, Europe, is the curator of VeChainThor, a world-leading smart contract platform spearheading the real-world adoption of blockchain technology, and a proud pioneer in the field of real world asset tokenization (RWA), having worked with companies in the area since 2015.By leveraging the capabilities of ‘trustless’ data (information without intermediaries), smart contracts, and IoT technologies, VeChainThor has enabled enterprise solutions across a wide array of fields.VeChain now turns its attention to the greatest challenge of all — building digital ecosystems to drive sustainability and digital transformation at global scale.Learn more about VeChain on vechain.org","creation_date":"2024-04-23","tags":[],"author":"vechainofficial","category":null}