{"id":"33f35898-91f6-46a4-8ce3-534d80f34338","article_link":"https://cointelegraph.com/news/nigeria-crypto-reputation-will-prevail-exchange-chief","website_source":"Cointelegraph","article_type":"News Article","summary":"Oladotun Akangbe, the chief marketing officer of Flincap, stated controversies in the Nigerian crypto space are to be expected, considering the country’s growing crypto adoption.","title":"Nigeria’s crypto reputation will prevail despite recent setbacks — Exchange exec","detailed_content":"Nigeria’s global reputation in cryptocurrency is in potential jeopardy due to recent government crackdowns on local exchanges. However, Oladotun Wilfred Akangbe, the chief marketing officer of the Flincap crypto exchange, believes the country can weather the storm.\nIn an interview with Cointelegraph, Akangbe expressed concerns about Nigeria’s image in the international crypto market following recent events. However, he stated that Nigeria has overcome more severe setbacks in the past.\nIn February, the Nigerian government used the country’s telecommunication providers to prevent local crypto users from accessing the websites of various crypto exchanges like Binance, OctaFX and others.\nAuthorities then accused Binance of illegally moving $26 billion out of the country and invited Binance to send representatives to discuss the issue.\nRelated: Nigeria’s Binance crackdown threatens Web3 industry\nBinance executives Tigran Gambaryan and Nadeem Anjarwalla visited Nigeria in February in response to allegations that the exchange manipulated the country’s fiat currency, the naira. \nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHowever, the Binance execs were detained and charged with five counts related to money laundering after meeting with Nigerian officials about Binance’s regulatory issues. Anjarwalla subsequently escaped custody and was tracked down to Kenya, where he faces extradition.\nAkangbe pointed out that controversies in Nigeria’s crypto sector are to be expected, given the country’s growing crypto adoption. He highlighted Nigeria’s significant role as a cryptocurrency user and blockchain adopter worldwide and remains optimistic about the future of crypto in the country:\n“We can turn it around by projecting the fact that we are one of the biggest users of cryptocurrency and adopters of blockchain across the globe. It is normal to have a few controversies in a place where there is so much massive growth. The future remains bright for cryptocurrency in the country.”\nAkangbe said the current sentiment in Nigeria toward crypto is a mix of enthusiasm and caution. While there is excitement around the crypto industry’s potential, concerns linger about regulations, cryptocurrency volatility, and the risks of scams and fraud. \nAkangbe clarified that the uncertainties are due to the back and forth between the Nigerian government and stakeholders in the crypto space. Local crypto analysts have expressed disappointment with the government’s unfriendly attitude toward crypto in resolving the nation’s foreign exchange challenge.\nMagazine: Bitcoin hits new highs, SEC delays options decision, and stablecoin bill looms: Hodler’s Digest, March 3–9\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Law","#Government","#Nigeria","#Cryptocurrency Exchange","#Binance","#Regulation"],"author":"by Amaka Nwaokocha","category":null}