{"id":"3426b474-2234-44a4-8b3e-26a1c264929f","article_link":"https://medium.com/degate/degate-monthly-update-apr-24-f59ce4933799","website_source":"Medium","article_type":"Blog Post","summary":"Welcome to DeGate April 2024 Ecosystem Update!","title":"DeGate Monthly Update (Apr ‘24)","detailed_content":"Welcome to DeGate April 2024 Ecosystem Update!DeGate is live on Mainnet!DeGate is a ZK-Rollup Orderbook DEX that allows you to Trade easy, Sleep easy. It enables spot trading with limit orders while you self-custody your funds. DeGate has no fees for Maker orders and very low fees for Taker orders. It offers distinctive trading features — decentralized grid strategy and DCA. Trade on DeGate DEX now: https://app.degate.com/.Trading Volume and More Tokens!In April, DeGate’s monthly trading volume was $556 million, marking a 51% increase compared to last month. The all-time volume has now surpassed $1 billion.The number and variety of tokens available for trading continue to grow. As of this writing, there are 143 trading pairs, covering the most popular ones.Perhaps you’ve noticed that some tokens from non-EVM chains are also trading on DeGate. Have you seen, for example, $NEAR, $SOL, $WIF? Users have expressed a desire to also trade non-ERC-20 tokens, so we are working around the clock to bring them to DeGate. The first batch of these tokens was bridged to DeGate through Wormhole. We are continuously exploring solutions to bring in more assets, aiming to satisfy user needs as much as possible.Product UpdateGrid Strategy UpdateThe single-token investment feature for Grid Strategy is now live! Users can now invest using only one token, the quote token of the pair, to open a Grid Strategy. Previously, users needed to allocate two tokens to create a Grid Strategy, a process more akin to setting up a Uniswap LP. However, based on user feedback, we realized many of you prefer the ease and simplicity of creating a Grid Strategy with just one token. The Details section of a Grid Strategy has been adjusted accordingly, presenting essential data that help users quickly understand key performance indicators like Grid Profit and Total Profit.DisconnectA ‘Disconnect’ button has been added to the user interface. When a user closes the browser tab of the DeGate App, the sensitive information temporarily saved in the SessionStorage of the user’s local browser is cleared automatically. Generally, closing the browser tab equates to disconnecting the wallet. However, feedback indicated that users are accustomed to manually clicking ‘Disconnect Wallet’ when exiting a dApp, as it provides a confirmatory sense that their wallets are disconnected. To align DeGate more closely with user habits, we have added this feature.Podcast with Mountain ProtocolA new podcast featuring DeGate evangelist Alvin and the CEO of Mountain Protocol is now available on Taiwan’s top influencer Bonnie’s YouTube channel. In this episode, the guests delve into discussions about stablecoins, inflation, and the advantages of using USDM. Alvin highlighted the unique benefits of USDM on DeGate — its flexibility for trading while being rebased daily.As of today, DeGate remains the leading exchange for USDM trading.ConferencesToken 2049April featured the hottest crypto event of the year, Token 2049 in Dubai, an event DeGate could not miss. Despite facing the most significant rainfall Dubai has seen, Token 2049 proceeded as scheduled. Hardcore participants, including DeGate evangelists, attended the event. We gathered valuable feedback from conference participants about DeGate, established new industry connections, and rekindled relationships with users, partners, and influencers.SEA Blockchain WeekDeGate, in collaboration with Katashe Solutions and FILLiquid, held a successful side event during SEA Blockchain Week in BKK. The event featured a live product demo to a select group of forward-thinking builders, investors, and industry leaders. The event also featured a #DEI panel, emphasizing the significance of diversity, equity, and inclusion in driving positive change within the tech industry. Palmy Veerapat Keerati (COO Bitkub) and Proud Limpongpan (President, Ennovie) delivered compelling insights on stage, highlighting how DEI initiatives can yield tangible business results.DeGate’s product showcase garnered considerable interest, showcasing its expanded token offerings, competitive fees, and emphasis on self-custody. Valuable feedback was collected, guiding DeGate towards achieving Product Market Fit (PMF).DeGate is looking for talented contributors. Check out this linkDeGate is a spot order book DEX on Ethereum built with Zero-Knowledge technology. In addition, DeGate offers a decentralized grid trading and DCA functions.Users can expect super-low gas fees that are the result of DeGate’s special Efficient Gas Saving technology. This innovation ensures significant gas savings while maintaining a decentralized protocol.DeGate also enables permissionless listing, meaning that any token can be listed in a permissionless manner through an open listing mechanism. DeGate Mainnet is live on https://app.degate.com/?s=mediumTrade| Website | Twitter | Discord | Telegram | YouTube | Contact | Join","creation_date":null,"tags":["Ethereum","Dex","Layer 2","Blockchain"],"author":"DeGate Team","category":null}