{"id":"3509240c-92f7-4abc-9ce1-281ee148de10","article_link":"https://cointelegraph.com/news/korean-university-launches-metaverse-private-student-access","website_source":"Cointelegraph","article_type":"News Article","summary":"The school’s metaverse was built by LG Uplus to cater to tech-savvy college students.","title":"Korean university launches metaverse with private student access","detailed_content":"South Korean telecom provider LG Uplus, a subsidiary of LG, recently launched a metaverse experience at Yonsei University in Seoul.\nThe Yonsei metaverse, aptly dubbed “Meta Yonsei,” features a recreation of the university’s Sinchon campus complete with traversable landmarks such as the school’s auditorium and library, as well as tiered access to digital resources and private meeting places for faculty and students.\nSource: LG Uplus, via Chosun Biz.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nUnlike many metaverse experiences, Meta Yonsei limits many of its features to verified students. While it appears prospective students and other outsiders can virtually walk around the campus to view its features and landmarks, access to peer meeting tools and certain areas within the metaverse is limited to registered students.\nPer an article in Chosun Biz, a local newspaper, the Meta Yonsei experience has been well-received by students at the campus.\nTypically, metaverse experiences aimed at specific communities, such as universities, tend to focus on the social aspects. As such, they tend to be aimed at prospective students or business partners. In action, these treatments tend to resemble digital museums rather than action spaces.\nHowever, the Meta Yonsei digital twin was apparently designed with productivity in mind. Tools such as a team meeting function featuring virtual workspaces, video and audio conferencing, and automated annotation and captioning are implemented directly into the experience. This gives students an impetus to participate in the metaverse throughout their academic careers.\nThis could also help prepare students for the realities of the modern global workplace where productivity tools such as Google Meet and Zoom and cross border collaboration between diverse workforces in real time have become the norm.\nRelated: The metaverse is coming straight to your web browser: Here’s how\nStudents and faculty can also interact through structured check-ins and supervised activities. A report from the project’s announcement in 2023 indicates that up to a thousand users can attend virtual events in the metaverse’s auditorium — a digital doppelganger of the university’s real installation — including the ability to watch guest speakers and experts on a virtual stage.\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#South Korea","#Metaverse","#Web3"],"author":"by Tristan Greene","category":null}