{"id":"358cbb20-bf55-4aa3-8e62-e8625086ef74","article_link":"https://cointelegraph.com/news/ethena-labs-adds-bitcoin-as-collateral-usde-stablecoin","website_source":"Cointelegraph","article_type":"Tweet","summary":"USDe is already backed by Ether, Ether-based liquid staking tokens and Tether, but Ethena says Bitcoin will provide a more “safe” and “robust” product for USDe tokenholders.","title":"Ethena Labs adds Bitcoin backing to its USDe synthetic dollar","detailed_content":"Ethena Labs, the team behind USDe, has added Bitcoin\nBTC\n$62,992\n as collateral to its synthetic dollar-pegged product with the hopes of scaling “significantly” from its current $2-billion supply. \nWith Bitcoin open interest increasing from $10 billion to $25 million over the past year on major cryptocurrency exchanges, USDe has the capacity to scale by a factor of 2.5, Ethena explained in an April 4 post on X.\nUSDe went live on Ethereum on Feb. 19. At the time, Ethena promised a 27.6% annual percentage yield (APY) on staked USDe, prompting widespread concerns in the community. USDe’s APY topped out at 113% on March 5 but has since fallen to 7.15%.\nExcited to announce that Ethena has onboarded BTC as a backing asset to USDe\n\nThis is a crucial unlock which will enable USDe to scale significantly from the current $2bn supply pic.twitter.com/FOZRWBrVZV\n— Ethena Labs (@ethena_labs) April 4, 2024\nEthena said Bitcoin would provide better liquidity and offer a more “safe” and “robust” product for USDe token holders.\n“BTC derivative markets are growing at a faster pace than ETH and offer better scalability and liquidity for delta hedging.”\nSource: Ethena Labs\nEthena adopts a delta hedging strategy in the derivatives market to maintain USDe’s peg.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nFor example, Ethena may have short positions in Ether\nETH\n$3,030\n or Ether-based derivatives, which become rewarding when Ether’s price falls. As a result, Ethena can offset any downward volatility from USDe’s collateral to a considerable degree.\nPrior to the Bitcoin addition, USDe was backed by ETH, Tether\nUSDT\n$1.00\n and Ether-based liquid staking tokens in proportions of 45%, 38% and 17%, respectively.\nThe firm sources the bulk of its collateral from Binance, Bybit and OKX in 59%, 15% and 20% proportions, respectively. Deribit, Bitget and BitMEX make up the remaining 6%.\nEthena acknowledged that Bitcoin doesn’t possess a native staking yield like staked Ether but said staking yields of 3%–4% are “less significant” during bull markets where funding rates can exceed 30%.\nRelated: Ethena will become highest revenue-generating crypto project — Delphi Labs CEO\nEthena is trying to differentiate its synthetic dollar product from stablecoins by eliminating or significantly reducing reliance on the traditional banking system.\nUSDe currently boasts the fifth-highest market capitalization among United States dollar-denominated products, according to CoinGecko.\nIts $2-billion market cap only trails USDT, USD Coin\nUSDC\n$1.00\n, Dai\nDAI\n$1.00\n and First Digital USD (FDUSD).\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-05","tags":["#Bitcoin","#Blockchain","#Altcoin","#Business","#Adoption","#Rewards","#Stablecoin","#DeFi"],"author":"by Brayden Lindrea","category":null}