{"id":"3615d68b-7b1e-4cac-9c9e-695bf93183ae","article_link":"https://www.wired.com/story/the-fallout-of-the-ftx-collapse/","website_source":"Wired","article_type":"News Article","summary":"As Sam Bankman-Fried’s crypto empire crumbles, its customers, and other crypto traders, are paying the price.","title":"The Fallout of the FTX Collapse","detailed_content":"WHEN SAMUEL REALIZED that FTX had suspended withdrawals on November 8, his hands began to tremble. The $25,000 in assets he keeps with the crypto exchange, equivalent to a decade’s worth of savings, was suddenly out of his reach.\nSamuel, who asked to be referred to only by first name to preserve his anonymity, says he lives somewhere in Southeast Asia and is currently between jobs, which means money is tight. The cryptocurrency in his FTX account was his nest egg.\nSamuel first caught wind of a problem at FTX on November 6, but dismissed the reports as simple “FUD”—a term used in crypto circles to describe baseless fear, uncertainty, and doubt. He says he thought that FTX, until now one of the world’s most reputable exchanges, was “bulletproof” and there was no way his funds could be in danger. FTX founder Sam Bankman-Fried helped contribute to this misconception, tweeting on November 7 that “FTX is fine. Assets are fine.” (The tweet has now been deleted.)\nFEATURED VIDEO\n This week, it became clear that FTX was on the brink of collapse. Today it voluntarily started bankruptcy proceedings in the US, joining the ranks of Mt. Gox, Celsius, Three Arrows Capital, and others in the crypto hall of shame. The troubled exchange was briefly handed a lifeline on Tuesday when Changpeng Zhao, CEO of Binance (who goes by the name CZ), announced on Twitter that a rescue deal had been reached. But less than 48 hours later, Binance backed out, citing the results of corporate due diligence and news reports of mishandling of customer funds at FTX.\nSamuel’s portfolio is made up predominantly of a cryptocurrency called XRP, the price of which is thought to have been depressed by an ongoing lawsuit between its issuer, Ripple Labs, and the US Securities and Exchange Commission. Recently, there have been signs the two-year legal battle may be coming to a close—and Samuel had been sitting tight in the hope that a favorable ruling might send the price of XRP skyward. But now, with his tokens locked up in FTX, he won’t be able to reap the rewards for his patience. “I could see the finish line, but this latest drama has me hanged by the balls,” he says. “It’s just so much hardship.”\nThere are many FTX customers with stories like this one. One FTX trader, who asked to remain anonymous, was in the US when they first heard of trouble at the exchange, which meant it was not possible to immediately withdraw their funds (FTX International, not to be confused with FTX US, is unavailable in the country.) When the FTX trader eventually used a VPN service to bypass the geo-restrictions, they found their withdrawal password needed to be reset, a process that for security reasons prevents money from being taken out of an account for 24 hours. By that time, it was already too late.\nThe FTX trader has the equivalent of $350,000 locked up in FTX, which they say amounts to 97 percent of their liquid net worth and represents 15 years’ worth of savings and investment gains. Unable to access the funds, they are now “in a highly vulnerable position due to debt and other liabilities that I may now be unable to service.” The fall of FTX, they say, “has changed my previously conditional trust in centralized exchanges—no matter how large and reputable—into an unconditional distrust.”Aaron Kaplan, a securities attorney and co-CEO of trading platform Prometheum, says that although the final outcome for FTX and its customers is not yet crystal clear, there is precedent in scenarios such as this for people never to recover their funds. Unfortunately, those caught up in the collapse are left with little in the way of legal recourse, says Kaplan. “The facts will come out in time. What is clear at this present moment is that FTX was taking advantage of a gray area at the heart of which was the expectation of profit, irrespective of the best interest of customers.”\nIn a Twitter thread announcing the bankruptcy, Bankman-Fried implied he still hopes to help customers recover their funds. But thinking this unlikely, some FTX customers are attempting to flog their account balances at a steep discount. As reported by CoinDesk on November 9, buyers on messaging platform Telegram are bidding $0.10 to $0.15 cents on the dollar for funds tied up in FTX, gambling on the chance they may eventually be released.\nThe financial impact of the collapse extends far beyond the immediate FTX customer base, too. The week’s events have sent other crypto coins into a downward spiral, with the price of both bitcoin and ether falling by more than 10 percent, wiping upward of $60 billion from the market. Large sums of SOL, the native token of the Solana network, are owned by FTX and its subsidiaries, and therefore has been hit even harder. Between November 7 and November 9, the value of SOL fell from $32 per coin to $13.\nA crypto trader who goes by the name Mando CT had at one point yesterday lost $637,000 on his SOL holdings and various Solana-based NFTs. (A slight recovery in the price of SOL, combined with other bets, has since helped him recoup some of these losses.) He says he remains confident in Solana’s core value proposition and quality of the technology, and has even purchased more SOL in an attempt to “buy the dip”, but concedes the fall of FTX will have “a huge impact on the whole market.”\nAlthough developers whose apps sit atop Solana claim it’s still the best network for building services at scale—the CEOs of both Audium and Irreverent Labs, two such development studios, say they are unconcerned about price of SOL—others predict the knock-on effects of the FTX crash will have a detrimental effect on the overall health of the ecosystem.\n“Developers in the blockchain space tend to put their efforts where the most money is located,” says Francesco Melpignano, CEO at Kadena Eco, which helps to incubate new projects tied to the Kadena blockchain. “If we see funds leaking away from Solana, developers will certainly be more incentivized to build elsewhere.”\nElsewhere, BlockFi says it was forced to cease operations, citing “a lack of clarity” over the situation at FTX. The crypto lender had itself been bailed out by FTX US earlier this year after it was caught up in the Three Arrows Capital collapse, but its future is now uncertain, illustrating the contagion effect described by CZ earlier today. “With FTX going down, we will see cascading effects,” he said. “Especially for those close to the FTX ecosystem.”\nIn the days since the crisis began, FTX’s Bankman-Fried, who is usually a prolific tweeter, has been uncharacteristically quiet. In a manic Twitter thread posted yesterday afternoon, he broke his silence: “I’m sorry,” he tweeted. “I fucked up, and should have done better.”\nThe FTX founder gave a puzzling explanation of the events that led up to the fall (something to do with “a poor labeling of bank-related accounts,” apparently) and set out a plan to do right by customers. “We’re spending the week doing everything we can to raise liquidity,” he wrote. “Every penny of that—and of the existing collateral—will go straight to users, unless or until we’ve done right by them.”\nAlthough it will be cold comfort to those whose funds are stranded in the exchange, Bankman-Fried has himself suffered extraordinary losses. Today, Bloomberg reported that his personal fortune, worth $16 billion just last week, has been wiped out entirely in the collapse of FTX—every single dollar—in what’s described as “one of history’s greatest-ever destructions of wealth.”","creation_date":"2022-11-11","tags":["","CRYPTOCURRENCY","BLOCKCHAIN","FINANCE","SAM BANKMAN-FRIED"],"author":"BY JOEL KHALILI","category":null}