{"id":"3a60f71e-50ba-4227-91fb-3879401426c7","article_link":"https://cointelegraph.com/news/crypto-casinos-can-onboard-millions-of-users-into-web3-myprize-ceo","website_source":"Cointelegraph","article_type":"News Article","summary":"On the latest episode of The Agenda podcast, MyPrize founder Zach Bruch makes the case for crypto casinos and online gambling as a path toward mass adoption.","title":"Crypto casinos can onboard millions of users into Web3 — MyPrize CEO","detailed_content":"Over the long course of human history, one activity that has followed humanity practically everywhere is gambling. The earliest evidence of human gambling dates back to the Paleolithic era, and it has been present in every major civilization and society since then.\nAs technology has evolved, so have the ways people gamble. While major gambling hubs such as Las Vegas and Macau still dominate with brick-and-mortar casinos and entertainment, online casinos have exploded in recent years — and many of these websites use cryptocurrency to power their platforms. The largest, Stake, reportedly generated a whopping $2.6 billion in gross revenue in 2022 alone.\nOn Episode 14 of The Agenda podcast, hosts Jonathan DeYoung and Ray Salmond spoke with Zach Bruch, founder and CEO of MyPrize — a crypto casino that recently emerged from stealth and is now open for early access — to better understand how crypto casinos work, where they fit into the broader crypto ecosystem, and how they might be silently onboarding millions of people into Web3.\nCrypto and gambling: a match made in heaven?\nBruch argued that the biggest use case for crypto in 2024 is still speculation, and this is playing out via the memecoin craze, which The Agenda recently discussed in depth in Episode 34 with Andreas Brekken of SideShift.ai. According to Bruch, memecoins are so popular “because people love to speculate. People are having fun with their friends. They’re participating as a group. They’re rallying around something, and they’re speculating together.”\n“Gambling has been around since the very first day of human life. People love taking risk. Crypto is the epitome of that.”\nBruch sees crypto casinos as fun places where people can come together as friends to engage in risk-taking and speculative behavior in a fun environment where — at least for MyPrize — the minimum bets can be as low as $0.01.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBut operating an online crypto casino is not without its challenges. For one, it must comply with the regulatory requirements of each country it operates in, which is why many online casinos — MyPrize included — have separate websites with different functionalities for United States-based customers.\nThe security concerns also differ, as crypto casinos have to make sure their code and smart contracts are bulletproof. In September 2023, Stake was hacked for a reported $41 million. According to Bruch, operating a crypto casino is more akin to operating a crypto exchange: “You’re building user accounts. You’re thinking about AML, KYC, fraud, chargeback risk, asset security, all those different types of things. And all of that comes into play for an online casino as well, right?”\nGambling as a path toward mass adoption\nBruch told The Agenda that online casinos offer significant on-ramps into the crypto ecosystem. “Most people don’t even recognize this, but some of the largest applications for crypto today are on-ramping into the casino space,” he said, offering the opportunity to then funnel these customers into the broader crypto ecosystem. Bruch said that this is made easier because gambling already has a long history of having a great product-market fit.\n“You have all these traditional folks that aren’t actually active members of the crypto ecosystem or the crypto ecosystem that we know it, but are active gamers and gamblers in online casinos, and they are buying crypto to go play in these sites.”\nThis is the long-term vision of MyPrize: Users will on-ramp into crypto through the casino and then remain in Web3. “We’re starting by creating a killer application that will onboard millions of users, and then we’ll funnel those millions of users into a much broader decentralized ecosystem,” Bruch said. \nTo hear more from Bruch’s conversation with The Agenda — including the future of “GambleFi,” whether there will be casinos in the metaverse and more — listen to the full episode on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\nMagazine: Cryptocurrency trading addiction — What to look out for and how it is treated\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.","creation_date":"2024-05-16","tags":["#Blockchain","#Cryptocurrencies","#Business","#Casino","#Technology","#Gambling","#Adoption","#Community","#Online Casino","#Streaming","#Podcast","#Web3","#Gaming","#The Agenda"],"author":"by Jonathan DeYoung","category":null}