{"id":"3b5483bd-ec75-4e13-9be5-985d509fab58","article_link":"https://www.wired.com/story/bitcoin-texas-power-grid/","website_source":"Wired","article_type":"News Article","summary":"Bitcoin miners say they can help stabilize a shaky power grid and prevent blackouts. Experts say it will make the problem worse.","title":"A Row Erupts Over Texas’ Bold Bitcoin Battery Plan","detailed_content":"IN FEBRUARY 2021, when 246 people in the US state of Texas lost their lives during a powerful storm and its ensuing blackout, the finger of blame was pointed at the state’s faltering electricity grid. Texas, it would emerge, was uniquely ill-equipped to cope with such extreme weather. Built in a time when temperature swings were less extreme, the state’s power plants struggled to operate, creating a supply crisis just as Texans ramped up demand by trying to keep warm. \nTexas found itself trapped and unable to pull power from farther afield, as its grid is isolated from the rest of the US—a measure designed to liberate the state from federal regulation. The brutal winter storm showed that Texas needed a plan to stabilize its grid. Now, it’s found one: bitcoin mining.\nIt might seem counterproductive to invite energy-guzzling bitcoin miners onto a vulnerable grid, but the plan has the support of Texas governor Greg Abbott. In May 2021, Abbott signed into law the Virtual Currency Bill, which legitimized bitcoin and made it easier for miners to come to the state. As he embarks on a third term in office, Abbott says he intends to make Texas the “centerpiece” of the Bitcoin movement, which he describes as the “cutting edge of innovation.” \nFEATURED VIDEO\nFormer NASA Astronaut Breaks Down a Rocket Launch\nAnd it doesn’t get much more “cutting edge” than using crypto mines to shore up a struggling electricity grid. But Lee Bratcher, founder of the Texas Blockchain Council, a pro-crypto lobbying group, says there’s method to the madness. He claims crypto mining can act like a “demand-side battery” that “creates a safety valve for the grid,” reducing the likelihood of blackouts.\nIn Bratcher’s terms, it works like this: In periods of low demand, big crypto mines can plug into sources of renewable power that would otherwise be wasted, thereby increasing the profitability of wind and solar and encouraging new development. Then, when demand from the grid is high, miners shut off their operations to allow power to be channeled toward regular people.\nAlthough Texas produces more renewable energy than any other US state, its grid is propped up by an aging fleet of fossil fuel plants, some of which have been running without maintenance to keep pace with energy demand. At an average age of 50 and 30 years, respectively, the state’s coal and gas plants are reaching the end of their useful lives. Core to Abbott’s plan is the theory that the additional demand for energy created by new bitcoin-mining facilities will establish “an investment incentive” that brings new sources of power generation to Texas. Then, when energy demand goes through the roof during a heat wave or cold snap, the state will have more energy flowing through its grid and the option to redirect power as a last resort.\nThe plan to use crypto mines as giant batteries is controversial, to say the least. Ed Hirs, an energy fellow at the University of Houston, claims the battery analogy is “nonsense” because miners don’t store and release energy, but rather only promise to stop consuming when it’s urgently needed elsewhere. And he disputes the idea that crypto mining will bring additional energy generation to the grid, which he describes as misdirection designed to distract from the price increases people will incur due to an overall rise in energy demand.\nDemand for energy in Texas is set to skyrocket as a result of Abbott’s plan. Miners in the state are currently using around 2 gigawatts (GW) of energy, with peak capacity for the state topping out at 80 GW. By 2026 it’s estimated that Texas bitcoin miners will draw as much as 29 GW—four times as much as the whole of New York City. \nFor the opportunity to test his theory, Abbott has the Chinese Communist Party to thank. When China banned crypto mining in June 2021 (outwardly for environmental reasons), some of the world’s largest miners—including Marathon Digital Holdings, Riot Blockchain, Core Scientific, Argo Blockchain, and others—either set up shop or expanded operations in Texas.\nThe miners were attracted to Texas for its cheap power, plentiful supplies of renewable energy, and hands-off approach to regulation. The libertarian ambitions of the cryptocurrency movement, as laid out in the original Bitcoin white paper, also dovetail neatly with the state’s identity. “Texas is all about freedom,” says Andy Long, CEO of crypto mining company White Rock. “So Texas and Bitcoin go hand-in-hand.”\nThere are now ten industrial-scale mining facilities operating in Texas, the largest of which by power capacity (at 750 megawatts) is operated by Riot and situated on a 100-acre plot in the town of Rockdale. And the Electric Reliability Council of Texas (ERCOT), the grid operator, says there is a long queue of companies awaiting approval for new mining installations.\nThe way facilities receive their energy differs on a case-by-case basis. To power its mining equipment in west Texas, Marathon Digital draws partly from the grid and partly from so-called stranded energy—power from solar and wind farms that isn’t needed by the grid or cannot be sold due to infrastructure constraints. In exchange for Marathon agreeing to purchase energy at a set rate at all hours of the day, the renewable provider gives the firm a cut of the profits whenever the grid is willing to pay a higher price, benefitting both parties.\nAnother way miners can turn a profit is by participating in ERCOT demand response programs, which for years have provided a way for factories and other industry-scale energy consumers to help stabilize the grid. Under this system, mining companies that buy energy in batches are compensated for switching off when a blackout looms. Meanwhile, those that have power purchase agreements (contracts that allow them to buy energy in advance at a set price) with energy suppliers can shut off when demand is high and sell their allocation to the grid at a premium.According to Trudi Webster, a spokesperson for ERCOT, this arrangement helps to “maintain grid reliability” because participants can “increase or decrease consumption to support system needs.” This principle was put to the test in July, when a heat wave drove energy consumption to record highs and 95 percent of large-scale miners in Texas were said to have shut down. One mining company, Riot, said it earned $9.5 million in energy credits during the heat wave for switching off operations, more revenue than it earned from mining bitcoin in the same period (roughly $6.9 million).\nFred Thiel, CEO of Marathon Digital, claims that crypto miners participating in demand response schemes have helped to stave off blackouts in Texas this year. Mining facilities acted “like a capacitor,” he says, echoing the battery metaphor, allowing the grid to remain on an even keel.\nEnthusiasm for the plan from Abbott and other crypto enthusiasts has been punctured by academics who claim even the basic premise is flawed. The idea of using huge crypto mines to control energy demand is based on “misunderstandings and misrepresentations of the grid and how it operates,” says Adrian Shelley, an energy policy expert and branch director of consumer advocacy group Public Citizen. Although crypto mines are unique in their ability to switch off at short notice (unlike a factory, which may take hours to shut down), Shelley says the case for placing the extra strain on the grid in the first place is full of holes. Abbott’s office did not respond to a request for comment.\nShelley argues it “doesn’t make sense” to pay miners for alleviating the strain they themselves are putting on the grid. In addition, much of the miners’ purchasing power gained directly from the grid is likely to decrease when demand spikes, as mining is no longer profitable under these conditions due to the rise in energy prices.\nHirs says there are millions of consumers already connected to the grid that would happily shut off their power in exchange for financial compensation, without adding additional strain to the grid or causing a price increase. Under the instruction of the Public Utility Commission of Texas, the state utilities regulator, ERCOT launched a pilot program earlier this month to investigate how regular people can help support grid reliability—but Hirs says this should have happened years ago.\nThe flood of crypto miners arriving in Texas has also attracted the attention of lawmakers. In a letter addressed to ERCOT, a group of US politicians headed by US senator Elizabeth Warren (D-Massachusetts) expressed fears that crypto mining will “add to the stress on the state’s power grid.” Shelley shares the same concern: “There’s no way the grid could handle all that demand,” he says.\nIn its response to the letter, ERCOT explained it will not allow new mining facilities to power up if there is a risk of destabilizing the grid. But the operator also said it’s not in the business of predicting the impact of mining on the price of energy for consumers. Doug Lewin, president of Stoic Energy, a Texas-based energy consultancy, is worried about a different problem: What happens if miners decide not to switch off their machines? While the price of bitcoin sits at $17,000 per coin (down 63 percent this year), miners stand to profit by shutting down. But if the price were to rise, a tipping point would be reached whereby continuing to mine becomes the more lucrative option.\nSome mining companies, like Marathon, are contractually obligated to shut down when demand spikes. But if others choose not to, they would be competing with consumer demand and increasing the risk of a blackout, says Lewin, who argues regulation is needed to mitigate this worst case scenario.\nBratcher of the Texas Blockchain Council says he expects ERCOT to ask all miners to sign agreements demanding they halt their operations if power reserves fall below 3GW. But in the meantime, he claims, the price of bitcoin would have to rise by ten times in order for the profit motive to collapse.\nDespite objections—and questionable logic—under Governor Abbott, the message is clear: “Texas is open for crypto business.” And despite headwinds, Bratcher says the mining industry in Texas is still growing and ERCOT intends to forge ahead with plans to bring more facilities onto the grid. But as winter starts to bite, the Bitcoin battery experiment could soon get the ultimate stress test. Shelley says the “frightening” scale of Abbott’s plans will have the opposite of the desired effect, increasing the chance that Texas ends up in the dark once again.","creation_date":"2022-12-07","tags":["","BITCOIN","CRYPTOCURRENCY","ENERGY","INFRASTRUCTURE","REGULATION","ELECTRICITY"],"author":"BY JOEL KHALILI","category":null}