{"id":"3bf82a7e-97f3-417a-848a-9ee2edc56045","article_link":"https://cointelegraph.com/news/solana-mainnet-beta-update-resolve-congestion-issues","website_source":"Cointelegraph","article_type":"News Article","summary":"The Solana Foundation claimed ongoing network congestion could be attributed to the high demand for Solana block space and increased network activity.","title":"Solana's mainnet beta update v1.17.31 aims to resolve congestion issues","detailed_content":"Solana developers have released a mainnet beta update, v1.17.31, to deal with the ongoing network congestion on the Solana blockchain.\nThe update was released on April 12, and now, after three days of testing, it is being recommended for general use by mainnet beta validators. \nThis patch contains enhancements that will help with some of the ongoing network congestion and will be followed by further enhancements in v1.18.\nThe current version will help improve the network congestion and issues with the open interest jump. Some of the key upgrades include:\nShow staked vs. non-staked packets sent down/throttled\nQuic: use smallvec to aggregate chunks, save 1 alloc per packet\nBankingStage Forwarding Filter\nTighten the minimal streams per 100ms for staked node\nTreat super low staked as unstaked in streamer QOS\nDefault staked client in LocalCluster\nSolana developer Anza asked validators to upgrade the latest patch only when there’s less than a 5% delinquent stake.\nDelinquency on Solana refers to inactive validators, and the percentage refers to the total stake for offline validators. Thus, validators are requested to install the updates only when there are less than 5% inactive validator stakes on the network.\nRelated: Over $1B in US Treasurys have now been tokenized on-chain\nAmid a growing network activity and memecoin frenzy, Solana network faced congestion issues for nearly a week with a transaction failure rate as high as 75%. While developers were working on the fix, a co-founder of Solana noted that the ongoing network congestion issues were merely a bug rather than a network issue.\nThe Solana Foundation attributed current network congestion problems to various factors, including a large demand for Solana block space and a delayed implementation of patches to tackle network-related issues.\nSolana Foundation strategy lead Austin Federa told Cointelegraph that developers had been working non-stop to fix the issue, but the network demand has outpaced the timely developer intervention.\nFedera added that engineers had “not been sleeping much” as they readied patches and tested features before they hit mainnet.\nHowever, Solana devs have developed a series of patches to tackle the ongoing issue, with the first released for developers on April 15.\nMagazine: Bitcoin ETFs make Coinbase a ‘honeypot’ for hackers and governments — Trezor CEO","creation_date":"2024-04-15","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#DeFi","#Solana"],"author":"by Prashant Jha","category":null}