{"id":"3c39f412-d5e9-48d5-9164-28d43353ff49","article_link":"https://medium.com/@ashonweb3/ram-and-rams-on-eos-informed-inscription-conversion-0f647fd16353","website_source":"Medium","article_type":"Tweet","summary":"There are just over five days remaining to convert your RAMS inscriptions (or have them automatically destroyed, releasing RAM back to…","title":"RAM and RAMS on EOS — Informed Inscription Conversion","detailed_content":"There are just over five days remaining to convert your RAMS inscriptions. As a community member who just converted her inscriptions, I wanted to share some information for those who are still deciding whether to transfer RAM to the DAO (to receive RAMS tokens) or to reclaim their RAM (and burn RAMS tokens.)This article is intended to inform the EOS community who participated in the RAMS inscription event, though it can also serve to provide more information on EOS RAM and the RAMS DAO. This is not financial advice, do your own research.EOS RAM is an EOS system resource that is used to store data on the blockchain. It is sold on the EOS RAM marketplace and is priced based on the Bancor liquidity algorithm. On December 17, 2023 an msig proposal was passed to stop RAM inflation on EOS, making it a finite resource at 390GB. The EOS community has been cumulatively experiencing the full range of emotions due to the changes that have been occurring over the past several months (the RAM price chart).There are some major changes to EOS tokenomics being proposed and one of the major focal points of this proposal is a large allocation to the EOS RAM market. You can read more about the tokenomics proposal in this article.Some high level (RAM-relevant) takeaways from this proposal:\n- 35M EOS to be used to purchase RAM from the system’s Bancor pool to support or fund various EOS Ecosystem initiatives.\n- 315M EOS to be lent out to professional market makers who will acquire RAM from the Bancor pool and the open market.In order to make an informed decision on whether or not to convert your inscription to RAMS tokens (releasing the RAM to the DAO) or to reclaim the RAM to your account (and burn the RAMS tokens) it is important to consider the following information.Who is the RAMS DAO?\nThe RAMS project was incubated by EOS Labs.Current RAMS holders can be seen here. Notable RAMS Whales include EOS Network Foundation (admin.grants) and EOS Labs (eoslabs.eco).RAMS DAO multi-signature group consists of: EOS Labs, BP Defibox, BP EOSNation, Labs member rams.base and Labs member Startship.eos.How much RAM?\nIf all RAMS tokens were created, then the RAMS DAO would manage 46GB of RAM (out of the finite 390GB supply on EOS). You can check the RAMS DAO account information here to see how much RAM the DAO currently manages.RAMS Token\nRAMS serves as the governance token of the RAMS DAO. RAMS can be staked to obtain voting rights and receive rewards.RAMS Maximum Supply: 1,000,000,000Currently 43.98% of RAMS have been minted with 4.82% of that supply burned. Check the ramseos.io website for the latest numbers.But what will the DAO do?From the RAMS DAO Website:RAMS DAO IncomeIncome for the DAO will be obtained by leasing RAM to third-party projects. The following tweet indicates that Exsat will be leasing RAM from the RAMS DAO.If you participated in the RAMS inscriptions event, your choices are as follows:Convert the Inscriptions to RAMS Tokens\n- Destroy inscriptions, receive RAMS tokens and release the inscription’s RAM to the RAMS DAO for management.\n- You cannot convert RAMS back into RAM (that RAM now belongs to the DAO), but you can trade it here.\n- This action removes the RAM from the open market and puts it under the management of the DAO.Release RAM from the Inscriptions\n- Destroy inscriptions, release the RAM back to your account and burn the associated RAMS tokens (sends the tokens to eosio.null).\n- Reduces circulating supply of RAMS, but also reduces the amount of RAM managed by the RAM DAO.\n- The released RAM is available for trade on the open market.Do Nothing\n- Inscriptions will be destroyed at the end of the conversion period, releasing RAM back to your account and burning the associated RAMS tokens.https://ramseos.io/\nhttps://twitter.com/ramseos\nhttps://t.me/rams_in_ram\nhttps://bloks.io/account/ramsdao.eos\nhttps://rams-3.gitbook.io/rams/v/english\nhttps://bloks.io/account/ramsms.eos#keys (msig group)","creation_date":null,"tags":["Eosnetworkfoundation","Eos","Blockchain Technology","Blockchain","Blockchain Development"],"author":"Ash","category":null}