{"id":"4002d55d-bc1d-445a-8af1-e6b580e418c6","article_link":"https://cointelegraph.com/news/ai-integration-is-changing-creature-catching-games-in-web3-heres-how","website_source":"Cointelegraph","article_type":"Tweet","summary":"Web3 game featuring AI tools that redefine in-game strategy and customization is available in early access for its collectors.","title":"AI integration is changing creature-catching games in Web3: Here’s how","detailed_content":"With the goal of transforming creature-catching games by blending AI and Web3 technologies, AneeMate enhances interaction, ownership and community participation in the gaming world.\nFew themes in the video game universe fascinate players more than magical lands populated by mythical creatures. Dominated by giants such as Pokémon, the third best-selling gaming franchises worldwide after Mario and Tetris, the genre has witnessed huge commercial success and fan loyalty.\nAs game developers attempted to emulate Pokémon’s triumph in the Web3 space, traditional alternatives like Palworld emerged and quickly cumulated millions of players. Offering a game model that not only entertains but also deepens participation, Web3 game developers are paving the way for a new era in creature-based games.\nCreature extraction shooter with robust multiplayer elements\nAneeMate, a mythical world creature extraction shooter, is poised to reinvent the nostalgia of Pokémon while bringing the best of Palworld and other creature-catching games. AneeMates are mythical creatures users will truly own, introducing magical powers, unique designs and body structures. They are designed to trigger the cute sentiment of little kitties while instilling a crippling sense of imminent danger.\nCreated by Cointelegraph Accelerator participant QORPO, AneeMate includes player-versus-player (PvP) mechanics, unlike previous Pokémon-like projects. The game offers a blend of exploration-focused shooter action, mission-driven narrative, role-playing game (RPG) elements and the pursuit of collecting AneeMates.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nOne of the features that distinguishes AneeMate from Palworld or other Pokémon-inspired games is its robust multiplayer experience. Players engage in fast-paced shooter action, tasked with transporting valuable loot to extraction zones before time runs out.\nAneeMate, characterized by its unpredictable events and rapid gameplay, sends players on a quest to find loot, craft weapons from extracted valuables, battle other players and capture AneeMates. Since all this unfolds within a 30-minute window, players face a fast and thrilling game dynamic.\nBeyond its dynamic action, AneeMate fosters social interaction, enabling asset trading and participation in a player-driven economy.\nThe sticker collection turns into an early access ticket to Hidden Islands. Source: AneeMate\nAneeMate also gives the most committed community members early access to its highly anticipated game. Those who own AneeMate Genesis NFTs and have completed AneeMate Sticker Books are whitelisted for early access to Hidden Islands.\nWeb3 games meet AI\nWith its innovative AI Mate integration, AneeMate simplifies navigation through games’ complex skill trees. Designed to help improve characters and creatures, AI Mate uses machine learning to learn players’ styles and provide recommendations for the most effective progression paths.\nWanderers, don’t play hard, play smart with AI Mate\n\nIntroducing AI Mate, your ultimate gaming companion! AI Mate revolutionizes how you progress through game talent trees, using advanced AI to make the smartest decisions for your gameplay developed by @QORPOworld and backed by… pic.twitter.com/ind9OWthRS\n— AneeMate (@playaneemate) April 10, 2024\nGetting started with AI Mate is simple. Players who allow AI to observe their games soon begin to receive strategic suggestions. The process ensures that all recommendations are customized and geared toward maximizing each player’s potential in-game.\nSpeaking about the artificial intelligence (AI) integration, Rastislav Bakala, founder and CEO of QORPO World, said:\n“With AneeMate, we want to bring a highly functional and player-focused AI integration that transcends a mere AI narrative and truly delivers the best player experience possible.”\nAI Mate, which will be part of the QORPO World and managed by a decentralized autonomous organization (DAO), benefits from the support of a powerful ecosystem united under the QORPO token.\nHaving launched semi-public early access, AneeMate plans to release the first public alpha version with AI Mate tools in late 2024.\nThe innovative steps taken by AneeMate reveal that the combination of Web3 technologies and AI is not a temporary trend but a transformative change in the gaming world. As developers continue to explore these technologies, the way players think about interactivity, economics and community in games will also change, paving the way for a richer gaming ecosystem.\nLearn more about AneeMate\n#Blockchain\n#AI\n#Games\n#Blockchain Game\n#Web3\n#NFT\n#Gaming\n#Cointelegraph Accelerator\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-24","tags":["#Blockchain","#AI","#Games","#Blockchain Game","#Web3","#NFT","#Gaming","#Cointelegraph Accelerator"],"author":"by Emre Günen","category":null}