{"id":"40a90292-ac4b-4c30-b438-8122ffb001d0","article_link":"https://www.wired.com/story/twitter-had-a-plan-to-fix-social-media-bluesky-will-elon-musk-follow-it/","website_source":"Wired","article_type":"News Article","summary":"For years, the platform has funded a project that's meant to create a better, decentralized online experience. Now Twitter's new owner will decide its future.","title":"Twitter Had a Plan to Fix Social Media. Will Elon Musk Follow It?","detailed_content":"THERE ARE A hundred ways in which Elon Musk might attempt to reshape Twitter after he bought it on October 28. Thanks to the publication of the entrepreneur’s personal messages in September, one thing is clear: Its future will involve decentralization. In a message to Twitter founder Jack Dorsey in March, Musk said he wanted to turn the platform into “something new that’s decentralized.” And in conversation with his brother Kimbal, he tossed around the idea of a social network “based on a blockchain,” before realizing it might be too complicated.\nInstead, he could turn to Bluesky, a project incubated inside Twitter that promises to establish a “federated social network” based around an open standard that multiple platforms can adopt.\nSince it was set up under Dorsey in 2019, Bluesky has tried to create a system that lets users see how algorithms serve up content and control their personal data, and allows them to use a single profile across several social apps. Dorsey, who bonded with Musk over a shared enthusiasm for crypto, effectively pitched him the idea of using Bluesky earlier this year when he proposed that Twitter be turned into “an open source protocol.” Musk’s response? “Super interesting idea.”\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nSo far, Bluesky has received at least $13 million in funding from Twitter, and Dorsey continues to be involved as a member of the board. There was precious little to show for this investment until only a few weeks ago, when Bluesky unveiled an “improved and simplified” version of its platform, called the AT Protocol, and technical documentation that showed developers how to build on top of the platform. It also set up a waitlist for its app, which will act as a browser for the network and enter private beta testing soon. Bluesky is now independent of Twitter—so as to best provide “public benefit”—but whether or not the dollars keep flowing will be up to Musk.\nJay Graber, Bluesky’s CEO, declined to comment on the progress of the project and the implications of Musk’s acquisition, but has implied publicly that she is unconcerned about the project’s future. “Very curious to see where Elon is going to take Twitter,” she tweeted. “Very glad we’re independent—will keep working on building protocols that make social more resilient to rapid change.” Meanwhile, in a thread published in April, soon after Musk tabled his bid, Bluesky claimed it will continue to receive funding from Twitter as long as it works toward enabling “open and decentralized public conversation”—a loose brief if ever there was one.\nWhat’s uncertain is how the federated social network, if it were adopted under Musk, will function in practice. If Musk chooses to follow Dorsey’s original vision, Twitter will become one of multiple social media services acting as a “client” for the Bluesky standard, but it’s unclear quite what this will mean for the end user. Bluesky hasn’t explained how the AT Protocol will change the way platforms are able to monetize and moderate content, saying only that it will create more interoperability and transparency around recommendation algorithms.Musk’s chief concern will be whether he can align his philosophical affection for decentralization with the need to turn Twitter into a profitable business. He has previously expressed a desire to open source the Twitter algorithm in the name of transparency, but ceding control of the algorithm (the mechanism by which people are kept on the platform) would be another step entirely, and surely a disaster for advertising revenue.\nMusk might use Bluesky technology to partly realize his ambition to turn Twitter into “X, the everything app”—a type of super-app that blends social media with payments and other utilities, similar to WeChat. Although the AT Protocol does not use blockchain, it is able to “integrate with cryptocurrencies,” Graber has previously said, which means Bluesky could help support the payments aspect of the vision. But again, this is all dealing in the hypothetical.\nAlthough plenty of questions hang over the implementation, Bluesky isn’t alone in thinking that society would benefit from a more decentralized social media ecosystem, with less power pooled in the hands of a cash-motivated minority.\nEvan Henshaw-Plath, the first employee of Odeo (which made Twitter), runs a “peer-to-peer social network” called Planetary that shares plenty of common ground with Bluesky; both are attempting to increase transparency around algorithms and give people control of their personal data.\nHenshaw-Plath predicts that Twitter will experiment heavily with Web3 and crypto-related projects under Musk, irrespective of whether Bluesky ends up playing a starring role. “I’m not sure that’s good,” he says, “but it’s definitely where most of the big changes will be.”\nHenshaw-Plath also says the acquisition might increase the chances of Bluesky securing additional funding since Twitter is no longer “constrained by Wall Street,” and suspects that Dorsey might return to Twitter in some capacity under Musk.\nOnce the AT Protocol is up and running, the aim is to enable a level of interaction between Planetary and Bluesky networks, says Henshaw-Plath, creating a sort of coalition motivated by the shared desire to tip the balance of power in favor of users.\nThis is also the ambition of Stani Kulechov, the creator of Lens Protocol, a similar project that relies on users self-hosting their profiles to create decentralization—an alternative to Bluesky’s cloud-based model. He says this approach “enables people to own their social capital” in terms of both their content and audience, and ensures social profiles are “always in your custody and control.”\nBut while efforts to minimize companies’ control over the way people communicate should be celebrated, there are short-term dangers that need to be taken into account, says Brewster Kahle, the creator of the Internet Archive, who was recently inducted into the Internet Hall of Fame. “If decentralization brought local control to more people in how they build their communities, that would be a good thing,” says Kahle. But the concern is that a lack of clarity over the mechanics of moderation under this new model might lead to the kind of “free-for-all hellscape” Musk says he is determined to avoid. “In the short term, decentralization could mean there is no content moderation or spam controls at all, giving a louder megaphone to a few,” Kahle adds.\nFor this reason, Kahle says getting the technology right is all-important, but there are “warning signs of simplistic, absolutist thinking” among those attempting to innovate in the social media space that could jeopardize the whole endeavor.\nIt’s up to Musk, the “free speech absolutist” and world’s richest individual, to carry forward the vision for a more equitable, more private, less antagonistic social media experience. If he decides not to, Bluesky will have to fly the nest in search of backing elsewhere.","creation_date":"2022-11-02","tags":["","TWITTER","BLOCKCHAIN","ELON MUSK","SOCIAL MEDIA"],"author":"BY JOEL KHALILI","category":null}