{"id":"4117fa0d-25ba-40e9-837b-09a9fe6c4f32","article_link":"https://www.wired.com/sponsored/story/whats-hype-and-whats-not-bcg-x-breaks-down-how-companies-should-think-about-technology/","website_source":"Wired","article_type":"News Article","summary":"Identifying what it takes to implement a truly successful digital transformation","title":"What's Hype and What’s Not? BCG X Breaks Down How Companies Should Think About Technology","detailed_content":"THE NEED FOR digital transformation has defined American industry for decades. But with technology advancing faster than ever before, enterprises across the world are finding it harder and harder to bring that goal to scale. Sylvain Duranton, a global lead at BCG X—Boston Consulting Group’s new tech build and design unit—has an idea of what can get today’s organizations back on track. \nWIRED Brand Lab:\nLet's start broadly, shall we? What kind of impact do you think today's large organizations are seeing from their digital investments over the last 10 years? Are they paying off? Or is that still TBD? \nSylvain Duranton:\nI think there's quite a gap between the hype and reality. We have corporate data on that; out of those who are really pushing digital transformation, only 30 percent of companies are starting to see some real financial impact through their transformation effort.\nIn this 30 percent, a small subset is seeing massive impact or several percentage points of incremental EBIDTA, or they’re gaining a much stronger competitive position. Others are making some incremental impact. But all in all, although everyone is talking about digital transformation, it’s had a positive impact in only 30 percent of cases.\nWIRED Brand Lab:\nWhy is that number so low? What is holding 70 percent of companies back from seeing impact?\nDuranton:\nIf you ask most companies, \"Did you tick the box of using AI?\" They would say yes. Same with, \"Did you tick the box of having a center of expertise?\" Yes. “Did you tick the box of recruiting new talent?” Yes. The list goes on. Many boxes have been ticked and money has been spent. But if you ask C-suite members, \"What are the three massively disruptive things that you have at scale that have made a difference on your market or customers?\" Then the answer is not so easy. \nThe main challenge has been to scale: Many companies have done many things, but very few have scaled in the end. The promise is still there, but that promise has not yet materialized. Typically, what we see is lots of small initiatives—thousands of flowers blooming at one company, because everyone wants to do a bit of digital somewhere in the company. And in the end, the company is diluting the investment.\nWIRED Brand Lab:\nIsn’t that diversification a good thing, though? Isn’t it safer to seed a variety of digital efforts, as opposed to just one or two?\nDuranton:\nThat approach often ignores how challenging true change is. I think the fundamental mistake is that companies underestimate how much change is needed to derive value from technology versus just implementing technology. I think 10 percent of the effort needed is after building a disruptive technology itself; another 20 percent of the effort will be spent integrating this technology into your legacy technology. \nThe remaining 70 percent of the effort lies in changing the organization and its processes and ways of working. If you just want to automate something simple, then okay, you don't need to change the way the company works. But if you use AI to make or support business decisions, then that could mean different teams, different people, and different processes. You might have to completely change the way people work, and that's very hard. Many companies think it's all about building a new technology: They focus on the 10 percent of the work, and they don't do the full 100 percent. This is why we don't see those technologies at scale as much as society thinks we should.WIRED Brand Lab:\nDo you think a lot of companies fundamentally don't understand that, or do you think they avoid that deeper effort? \nDuranton:\nI think they underestimate the amount of change required. Most can only do it on a few very big topics within the organization. Many companies have launched too many things and cannot invest enough in each of them. \nIt's like taking a rocket to space. To get off the ground, you need massive amounts of energy. I think the best way to allocate this (organizational) energy is on just two or three big things that will make a real difference. If you aren’t focused, you don't get any meaningful results, and then people start to lose patience. Once you've completed a few of those builds, you've been forced to change the way some of your teams operate, and you've been forced to create some smart data architecture on top of your legacy IT. Then it's a bit self-propelled and you have much less resistance. The first few big victories are super costly.\nWIRED Brand Lab:\nHow should companies identify those two or three major efforts where they should focus their investment?\nDuranton:\nYou need to pick a topic where you are convinced that the business people in charge of that 70 percent—the change effort—are up for it. I've seen many discussions at companies where someone says, \"Okay, why not apply something tech-focused to this process?\" Then you have the business owners say, \"Yeah, why not?\" You can't start like that. You need to start with the commitment that the technology will be used. \nIf you don't have that commitment, and if you don't provide resources for that team to work on that initiative right now, it's just lab work: “We can show you a shiny object, but there’s nothing in the end.” So that commitment is what is hard to get. Leadership teams need to focus on the place where leaders will have the right mindset and the appetite to really disrupt the organization and work in this new way.\nWIRED Brand Lab:\nSuch massive organizational efforts will surely require changes in talent, either through new hiring or upskilling. How should companies approach that aspect?\nDuranton:\nTwo important things here: There are the skills of people that will be users of technology, and there are the skills of people who will be builders of technology. \nFor users of the technology, there is massive upskilling that is required. It’s not just telling them about what AI can do, it’s saying, “Okay, concretely, this new solution in your hand—what’s the impact?” Then you’ve got the builders, which is where I don't think companies will be able to internalize everything required. There's a war for talent out there. Even if you open your checkbook and you write big checks to recruit people, the challenge is to make sure that those talents continue to learn and provide.\nFew companies can really build an end-to-end team of people who can work on everything from blockchain to AI. You need a full ecosystem there. You need a huge network. In most situations, it should be a combination of internal and external resources.WIRED Brand Lab:\nThe kind of effort you’re describing for true transformational change is enormous. Do you think companies will be scared off of that as we head into what feels like a very uncertain 2023 market?\nDuranton:\nWe've done a survey on this. 60 percent of the companies that we surveyed say that they want to increase their investments into digital technology, AI, and digital transformation; 36 percent say they just want to continue as-is. Only 4 percent say they should be decreasing investment. \n\nI think companies understand that the need to innovate is bigger than ever in the current market situation, either to steer operations in a very uncertain world or to innovate for your clients. We need technology to move through crises. We saw that a lot with the Covid crisis, where companies who were more advanced in terms of technology could better manage the situation, and companies who were lacking suffered a lot from the competitive standpoint. Everyone is sort of sensing that pressure will increase in 2023, and those who master technology will take advantage of that.\nWIRED Brand Lab:\nHow much is consumer expectation driving that general market pressure?\nDuranton:\nIt is a massive market force, and it will accelerate because there's a generational thing here. The new generation, they have no patience for many of the things that some of the more traditional companies are doing and the way they operate. That's why, for many companies, it's a question of survival: If you don't adapt to the future or current world, as defined by digital standards, you will be out of business pretty soon.\nThat push has been really coming from the digital world, from people who think it's no longer acceptable to be dealt with so badly in so many instances of our life as citizens or as consumers.\nWIRED Brand Lab:\nBut how many of the technologies that consumers are hearing about in the media every day are really ready for mass deployment, and how many are still just hype?\nDuranton:\nAI, I think, is there. We can discuss how it is still changing, but AI is there. Quantum computing is not there and won't be there for some time. We've had the hype period on the metaverse, but now we have a bit of a backlash mode on the metaverse. There are doubts in the minds of many consumers of that really bringing something to the world. My sense is we need a bit of patience on that one. \nAs long as the customer experience is not there, something will not take off. For example, in 1993, I was working in the research lab for electric vehicles. Everyone was excited. It was cool. But the demand wasn't there. After the hype, things cooled down. Then Tesla came in. Everyone sees a Tesla, they feel it's cool, and they want it. Now it's picking up. In the end, customer experience is the name of the game. And with the metaverse, it is not there. The three things where companies have highest expectations in the short term are advanced AI, blockchain, and the internet of things (IoT), because they need this architecture to be able to have much more pervasive device support and real-time decision support in a decentralized way.WIRED Brand Lab:\nWhat are the three things you’re most excited about?\nDuranton:\nIt's a combination of advanced AI, blockchain, and synthetic biology (synbio). I think synbio has intangible potential, but I think combining the three can solve the biggest challenges for companies and for the world.\nI'm sure that in 10 years, from a tech standpoint, we'll be in a completely new world. What has happened over the last 20 years or 30 years will now happen much faster. When you talk to companies, governments, citizens, and consumers, there's a massive appetite for more innovation. And when you talk to people in the labs, they have massive innovations on the shelf.\nWe need to connect the dots here and start materializing the promise of technology. And I think that is what will happen in the next five to 10 years. I'm positive that the world will be very different.\nWIRED Brand Lab:\nIt feels like BCG has a key role to play in that advancement—especially with the launch of its new team, BCG X. Tell us a little about that group and its mission. \nDuranton:\nThe mission statement is to partner with companies to really make the promise of technology a reality, and to then help large corporations scale this disruptive technology. \"X\" is a symbol of multiplication, and we want to generate big outcomes—multiplying outcomes by two, three, or 10 times. It's a big ambition, because I think we need big ambition.\nPart of the idea of multiplication is also that joining forces helps. It's joining forces with our clients, who are our partners—we believe in the notion of multiplying talents to multiply your impact. Like I said at the beginning, digital transformation has stalled for most companies; we want to be the solution for that. \nCompanies are getting frustrated with their traditional tech vendors. It's slow, they don't see things progress enough, and they need more. That's a result of being too tech-centric when you do things. Our mission with BCG X is that, combined with BCG, we provide the partnership to companies that's as much business as it is tech. You need both because of the 70 percent—where you need to be able to change the organization and change the way the company works.\nIs your organization looking to create its own transformational change? See how Duranton’s BCG X team can help your company take the next step on its digital journey. \nThis article was produced by WIRED Brand Lab on behalf of Boston Consulting Group.","creation_date":"2022-12-01","tags":[""],"author":null,"category":null}