{"id":"41bb54b3-e24e-4fc9-9fa2-fe36d357ed4e","article_link":"https://cointelegraph.com/news/solana-struggling-record-seventy-five-percent-trasnactions-fail-memecoin-mania","website_source":"Cointelegraph","article_type":"Tweet","summary":"The Solana network appears to be struggling to keep up with a ravenous demand for memecoins, with data showing roughly 75% of transactions on the network currently failing.","title":"Solana struggles: Record 75% of user txs are failing... or are they?","detailed_content":"Roughly three-quarters of all transactions on the Solana network have been failing amid a deluge of activity brought by the recent memecoin mania on Solana; however, proponents say the data is being widely misinterpreted. \nDune Analytics data shows that on April 4, just over 75% of all “non-vote” Solana transactions failed, the highest failure rate on record.\n75.4% of non-vote transactions on Solana have failed. Source: Dune Analytics\nThe uptick has been paralleled by a recent uproar from Solana users on social media, complaining of failed transactions and degraded user experience.\nIn an April 4 post to X, pseudonymous trader Altcoin Sherpa said that while he still believed Solana would cement itself as the blockchain network for retail adoption, he noted that the current user experience was currently less than ideal.\n“As much as I think that SOL is the chain for retail this cycle — the experience is f---ing brutal lately.”\nOr maybe it’s bot spam \nHowever, in an April 4 post to X, vocal Solana proponent and Helius CEO Mert Mumtaz took issue with the claim that 75% of transactions were failing, noting that the vast majority of failed non-vote transactions were simply “bot spam.”\nRelated: Solana activity flips Ethereum amid memecoin craze, even as txs fail\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“This is usually not a big problem for users because your wallet will simulate the [transaction] and let you know that it will not work beforehand anyway,” he said.\nMumtaz claimed that the failed transactions chart was “not a good way of assessing user impact as most users don’t make it there to begin [with].”\n“About 95% of that entire chart is just bots failing arbitrage attempts,” he added.\nAdditionally, Mumtaz explained that because much of this spam activity occurs before the scheduling process, increasing transaction priority fees won’t help and that “increasing it above a certain median” will see users “waste money.”\nSource: Mert Mumtaz\nHe added that it was unlikely that the upcoming 1.18 Solana network upgrade would fix these issues, hinting that user experience on Solana could remain degraded for some time.\n“Networking patches are what’s required, and those are rolling out soon.”\nSolana CEO Anatoly Yakovenko took to social media to express his frustration at the process of improving congestion bugs on the network. \n“Dealing with congestion bugs sucks so much more than total liveness failure. The latter is one and done, bug is identified and patched and chain continues. The former has to go through the full release and test pipeline. Shipping fast is impossible,” wrote Yakovenko in an April 5 post to X. \nThe price of Solana’s SOL\nSOL\n$154\nhas fallen around 3% in the last week, stumbling slightly after a 45% rally in the last month. Its recent weekly drawdown has seen it fall back to being the fifth-largest cryptocurrency by market capitalization, per CoinGecko data.\nSOL currently commands a total value of $81 billion, trailing behind Binance’s BNB\nBNB\n$593\nat $89 billion.\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-05","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Transactions","#Solana","#Memecoin"],"author":"by Tom Mitchelhill","category":null}