{"id":"4254eb3c-b09a-4b71-ac6e-908815de1f28","article_link":"https://cointelegraph.com/news/dwf-labs-market-manipulation-binance","website_source":"Cointelegraph","article_type":"News Article","summary":"DWF Labs was first hit by market manipulation accusations in September 2023.","title":"Binance denies reports of DWF Labs market manipulation","detailed_content":"Binance has denied the latest allegations surrounding alleged market manipulation from DWF Labs.\nAllegations over DWF Labs’s alleged market manipulation have reemerged. An anonymous source claiming to be a former Binance insider said that Binance investigators uncovered $300 million worth of wash trading from DWF during 2023, according to a May 9 report in The Wall Street Journal.\nWhen asked about the market manipulation incident, Binance denied the reports. A Binance spokesperson told Cointelegraph:\n“Binance emphatically rejects any assertion that its market surveillance program has permitted market manipulation on our platform. We have a robust market surveillance framework that identifies and takes action against market abuse. Any users that breach our terms of use are off-boarded; we do not tolerate market abuse.”\nAccording to the WSJ report, DWF Labs’ manipulated the price of the Yield Guild Game (YGG) token and at least six other cryptocurrencies in 2023. However, Binance said that its surveillance program would make this impossible.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nBinance is actively banning traders that showcase signs of market manipulation, a spokesperson told Cointelegraph:\n“Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use.”\nInvestigating potential market manipulation is a top priority for Binance, the world’s largest exchange, which is also evidenced by independent investigations, Binance’s spokesperson added:\n“A recent independent investigation from Inca Digital into Binance’s market surveillance practices validates the effectiveness of our approach, finding ‘minimal signs of anomalous trading activities.‘”\nRelated: Public blockchain ledgers ‘not fit for purpose,’ says JPMorgan exec\nDWF Labs — a Web3 investment and market-making firm — was first hit by market manipulation allegations in September 2023 after high-volume on-chain activity raised the eyebrows of crypto investors.\nWintermute, an algorithmic trading firm and market maker, was among the first companies to accuse DWF Labs of crypto market manipulation. \nDuring a September interview at Token2049, Wintermute co-founder Yoann Turpin said that DWF Labs “are not market makers in our sense” and confuse users because they “declare what are essentially [over-the-counter] trades as investments.”\nAndrei Grachev, the co-founder of DWF Labs, has strongly denied the allegations.\nRelated: Trader loses 7-figure sum due to 0L Network hard fork\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Cryptocurrencies","#Fraud","#DeFi","#Trading"],"author":"by Zoltan Vardai","category":null}