{"id":"425c05b3-5211-4301-b957-ab42b21c2b31","article_link":"https://cointelegraph.com/news/token2049-attendees-showcase-community-resilience-dubai-storms","website_source":"Cointelegraph","article_type":"News Article","summary":"Ava Labs founder Emin Gün Sirer said that while there were challenges, it was “worth it” because of the energy the crypto community brought.","title":"Crypto community triumphs: Token2049 attendees brave Dubai storms","detailed_content":"Despite the difficulties faced by crypto community members who flew to the United Arab Emirates for Token2049, the number of attendees who persevered surprised leaders and executives who came to the event.\nBus stuck in the middle of the road. Source: Cointelegraph\nOn April 18, attendees were met with blocked roads and challenges that could have made many people simply turn around and leave the country. \nVarious leaders in the space who were scheduled to have interviews with Cointelegraph wound up stuck in different airports and had to turn back because of the situation.\nTether CEO Paolo Ardoino had to wait an extra two hours in the sky because his plane was unable to land due to the storm. “I was quite lucky because I only spent two more hours in the sky,” he said.\nHowever, after witnessing the number of people who still made it to the event, Ardoino expressed gratitude for the type of people crypto community members are. He said:\n“It’s a good sign that this industry is made by people who are willing always to gather, to discuss and keep pushing the industry forward. I’m grateful to see many people around.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAva Labs founder Emin Gün Sirer also shared the challenges his team went through as they went to the event.\n“It was very difficult to come here. We were landing in the middle of the biggest storm ever. We spent five hours on what should’ve been a 20-minute landing,” he said.\nFully packed main stage of Token2049. Source: Cointelegraph\nDespite this, Sirer believes that attending was the right choice and that it was worth it. He said:\n“We ended up going through a lot of water. My luggage and clothes were wet, but it was so worth it because the energy I see in the room right now is amazing.”\nAmong the attendees, almost everyone faced their own difficulties. Still, since the tickets were sold out three weeks in advance, many crypto enthusiasts flocked to the event.\nCrypto community members indulged in the various activities available at the event, including various content-packed talks, project booths and networking.\nUltimately, the crypto community showed resilience amid a historic storm that made attending the event difficult.\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Bitcoin","#Blockchain","#Adoption","#Bitcoin Industry","#Dubai","#Blockchain Meetup"],"author":"by Ezra Reguerra","category":null}