{"id":"431c99c8-8afa-4c2c-83ea-d0040631888f","article_link":"https://cointelegraph.com/news/blackrocks-buidl-becomes-worlds-largest-tokenized-treasury-fund","website_source":"Cointelegraph","article_type":"News Article","summary":"It took less than six weeks for the BlackRock USD Institutional Digital Liquidity Fund to surpass Franklin Templeton’s one-year-old tokenized treasury fund.","title":"BlackRock’s BUIDL becomes the world’s largest tokenized treasury fund","detailed_content":"The BlackRock USD Institutional Digital Liquidity Fund is now the largest treasury fund tokenized on a blockchain after it surpassed Franklin Templeton’s product this week.\nBlackRock’s six-week-old product, tickered BUIDL, has notched a market capitalization of $375 million, surpassing the 12-month-old Franklin OnChain U.S. Government Money Fund (BENJI), which sits at $368 million, according to Dune Analytics.\nIt comes as BUIDL took in $70 million last week, including $50 million from real-world asset tokenization firm Ondo Finance’s OUSG token.\nMeanwhile, BENJI’s assets under management shrunk around 3.7% over the same timeframe.\nSource: Tom Wan\nMore than $1.2 billion worth of United States Treasurys now exists across Ethereum, Polygon, Solana and other blockchains.\nBlockchain-based tokenization of real-world assets has become a hot topic lately, with BlackRock CEO Larry Fink recently voicing that capital markets could be made more efficient by moving on-chain.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nTreasurys are only one piece of the pie — stocks, real estate and many other assets can also be tokenized.\nRelated: BlackRock receives memecoins, NFTs after depositing $100M USDC on-chain\nHowever, investor demand for these tokenized products is low at the moment, according to 21.co research strategist Tom Wan, citing “thin liquidity” as one of the primary reasons.\nThis creates a “chicken and egg problem,” as issuers are struggling to see a clear benefit in tokenizing assets on-chain with low demand, Wan said in an April 30 X post.\nThe good news is that demand for U.S. Treasurys already exists from industry players in the $140-billion stablecoin market.\nTherefore, “it will be easier to find end investors to switch over” when demand picks up, Wan explained.\nTokenized government securities currently account for 1.4% of the total assets tokenized on-chain — up from 0.1% at the start of 2023. However, Wan predicts this market dominance will increase to 10% in the future.\nMid to late-stage private equity firms have the most potential to grow in the tokenization space, Wan told Cointelegraph.\nHe also expects other ETF issuers will follow BlackRock and Franklin Templeton's lead and tokenize RWAs onchain.\nSource: Cointelegraph Research/RWA.xyz\nBoston Consulting Group estimates blockchain-based tokenization will have become a $16-trillion market by 2030.\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Business","#Adoption","#Tokens","#Stablecoin"],"author":"by Brayden Lindrea","category":null}