{"id":"435a39d4-bbe9-41b6-9695-c58ed4fa5c80","article_link":"https://cointelegraph.com/news/onboarding-billions-users-invisible-blockchain-rise-de-pins","website_source":"Cointelegraph","article_type":"News Article","summary":"Decentralize with Cointelegraph dives into the inner workings of DePINs and how they leverage blockchain to revolutionize real-world applications.","title":"The rise of DePINs: From noise pollution sensors to robo-cafes","detailed_content":"The latest episode of the Decentralize with Cointelegraph podcast takes a thorough look at decentralized physical infrastructure networks, or DePINs, to better understand how they leverage the power of blockchain to decentralize real-world use cases that can result in scalable, secure and user-friendly applications.\nBuilding a decentralized world\nDePINs are quietly working behind the scenes to bring the power of blockchain into everyday applications and use cases — all while effortlessly onboarding billions of new Web3 users. \nImagine a world where noise pollution data collected from phones earns users rewards. Or picture a future where a robo-cafe is co-owned on a decentralized network while passively earning users income from its operation selling coffees and ice cream. \nThese are just a few possibilities unlocked by DePINs, a concept that breaks down the barriers to entry and empowers individuals to participate in a decentralized future.\nThe guest on this latest episode of Decentralize with Cointelegraph is Leonard Dorlöchter, co-founder of the Peaq network — a layer-1 blockchain protocol hosting dozens of new DePIN applications.\nCointelegraph sat down with Dorlöchter at the Token2049 conference in Dubai to peel back the layers of DePINs and find out what it takes to build networks capable of scaling for the masses.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWhile these networks can be deployed on an enterprise level, Dorlöchter explained that they can also be run via smartphones, meaning gone are the days of needing a hefty investment in specialized hardware. \nThrough DePIN applications, users can contribute to a network simply by downloading an app to open up a world of decentralized and tokenizable opportunities.\n“Crypto is finally getting real because there are, for the first time, real-world tangible use cases that make sense and that users can use and contribute that have never used a wallet before.”\nRelated: Web3 wellness ring lets users own their health data — and wear it too\nDePINs are more than just a new technological tool — they also represent a philosophical shift toward a more “people-powered” future. \nBy enabling individuals to contribute their resources and data to a network, DePINs help break the stranglehold of centralized corporations and usher in a more collaborative and equitable tech ecosystem.\nTo learn more about DePINs and how this blockchain-based tool can steer major industries toward a more decentralized future and onboard billions of users, listen to the full episode of Decentralize with Cointelegraph on Cointelegraph’s podcast page, Spotify, Apple Podcasts or your podcast platform of choice. And don’t forget to check out Cointelegraph’s full lineup of other shows!\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nCointelegraph does not endorse the content of this article nor any product mentioned herein. Readers should do their own research before taking any action related to any product or company mentioned and carry full responsibility for their decisions.\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-29","tags":["#Blockchain","#Decentralization","#Adoption","#Podcast","#Decentralize with Cointelegraph"],"author":"by Savannah Fortis","category":null}