{"id":"4446e93f-a54b-4177-b390-411d84c8e22b","article_link":"https://cointelegraph.com/news/blockchain-for-good-alliance-launches-web3-blockchain-life-dubai","website_source":"Cointelegraph","article_type":"News Article","summary":"The alliance is joined by Bybit Web3, Solana Foundation, Aptos, Moledao, Harvard Blockchain Club, and numerous other organizations.","title":"Blockchain for Good Alliance launches at Blockchain Life Dubai","detailed_content":"The Blockchain for Good Alliance (BGA) announced its official launch on April 15, at the Blockchain Life Dubai event. \nDescribing itself as a “collaborative network of organizations, projects, and individuals committed to leveraging blockchain technology to solve global social, environmental, and economic challenges,” the BGA has partnered with blockchain-based organizations of nearly every stripe.\nThese include Bybit Web3, Solana Foundation, Aptos, Moledao, Harvard Blockchain Club, ICP.Hub UAE, American University of Sharjah (AUS), Coineasy, Libera, Edu3Labs, Alchemy Pay, Bu Zhi DAO and XueDAO.\nThe newly launched organization will work as an incubator for blockchain tech, according to its website. It’ll provide networking opportunities connecting builders with mentors, resources, and events.\nA spokesperson named Abbie, a representative of the Harvard Blockchain Club, said in a statement that:\n\"We are thrilled to be a part of the Blockchain for Good Alliance (BGA) launch. Through our commitment to exploring university initiatives such as establishing a blockchain publication repository and supporting BGA's impactful projects, we aim to foster a culture of innovation and collaboration within our academic community.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBlockchain social platform Moledao, a BGA partner, described the alliance as a path towards mass adoption in a YouTube video posted on April 14.\nThe concept of “blockchain for good” was recently studied by Italian researcher Silvia Semenzin, at the GRASIA Research Group, Institute of Knowledge Technology, Complutense University of Madrid, in a research article posted to Sage Journals.\nAccording to Semenzin, many initiatives to “do good” through the use of blockchain technology are either motivated by profit seeking or largely ignorant to the realities of disparate class financial relativities.\nThe Blockchain for Good Alliance will operate as a non-profit, something that should largely assuage the typical concerns associated with tech-based endeavors to do good.\nRelated: Over half of U.S. charities now accept cryptocurrency donations\nLily Liu, President of Solana Foundation, said in a statement that this collaboration “enhances our commitment to harnessing blockchain for global benefit.” She added that the platform would drive “impactful change,” by joining the partners together:\n“This has opened doors for innovative public infrastructure projects such as Helium and Hivemapper, where users not only contribute but also earn from their participation. Moreover, Solana's technology facilitates accessible cross-border remittances and new financial products, making it a pivotal player in creating a more inclusive financial system.”\nExchange or buy APT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-16","tags":["#Blockchain","#Non-Profits","#Alliance","#Web3","#Solana","#Aptos"],"author":"by Tristan Greene","category":null}