{"id":"4454df16-fcac-4caa-a2fd-28b2b9e24090","article_link":"https://cointelegraph.com/news/fantom-ceo-defends-solana-amid-network-woes","website_source":"Cointelegraph","article_type":"News Article","summary":"Fantom creator Andre Cronje referred to the Solana network as a victim of success.","title":"Fantom CEO defends Solana amid network woes","detailed_content":"Fantom network creator Andre Cronje has expressed support for the Solana network amid recent transaction failures. Cronje is considered one of the most influential thought leaders in decentralized finance (DeFi).\nAccording to a post on X by Cronje, some critics view the ongoing congestion as Solana’s flaw, but it stems from the ecosystem’s rapid growth, which has increased demand for block space. Cronje stated that performance issues are technical challenges, not consensus mechanism flaws.\nAccording to Dune Analytics, amid a surge in activity driven by the recent memecoin craze on Solana, approximately 75% of non-vote transactions failed on April 4. Yet, proponents argue the data is widely misunderstood.\nSource: Santiago Roel Santos\nCronje referred to the Solana network as a victim of success. The uptick in transaction failures was followed by a recent uproar from Solana users on social media, who complained of failed transactions and a degraded user experience.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMeanwhile, other members of the community supported Cronje’s stance, stating that people often laud blockchain technology for its underlying principles and capabilities. However, when increased demand leads to temporary user experience issues, they tend to react negatively despite craving higher usage.\nSolana CEO Anatoly Yakovenko expressed frustration, noting that addressing congestion bugs is more challenging than total liveness failure. While the latter requires identification and patching, congestion bugs entail a lengthy testing process and releasing updates, hindering rapid deployment.\nRelated: Starknet explains reasons for 4-hour block outage\nThis is not the first time Solana has gone down. Solana suffered a significant outage in early February. Downtime in block production on its mainnet halted the network’s block progression for over five hours.\nSince January 2022, Solana has seen around half a dozen significant outages and 15 partial or primary outage days. Solana-focused software development firm Anza released a postmortem report of the recent outage on Feb. 9.\nThe report revealed that Solana’s Just-in-Time (JIT) compilation cache, which compiles all programs before executing a transaction, encountered a bug. Austin Federa, Solana Foundation’s strategy head told Cointelegraph of plans to replace the old loader system with a new one, set to deactivate upon update rollout.\nThe price of Solana’s\nSOL\n$154\ntoken has fallen around 3% in the last week, stumbling slightly after a 45% rally in March. Its recent weekly drawdown has seen it fall back to being the fifth-largest cryptocurrency by market capitalization, according to CoinGecko data.\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-06","tags":["#Blockchain","#Business","#Decentralization","#Ecosystem","#Solana"],"author":"by Amaka Nwaokocha","category":null}