{"id":"44f2ecdf-a7d1-4452-a0eb-c9e9507f8088","article_link":"https://cointelegraph.com/news/unofficial-gamestop-memecoin-surpasses-100-million-market-cap","website_source":"Cointelegraph","article_type":"News Article","summary":"The Solana memecoin has soared more than 2,000% in the past week following the surge in GameStop’s stock.","title":"Unofficial GameStop memecoin surpasses $100M in market cap","detailed_content":"GME, an unofficial Solana memecoin parody of American gaming retailer GameStop, has surpassed $100 million in market capitalization amid a trading frenzy of its namesake (but unrelated) entity. \nAs of May 14, the GME memecoin has returned 2,291% within the past week and trades at $0.01449 at the time of publication. The move was largely fueled by investor interest in shares of GameStop Corp, listed on the New York Stock Exchange, which havd surged 228% in the past five trading days. \nBreakout of the unofficial GameStop memecoin on Solana: Source: CoinMarketCap\nIn addition, the GME memecoin’s listing on centralized exchanges such as Bitget and BingX appears to have propelled buying activity. \nADVERTISEMENT\nMAY 15, 2024\nWeb3 travel app turns regional experiences into mintable NFTs\nTravelers around the world are ready to discover new destinations, and blockchain is here to help connect local attractions to global experiences.\nTraveling to a new region always conjures up delightful experiences and vivid memories. From visiting a historical ruin for the first time to randomly attending a local musician’s performance, the satisfying feeling of embracing the entire essence of what a touristic visit can offer keeps most of the travel industry operational and thriving.\nHowever, as the idea of a regional visit slowly turns into a plan and then into a calendar-filling endeavor, travelers soon realize that it’s way easier to dream about going to Nordic fjords than actually realizing the whole trip through scheduling, booking and transactions.\nDespite the decade-long digitization of the industry, travel systems are still operating at a surprisingly regional scale. Along with travel agencies, regional attractions and vendors like museums or event venues face limited market reach, often hindering them from marketing and selling their offerings to a global audience. Even when they score by selling tickets to a global customer group for a period of time, the lack of better customer insights makes it hard to reproduce the success.\nFor travelers, that translates to unnecessarily complicated booking processes that require ticketing from multiple apps and services. Furthermore, the potential risks associated with first-time visits beg for full traceability and transparency across the travel experience.\nNFT ticketing for the masses\nThe traditional “Web2” travel industry lacks a reliable solution to seamlessly integrate local offerings with global platforms, and blockchain is here to change that. VisitorApp, a blockchain-powered ticketing solution, showcases how Web3 can simplify regional travel for both travelers and industry participants.\nUsing Camino Network, the first blockchain designed for the needs of the travel industry, VisitorApp offers users a one-stop shop for discovering and purchasing local offerings directly from regional vendors. The VisitorApp team has spent four years to forge regional platforms and mobile apps for cities, regions and event organizers.\n  Read more\nIt appears that the sudden, unexpected return of Keith Gill — the trader widely credited with kicking off the 2021 Reddit-infused GameStop short squeeze — has led to yet another short squeeze of GameStop shares among enthusiastic investors. In the 24 hours following Gill’s return to X, shares of GameStop rallied as much as 111% in price.\nIt’s not just average day-to-day traders who are benefitting from the market euphoria. \nRyan Cohen — GameStop’s CEO, chairman and largest individual shareholder with a 12% stake — reportedly holds $1 billion of unrealized capital gains that arose from the ongoing short squeeze. \nThe memecoin hysteria has gripped much of the crypto industry this year. \nOn May 13, the unofficial Pepe the Frog memecoin Pepe\nPEPE\n$0.000010\n, minted on Ethereum, rallied over 34% in a single day to set a new record high of $0.00001119 on Binance. \nOn March 22, the price of Solana memecoin Dogwifhat (WIF) hit a record high following its $700,000 Vegas Sphere fundraiser. Immediately following the campaign’s conclusion, WIF’s price spiked 25%, briefly pushing the token to $3 and a total market capitalization of $3 billion. \nOn April 3, a trader reportedly turned $13,000 into $2 million within several hours by purchasing Bitget Wallet’s Donotfomoew (MOEW) memecoin, deployed on the Base blockchain, shortly after its launch and selling their positions after MOEW picked up traction. \nThe apparent recklessness of investors gambling on memecoins has attracted warnings from experts. \nIn a statement on April 24, prominent decentralized finance sleuth ZachXBT wrote that 12 Solana memecoins allegedly raised a combined $26.7 million from investors and then abruptly abandoned the projects. According to ZachXBT, the most costly “abandoned” presale project was a memecoin dubbed “I like this coin,” which sported the ticker LIKE.\nRelated: Memecoins rally as Bitcoin recovers to all-time high\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-14","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Business","#Adoption","#Solana","#Memecoin"],"author":"by Zhiyuan Sun","category":null}