{"id":"45009d70-f757-4787-994c-6568a53cf25f","article_link":"https://medium.com/planetatmos/putting-the-exo-in-exogp-406d9b367c90","website_source":"Medium","article_type":"Blog Post","summary":"Planet Atmos Rewards: Exos, Points, and EQD","title":"Putting the Exo in ExoGP","detailed_content":"Planet Atmos Rewards: Exos, Points, and EQDPlanet Atmos is an ecosystem of games connected by their shared Web3 economy and a wholly unique IP.ExoGP is a competitive web3-enabled racing game and the first game from Planet Atmos. ExoGP is a play and earn game. There will be rewards for users to incentivize play, competition, and early gameplay feedback.The Exo is the core game piece for Planet Atmos and will be required to participate in ExoGP. It is both the core identity component of the ecosystem and is also a composable, wearable vehicle. The Genesis Exo NFT collection provides early access to ExoGP gameplay and makes Planet Atmos community members eligible for rewards.Rewards will initially be in the form of non-transferrable points and evolve into on-chain rewards, which ultimately consist of our core token, EQD, and NFTs. Rewards will have seasonality and change over time as we develop a sustainable economy.What are we rewarding users for and what are they being rewarded with?We are rewarding users for their involvement, engagement, and participation within Planet Atmos and ExoGP. The majority of these rewards will be reserved for Exo owners.Exo holders will have the opportunity to earn rewards, firstly in the form of points and later in the EQD token directly. The way rewards are distributed and the quantity of those rewards are subject to change as we continue to refine the balance of the game and pursue a long term sustainable economy.PointsPoints are how we will track users’ engagement prior to the launch of our token, EQD. Points are linked to EQD but the mechanics for any potential conversion or redemption will be shared in subsequent documentation. Points are not tradeable in any way.How to earn pointsExo Owners:Whether or not you own an Exo:Other mechanisms for performance point rewards include teams competing with each other to maximize their share of the team reward pool. Also, pilots competing within teams to gain a larger share of the team’s distribution from the reward pool.Point scoring strategy / alpha:The EQD Token\nEQD, or Emergent Quid is the native currency of Planet Atmos. A formal litepaper is in development and will be released when complete. EQD will be used across the Planet Atmos Ecosystem and will replace the points system for rewarding users once live.Beyond Alpha:As gameplay progresses, the points reward system will be replaced with in-game rewards and EQD, and competitors will be charged entry fees and be eligible to earn fee-based purses. Those purses may also include bonus rewards. Rather than being a simulation game, it is a professional racing circuit where you are entering yourself.This will enable the formation of divisions, leagues, and official teams, ultimately fulfilling the competitive narrative for ExoGP.Additionally, an in-game progression system will enable players to unlock and mint additional gear for their Exo as a direct reward for participating.Beyond ExoGPPlanet Atmos is developing a resource-based economy that enables the creation of gear for their Exo and other items. There will be multiple ways to extract OREs from the planet, and use those OREs to craft items.There are two other game modes besides racing that we have designed around our flight controller for ExoGP. These are ExoBall and ExoArena.Exos are the central individual component for Planet Atmos and are therefore interoperable with these other game modes. However, pilots may find that different loadouts and stat profiles are desirable.The Genesis CollectionMint starts at 1pm PT on May 9 on Magic EdenMore information about the MKIV Genesis Exo can be found here","creation_date":null,"tags":["Gaming","Gaming News","Blockchain","Web3"],"author":"Planet Atmos","category":null}