{"id":"453d30dc-2f36-472a-951a-43d6c505df00","article_link":"https://cointelegraph.com/news/bitcoin-s-euphoria-phase-cools-but-a-btc-bottom-could-be-near-glassnode","website_source":"Cointelegraph","article_type":"News Article","summary":"Data suggests that newer investors are behind Bitcoin’s sell-off, but sell-side exhaustion will eventually mark BTC’s price bottom.","title":"Bitcoin’s ‘euphoria phase’ cools, but a BTC bottom could be near — Glassnode","detailed_content":"The Bitcoin price continues its post-halving retrace, which has seen the market transition into a regime of widespread net redistribution, causing the “euphoric phase” to cool off, according to a Glassnode report that identifies the cohort of investors driving the current sell-side activity. \nBitcoin’s rally to $73,000 reactivated sell-side pressure\nThe Bitcoin\nBTC\n$63,041\n price has had an impressive run so far in 2024, with the flagship cryptocurrency breaching its all-time high on March 5. BTC has since corrected, consolidating within the $60,000 and $67,500 price range over the last two weeks.\nEmploying an accumulation trend score, the market intelligence firm reported that BTC’s rise to all-time highs revealed local distribution patterns, mirroring similar structures seen in previous bull runs.\nGlassnode analyst CryptoVizArt wrote:\n“During the early stages of both the 2020-21 and 2023-24 bull runs, we can see a confluence between local regimes of distribution (light colors) and intervals of price contraction. As the market rallies to new highs, sell pressure is reactivated, as investors bring dormant supply back into the market to satisfy the inflowing demand.”\nBitcoin accumulation trend score. Source: Glassnode\nGlassnode explained that the accumulation trend score intensified as geopolitical tensions in the Middle East escalated, causing a correction to $60,300.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nBTC spot trading volume has soared since spot Bitcoin exchange-traded funds (ETFs) began trading in the United States on Jan. 11, positively impacting the price momentum. Glassnode explains ETF impact on investor behavior using the net unrealized profit and loss (NUPL) metric.\nThe NUPL metric measures the magnitude of net paper profits (or losses) held by the market (normalized by the market cap).\nGlassnode data shows that the NUPL has been greater than 0.5 for the last seven months, meaning the market is in a “classic euphoria phase of a bull market.”\n“Using NUPL, we can identify the classic Euphoria phase of a bull market where unrealized profits surpass more than half the market capitalization size (NUPL > 0.5).”\nBitcoin Unrealized profit and loss. Source: Glassnode\nRelated: Bitcoin sub-$60K levels in focus after daily crypto liquidations near $300M\nShort-term holders caused the latest correction, but seller exhaustion is coming\nDue to high liquidity and the stalling flows into spot Bitcoin ETFs, the euphoria that backed Bitcoin’s yearly highs appears to be cooling off, fueled by selling by recent buyers. Bitcoin’s realized loss breakdown metric reveals that short-term holders (STH) are dominating the market at the moment.\nBitcoin realized loss by STH and LTH. Source: Glassnode\nGlassnode expects the cost basis of younger age bands — one-month to three-month and three-month to six-month cohorts — to “emerge as valuable tools for distinguishing the bull and bear market structures.”\nIn terms of spot price action, this means recent buyers are more sensitive to short-term price movements and have a higher probability of spending in the short term as “the market starts to sell-off.”\nAs the market price approaches each subcohort’s cost basis, their pace of spending can be anticipated to slow down, signaling seller exhaustion.\nBitcoin one-week to one-month cohort cost basis. Source: Glassnode\nAs such, the chances of the market experiencing seller exhaustion over the next few weeks are high since the cost basis of one-week to one-month holders is $66,700, while their realized loss has surpassed the 90-day level on multiple occasions since mid-March.\n“Since the price resides within the $60k to $66.7k range, the MVRV condition is met, and it could be argued that the market is hammering out a local bottom formation.”\nExchange or buy NEAR\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.","creation_date":"2024-05-01","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Bitcoin Price","#Markets","#Cryptocurrency Exchange"],"author":"by Nancy Lubale","category":null}