{"id":"45f13ff0-95ed-4ce8-9897-96c35b0f7bda","article_link":"https://cointelegraph.com/news/lazarus-group-laundered-200m-crypto-since-2020","website_source":"Cointelegraph","article_type":"News Article","summary":"The notorious group of hackers has used a combination of crypto mixers and peer-to-peer marketplaces to launder the stolen funds.","title":"Lazarus Group laundered over $200M in hacked crypto since 2020","detailed_content":"The Lazarus Group, the infamous North Korean state-backed hackers, laundered over $200 million worth of stolen crypto between 2020 and 2023.\nThe funds were stolen from over 25 crypto hacks, according to pseudonymous on-chain researcher ZachXBT’s April 29 X post.\nLazarus is among the most notorious groups of crypto hackers and first emerged in 2009. In total, the Lazarus Group stole over $3 billion in crypto assets in the six years leading up to 2023.\nThe North Korean hackers used a combination of crypto mixing services and peer-to-peer (P2P) marketplaces to convert the stolen digital assets, according to ZachXBT:\n“Identified accounts at Noones and Paxful (P2P marketplaces) that received funds from the hacks and were used to convert crypto to fiat.”\nAccording to ZachXBT, the group of hackers has laundered at least $44 million worth of stolen crypto through the Paxul and Noones peer-to-peer marketplaces, using two usernames identified as “EasyGoatfish351” and “FairJunco470.” These usernames display deposits and trading volumes in line with the stolen funds.\nStolen funds flow. Source: ZachXBT\nThe analysis further indicates that the hacked funds were converted into the Tether\nUSDT\n$1.00\nstablecoin before being exchanged for cash and withdrawn. The group has historically relied on China-based over-the-counter traders for crypto-to-fiat conversions.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOver $374,000 worth of stolen funds were blacklisted by Tether in November 2023, while three out of four stablecoin issuers have blacklisted an additional $3.4 million sitting in a cluster of addresses associated with Lazarus, according to ZachXBT.\nRelated: DeFi platform Hedgey Finance hit by $44 million exploit\nLazarus Group stole 17% of hacked crypto in 2023\nOver $309 million, or 17% of the total stolen funds in 2023, are attributed to the Lazarus Group. 2023 saw over $1.8 billion worth of crypto lost to hacks and exploits, according to a Dec. 28 report by Immunefi.\nEarlier in April, the North Korean hacker group was using LinkedIn to steal digital assets with targeted malware attacks, blockchain security analytics firm SlowMist reported.\nLazarus Group was behind some of the biggest heists in the crypto industry, including the 2022 Ronin Bridge hack that resulted in $625 million worth of stolen cryptocurrency.\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-29","tags":["#Blockchain","#Hackers","#North Korea","#Hacks","#DeFi"],"author":"by Zoltan Vardai","category":null}