{"id":"4649cb04-0def-44d7-9327-1722f2a48828","article_link":"https://cointelegraph.com/news/hong-kong-bitcoin-ether-etf-structures-revealed-ahead-april-30-launch","website_source":"Cointelegraph","article_type":"News Article","summary":"The spot exchange-traded funds will be denominated in the United States dollar, Hong Kong dollar and Chinese yuan.","title":"Hong Kong Bitcoin, Ether ETF structures revealed ahead of April 30 launch","detailed_content":"Hong Kong spot Bitcoin and Ether exchange-traded funds (ETFs) will be remarkably different from their United States counterparts, with the city’s regulator having greenlit them for an April 30 launch. \nAccording to a report by one of the issuers, ChinaAMC, its spot Bitcoin\nBTC\n$63,026\nand Ether\nETH\n$3,032\nETFs will track the performance of the Chicago Mercantile Exchange’s crypto indexes. Redemptions will be available in both fiat money and crypto funds. In addition, ChinaAMC’s crypto ETFs will be denominated in three currencies: the U.S. dollar, Hong Kong dollar and Chinese yuan. Investment asset manager BOCI-Prudential and crypto exchange OSL will act as the custodians for the ETFs. \nThe aforementioned two firms will also custody spot Bitcoin and Ether ETF assets for issuer Harvest Global. BOCI and OSL \"effectively solves problems such as excessive margin requirements, price premiums caused by missing short positions, and roll losses, thereby more accurately reflecting the real-time value of Bitcoin and Ethereum,” said Harvest Global staff in a statement. \nMeanwhile, Hong Kong-based HashKey Capital will jointly launch its spot Bitcoin and Ether ETFs with Bosera Asset Management. Regarding the future of the crypto ETFs, its staff wrote: \n“The approval of the virtual asset spot ETF and the innovative introduction of a currency-holding subscription mechanism (which allows investors to directly use Bitcoin and Ethereum to subscribe for corresponding ETF shares) are expected to further promote the development of the virtual asset market in Hong Kong and even Asia., attracting more global capital inflows.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nOn April 24, Bloomberg senior ETF analyst Eric Balchunas mentioned that Hong Kong Bitcoin ETF management fees will range from 0.3% to 0.99%. This is much higher than U.S. spot Bitcoin ETFs, where some issuers charge less than 0.25% per annum. “A potential fee war could break out in Hong Kong over these Bitcoin & Ethereum ETFs,” commented Bloomberg analyst James Seyffart. \nThe structure of Hong Kong spot crypto ETFs (Source: Bloomberg)\nAll three ETF issuers will create and redeem ETF shares on Hong Kong's regulated crypto exchanges, OSL and HashKey. Each day, investors will have until 11:00 am local time to redeem their shares for cash or until 4:00 pm for crypto withdrawals. BOCI Prudential will serve as the custodian for all issuers, while market makers include Vivienne Court, Virtu Financial and others. \nRelated: Hong Kong approves first Bitcoin and Ether ETFs\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-24","tags":["#Blockchain","#Cryptocurrencies","#Hong Kong","#Business"],"author":"by Zhiyuan Sun","category":null}