{"id":"46b682ec-e0a8-4933-9a93-4386ed6ddffb","article_link":"https://cointelegraph.com/news/solana-ethereum-transaction-fees-race","website_source":"Cointelegraph","article_type":"Tweet","summary":"The potential flip could further cement Solana’s status as an “Ethereum killer,” which has been questioned due to recent network outages.","title":"Solana could flip Ethereum in transaction fees within a week: Report","detailed_content":"The Solana network could be on track to overtake the Ethereum network in transaction fees, a potentially significant development for Solana’s status as a so-called “Ethereum killer.”\nSolana could flip Ethereum’s transaction fees as soon as this week, according to Dan Smith, senior research analyst at Blockworks, who wrote in a May 7 X post:\n“Solana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week.”\nCaptured maximal extractable value, or MEV, refers to profits that are mostly captured through arbitrage trading on protocols. MEV measures the maximum amount of value that can be extracted from a blockchain by a user or a group of users.\nMoreover, Solana’s $2.8-million total economic value was near Ethereum’s $3.1-million total economic value on May 7, according to Smith’s X post:\n“Defining ‘total economic value’ (shill me better names) as total transaction fees + captured MEV returned to validators. Yesterday, Ethereum: $3,165,772, Solana: $2,803,313.”\nTotal economic value of Solana and Ethereum. Source: Dan Smith\nHowever, Solana’s daily transaction fees are still far from Ethereum’s. Ethereum generated over $2.75 million worth of fees in the past 24 hours, compared to Solana’s $1.49 million, according to DefiLlama data.\nSolana and Ethereum TVL. Source: DefiLlama\nLooking at the total value locked (TVL), Solana’s $3.94 billion in TVL is still a small fraction or around 7.4% of the Ethereum network’s $53 billion TVL.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: How Binance played a key role in arrest of ZKasino scam suspect\nIs Solana really an “Ethereum killer?”\nSolana launched on mainnet in March 2020, with a claimed throughput of 50,000 transactions per second (TPS), promising to improve on the lack of scalability and inefficiencies of Ethereum, as a so-called “Ethereum killer.”\nUnlike Ethereum’s modular approach to scalability via layer-2 (L2) scaling solutions, Solana’s monolithic approach aims to create scalability and low fees as a standalone blockchain network.\nHowever, Solana’s approach saw widespread criticism following its previous outages. At the beginning of April, the demand for memecoins caused approximately 75% of Solana transactions to fail, as the network was unable to handle the large demand.\nOn Feb. 6, block production on Solana stopped for approximately five hours, before engineers and validators were able to restart the network, according to Solana’s status page.\nRelated: Bankruptcy law firm S&C absolved from misconduct, according to new FTX proposal\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-08","tags":["#Blockchain","#Ethereum","#Transactions","#Adoption","#Scalability","#DeFi","#Solana","#Transaction Fee"],"author":"by Zoltan Vardai","category":null}