{"id":"46d47793-9bfe-456b-a9e5-d24e934dc9ed","article_link":"https://cointelegraph.com/news/apple-ios-imessage-zero-day-crypto-exploit-warning-trust-wallet","website_source":"Cointelegraph","article_type":"Tweet","summary":"The firm’s CEO, Eowyn Chen, shared a screenshot of the supposed “high-risk” exploit being sold on the dark web for a whopping $2 million.","title":"‘Disable iMessages’ ASAP to avoid crypto zero-day exploit: Trust Wallet","detailed_content":"Crypto wallet provider Trust Wallet is urging Apple users to disable iMessage, citing “credible intel” of a zero-day exploit that could allow hackers to take control of users’ phones.\n“Alert for iOS users: We have credible intel regarding a high-risk zero-day exploit targeting iMessage on the Dark Web,” the firm posted to X at 7:53 pm UTC on April 16.\nThe firm stressed the zero-day exploit can infiltrate and take control of iPhone users without clicking a link and that high-value account holders are most at threat.\nSource: Trust Wallet\nA zero-day exploit is a cyberattack vector that takes advantage of an unknown or unaddressed security flaw in computer software, hardware or firmware.\nTrust Wallet stressed that all crypto wallets held on an iPhone with iMessage switched on are at risk.\nThe firm’s CEO, Eowyn Chen, shared a screenshot of which she claims to be a potential zero-day exploit, showing an asking price of $2 million for the exploit. \nSource: Eowyn Chen\nHowever, the so-called threat was met with skepticism from several industry pundits. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“If this is your ‘credible intel’ it’s embarrassing. You don’t have evidence of a iOS exploit you have a screenshot of a guy claiming to have an exploit,” pseudonymous blockchain researcher Beau said in response to Chen’s screenshot.\nAsked whether it’s better to be “safe than sorry,” Beau stressed Trust Wallet’s alert could cause panic-induced harm.\nMore than 1.2 million X users viewed Trust Wallet’s alert on X over the first four hours.\nAnother skeptical comment from crypto analyst Foobar later led the firm into revealing its intel was sourced from its “security team and partners” that constantly check for threats.\nCointelegraph reached out to Apple but didn’t receive an immediate response.\nRelated: WinRAR patches zero-day bug that targeted stock and crypto traders\nIt comes as Apple released emergency security updates to fix two iOS zero-day vulnerabilities that were exploited in attacks on iPhones last month.\nApple’s iMessage application has also been used as an attack vector for hackers in previous events, according to security researchers at Kaspersky.\nMeanwhile, more than 280 blockchain networks are at risk of zero-day exploits that could put at least $25 billion worth of crypto at risk, cybersecurity firm Halborn claimed last month.\nMagazine: Should crypto projects ever negotiate with hackers? Probably\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-16","tags":["#Blockchain","#Apple","#Security","#Hackers","#Cybersecurity","#iPhone","#Hacks","#Trust Wallet"],"author":"by Brayden Lindrea","category":null}