{"id":"48fd547f-612f-4d57-9e43-d1c2f7d9e328","article_link":"https://cointelegraph.com/news/pantera-capital-seeks-one-billion-raise-for-new-crypto-fund","website_source":"Cointelegraph","article_type":"News Article","summary":"The Pantera Fund V will invest in a range of blockchain-based assets and is slated for launch in April 2025.","title":"Pantera Capital seeks $1B for a new crypto fund: Report","detailed_content":"Digital asset investment manager Pantera Capital is reportedly looking to raise more than $1 billion for a new fund that offers investors exposure to a “full spectrum” of blockchain-based assets.\nSlated for an April 2025 launch, the Pantera Fund V is set to serve as the firm’s ‘all-in-one’ fund, a slight change of tune from its existing Liquid Token Fund, Early Stage Token Fund, Bitcoin Fund and Venture Funds — which offer a more specific investment focus.\nThe fund requires a minimum $1 million allocation from qualified investors. The first close is scheduled for April 1, 2025. Limited partners will need to contribute a minimum of $25 million, according to an April 25 report from Bloomberg.\nStartup equity, early-stage tokens, and liquid tokens are among the asset types that would be included in the Pantera Fund V, according to Pantera’s website.\nPanteramaintains a total of $5.2 billion in assets under management across its four existing funds.\nA $1 billion raise would be the largest for the cryptocurrency industry since May 2022, when Silicon Valley-based venture capital firm Andreessen Horowitz raised a record-setting $4.5 billion.\nVC firm Paradigm is also reportedly negotiating a raise of up to $850 million for a new cryptocurrency fund, which — combined with Pantera — could signal that more institutional capital is coming back into the sector following a market rebound in 2023.\nCointelegraph contacted Pantera for comment but did not receive a response the time of publication. \nLast week, venture capital firm Andreessen Horowitz announced it raised $7.2 billion to invest in several technology-focused sectors, including GameFi and artificial intelligence. However, its $4.5 billion cryptocurrency-focused fund did not receive any additional capital.\n Meanwhile, Pantera has doubled down on GameFi platform InfiniGods, exclusively taking its $8 million Series A round on April 25, the firm revealed in a statement.\nSource: Pantera Capital\nRelated: ‘FOMO’ once drove GameFi funding, but VCs say it’s different this time\nOver $3.5 billion in funds have poured into the cryptocurrency industry, raised across 604 funding rounds so far in 2024. If the current trend continues, this year's funding is on track to clear the $9.3 billion raised in 2023 by a considerable margin, according to RootData.\nDespite the recent uptick, venture capital funding is still far off previous highs in 2021 and 2022, which saw a respective $31.2 billion and $29.3 billion raised. \nCryptocurrency fundraising between Jan. 2020 and April 2024. Source: RootData\nMagazine: The secret of pitching to male VCs: Helping female crypto founders blast off\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-26","tags":["#Blockchain","#Business","#Funding","#Adoption","#Pantera Capital","#Asset Management","#Digital Asset Management","#Cryptocurrency Investment"],"author":"by Brayden Lindrea","category":null}