{"id":"495ee7db-fd63-4f85-b4c9-27afaf6fe9d5","article_link":"https://cointelegraph.com/news/blockchain-data-availability-protocol-avail-600-million-token-airdrop","website_source":"Cointelegraph","article_type":"Tweet","summary":"The airdrop was announced one year after Avail was spun-off from Polygon Labs.","title":"Blockchain data-availability protocol Avail announces 600M token airdrop","detailed_content":"Avail, a Web3 infrastructure layer built using Polygon’s software development kit, will be airdropping 600 million of its native AVAIL tokens to users.\n“The Unification Drop is a unifying force bringing different communities together, rewarding developers, governance contributors, technical educators, rollup users, stakers, and other valuable contributors from across multiple blockchain communities,” Avail said in an April 18 statement. \nFounded in 2020, Avail consists of three segments: Nexus, Fusion and DA. Avail DA improves base-layer transactions further by scaling rollups via methods such as KZG commitments and data availability sampling. \nData availability enables nodes to verify bundled transactions without having to download all data for a block. Meanwhile, KZG commitments, common in zero-knowledge protocols, allow for the verification of underlying data without revealing private information. \nAt the same time, Avail Nexus provides a cross-chain bridge for users to transact or swap for assets on multiple blockchains. Finally, Avail Fusion allows the liquid staking of assets on Ethereum, Bitcoin and others. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAccording to its developers, AVAIL is used to “obtain Avail DA services, secure the unification layer via staking, and take part in governance.” Tokens are airdropped based on a user’s total time, depth and impact of their commitments to the ecosystem. A total of 354,605 wallet addresses will receive the airdropped AVAIL token upon mainnet launch.\nOut of the 600 million token airdrop supply, 90 million are allocated to blockchain ecosystem developers, 49.5 million to testnet users, 380 million to rollup users on various blockchains such as Arbitrum One, 70 million to Polygon stakers and 10.5 million to community contributors. \nThe airdrop is not exclusive to users of the Avail or Polygon ecosystems. “Unification of Web3 requires unification to happen at the most fundamental level,” Avail wrote. “This [airdrop] includes Bitcoin, Ethereum, Solana, Cosmos, Avalanche, Near, and others who have each made unique contributions to the blockchain ecosystem.”\nMany in the Polygon community spoke highly of the airdrop. “Oooh, looks like a massive airdrop is upon @0xPolygon community,” commented Polygon co-founder Sandeep Nailwal, in relation to the news. \nAvail was spun off from Polygon Labs on March 16, 2023. At the time, developers explained that the move was due to Polygon shifting its attention to more Ethereum-native data availability efforts. “Avail as a standalone layer will be better positioned to play a leading role in bringing modular blockchain architectures to market and enabling any Web3 project to scale,” Polygon Labs said in a statement. \nRelated: Polygon CEO says L3s are taking value away from Ethereum, sparking debate\nExchange or buy MATIC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Cryptocurrencies","#Airdrop","#Polygon"],"author":"by Zhiyuan Sun","category":null}