{"id":"496d4be6-858c-4843-b54f-3726ce42143e","article_link":"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend","website_source":"Cointelegraph","article_type":"News Article","summary":"Franklin Templeton thinks Solana could be in the top three largest cryptocurrencies, with the blockchain’s tech in a good place to catch the next crypto wave.","title":"Weekend Wrap: SOL set for bronze, Bitcoiner fat fingers $100K fee and more","detailed_content":"Solana ‘well positioned’ to be a big 3 crypto: Franklin Templeton\nSolana\nSOL\n$154\n— once thought “dead or forgotten” — is in a good place to become the third-largest cryptocurrency behind Bitcoin\nBTC\n$63,046\nand Ether\nETH\n$3,033\n, says investment manager Franklin Templeton.\nSolana has dominated “in capturing the surge of activity in crypto from 2023 to 2024” and is “well-positioned to capture the next wave of crypto adoption, solidifying itself as the third major crypto asset,” the firm said in a May 2 market note.\nFranklin Templeton pinned memecoins like Bonk (BONK) and Dogwifhat (WIF) along with “major airdrops” like Jito (JTO) and Pyth Network (PYTH) as kicking off a “wealth effect” on Solana which pumped token prices and boosted decentralized exchange volumes.\nMore expected airdrops over the next months and memecoin trading showing “no signs of slowing down” are set to keep that wealth effect in motion, the firm believes.\nSource: Franklin Templeton Digital Assets\nThe “next wave of adoption” is likely decentralized physical infrastructure networks (DePINs), compressed nonfungible tokens (NFTs), centralized limit order books (CLOBs) and payments — “especially micropayments” — which Solana is “uniquely qualified” to tackle, the firm wrote.\nFranklin Templeton noted the blockchain’s congestion issues, saying current activity had “pushed Solana to its limit” but added its developers are working a fix with the Firedancer update slated for later this year.\n“Crypto enthusiasts are wondering what the next big thing in crypto will be,” it wrote. “While we don’t know the precise answer, we’d argue there is a strong chance it happens on Solana.”\nSOL is currently the fifth largest cryptocurrency with its market capitalization at $65.3 billion, according to CoinGecko. It is the fourth-largest blockchain with a total value locked of $3.99 billion, per DefiLlama.\nFat-fingered Bitcoin user seemingly pays $100K fee by mistake\nA Bitcoin user appears to have accidentally paid a nearly 1.6 BTC transaction fee, worth over $100,000, to send less than $6.50 worth of the cryptocurrency.\nOn May 4, blockchain tracking X account Whale Alert posted about the likely fat-fingered error, writing “100,254 USD has just been paid for a single transaction.”\nIn all, the user spent 1.59 BTC to send 0.0001 BTC.\nSource: Whale Alert\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nIt’s unknown who owns the transacting and receiving wallets — Blockstream’s analysis put that the transaction was “possibly self-transfer.”\nSome wallet apps allow users to denote the transaction fees they wish to pay. Higher fees mean faster processed transfers with the opposite true for lower fees for those happy to wait.\nIf this was a case of a self-transfer it’s likely the user erroneously swapped the input amounts in whatever wallet they used — putting nearly 1.6 BTC they wanted to send in the “fee” area and the $6.50 worth of BTC fee they wanted to pay in the “send” area instead of the other way around.\nFormer LA mayor, Biden adviser joins as Coinbase advisers\nFormer Los Angeles mayor Antonio Villaraigosa and former Atlanta mayor and President Joe Biden adviser Keisha Lance Bottoms have joined paid positions on crypto exchange Coinbase’s advisory council.\nCoinbase chief policy officer Faryar Shirzad said in a May 2 X post that Villaraigosa and Bottoms’ council roles are meant to help with “bridging the gap between policymakers and the American people.”\nBiden (middle) and Bottoms (middle right, to Biden’s left) at a January 2023 service in Atlanta for Martin Luther King Jr.’s birthday. Source: The White House\nCoinbase spun up its Global Advisory Council last May to bolster its political lobbying efforts, or as it put it, to “strengthen relationships with strategic stakeholders.”\nA month later the Securities and Exchange Commission sued Coinbase alleging it operated as an unregistered securities exchange — a lawsuit the exchange is fighting.\nVillaraigosa told the LA Times on April 30 that he won’t lobby for Coinbase but will advise it on how to lobby for a “robust, fair regulatory framework.”\nThe same day, Bottoms told The Atlanta Journal-Constitution that she’d help Coinbase with being a voice to lawmakers about crypto.\nWeb3 publishing site Paragraph takes over rival Mirror\nBlockchain publishing platform Paragraph is taking over rival Mirror and is putting focus on a new Web3 social media app — “Kiosk.”\n“Paragraph will take over stewardship of the Mirror product, design system, and brand,” Mirror said in a May 3 blog post.\nIt added Paragraph founder Colin Armstrong will take over as CEO and Mirror founder — and now former CEO — Denis Nazarov will take an adviser role.\nParagraph also said it raised $5 million from Union Square Ventures and Coinbase Ventures in a fundraising round. It didn’t say how it’d use the money and didn’t immediately respond to Cointelegraph’s comment request.\nSource: Mirror\nLaunched in 2020, Mirror allowed writers to monetize their work by offering articles up as NFTs. Paragraph was launched two-years later and did a similar thing but focused more on newsletters.\nRelated: Blockchain and AI: Redefining authorship in publishing\nMeanwhile, the firm backing Mirror, the fittingly named Reflective Technologies, Inc., said the same day that it's launching Kiosk — a client for the decentralized social media protocol Farcaster.\nThe Kiosk team added it “recently raised” $10 million to build the client and hire its founding team in a raise led by Electric Capital with Andreessen Horowitz (a16z) and Variant also pitching in.\nOther news\nA class group of Coinbase customers sued the crypto exchange alleging it deceived them into buying securities and claims the firm’s business model is illegal.\nGrayscale’s spot Bitcoin exchange-traded fund (ETF) saw its first-ever inflows of $63 million on Friday, May 3 since it converted from a trust in January.\nWeb3 Gamer: Web3 gaming won’t exist in 5 years, $656K for best crypto game pitch\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Business","#Ethereum","#Adoption","#Bitfinex","#Tokens","#El Salvador"],"author":"by Jesse Coghlan","category":null}