{"id":"4ba03cf8-fd73-4bca-a61e-fce1fd546333","article_link":"https://cointelegraph.com/news/memecoins-making-millionaires-good-for-crypto","website_source":"Cointelegraph","article_type":"News Article","summary":"Memecoin mania has swept crypto, particularly Solana, and SideShift founder Andreas Brekken weights on whether they are overall positive or negative for crypto.","title":"Memecoins are making millionaires, but are they actually good for crypto?","detailed_content":"The crypto bull market is back, and with it comes everyone’s favorite — or least favorite — symbol that euphoria is returning: memecoins.\nHeadlines have been abuzz with wild stories of traders turning relatively modest sums of money into multimillion-dollar jackpots by getting in early on a token that ends up exploding. But for everyone who hits a major payday, there is inventively someone else who loses tons of money by betting too much on the wrong coin.\nIt seems like everyone has a strong opinion on memecoins, whether they think they bring a sense of joy and fun to crypto that is often missing or think they distract from the real-world issues blockchain seeks to solve.\nOn episode 14 of The Agenda podcast, hosts Jonathan DeYoung and Ray Salmond speak with Andreas Brekken, founder of no-sign-up crypto exchange SideShift.ai, about the positives and negatives associated with the memecoin frenzy, as well as what it all means for crypto as a whole.\nThe benefits of memecoin hype\nBrekken believes that memecoins are overall “a super easy and friendly way for normal people to get involved in crypto just using your phone” and “a completely harmless way to use crypto” with one’s friends.\nHe argued that memecoins are a net positive for the crypto ecosystem, as they help people engage with blockchain technology and learn more about how cryptocurrencies work. They also function as a real-world testing ground for the technology:\n“We’re testing real stuff because the same technology we can use to trade memecoins is literally the same technology we use to trade any other assets on-chain or cross-chain.”\nThe chain-congesting frenzy on Solana, for example, will force the network to improve its speed and reliability, which will ultimately benefit the blockchain in the long term, said Brekken.\nWhen asked what more serious crypto projects can learn from meme tokens, Brekken said he admires the speed at which memecoins are able to build strong communities. He also pointed out that many memecoin developers burn their liquidity provider tokens so that their initial liquidity cannot be removed, demonstrating their commitment to a project — something other developers might imitate in the future.\nMemecoin gambling\nMost memecoins admittedly have no intrinsic or real-world value. As such, many people approach them as a gambling opportunity, one where there is the hope of making life-changing money. However, a large number of memecoin projects end up being outright scams and rug pulls, meaning that investors face the very real possibility that their funds will go to zero.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nBrekken compared gambling on memecoins to gambling at Vegas or on sports: Some people go to casinos with a small amount of money and have fun with their friends no matter the outcome, while others cash out their life savings, lose it all on black and are left with nothing but regrets.\nHe added, however, that one must zoom out to get the bigger picture rather than being upset at memecoins themselves:\n“Maybe the bigger question is, why are people gambling so much? I think one way to look at this is it may be that people are gambling because they don’t trust the system to give them a fair chance, and they’re looking at the inflation, and your money is becoming worthless all the time, and your salary is not going up. So it could be that it’s just a symptom of a financial system that people don’t trust.”\nTo hear more from Brekken’s conversation with The Agenda — including his thoughts on token names and free speech, the future of memecoins, and how memecoin seasons influence the broader crypto ecosystem — listen to the full episode on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\nMagazine: 5 dangers to beware when apeing into Solana memecoins\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.","creation_date":"2024-04-17","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#Cryptocurrency Exchange","#Podcast","#Uniswap","#Solana","#DEX","#Memecoin","#The Agenda"],"author":"by Jonathan DeYoung","category":null}