{"id":"4bb5ae38-d1b5-4a0c-bd38-dde83285bf2a","article_link":"https://medium.com/yield-guild-games/yield-guild-games-treasury-update-april-1-2024-3b3d6c017f77","website_source":"Medium","article_type":"Blog Post","summary":"The following is a summary of the Yield Guild Games (YGG) Treasury Update, which follows up on the February 2024 Community Update and…","title":"Yield Guild Games: Treasury Update — April 1, 2024","detailed_content":"The following is a summary of the Yield Guild Games (YGG) Treasury Update, which follows up on the February 2024 Community Update and outlines the status of Yield Guild’s treasury of assets as of April 1, 2024.Yield Guild Games (YGG) has undergone an evolution from being the first and largest web3 gaming guild to the first web3 protocol enabling the formation and growth of onchain guilds. Through its partnerships across games, web3 infrastructure projects, and guilds, YGG addresses a primary challenge of the gaming industry — targeting high-value players and driving community engagement.With over 100 web3 partners, eight regional guild partners, and two user acquisition products, YGG continues to build an ecosystem where great games and communities intersect. Supported by the Yield Guild Games Association (Yield Guild), which has maintained a carefully managed treasury, YGG has created a sustainable environment where players can have access to premium assets enabling them to build their onchain reputation and earn rewards.As of April 1, 2024, Yield Guild’s treasury holds US$67 million worth of assets, divided into three categories: Token Positions, NFT Gaming Assets, and Network Validators.Token PositionsToken positions make up US$62.6 million, or 93.5% of the treasury. Vested tokens make up US$43.2 million, further broken down to US$17.1 million in stablecoins and large-cap tokens, and US$26.1 million from tokens of games and partners. The remaining US$19.4 million is in unvested tokens, SAFTs and SAFEs.NFT Gaming AssetsYGG holds US$4.0 million in vested assets and US$405,000 in unvested NFTs.Network ValidatorsYield Guild has 56.1 million OAS tokens, valued at US$5.3 million, staked on the Oasys Network. The Association also has 1.0 million RON tokens, valued at US$4.1 million, staked on Ronin. Lastly, Yield Guild staked 548,000 XPLA tokens valued at US$157,000.“On the back of a long bear market, we are very happy with our strong position in terms of both vested tokens as well as our position with gaming tokens and NFT gaming assets,” said YGG co-founder Beryl Li. “Our position has benefited greatly from our proactive role as a validator for three important networks in the web3 gaming space. In total, we have earned in excess of US$3.0 million in validator rewards. We are really looking forward to strong growth in the year ahead as more of our partner games come online and the YGG community drives gaming adoption forward.”With a strong treasury, YGG has over 20 months of runway for business operations, extending into 2026. In the next 12–18 months, projects will launch with Yield Guild holding assets in these games and services.Yield Guild has been able to defend, maintain, and grow its position even during the bear market, with the treasury reflecting this success. The Association is poised to leverage its position as new games launch in 2024 and 2025. The Yield Guild treasury will continue to be used to make strategic partnerships, build an onchain guild network, and further improve questing products.View the full Yield Guild Games Treasury Update here.","creation_date":"2024-05-02","tags":["Cryptocurrency","Blockchain","Gaming","Games","Web3"],"author":"Yield Guild Games","category":null}