{"id":"4c3ea628-822b-4c42-ae76-14328f3fb117","article_link":"https://cointelegraph.com/news/hyperledger-financial-infrastructure-open-source","website_source":"Cointelegraph","article_type":"News Article","summary":"Governments and major financial institutions are actively building open-source blockchain solutions on the Linux Foundation’s Hyperledger tools.","title":"Why financial infrastructure needs to be open-source — Hyperledger","detailed_content":"Open-source governance and development tools remain prerequisites for governments, organizations and financial institutions that want to leverage blockchain technology.\nSpeaking exclusively to Cointelegraph at Paris Blockchain Week, Hyperledger executive director Daniela Barbosa discussed why open-source blockchain technology is a non-negotiable requirement for global institutions.\nBarbosa, who also serves as the general manager of the Linux Foundation, said shifting critical financial infrastructure onto blockchain protocols hinges on the underlying network being open-source and open governance.\nOpen-source blockchain infrastructure like Hyperledger Besu operates on Ethereum, but enables public and private permissioned use cases. Source: Daniela Barbosa, Hyperledger Foundation.\n“All around the world, organizations are selecting Hyperledger families to work with because they know it’s under the Linux Foundation. It’s under that open governance and open development, and it has the backing of major companies, governments and organizations,” Barbosa explained.\nThe Hyperledger director said that organizations tapping into their technology stack care not only that the tools are open-source but that there is open development and an active community of diverse maintainers and code contributors.\n“Nobody wants to build new rails on code that one company owns. If that company goes out of business or changes its mind and says we’re no longer open source, you must pay license fees to continue using what you built.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBarbosa also believes the Linux Foundation’s focus is on fostering open governance and the development of tools under its umbrella. She highlighted critical infrastructure like Linux Kernel’s use in a myriad of computing systems as an example of the embeddedness of open-source infrastructure.\n“For the last 25 years, the Linux Foundation has been building open source communities and the most important code. Think Linux Kernel and Kubernetes. Essentially, all cloud computing runs on Kubernetes,” Barbosa said.\nRelated: Hyperledger onboards Citi, forms Besu working group headed by DTCC\nThe Linux Foundation GM said that several organizations have made efforts to open-source their software and code. However, she questioned whether making this information openly useable on GitHub does enough to make the tools openly developed and governed.\n“That’s what the foundation does; we bring that open governance and development. Banks who compete with one another can come and collaborate. Companies like Accenture and IBM could collaborate on things for the community,” Barbosa explained.\nRelated: Tokenized asset market could hit $16T on public blockchains — RippleX VP\nShe added that this is an essential long-term consideration for the financial services industry in the event that regulators begin to probe who owns what and makes changes to the underlying code.\nBarbosa also unpacked the development history of Hyperledger’s blockchain tools. Hyperledger Besu, a prominent Ethereum execution client, has become one of its most important infrastructure offerings.\nHyperledger Besu is an open-source Java Ethereum execution client. It offers public and private functionality and can run all Ethereum smart contracts. Users can use all Ethereum token standards, including nonfungible token standards ERC-20 and ERC-721.\nHyperledger Besu is among the top three Ethereum execution clients by user numbers. Source: Daniela Barbosa, Hyperledger Foundation. \n“By 2019, institutions were very interested in Ethereum ecosystem. This was the contribution that came in from Consensys around the time that the Hyperledger Foundation and Ethereum Enterprise Alliance joined forces,” Barbosa said.\nBarbosa cited on-chain data that reflects 12% of Ethereum mainnet users running Hyperledger Besu as an execution client. Consensys Linea runs on the client, as well as Hedera Hashgraph.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Linux","#Government","#Ethereum","#Open Source","#Adoption","#Hyperledger","#Ethereum Price"],"author":"by Gareth Jenkinson","category":null}