{"id":"4cc0baac-0dc4-4691-a46b-0be8d822b8e5","article_link":"https://cointelegraph.com/news/web3-protocol-receives-23m-boost-to-decentralize-ai","website_source":"Cointelegraph","article_type":"Tweet","summary":"Web3 protocol announced $2.3 million pre-seed funding to develop a verification network using a proof of inference mechanism.","title":"Web3 protocol receives $2.3M boost to decentralize AI","detailed_content":"Inference Labs announces a $2.3 million pre-seed funding round to focus on developing a network for zero-knowledge verification with Proof-of-Inference for AI.\nAs the global integration of artificial intelligence (AI) accelerates, concerns are growing regarding its potential for monopolization and manipulation. Experts think AI technology must adhere to the principles of freedom of expression and inclusivity to make the world a “more equitable place.”\nAware of AI’s potential risks, such as discrimination or algorithmic bias, the Web3 community advocates for accessible technologies that encourage open participation and prevent the concentration of power.\nDemocratization of AI\nInference Labs is leveraging Web3’s transformative potential to foster a decentralized, transparent and secure environment where AI can thrive. The company is committed to making AI more decentralized, democratized and self-sovereign.\nTo put its ideals into practice, Inference Labs announced a $2.3 million pre-seed funding round led by Digital Asset Capital Management, Delphi Ventures and Mechanism Capital. The funding attracted a diverse group of investors, including Big Brain Holdings, BitScale Capital, Edessa Capital, ID Theory and Metropolis DAO.\n🚀 Exciting News! Inference Labs has raised $2.3 million in pre-seed funding to bring revolutionary changes to AI with Proof-of-Inference, starting with liquid restaking & $TAO. Thank you to all our amazing investors for believing in our vision! #bittensor #decentralizedAI pic.twitter.com/xCoPzIkri9\n— Inference Labs (@inference_labs) April 15, 2024\nInference Labs emphasized that this investment will optimize its innovative approaches to efficient AI verification and catalyze the ecosystem by helping the team grow and accelerate product development.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nInference Labs’ team has more than 30 years of startup experience combined. Source: Inference Labs\nProof of Inference\nWith Omron, Inference Labs blends zero-knowledge cryptography and advanced machine learning with Proof-of-Inference. Proof-of-Inference allows miners to provide predictions along with ZK proofs to ensure computational integrity, confirming their predictions were run on a specific model directly on the blockchain.\nBy rewarding miners who deliver the most accurate predictions and verifiable models, the subnet ensures optimal performance for its use cases. Inference Labs aims to enhance the Bittensor economic system by introducing a market-driven approach to incentivize miners based on their performance and the volume of on-chain verifiable transactions.\nMerging allocation strategies and AI\nAdditionally, Inference Labs introduced Omron.ai to address the complex challenge of optimizing staked allocations across Actively Validated Services (AVS) through the application of artificial intelligence (AI).\nOmron offers a practical solution to selecting the most advantageous AVS among potentially tens of thousands of options by considering a variety of risk factors, including changes in AVS rewards as more operators enter the market and their effects on risk-adjusted yields. As Omron begins to receive payments and slashing data, the subnet will be well-positioned to integrate this real-time data, ensuring that these models provide a more accurate depiction of yield.\nOmron allows users to stake their digital assets like Ether\nETH\n$3,032\nand earn rewards through their choice of Liquid Restaking (LRT) protocol. For example, Renzo converts staked ETH or liquid staking tokens (LSTs) into a new type of tradable token that continues to earn rewards. These tokens are also used within the Ethereum network to gain additional financial returns and provide vital data for AI training on the Bittensor network.\nOmron operates through a complex system of smart contracts, Bittensor validators and mining nodes, which are computers that process the computationally intensive requirements of Inference and zero-knowledge (ZK) proofs. The Bittensor economic model incentivized the creation of Subnet 2, a powerful zero-knowledge machine learning (ZK-ML) compute cluster.\nThe Bittensor decentralized network allows machine learning models to exchange and monetize on a blockchain platform. On the Bittensor, nodes that host these models serve requests for AI services and earn crypto in return for their computational contributions.\nInference Labs’ strategic integration of AI and blockchain through the innovative Proof-of-Inference mechanism and the successful pre-seed funding round marks a forward-thinking step toward democratizing AI technology and ensuring its development is equitable, accessible and protected from monopolistic tendencies with sovereignty.\nLearn more about Inference Labs and Omron\n#Blockchain\n#Decentralization\n#Funding\n#AI\n#Web3\n#Staking\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-09","tags":["#Blockchain","#Decentralization","#Funding","#AI","#Web3","#Staking"],"author":"by Emre Günen","category":null}