{"id":"4d1a4d74-a56e-499c-93ab-20958749bafd","article_link":"https://medium.com/@vechainofficial/vechain-king-of-rwa-to-integrate-blockchain-in-ufc-fighter-gloves-showcasing-real-world-asset-195943f4f84d","website_source":"Medium","article_type":"Blog Post","summary":"The tokenization of real world assets has become one of the hottest topics in the blockchain space following the entry of Blackrock, a…","title":"VeChain “King of RWA” To Integrate Blockchain In UFC Fighter Gloves, Showcasing Real World Asset…","detailed_content":"The tokenization of real world assets has become one of the hottest topics in the blockchain space following the entry of Blackrock, a leading asset manager, and their recent announcement of intent to launch an ‘RWA’ initiative. The notion of tokenizing everything, from stocks to skyscrapers, has single-handedly transformed the mass perception of blockchain technology as a viable tool for economic transformation.VeChainThor, our blockchain, has long been heralded as one of the few protocols to actually deliver in this area, working with influential companies from automotive and major IT companies, to Walmart, PwC, DNV, BMW and more. Most recently, we joined forces with Boston Consulting Group and launched a new global initiative, the VeBetterDAO ecosystem, to deliver an impactful dApp ecosystem for both consumers and enterprises to tokenize real world activity and derive new kinds of value from individual behaviours.The ability to imbue physical objects with immutable digital identities has a myriad of applications, from authentication to provenance, consumer engagement and marketing to sustainability, auditing and much, much more.Whether preserving the value of a luxury product in a secondary market or helping businesses collaborate in seamless data environments, the value add of blockchain is no longer in question, and the Web3 revolution has begun in earnest, with VeChain as its pioneer.The UFC is one of the fastest growing sporting brands in the world. Our global marketing partnership, announced in 2022, not only helped VeChain gain visibility in 900 million households globally, but vastly increased our digital footprint across media channels, offered new channels for community engagement and growth, and has helped boost the adoption of the VeChainThor protocol, highlighted by the sustained, rapid growth in new addresses seen recently on the network, adding 1.2 million new addresses over the past year.While our partnership began under the pretext of marketing, we are excited to share that the relationship has grown further, entering a new phase of technological integration. During UFC300, a new set of fighter gloves will be unveiled that not only improve the safety and wellbeing of UFC athletes, but contain VeChain-powered NFC blockchain technology.At a global press conference on Friday 12th 2024, Dana White will unveil a new development to a global audience — the integration of VeChain’s blockchain technology with sporting apparel that enhances both athlete performance, and improves the fan experience, offering a means of authentication and enhanced brand/athlete engagement post-event.This development will take place on a global stage and showcase a tangible use case of blockchain to a largely non crypto-native audience. To mark the occasion, Dana White has minted an initial set of 25 exclusive gloves for distributions to a prestigious list of A-list talent, including Joe Rogan and others, placing VeChain’s technology in the hands of some of the world’s most influential people.As a leader in the ‘RWA’ field, having been actively developing solutions since 2015, our experience, enterprise prestige, and technological prowess places the VeChainThor blockchain in the optimal position to lead a new phase in blockchain adoption. Working hand in hand with enterprise leaders and leveraging our proven proprietary technologies, we continue to remain incredibly confident of our role as the frontrunner and deliverant of this new era of tokenization and blockchain mass adoption.For our use case with the UFC and their fighter gloves, post-fights, athletes will donate and give away their apparel. By including VeChain’s NFC chips, our blockchain technology can provide an immutable record of the event itself, including the action between athletes, as well as serve as an authentication tool and introduce new ways to engage with fans of the sport. One example is through bespoke content, dedicated to a single individual, or for unique experiences, marketing opportunities or special offers, such as discounts. It also ensures the legitimacy of the item if sold or traded, eliminating fraud — a common problem for secondary markets.Today marks another step in our aspirations to drive real world adoption of blockchain. The journey is getting ready to get even faster, with regulations and institutions entering the space. We remain excited about our crucial role in building that future.VeChain, headquartered in San Marino, Europe, is the curator of VeChainThor, a world-leading smart contract platform spearheading the real-world adoption of blockchain technology, and a proud pioneer in the field of real world asset tokenization (RWA), having worked with companies in the area since 2015.By leveraging the capabilities of ‘trustless’ data (information without intermediaries), smart contracts, and IoT technologies, VeChainThor has enabled enterprise solutions across a wide array of fields.VeChain now turns its attention to the greatest challenge of all — building digital ecosystems to drive sustainability and digital transformation at global scale.Learn more about VeChain on vechain.org","creation_date":"2024-04-13","tags":[],"author":"vechainofficial","category":null}