{"id":"4dadb577-8cd5-4412-b649-f82ea9f3889e","article_link":"https://cointelegraph.com/news/taiwan-aml-regulations-crypto-fraud","website_source":"Cointelegraph","article_type":"News Article","summary":"Taiwan’s Ministry of Justice proposed four amendments to the country’s AML regulations focused on cryptocurrency firms that plan to impose hefty penalties for noncompliance.","title":"Taiwan proposes tougher AML measures for crypto service providers","detailed_content":"Taiwan wants to amend its Anti-Money Laundering (AML) regulations to combat fraud and AML measures for virtual asset service providers (VASPs). \nTaiwan’s Ministry of Justice has proposed amendments to existing AML laws that could impose jail terms of up to two years for noncompliant firms and fines of up to $1.5 million. The proposed amendments will be sent to Taiwan’s national parliament, the Legislative Yuan, for review.\nThe “New Four Laws to Combat Fraud” was proposed by Taiwan’s Executive Yuan. The amendments aim to strengthen the crackdown on fraud and strictly regulate money laundering prevention measures for crypto service providers.\nThe four critical components of the amended regulations include the fraud crime harm prevention regulations, the money laundering prevention law, the technology investigation and security law, and the communications security and supervision law.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe most notable change comes from the new money laundering prevention law targeting virtual asset service providers. VASPs that violate the law will face harsher penalties for noncompliance.\nThree distinct modifications have been made to the law, requiring revised registration requirements and restrictions for domestic and international currency dealers.\nUnder the newly amended laws, VASPs risk prison sentences if they offer services without registering with the relevant authority.\nA new legal category has also been introduced for money laundering offenses linked to third-party payment accounts and virtual asset accounts.\nRelated: Taiwan will review global trends before deciding on crypto ETFs\nThe penalties for utilizing third-party accounts for money laundering could lead to jail terms of six months to five years and fines of up to 50 million New Taiwan dollars ($1.5 million).\nTaiwan’s Deputy Minister of Justice, Huang Mou-hsin, said under the current provisions, the authorities can only penalize noncompliant cryptocurrency companies administratively. However, the new proposed law criminalizes such behavior with hefty fines and prison time.\nThe proposed law would make foreign cryptocurrency platforms risk criminal penalties unless they establish local firms and seek AML registration.\nThe latest proposal comes a couple of months after the country’s securities regulator said it would propose new laws for digital assets by September.\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Cryptocurrencies","#China","#Taiwan","#Regulation"],"author":"by Prashant Jha","category":null}