{"id":"4dce5cc2-5878-443a-b9b6-0712bb78f8d9","article_link":"https://cointelegraph.com/news/tokenized-assets-public-blockchains-ripple","website_source":"Cointelegraph","article_type":"News Article","summary":"Institutional investors, asset managers and banks are racing to bring financial assets on-chain in a market estimated to grow to $16 trillion in value.","title":"Tokenized asset market could hit $16T on public blockchains — RippleX VP","detailed_content":"Traditional finance (TradFi) firms have warmed up to the idea of tokenizing financial assets on public blockchains as the race toward blockchain-based tokenization heats up.\nAccording to RippleX senior vice president Markus Infanger, TradFi players are finally bringing financial assets on-chain as they look to deploy for production and solve pain points in various value chains.\nSpeaking exclusively to Cointelegraph during Paris Blockchain Week, Infanger said that TradFi’s use of blockchain is finally becoming tangible.\n“We’re starting a paradigm shift for blockchain technology, moving beyond the hype and into real utility. It’s starting to unfold,” Infanger said.\nTradFi wants holistic blockchain solutions\nThe executive said that research estimates pin the future value of tokenized markets at $16 trillion, which is eight times bigger than the total market capitalization of the entire cryptocurrency sector.\n“A couple of years ago, many of us in this space were envisioning that. It’s getting closer to reality, and it’s happening on public blockchains. At some point, it looked like it would only happen on JPMorgan Coin or IBM.”\nInfanger said that advanced conversations with various financial institutions are ongoing, and they are exploring tokenization projects to issue assets on the XRP Ledger. These firms already have distribution lined up and can articulate use cases and how they want to use the underlying blockchain.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nA tangible example of this was HSBC partnering with Ripple-owned technology firm Metaco to allow institutional investors to hold tokenized securities on its new custody platform in November 2023.\nInfanger added that Ripple’s business is becoming more holistic by combining various solutions that make use of XRPL.\nWhile Ripple is widely viewed as “a payments-first company” providing a blockchain-based payment solution to solve economic and financial friction, recent developments are broadening its appeal to both TradFi and decentralized finance (DeFi) players.\n“We have a custody arm, a payments arm and our contributions to the XRP Ledger. The combination is a holistic digital asset infrastructure value proposition for traditional finance and developers who want to solve DeFi problems,” Infanger explained.\nRipple’s stablecoin\nRipple’s recently announced plans to issue its own United States dollar-pegged stablecoin on XRPL and Ethereum will complement its offering to institutions. Cointelegraph previously spoke to Ripple chief technology officer David Schwartz about the details of the stablecoin.\nInfanger added further detail to the impetus behind Ripple’s stablecoin, highlighting that the stablecoin market could reach $2.8 trillion in five years given that there are some $22 trillion that are off-chain.\n“Right now, we’re at $130 billion, so there’s clear demand, and there’s an expected trajectory of enormous growth. We’re really still at the early days,” Infanger said.\nAnother key driver was constant requests from developers in the XRPL ecosystem for a tier-one stablecoin offering like USD Coin\nUSDC\n$1.00\nor Tether\nUSDT\n$1.00\n. Infanger said Ripple had used stablecoins in small-scale experimentation alongside XRP\nXRP\n$0.52\nand its payment product.\n“We really envision our institutional DeFi use case, on one hand, tokenization on XRPL and then in our payments product for optionality and some use cases alongside XRP using the stablecoin and for the XRP ecosystem as a whole.”\nRipple has not yet confirmed when it will launch its stablecoin or what it will call the XRPL and Ethereum-based token.\nExchange or buy XRP\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-18","tags":["#Blockchain","#Ripple","#Adoption","#Stablecoin"],"author":"by Gareth Jenkinson","category":null}