{"id":"4ec7f2cf-2380-4ed8-b8d8-eca0b2703171","article_link":"https://cointelegraph.com/news/600-firms-billions-investment-bitcoin-etf","website_source":"Cointelegraph","article_type":"News Article","summary":"Millennium Management is the largest Bitcoin ETF investor with a $1.9 billion investment.","title":"Over 600 firms reveal billions in combined investment in Bitcoin ETFs","detailed_content":"Over the past week, more than 600 firms have revealed significant investments in spot Bitcoin exchange-traded funds (ETFs) in their 13F filings with the United States Securities and Exchange Commission (SEC).\nAccording to the filing data, professional investment firms reported owning $3.5 billion worth of Bitcoin ETFs.\nAmong them are Morgan Stanley, JPMorgan, Wells Fargo, UBS, BNP Paribas, Royal Bank of Canada and hedge funds like Millennium Management and Schonfeld Strategic Advisors.\nMillennium is the largest BTC ETF investor, with $1.9 billion invested. It invested $844.2 million in BlackRock’s iShares Bitcoin Trust (IBIT), $806.7 million in Fidelity’s Wise Origin Bitcoin Fund (FBTC), $202 million in the Grayscale Bitcoin Trust (GBTC), $45.0 million in the ARK 21Shares Bitcoin ETF (ARKB) and $44.7 million in the Bitwise Bitcoin ETF (BITB).\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nSchonfeld Strategic Advisors, a hedge fund with $13 billion in assets under management, was the second-largest spot BTC ETF investor with a $248 million investment in BlackRock’s ETF and a $231.8 million investment in Fidelity’s fund, totaling $479 million.\nBoothbay Fund Management, a New York-based hedge fund manager, declared a $377 million exposure to spot Bitcoin ETFs, with $149.8 million in IBIT, $105.5 million in FBTC, $69.5 million in GBTC and $52.3 million in BITB.\nPine Ridge Advisers, a New York-based advisory firm, announced a $205.8 million investment in spot Bitcoin ETFs, with $83.2 million in IBIT, $93.4 million in FBTC and $29.3 million in BITB.\nMorgan Stanley revealed a $269.9 million investment in GBTC, making it one of the largest GBTC holders. Aristeia Capital, an alternative asset manager, revealed a $163.4 million investment in IBIT.\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?\nGraham Capital Management, a Connecticut-based investment firm, declared a $98.8 million investment in IBIT and $3.8 million in FBTC, while CRCM disclosed a $96.6 million investment in IBIT. Fortress Investment Group, a New York-based investment firm, disclosed a $53.6 million investment in IBIT.\nSpot Bitcoin ETFs launched in the second week of January, with massive demand in the first three months since they launched. However, in recent weeks, inflows have dwindled significantly. Despite the recent slump, hundreds of financial institutions have revealed billions of dollars invested in spot BTC ETFs.\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-16","tags":["#Bitcoin","#Blockchain","#Adoption","#Morgan Stanley","#JPMorgan Chase","#Hedge Fund"],"author":"by Prashant Jha","category":null}