{"id":"4eeb0b6c-588c-4984-b6c4-3f130fff32b3","article_link":"https://cointelegraph.com/news/crypto-on-track-1-billion-users-end-2025-analyst","website_source":"Cointelegraph","article_type":"News Article","summary":"More conservative estimates from the likes of the Boston Consulting Group predict that the crypto industry will reach its first billion users by 2030.","title":"Crypto on track to hit 1B users by end of 2025 — Analyst","detailed_content":"The cryptocurrency industry could reach its first billion users by the end of 2025, according to Bitcoin analyst Willy Woo.\nWoo wrote in an April 29 X post:\n“On track for 1 BILLION crypto users by the end of 2025. An extrapolation of many independent prior studies in this chart. Binance estimates that 65% of crypto users hold Bitcoin.”\nSource: Willy Woo\nWoo’s chart is the first comprehensive model aiming to map out all existing crypto asset users and to predict the first billion adopters, according to Daniel Batten, investor and author of the Bitcoin ESG Forecast. Batten wrote in an X reply to Woo:\n“Incredible chart. The first view we’ve had of when we’ll cross the 1B threshold, with a full backtrace.”\nThe chart defines crypto users as unique entities that completed Know Your Customer (KYC) verification and have previously transacted on the blockchain.\nReaching the first billion crypto users has long been touted as an important milestone for mainstream crypto adoption. Mainstream adopters can bring a new influx of capital, which is important for the price appreciation of digital assets.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: How high can Bitcoin go? New BTC price prediction sees cycle top at $180K\nCan the industry reach 1 billion crypto users by 2025?\nThe number of cryptocurrency owners increased by 34% to 580 million in 2023, according to a January 2024 report by Crypto.com.\nBitcoin\nBTC\n$63,041\nholders grew by 33%, from 222 million in January to 296 million in December 2023, accounting for 51% of global crypto holders. The report notes that the developments around the Bitcoin exchange-traded funds (ETFs) were the main catalyst behind the user growth.\nHowever, the current 580 million users would need a 72% increase to reach the first billion, which seems unlikely based on 2023’s growth.\nIn a 2022 joint report, the world’s largest management consulting firm, Boston Consulting Group, along with Bitget and Foresight Ventures, estimates reaching the first billion crypto users by 2030.\nSource: Boston Consulting Group, Bitget and Foresight Ventures\nThe report compares the internet’s adoption curve to reach one billion users with current cryptocurrency holders and Ethereum addresses with non-zero balances, provided that the current crypto adoption rate continues.\nAccording to BCG, crypto adoption is still low, with “plenty of room to grow.” The consulting giant estimates that only 0.3% of individual wealth is invested in crypto, as opposed to the 25% invested in global equities.\nCrypto bull market phase two: What to expect. Source: Cointelegraph\nRelated: Lido Finance hits 1M validators, fueling the growth of DeFi\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-29","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Ethereum","#Adoption","#Bitcoin Adoption"],"author":"by Zoltan Vardai","category":null}