{"id":"4f1d0c4c-76c1-42b6-a76a-3cf0e6938608","article_link":"https://cointelegraph.com/news/solana-illustrates-dark-side-monolithic-blockchains","website_source":"Cointelegraph","article_type":"News Article","summary":"Modular blockchains might lead to a poor user experience, but — unlike Solana — they remain functional even during periods of high demand.","title":"Solana illustrates the dark side of monolithic blockchains","detailed_content":"Everyone agrees that blockchains must scale. What they don’t agree on is how. This is the “modular” versus “monolithic” discussion unfolding across the industry, and it’s one of the most interesting — and sometimes contentious — debates.\nModular scaling calls for moving small-value transactions to a tiered system of layer-2s and even layer-3s that eventually settle to a base chain. This approach, which has been embraced by the Ethereum (ETH) community, has a major drawback: it leads to network fragmentation and an inferior user experience.\nMonolithic scaling — best exemplified by Solana (SOL) — calls for keeping all transactions on the same chain and optimizing the network with hardware, software, and consensus upgrades to give it greater throughput. The primary benefit of this approach is a better user experience. The main downside is that it can’t possibly work, not without sacrificing the very features that make a blockchain appealing in the first place: decentralization and resilience.\nRelated: The Runes protocol will ignite a new season for Bitcoin after the halving\nProponents of the monolithic approach often misunderstand the fundamental service that a permissionless chain offers. It’s not transaction processing — that’s what centralized networks do. Decentralized networks provide a scarce asset called secure blockspace. Think of it as fuel, but for a decentralized economy. Like all scarce assets, secure blockspace has a limited supply. But demand fluctuates, so the ultimate arbiter of who gets to use it is price.\nThere’s an old joke in commodities that “the best cure for high oil prices is high oil prices.” Higher prices can potentially lead to higher supply in the long run — although there isn’t always more product to pull out of the ground. More importantly, higher prices are guaranteed to reduce demand now. They force everyone to use the commodity more efficiently and price out smaller users altogether.\nSolana's network crashed most recently in February. Source: X\nThat might seem unfair, but the goal is efficiency, not fairness. The alternative is for a third party like the government to either ration fuel or subsidize it. Neither works as intended. Rationing leads to long lines, subsidies lead to waste. Think: kids going on a joyride vs a factory that can’t operate.\nWelcome to the current state of Solana. The monolithic chain experienced spiking demand during the memecoin mania in recent months, leading to high transaction failure rates. Users adopted by trying to submit their transactions over and over, exacerbating the problem. Solana doesn’t have a network mempool, but it now has a de facto queue.\nUsers have been getting upset about Solana's outages for years. Source: X\nThis is what you’d expect to happen if secure blockspace is priced too cheaply.\nModular chains provide different tiers of secure block space for different users — $20 to transact on ETH but only 2 cents to use Arbitrum. But Solana wants to give a $1 trade as much security as a $1 million transfer — even though the $1 trade, like the kids going on a joyride, doesn’t need it.\nRelated: Bitcoin's halving won't see a 600% return this year — so adjust your strategy\nTo be fair, one of the upgrades Solana developers are working on are better fee markets that are more responsive to demand. But if these upgrades work then smaller traders will simply be priced out in peak times. Unlike a modular chain, they won’t have anywhere else to go.\nThe other solution developers are working on are ways of scaling the network with upgraded software and faster hardware. What they don’t realize is that doing so will just invite more small value transfers — there is no limit to demand if you price a scarce good cheap enough. Back when the Soviet Union used to subsidize bread, people would feed it to their animals.\nMeanwhile, the core network infrastructure becomes more centralized and less stable. A chain that is optimized to run at peak performance at all times is more likely to go down, as Solana has periodically.\nThe intentions of the monolithic approach to scaling may be commendable, but the outcomes aren’t — not if we value decentralization and resilience.\nOmid Malekan is an adjunct professor at Columbia Business School and the author of Re-Architecting Trust: The Curse of History and the Crypto Cure for Money, Markets, and Platforms.\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.","creation_date":"2024-04-30","tags":["#Blockchain","#Cryptocurrencies","#Technology","#Transactions","#Tech","#Tech Analysis","#Solana","#Opinion"],"author":"by Omid Malekan","category":null}