{"id":"4f2328b2-9e4a-4a84-9013-012912f48976","article_link":"https://medium.com/@bitsmiley/bitsmiley-officially-launches-on-merlin-and-opens-bitpoint-season-1-on-may-15th-fac754efb4f2","website_source":"Medium","article_type":"Blog Post","summary":"Following the launch of bitSmiley’s Alpha Net Launch on Bitlayer, we are excited to announce that bitSmiley will officially go live on…","title":"bitSmiley Officially Launches on Merlin and Opens bitPoint Season 1 on May 15th","detailed_content":"Following the launch of bitSmiley’s Alpha Net Launch on Bitlayer, we are excited to announce that bitSmiley will officially go live on Merlin Chain on May 15th. We’ll be offering an exclusive liquidity incentive grant for the Merlin community, and detailed information about these rewards will be released tomorrow.At the same time, users who previously earned bitPoints on Bitlayer can now view their bitPoints and corresponding $BIT token rewards. In preparation for the upcoming Season 1, we have reset the points earned during the pre-season.Additionally, on May 15th, we will launch the bitSmiley bitPoint Season 1 simultaneously on Merlin and Bitlayer. Users on both platforms will share Season 1 bitPoints and rewards (token incentives for the Merlin community will be exclusive to Merlin users and will not be included in the Season 1 rewards).Below are the key parameters of the Season 1 and the rules for point calculation:Protocol Key Parameters:\nKey parameters are subjected to changes according to the current market status(a) Minting bitUSD\nPoint Mint=Value of Minted bitUSD×3(b) Providing Liquidity for Specified Trading Pairs on bitCow (bitUSD-USDT/bitUSD-WBTC)\nPoint Add (bitUSD-USDT)=(Value of added bitUSD+Value of added USDT)×2 Point Add (bitUSD-WBTC)=(Value of added bitUSD+Value of addedWBTC)×2(c) Staking bitUSD\nPoint Staking=Value of Staked bitUSD×1.5We encourage users to form teams or join teams using invitation codes. We will rank the total points of each team, and joining a team with higher total points will significantly increase the user’s individual points. The specific bonuses are as follows:*Any team bonus earned prior to joining a group will not contribute to your individual point bonus.Users staking M-bitDisc on the bitSmiley website and associating their EVM wallet address will enjoy additional rewards, as outlined below:*bitDisc staking bonus will be calculated by the end of season 1.Have fun at season 1! Will you be the no.1?","creation_date":null,"tags":["Btc","Bitcoin","Web3","Crypto","Blockchain"],"author":"bitSmiley","category":null}