{"id":"500ca85a-76fc-4349-bc02-83e777fc7f05","article_link":"https://cointelegraph.com/news/safe-token-drops-42-percent-after-enabling-transfers","website_source":"Cointelegraph","article_type":"Tweet","summary":"Safe’s decentralized autonomous organization enabled token transferability on April 23 after achieving several milestones.","title":"Safe token drops 42% after enabling transfers","detailed_content":"After unlocking the transferability of its tokens, the price of Safe (SAFE) tokens plummeted by 42%, going from $3.26 on the day of the unlock to $1.88 on April 30. \nSafe's token contract was unpaused on April 23, enabling holders to transfer their tokens. These tokens had been locked for two years following the decision of the project’s decentralized autonomous organization (DAO) to implement the lock in 2022.\nThis follows a vote from SafeDAO over a token transferability proposal that saw 99.1% of participants voting to ratify the proposal.\nA Safe spokesperson told Cointelegraph that the DAO delayed releasing the tokens to “allow for progressive decentralization.” The DAO collaborated on a roadmap to cover different areas like governance processes and resource allocation. This allowed the community to ensure these areas were mature before unlocking its tokens.\nThe spokesperson said that the proposal to enable token transferability was only put together after the milestones set by the DAO were achieved. They wrote:\n“Unlocking SAFE token brings more utility to the Safe ecosystem, powering the movement for better user experience through smart accounts. This milestone marks the beginning of a new chapter in the journey to making digital ownership easy and accessible.”\nDespite the lack of token transferability and the crypto winter, the Safe team claimed that its user base grew by 22 times. The spokesperson also said their team secured $100 billion in assets and saw 7.5 million accounts created.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nEven though the ecosystem experienced significant growth, the token’s price experienced a massive drop after the DAO enabled token transferability.\nAll-time price chart for the safe token. Source: CoinGecko\nAccording to coin information website CoinGecko, Safe traded at $3.26 on April 23. At the time of writing, the token hovers at $1.88 a piece. This represents a 42% drop since transfers were enabled.\nRelated: ZK systems will have their ChatGPT moment — Telos Foundation\nAfter enabling token transferability for the project, the Safe spokesperson said that the project is looking into building the internet’s ownership layer, where users will have control over their data, identity and assets within the Web3 space.\nThe spokesperson said they will implement native integration for layer 2s to increase scalability and cross-chain functionality with network abstraction. It will also create community activities for its ecosystem.\nMagazine: Woman accused of $6B scam, China loophole for Hong Kong Bitcoin ETFs: Asia Express\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-30","tags":["#Blockchain","#Cryptocurrencies","#Altcoin"],"author":"by Ezra Reguerra","category":null}