{"id":"516c2a28-b602-40dc-a1d4-ca621e05efbf","article_link":"https://medium.com/kroma-network/southeast-asia-blockchain-week-2024-recap-eb475b4bc09d","website_source":"Medium","article_type":"Blog Post","summary":"Kroma Team attended the Southeast Asia Blockchain Week (SEABW) in Bangkok from April 24th to 28th.","title":"Southeast Asia Blockchain Week 2024 Recap","detailed_content":"April was a fruitful month for the Kroma Team! After attending Token2049 in Dubai, we attended the Southeast Asia Blockchain Week (SEABW) in Bangkok from April 24th to 28th and networked with like-minded professionals.The panel session was about the transformative impact of L2 on blockchain adoption. It was a great honor to share the stage and exchange insights with Mark Veer (Head of BD from Mantel), Ben Wan (CCO from Taiko), Kin Wai Lau (Founder of zkCandy), and David (General Partner of Kronos Ventures)!The panel began by comparing the existing Layer 2 infrastructure. Optimistic rollups were praised for their EVM compatibility but criticized for the one-week challenge period, while ZK rollups offer almost instant finality but lack EVM compatibility.They also discussed Ethereum’s future, noting the proliferation of Layer 2 solutions, each with different goals and potential success rates. Lastly, Derek emphasized the importance of balancing technology and go-to-market strategies in building an L2. While good technology is crucial, adoption is equally vital for success.Hosting a booth was always bittersweet. While it presented a great opportunity to connect with partners and potential collaborators, operating it was never easy!However, we were thrilled to see the interest in Kroma from other projects. Some even approached us after Derek’s panel to learn more about our project. Most were particularly curious about the kind of support Kroma provides. We are committed to assisting projects through onboarding and building a vibrant game-centric ecosystem by offering lower transaction fees and fast finality.P.S. Our Business Development lead, Kevin, was interviewed by YGG Philippines! 👀 Stay tuned for more Kroma merch or if you have any ideas for merch we should create, please let us know!Kroma was glad to co-host the Demo Day at the SEABW this year, providing a platform for early-stage startups in Southeast Asia to showcase their projects. It was an excellent opportunity to witness these seasoned teams present and demonstrate their projects on stage. We were impressed by the dedication and innovation of all the participants!It served as a good medium for projects and investors to connect and opened doors for potential collaborations with Kroma in the future. We enjoyed the Demo Day and were happy with the vibrant startup ecosystem in Southeast Asia.After a bustling month, Kroma has been busy preparing for the official launch of Spectrum, a restaking service that offers users the opportunity to stake ETH, stETH, or eETH and earn rewards at an unprecedented level in the industry. While the official launch is scheduled for May 14th, pre-registration is now open for additional Kroma Spectrum Points (KSP) boosts!As Asia’s leading game-centric Layer 2 solution, Kroma is an Optimistic Rollup with a ZK fault-proof system based on the OP Stack and utilizing Scroll’s zkEVM. Kroma will transition to a universal ZK Rollup once the generation of ZK proofs becomes more cost-efficient and faster — using our original project, Tachyon.Website | Twitter | Discord | Github | Medium | Docs | Ecosystem | Brand Kit","creation_date":null,"tags":[],"author":"Kroma","category":null}