{"id":"517739a7-34c6-4b22-836d-4001796766e5","article_link":"https://www.wired.com/story/confusion-spirals-in-crypto-as-the-us-cracks-down/","website_source":"Wired","article_type":"News Article","summary":"The Securities and Exchange Commission launched enforcement actions against some of the industry’s major players, raising questions over crypto’s future.","title":"Confusion Spirals in Crypto as the US Cracks Down","detailed_content":"THE US SECURITIES and Exchange Commission is on the warpath—and crypto is in its crosshairs. Over the weekend, The Wall Street Journal reported that the agency intends to sue crypto firm Paxos for issuing BUSD, a stablecoin developed in partnership with the world’s largest crypto exchange, Binance. \nThe SEC declined to comment, but Paxos, which is based in New York and Singapore, confirmed today that the agency alleges BUSD should have been registered as a security in the US, which requires compliance with complex rules. In a statement, the firm said it “categorically disagrees” that BUSD is a security but has complied with an order from the New York Department of Financial Services to halt the creation of any new BUSD, effectively strangling the coin.\nPaxos did not respond to a request for comment. Binance’s chief strategy officer, Patrick Hillmann, declined to comment on how the SEC’s action would affect the exchange but said the firm will be “reviewing other projects to ensure users are insulated from further undue harm.”\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nThe crypto industry is no stranger to conflict with regulators, but the Paxos case is different—and it has sparked a measure of panic and confusion. The concern is that a ruling against the issuing or use of BUSD will set a precedent that could be applied to all stablecoins, striking down a crucial piece of infrastructure in many crypto markets. “If the supply suddenly dried up, the crypto economy would collapse,” says economist Frances Coppola, who previously worked for HSBC and other banks.\nDesigned to cling to a specific value, usually $1, stablecoins are a critical pillar of the crypto economy. Most are backed by a combination of cash and bonds, which anchors the tokens in circulation to the desired value.\nUnlike cash, which can be difficult to move around, especially across borders, stablecoins are “easy and fast,” says crypto analyst Noelle Acheson, formerly of CoinDesk, helping traders jump on opportunities as they arise. They have “opened up an economy on-chain,” says Ram Ahluwalia, CEO of wealth management firm Lumida, allowing money to “flow into and stay in the ecosystem.”\nThe SEC defines securities as contracts that amount to “an investment of money, in a common enterprise, with a reasonable expectation of profit, to be derived from the efforts of others.” The classification brings with it a range of regulatory and disclosure requirements. If stablecoins were universally determined to be securities, issuers would be required to register them with the SEC, giving the agency a chance to reject coins. Any stablecoins already on the market could be subject to enforcement action.\nBemused members of the crypto industry, including Binance CEO Changpeng Zhao, are now asking how stablecoins can possibly meet the SEC’s criteria, and in particular how crypto coins designed not to fluctuate in value can be said to be sold with a reasonable expectation of profit.\nBut action against a major stablecoin issuer should be no surprise, says Acheson, because the SEC has said on multiple occasions that it believes some stablecoins qualify as securities. Acheson imagines the regulator will argue that stablecoins like BUSD, backed by their issuer’s holdings of established securities such as government and corporate bonds, are by extension securities themselves and must be regulated accordingly.Because neither the SEC nor Paxos have specified the nature of the regulator’s complaint, says Ahluwalia, the impact of a potential lawsuit is unclear for now. But it can hardly be good for stablecoin issuers—and could signal more trouble to come.\nThe move against Paxos is the latest in a volley of enforcement actions launched by the SEC in the aftermath of the collapse of crypto exchange FTX in November. Last week, the regulator announced that crypto exchange Kraken would halt one of its services in the US, after the SEC charged the firm with failing to register a security. And in January, the agency charged crypto exchange Gemini and crypto lender Genesis Global Capital over different services offered to US customers. \nThis crackdown is being described in crypto circles as Operation Choke Point 2.0—a reference to a program launched by the Obama administration, under which US officials were alleged to have pressured banks into severing ties with disfavored industries like pornography and payday lending. \nCoppola says it feels like the SEC’s intention is to “drive crypto entirely offshore,” and out of the US altogether. “The SEC wants to prevent US citizens from interacting with crypto. And I think other countries may follow suit.”\nDespite fears the SEC will target stablecoins more broadly, Acheson, Coppola, and Ahluwalia all suspect the agency is taking on Paxos as a way to gain a measure of control over Binance, and that it does not reflect an enmity towards stablecoins in general. Although Binance is by far the world’s largest crypto exchange, it operates only a limited service in the US. But Reuters reports that the US has long believed Binance to have facilitated money laundering activity.\nBy taking aim at BUSD, the stablecoin that underpins much of Binance’s activity, says Coppola, the SEC can effectively shut the firm off from a source of US dollars. Ahluwalia agrees, suggesting the SEC is looking for creative ways to “defang” Binance. “If you’re a regulator that has suspicions but not jurisdiction, you pull the levers at your disposal,” he says. Binance has always maintained that it plays a central role in helping law enforcement deal with financial crime.\nUntil the SEC makes its intentions known, though, the crypto industry must wait. “We’re all just guessing,” says Ahluwalia. If the SEC were to go after other stablecoin issuers, like Circle or Tether, the consequences would be severe. Without stablecoins acting as a “bridge” between volatile coins, trading would become more expensive and riskier, says Coppola—and the decentralized finance sector as a whole could topple. “Potentially,” she says, “this could bring down the entire crypto edifice.”","creation_date":"2023-02-13","tags":["","CRYPTOCURRENCY","BLOCKCHAIN","REGULATION","FINANCE"],"author":"BY JOEL KHALILI","category":null}