{"id":"53d88540-9246-45ac-a056-311c2666a31b","article_link":"https://cointelegraph.com/news/fansociety-web3-nfts-musicians-fans-together-decentralization","website_source":"Cointelegraph","article_type":"News Article","summary":"Fans want to journey alongside their favorite musicians as they explore their creativity and expand their catalog. FanSociety hopes to be the Web3 platform that makes this possible.","title":"FanSociety creator explains how NFTs can bring musicians and fans together","detailed_content":"Nonfungible tokens, or NFTs, took the world by storm in 2019 — and then eroded to near rubble as the entire crypto market contracted and the industry fell into a nearly two-year-long bear market. An objective assessment of the NFT phenomena might conclude that the technology did deliver on a good deal of its promises, and instead of writing off the failed projects as scams, it might be more insightful to take a closer look at what features were needed to make projects successful. \nOn Episode 35 of The Agenda podcast, hosts Ray Salmond and Jonathan DeYoung spoke with Miles, a Web3 developer who is the creative mind behind FanSociety — a funding mechanism for musicians that borrows and blends ideas from traditional fan clubs of the 1950s with modern crowdfunding ideas and immutable storage on blockchain networks.\nTech should be adaptable and give users room to grow\nAny aspiring musician knows that securing funding for an album is difficult, and of course, once the album is out, locking in fans for life becomes the next hurdle. Miles explained that he envisions FanSociety being used as a tool for creators to connect with their audience, reward loyalty and grow in a way that is more organic than the typical NFT collections that currently exist.\nHe also explained that FanSociety has the dual purpose of allowing musicians to raise money from fans while also rewarding and retaining them by giving them digital artifacts as part of their expanding discography.\nAccording to Miles, a recurring issue with NFT collections is that projects often have fixed sizes and creators need to issue a new contract to “extend” the collection:\n“It doesn’t make sense to have a limit, you know, and kind of just have one smart contract. And, like I said, it’s like a boolean. You either have the token, you either have the NFT or you don’t. And a lot of what was going on as well was very successful musicians were launching NFT projects, and it was kind of that same situation where, you know, they’ve only got 10,000 NFTs available, and you either have one or you don’t. And to me, that’s very elitist and kind of antithetical to kind of the whole Web3 ethos, to me. And so I wanted to do something different.”\nRelated: NFT utility continues to captivate fashion and luxury brands — NFT Paris\nFan engagement should also have value\nRevenue sharing is another issue FanSociety aims to tackle. Miles lamented that popular streaming platforms and record labels only give creators a sliver of the revenue generated by their music and that platforms tend to absorb the bulk of tips that creators receive from fans:\n“You look at Twitch, for example. You tip somebody, you give them money, you subscribe to them. First of all, the platform takes 50% rev[enue] split, which is atrocious to me. And we don’t know if that’s going to go up in the future, right? The content creators on there don’t know if that’s going to go up to 60%, 70%, if they’re going to throw more fees on top of that. So there’s that kind of problem.”\nFor artists who will use the platform to expand their catalog and engage with fans, Miles said the NFTs can be a more meaningful show of appreciation than “a sticker pack to put in their chat” or something else that is kind of gimmicky and “not very valuable.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nMiles said:\n“I’d like to see more value being able to be given back to the supporters, and so that’s what I’m trying to support. And it’s up to the artist to decide what sorts of things, what sorts of ways they want to show their appreciation to people who support them.”\nTo hear more from Mile’s conversation with The Agenda — including his future plans for FanSociety — listen to the full episode on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Cryptocurrencies","#Music","#Smart Contracts","#Decentralization","#Adoption","#Streaming","#Podcast","#Entrepreneur","#Web3","#NFT","#The Agenda"],"author":"by Ray Salmond","category":null}