{"id":"53e79e5a-fea7-4672-8815-a1b568867b3b","article_link":"https://cointelegraph.com/news/bored-ape-burger-shop-shuts-bitcoin-nft-gaming-console-nifty-news","website_source":"Cointelegraph","article_type":"News Article","summary":"California’s Bored Ape burger place in Long Beach is shutting down though it hasn’t ruled out a U.S. reopening and a Bitcoin-based gaming console is reportedly set to sell for a cool $500.","title":"Nifty News: LA’s Bored Ape lovers go hungry, Bitcoiners sell $500 Game Boy dupe and more","detailed_content":"Bored & Hungry LA flips its last NFT-themed burger\nA Los Angeles burger restaurant which used a Bored Ape Yacht Club (BAYC) nonfungible token (NFT) as its brand is serving up its last patties and fries after two years in business and is being sold to a decentralized autonomous organization (DAO).\n“Today we say goodbye to the original Bored & Hungry location in Long Beach, CA,” co-founder Andy Nguyen said in an April 8 X post.\nNguyen added the “branding and franchising company” Hungry DAO acquired the Bored & Hungry brand, which also has three locations in the Philippines, one in Seoul, South Korea and slated Hong Kong, Singapore and Dubai pop-ups during events later in the year.\nSource: Andy Nguyen\nThe restaurant’s founding team will join the DAO as a shareholder, and the brand “will be announcing their new home in the U.S. soon,” he added.\nBored & Hungry opened in April 2022 and other Bored Ape NFT holders have started businesses — including a Cuban restaurant in Miami — using their NFTs which they own the rights to.\n“The supportive BAYC and Web3 community helped us break ground, in becoming the first to utilize ownership of the digital IP asset and create a restaurant brand,” Nguyen wrote. “We’re proud to have made our mark, and excited to see where the community takes it next.”\nGame Boy dupe will cost $500 to play Bitcoin NFTs\nThe Bitcoin Ordinals-based gaming platform Ordz Games is planning to hock a Bitcoin gaming console and crypto wallet that looks like a Game Boy for a reported $500 price tag.\nOn April 7 at Hong Kong’s Web3 Gaming Expo, Ordz debuted its BitBoy One device, a name blending “Bitcoin” and “Game Boy” — not to be confused with the crypto influencer turned one-time “fighter” of the same name.\nOrdz Games expects the console will cost around $500, exact price pending, with preorders slated for mid-April, GamesBeat reported.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThat’s 10 times as pricey as competing handheld retro game consoles such as those from Anbernic, which start at about $50 and its around $50 more than a new entry-level PlayStation 5.\nThe BitBoy One (left) being demonstrated in Hong Kong. Source: BitBoy/X\nThe BitBoy One can play retro-style play-to-earn games put on Bitcoin using its NFT-emulating Ordinals protocol and acts as a wallet to store any Bitcoin\nBTC\n$62,992\nearned, which — obviously — neither the PS5 nor Anbernic’s consoles can do.\nThe Bitcoin console can also power a Decentralized Physical Infrastructure Network (DePIN) with users able to farm airdrops by leaving it running, according to a press release.\nDoodles to make animated film with Lil Wayne as a skeleton\nNFT collection Doodles has teased its upcoming animated film Dullsville and The Doodleverse, which will have rappers Lil Wayne and Coi Leray voicing characters.\nIn an April 5 X post, the collection said it will start to unroll the film’s “storytelling experience” starting in “summer” (that’s mid-year for non-Americans) through music, live events, partnerships, merchandise and NFTs, which it decided to market as “digital collecting experiences.”\nThe marketing blitz will end with the film premiering at the Toronto International Film Festival in September.\nA poster for the Doodles film. Source: Doodles/X\nDoodles kept further details about the film sparse but said Lil Wayne, known for his diamond-certified 2008 hit Lollipop and Coi Leray, who rose to prominence with her 2022 platinum hit Players, will voice respective film characters “Captain Stoke” — a skeleton — and “Deysi” — a seemingly anthropomorphic flower.\nA promotional picture for the Doodles film. Source: Doodles/X\nThe musical pair will also take part in the film’s original soundtrack composed by singer-songwriter and Doodles chief brand officer Pharrell Williams which includes three music videos.\nNFT sales drop for 5th straight week\nNFT sales volumes for all blockchains have slid for the fifth week in a row after reaching a year-to-date high in early March led by a significant drop in Ethereum NFT sales.\nCryptoSlam! data shows the daily total NFT sales volume peaked this year on March 4 at over $80.4 million, which has slid over 50% to nearly $39.4 million five weeks later on April 8.\nDaily total year-to-date NFT sales volumes in U.S. dollars. Source: CryptoSlam!\nEthereum NFT sales volumes have seen a significant downturn, with 30-day figures seeing a nearly 48% drop to $363.3 million — larger than the drops seen by market leader Bitcoin at 13.5%, Solana at over 15% and Polygon’s nearly 34%.\nThe 30-day NFT sales volumes by the top 5 most used blockchains. Source: CryptoSlam!\nOver the past seven days, however, Bitcoin-based NFTs saw an over 24% volume jump at $97.7 million — the only blockchain in the top five to see a weekly gain.\nRelated: ZachXBT claims he is being ‘borderline harassed’ by US law enforcement\nThe most traded NFTs over the past week and the past 30 days were “Uncategorized Ordinals,” which as the name suggests, is any Bitcoin Ordinal not part of a recognized collection.\nThese vagrant Ordinals saw $156 million in trading volumes over 30 days, a 54% bump from the previous 30-day period — $37.4 million of which was in the past week.\nOther news\nDogecoiners did their own “Runestone” airdrop, copying the hyped giveaway done through Bitcoin Ordinals last month.\nCrypto exchange Binance shelved supporting Bitcoin Ordinals about a year after introducing them to its NFT marketplace, claiming it needed “to streamline product offerings.”\nWeb3 Gamer: Gods Unchained app drops crypto, Kings of Fighters Arena review\nExchange or buy APE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-09","tags":["#Bitcoin","#Blockchain","#Movie","#NFT","#Gaming"],"author":"by Jesse Coghlan","category":null}