{"id":"544f76c8-3f2c-426b-b376-c2886febe27d","article_link":"https://cointelegraph.com/news/chainalysis-dubai-regional-hq-uae-crypto","website_source":"Cointelegraph","article_type":"Tweet","summary":"Chainalysis relocates its regional headquarters to Dubai, reflecting the UAE’s progressive stance toward blockchain technology.","title":"Chainalysis sets up regional HQ in Dubai amid local crypto boom","detailed_content":"Update May 9, 08:30 UTC: This article has been updated to include new quotes from Nicola Buonanno\nThe blockchain data and analytics company Chainalysis has moved its regional headquarters to Dubai following close cooperation with the local government. \nOn May 8, the company announced the inauguration of its headquarters for Southern Europe, the Middle East, Central Asia and Africa in Dubai.\nAccording to the announcement, the analytics firm has been “actively engaging” with local government stakeholders to offer advice on best practices for regulatory development in the crypto industry that drive innovation.\nChainalysis is officially in Dubai ! After 3️⃣ years of working closely with UAE’s public and private sectors, the opening of our regional headquarters only strengthens our commitment to supporting UAE’s crypto ecosystem, and advancing its vision to be a global crypto hub. pic.twitter.com/1NRG2f4bWX\n— Chainalysis (@chainalysis) May 8, 2024\nThis has included a partnership with the United Arab Emirates’ Ministry of Artificial Intelligence, Digital Economy and Remote Work Applications to create an excellence center for government employees to “upskill” their knowledge and prowess on blockchain technology. It has also set up a Centre of Excellence that helps government employees upskill in blockchain technologies. \nTwo days prior, on May 6, Chainalysis entered into a memorandum of understanding with Emirates NBD, through which it said it would support the banking leader’s Digital Asset Lab program.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMichael Gronager, CEO of Chainalysis, commented that the UAE government has “spearheaded the crypto revolution” with its crypto-related policies. \n“The true potential and value of cryptocurrencies lies in their ability to transfer value, and we’re seeing an upward trend of overall transfer activity… the UAE is strongly positioned to lead innovation with novel use cases that deliver tangible value to consumers and businesses.”\nRelated: Chainalysis will help Tether monitor secondary market for illicit activity\nThis regional headquarters will allow the company to support emerging markets, such as India, Africa and Central Asia. Nicola Buonanno, Chainalysis’ vice president of Southern EMEA, said the UAE market is at a “tipping point,” with institutional-sized transfers now accounting for the “lion’s share” of the country’s crypto activity.\nBuonanno said that, therefore, the need for investigating the local industry for better compliance, market intelligence and data solutions is “greater than ever.”\nHe told Cointelegraph that the UAE has “clearly demonstrated its eagerness” to be a global cryptocurrency hub. Buonanno pointed to 2016 when Dubai initially launched its Blockchain Strategy.\nHe highlighted how robust regulatory frameworks have since been established by the Virtual Assets Regulatory Authority (VARA)  and the Abu Dhabi Global Market finance center (ADGM) in Dubai’s capital, which have “served to drive market maturity.”\nWe feel that now is the perfect time to double down on this momentum. The market is at an impressive level of maturity – evidenced in both the aforementioned regulations and the outsized participation of institutional investors.\nHe continued saying, \"VASPs now have clear guidelines for their operations, and consumers have the all-important confidence they need to embrace digital assets.\"\nChainalysis is just one of the many crypto and Web3-related companies that have decided to call Dubai home in the last year. An increasing number of firms within the industry have been applying for licenses and setting up shop in the Middle Eastern technopolis. \nOn April 18, Binance reportedly received its long-awaited license to operate as a cryptocurrency exchange in Dubai.\nMore recently, on May 7, in Dubai’s sister city Abu Dhabi, crypto options desk QCP Capital received its in-principle approval to offer regulated digital asset activities in the region.\nMagazine: CZ gets jail sentence, Gensler viewed Ether as security, and FBI targets mixers: Hodler’s Digest, April 28 – May 4\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-08","tags":["#Blockchain","#UAE","#Business","#Dubai"],"author":"by Savannah Fortis","category":null}