{"id":"54f368d0-f27e-4b74-9716-8304496e5263","article_link":"https://cointelegraph.com/news/london-crypto-brian-rose-mayor-election","website_source":"Cointelegraph","article_type":"Tweet","summary":"The former Wall Street and City of London banker is making his second bid to become mayor of London.","title":"London’s ‘Joe Rogan’ and crypto advocate Brian Rose makes bid for mayor","detailed_content":"Pro-crypto American businessman Brian Rose is running for London mayor again.\nLondoners go to the polls on May 2 to elect their next mayor, with incumbent Sadiq Khan and Susan Hall as leading candidates.\nRose previously stood for election in 2021, securing 1.2% of the vote, but expects to improve on that tally this time around.\nRose spoke with Cointelegraph to explain why he decided to stand again in 2024.\n“I love London so much. I’ve been there for over 20 years. This city’s given me everything: my business, my purpose. My two children were born here. I plan to be buried in the city,” said Rose. “So it’s my way of giving back.”\nRose, a fierce advocate for freedom of speech, conducts long-form interviews on his “Digital Freedom Platform,” drawing comparisons with major podcaster Joe Rogan. His guests cover topics such as politics, wellness, self-improvement and wealth. Many of Rose’s interview subjects hail from the world of blockchain and cryptocurrency, informing his political outlook.\nRose told Cointelegraph that the current leadership of the United Kingdom isn’t doing enough to promote the crypto industry.\n“I really believe we could push London as a crypto-first city and bring in massive amounts of business and industry,” said Rose. “Unfortunately, we just don’t have that right now, and the prime minister is paying crypto a bunch of lip service.”\nIn 2022, Prime Minister Rishi Sunak stated his intention to make the U.K. “a global hub for crypto asset technology,” but in 2024, evidence of progress toward this goal remains scant.\nRose argues that Sunak is not the only one underperforming. The entrepreneur also believes the Financial Conduct Authority (FCA) — which regulates cryptocurrency in the U.K. — is misfiring.\n“The FCA and the other organizations are literally pushing companies out, and that’s a shame,” said Rose.\nBlockchain use cases and London coin\nRose tells Cointelegraph that his association with Bitcoin (BTC) and cryptocurrency is longstanding.\nLondon Real regularly features high-profile names from the cryptocurrency world. The entrepreneur explains how he previously attracted big names to interview:\n“I started featuring the top 100 people in crypto, and they said ‘yes’ because I had two million YouTube subscribers. That’s probably the biggest channel they would ever be on,” he said.\n“I could have Michael Saylor, Raoul Pal, Yat Siu and most of the layer-1 founders — Justin Sun, Hedera Hashgraph, Avax — and they taught me about the blockchain.”\n“I had Max Keiser on my show in 2013 talking about Bitcoin. That’s when I bought my first Bitcoin and went down the rabbit hole. I would later have Andreas Antonopoulos on my show in 2015, ‘17 and ‘19. Some people call him the Bitcoin Jesus,” said Rose.\nRecent: DeFi bull market confounds expectations with RWAs and ‘recursive airdrops’\nRose is further pushing a policy agenda that is heavy on cryptocurrency and blockchain. One of his proposals to win over Londeners is the creation of a “London coin.”\nAccording to Rose, the token would put the equivalent of £100 into the hands of every London resident, sourcing liquidity from a tax on the traditional financial sector.\n“We want to inject it with 1 billion pounds of liquidity, with a one-off 1% tax from the banks, who make all of their money in the City of London and probably don’t pay anything back,” said Rose.\n“Then, what we would do is put that in the wallets and hands of every man, woman and child and use them to stake that for additional yields, allowing them to pay for public transport and other services with that and that alone. If we can make that work over the next 12 months, it could literally be copied by so many other cities.”\nRose added, “I want something super functional that’ll have DeFi practicalities in there as well. So that’s the plan for the London coin.”\nBlockchain for democracy\nFor Rose, blockchain goes beyond financial applications. The electoral hopeful also advocates using blockchain to secure the voting system, citing a 2005 Ipsos study that showed “two in five British voters are concerned about election fraud.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nWhile that study may be a little long in the tooth, more recent events in London are unlikely to have improved voter confidence. In 2015, Lutfur Rahman, the London mayor of the Tower Hamlets borough in East London, was found guilty of election fraud. Rahman was ordered to pay £250,000, and the election was re-run. Rahman was excluded from standing that year.\nIn March 2022, Communities Minister Kemi Badenoch wrote to the Metropolitan Police and the Electoral Commission, expressing concerns that voting fraud could occur again. In May 2022, Rahman was reelected to Tower Hamlets.\nRose sees a similar problem across the Atlantic, pointing to an erosion in voter trust after the last United States presidential elections.\n“After the 2020 elections, especially in Philadelphia, Pennsylvania, I heard a lot of people say there hasn’t been a fair election in that city for 100 years,” said Rose.\nIn an April 25 press release, Rose said blockchain “can help the electorate see and interrogate voting, as well as securing the electoral process, providing a permanent, accessible and reliable record.”\nRegarding London elections, Rose told Cointelegraph, “I’m not accusing anyone of election fraud, but I am saying that the job of London Elects is to make the British public confident that their vote matters.”\nLondon Elects is the body responsible for the mayoral elections in London.\nBrian Rose is running for mayor of London. Source: Brian Rose\nRun-ins with Ofcom and YouTube\nRose, the host of the longstanding London Real podcast, is not without critics or controversy.\nIn fact, much of Rose’s politics are intertwined with his podcast and the events surrounding its broadcast.\nIn 2020, during the U.K.’s COVID-19 lockdown, Rose broadcast an episode of London Real featuring professional conspiracy theorist David Icke. Icke is best known for popularizing the theory that the U.K. royal family are shapeshifting lizards from outer space (or another dimension).\nFree speech advocate Rose told Cointelegraph, “I don’t agree with everything that my guests say by any means, but I believe they have the right to say it.”\nIn 2020, Icke offered a number of conspiracies regarding COVID-19. On London Real, Icke blamed an electromagnetic “soup of radiation toxicity” for compromising the immune systems of the elderly and said a cult was using the virus to create an “Orwellian global state” enabled by artificial intelligence.\nThe U.K.’s communications regulator, Ofcom, received 48 complaints about the London Real broadcast.\n“We didn’t incite violence. We didn’t incite overthrows of governments. It was literally just two people talking. But I guess that was considered dangerous,” Rose said.\nOn the podcast, Rose resisted or outright disagreed with Icke’s theories.\n“I do believe in the science, and I do believe in vaccines,” he told Icke at the time.\nDespite this, Rose was censored, and the broadcast was removed from YouTube. Ofcom later ruled that the program “had the potential to cause significant harm to viewers in London during the Coronavirus crisis.”\nDigital Freedom Platform\nThe censorship of his YouTube channel set Rose on a path to creating the “Digital Freedom Platform,” a website that hosts London Real broadcasts. He no longer uploads to YouTube, telling Cointelegraph that he was permanently deplatformed eight months ago.\nRose’s followers crowdfunded the Digital Freedom Platform to the tune of $1 million. During the raise, Rose stated that $200,000 would be earmarked for the application of blockchain technology.\nCointelegraph asked Rose how that blockchain integration was progressing.\n“The problem is that putting video on the blockchain is still not doable,” Rose explained. “There are a couple of companies in Dubai right now that I’m talking to, but right now, from a bandwidth perspective, it’s just nearly impossible.”\nHe added, “I would love to do it because we continue to be censored.”\nIn an interview with PoliticsJoe in April 2021, Rose gave another reason for not implementing blockchain into the Digital Freedom Platform. He said he’d “already spent the money” on other aspects of the platform, including livestreams.\nRecent: US stablecoin bill to ‘cement’ dollar dominance, fight sanction evasion\nWhen Cointelegraph spoke with Rose, the broadcaster was in Myrtle Beach, South Carolina, promoting his documentary film We Will Not Be Silenced. The documentary centers on the censorship of London Real in 2020 and stars David Icke, with whom Rose has fostered an ever-closer working relationship in recent years.\nAt the premiere, Rose said, “Before I was an advocate for free speech, but now I’m a fanatic [...] they chose the wrong white boy to f*ck with.”\nRose tells Cointelegraph he plans to spend the final few days of the campaign back in London, aiming to secure every last vote he can. Should the entrepreneur capture five percent of the vote or more, it would strengthen the case for Rose to be included in future televised mayoral debates — if he decided to stand again.\nLondon goes to the polls on May 2.\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-30","tags":["#Blockchain","#London","#Politics","#Government","#UK Government","#United Kingdom","#Voting","#Corruption","#Regulation"],"author":"by Robert D. Knight","category":null}