{"id":"559121c4-c5ec-48fd-be5f-d1b7f4e57394","article_link":"https://medium.com/berachain-foundation/the-bera-era-has-begun-49a18c6d77c0","website_source":"Medium","article_type":"Tweet","summary":"The happy day has arrived. Rejoice, one and all, because if you’re reading this, Berachain Public Testnet “Artio” is live.","title":"The Bera Era Has Begun","detailed_content":"The happy day has arrived. Rejoice, one and all, because if you’re reading this, Berachain Public Testnet “Artio” is live.At long last, we’re excited to reveal Berachain to the world.First and foremost, the question that’s been on everyone’s mind for months:Since our inception in 2022, people haven’t known exactly what we do or what the chain is, or why they should care (our fault and kind of by design). So without further ado, let’s get into it.Berachain is an EVM equivalent L1 built on top of the Cosmos SDK, using Proof of Liquidity (PoL) Consensus, a variant of delegated Proof of Stake.What is Proof of Liquidity? In short, proof of liquidity is a sybil resistance mechanism meant to harmonize staking and align incentives between security and liquidity. This stands contrary to typical proof of stake chains where users possessing a fixed amount of capital have to choose between contributing to security by staking with a validator, or contributing to on-chain liquidity by providing liquidity in a DEX or lending platform.In Proof of Liquidity, the only way to contribute towards network security is by first doing the “work” of providing liquidity to a set of DeFi primitives that are built into the chain itself; namely a native AMM DEX, a perps exchange, and a stablecoin lending platform.The only way to earn BGT, the staking token of the chain which contributes to security, is by providing liquidity to the system. BGT is naturally illiquid and soulbound, and cannot be market bought, only earned.Validators and governance play a large role within PoL, and effectively control the “rewards rate” for different methods of earning BGT across the chain. Block by block, the validators direct the inflation back into the Berachain ecosystem across multiple primitives, keeping the network liquid. However, this can extend to any governance-approved smart contract on the chain over time.Each validator can set its own set of incentives and distribution of the BGT rewards it receives across a wide variety of governance-approved protocols. The weighted average of all of these distributions across the ~100 validators in the network will determine the APYs of each pool. The best mental model for this is Curve / Frax gauges, except in this case instead of veFXS/veCRV, it is the average weighting and distribution of BGT across the validator set which determines network wide rewards rates.Users delegating BGT will earn fees in the form of $HONEY, the native stablecoin of the network from the various protocols that are part of (or become part of) Proof of Liquidity, along with bribes from the validator that they are delegated to (more on this later).Finally, users can redeem or burn 1 BGT into 1 BERA at any point in time. However, this is a one-way process. Once the BGT is burned, it is gone for good. This gives them a choice between holding the liquid gas token, or holding a token which allows them to earn fees in the form of a stablecoin + bribes + influence the distribution of rewards across the ecosystem, while accruing fees from applications powered by BGT emissions.So in short, Berachain is fully EVM compatible L1 where users provide liquidity into the chain-enshrined primitives (dex, perps, stable lend, or others voted in by governance) to earn BGT, delegate it with validators to earn fees / bribes, or burn it into Bera. Through their contribution to liquidity on the chain, users bootstrap its security.Why should developers or protocols care?Berachain is the first chain with mechanics structured to sustainably enable protocols to build their liquidity base and drive capital efficiency over time.Protocols who successfully pass a governance vote will have their smart contracts included in the set of contracts whose LPs will receive BGT rewards (in the same way as the dex / perps / lend LPs receive rewards at genesis). This means that a new NFT AMM, on-chain game, SoFi protocol, or any other DApp requiring that extra helping hand in bootstrapping their protocol could launch on Berachain and effectively subsidize their cost of user acquisition by passing a governance vote for their vault / LP contract to receive BGT rewards, thereby giving their LPs emissions in the form of the staking/gas token of an L1 blockchain (in addition to any native token emissions).In short, protocols are able to attract more liquidity at lower costs. The chain is aligned, as it attracts the best protocols to build on top of it which serve as user acquisition channels. PoL allows protocols building on the chain to become “enshrined” into the base layer and contribute to security (BGT generation) via their users’ liquidity provisioning without modifying user behaviour.Typically, in bootstrapping liquidity, a protocol will launch a liquidity mining program, in which they pair their own native token against another token, and require users to stake this LP in exchange for emissions in the form of their native token, generally inflating or devaluing their native token. On Berachain, a protocol may work directly with validator(s) to bribe for liquidity in the native dex in the following process:Why should users care?Berachain’s private testnet and months of buildup have provided us with a thriving ecosystem. We strongly believe that an ecosystem can get off the ground quickly with effective planning. The basic primitives are built into the chain, discouraging a series of repetitive forks which are normally the short-lived basis of new chain launches. This will be bolstered by the 30+ native protocols and 100+ groups building from other chains which will be deploying on Berachain.Users can have their stake and eat it too — users who LP will earn BGT emissions, contributing to security, and be able to stake those BGT emissions to help influence the direction of liquidity across the chain, while earning bribes and fees from the network. This means that a user can tangibly impact their own economic incentives by participating in network, at no cost to themselves (eg. A user farming a stable pool LP in the DEX may choose to stake their BGT with a validator directing the majority of their BGT emissions to that stable pool, thereby increasing the user’s effective rewards or earnings on their existing LP)New game theory always brings out new ways to win in an ecosystem; the tradeoffs between BGT and Bera at different points in an economic cycle will give users an entirely new way to play — is it better to stake BGT and earn more network fees when not much is staked? Which validators will have the best bribes? Will they even reap the rewards of that new liquidity if they accept the bribe?At times this is a meme, but Berachain has a real community. There are thousands of NFT holders who have already bought into the ecosystem, and multiple projects that have formed their own communities even prior to the launch of this testnet with thousands of engaged users — see Infrared, Kodiak, The Honey Jar, Berachein, Ramen Finance, Beradrome, Beramarket, Goldilocks and more. There are podcasts, community rating services, public goods and a raving group of crypto-natives who are often the earliest users of new and exciting protocols across the space. They’ve been waiting for over a year, and they’re ready to go.Why should validators care?Validators are first class citizens in Berachain, controlling economic incentives and reward rates across the ecosystem; an unprecedented role and set of responsibilities for validators across crypto.There’s an opportunity to attract new capital and engage in a new form of governance. For Cosmos validators, they can now attract delegates and liquidity from the EVM world, which has typically been a major restriction for growth in the Cosmos ecosystem.This responsibility also brings new revenue streams to validators. Validators on Berachain may receive bribes or rewards from protocols building on the chain in exchange for directing BGT block rewards towards their pools or smart contracts. This allows a validator to diversify their treasury / holdings, receiving exposure to new protocols on the chain at no cost to their own users and delegates.Why should blockchain purists care?We talk a lot about how the blockchain trilemma has become a bit of a meme; decentralization turning into a form of regulatary arbitrage, scalability never reaching par with offchain/web2 options, and security being ignored until proven otherwise. The ideal chain probably maxes out on all of these properties, but a more practical trilemma perhaps revolves around users, developers, and capital/liquidity. With that somewhat counterintuitive point, Berachain actually makes meaningful strides in improving 2/3 of these angles, with the last one to be tackled in the future.Beyond all else, Berachain is its community — it’s a product of long nights on VC in Discord, CoD games with Dev, rap nights, MC sessions with FW, Honey Jar ceremonies with Jani and the guys, the Honeylist, fudding ourselves, podcast eps, raiding Polaris tech talks, meetups at conferences across the world, typing Bm in Discord, and everything in between.We’ve spent the last year building out our moneyball team of 30+ Beras — from folks who have built the very first Dapps on Ethereum to engineering and ecosystem leaders at Sui, Polygon, Mantle, Coinbase, Chainlink, Aave, Dapper, TFL and more, with collective experience in building applications reaching millions of users, securing $Bs of TVL, and deploying $Bs in capital.We’re incredibly thankful for the faith that you’ve placed in us, and our team is equally excited to see what everyone builds over the months to come as we move towards our mainnet later this year.Let’s see what happens when the liquidity is unchained.To learn more, check out Berachain’s foundation page and socials below.🌐 Website: https://www.berachain.com\n🐦 Twitter: https://twitter.com/berachain\n👾 Discord: https://discord.gg/berachain","creation_date":"2024-01-11","tags":["Cryptocurrency","Venture Capital","Bears","Defi","Blockchain"],"author":"Smokey the Bera","category":null}