{"id":"56d66eea-ea82-4791-8835-9e957dc6e81b","article_link":"https://cointelegraph.com/news/satoshi-era-dormant-bitcoin-address-awakens-transfers-43-9m","website_source":"Cointelegraph","article_type":"News Article","summary":"According to a Chainalysis report, there are a total of 1.75 million dormant BTC addresses inactive for over a decade.","title":"Satoshi-era dormant Bitcoin address wakes up after 10 years","detailed_content":"A dormant Bitcoin address dating back to the era when Satoshi Nakamoto was still active has woken up after 10 years. The Bitcoin wallet containing 687 BTC ($43.9 million) transferred its holdings to two different wallets on May 6.\nThe wallet first transferred 625.43 Bitcoin\nBTC\n$63,046\n to an address starting with “bc1qky” and 61.9 BTC to “bc1qdc.” The movement of funds from very old wallets, especially from the Satoshi era, often sparks curiosity among the crypto community.\nThe term “Satoshi era” relates to the early days after Bitcoin was created when its pseudonymous founder, Nakamoto, was active online in forums. Some Satoshi-era wallets are often speculated to be linked to Satoshi himself.\nOne such wallet woke from dormancy in August 2023 after almost 14 years and transferred 1,005 BTC mined in 2010. The wallet movement created the most buzz on social media, with speculation that it was Satoshi’s wallet.\nHowever, experts suggest it is more likely associated with early miners or buyers just trying to make a profit.\nAccording to a Fortune report, a total of 1.75 million Bitcoin wallets have remained inactive for over a decade. Many of these wallets contain significant BTC holdings estimated to be bought when the BTC price was trading in double digits and is currently valued in millions.\nThese dormant wallets contain 1,798,681 Bitcoin worth around $121 billion at today’s price.\nSource: Chainalysis\nRelated: 100%+ BTC price gains? Bitcoin faces ‘massively overvalued’ stocks\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nOver the past couple of years, numerous Satoshi-era wallets have been activated only to transfer the BTC holdings to a new address. Some of these wallets were also found to have transferred their BTC holdings to crypto exchanges, which suggests they might be looking to take profits after nearly a decade.\nSource: Chainalysis\nIn July 2023, a wallet dormant for 11 years transferred $30 million in BTC. In November 2023, three Satoshi-era BTC wallets transferred $230 million in BTC after six years of dormancy.\nThe three wallets are believed to be connected to the same individual or organization, as they made their last transactions on Nov. 5, 2017.\nMagazine: The value of a legacy: Hunting down Satoshi’s Bitcoin\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Satoshi Nakamoto","#Bitcoin Price","#Adoption"],"author":"by Prashant Jha","category":null}