{"id":"57c70ffd-67dd-40a6-9118-53542be290ac","article_link":"https://cointelegraph.com/news/streamlined-usdt-xaut-transactions-ton-oobit","website_source":"Cointelegraph","article_type":"News Article","summary":"The Open Network users will be able to use Oobit’s Tap & Pay technology to pay merchants in fiat while spending USDT.","title":"Tether, TON team up with mobile app for USDT-to-fiat transactions","detailed_content":"Transactions with Tether’s USDT and XAUt on The Open Network (TON) will be streamlined thanks to the incorporation of the Oobit mobile payment app, giving merchants a more convenient user experience.\nTether\nUSDT\n$1.00\nand Tether Gold (XAUt) launched on TON in April. XAUt is pegged to the price of one fine troy ounce of gold. More than $200 million in USDT has been issued on TON, and users can send USDT in Telegram messages. Telegram has over 900 million users worldwide. TON also issues its own native Toncoin (TON) on the TON network.\nIn addition to TON, USDT is issued on 14 other blockchains, including Tron and Ethereum. It also joined the Celo network in March.\nRelated: New Telegram mini-apps will be so convenient users won’t know it’s crypto\nOobit’s Tap & Pay technology will allow merchants to receive payment in fiat currency even when the customer pays in USDT. In a statement provided to Cointelegraph, Tether CEO Paolo Ardoino said:\n“Together, we will provide banking solutions to the unbanked population and revolutionize how users transact with cryptocurrencies, making it easier and more convenient.\"\nTether was among the investors in Oobit’s Series A funding round in February, which raised $25 million. Solana was also an investor. Oobit CEO Amram Adar also emphasized the inclusionary nature of the partnership with Tether and TON. He said:\n“We’re not just providing another payment option; we’re providing unbanked access to the most prominent cryptocurrencies and worldwide payments using Oobit.”\nOobit released its first crypto-to-fiat mobile app in April 2022 and introduced its Tap & Pay feature in September 2023. Tap & Pay uses Near Field Communication (NFC) technology. In March, Oobit integrated VeChain’s VET coin.\nSource: Oobit\nTether is expanding on many fronts. Earlier in May, it increased its investment in payment provider CityPay.io in Georgia, which plans to expand to Armenia, Azerbaijan, Kazakhstan and Uzbekistan. Tether made its first investment in CityPay.io in May 2023.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExchange or buy TON\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-16","tags":["#Blockchain","#Business","#Mobile Payments","#TON","#Tether"],"author":"by Derek Andersen","category":null}