{"id":"599bc5ca-bc54-4df0-930b-9457415360d0","article_link":"https://cointelegraph.com/news/bitcoin-ordinals-runes-brc20s-mitigating-halving-effect-viabtc","website_source":"Cointelegraph","article_type":"News Article","summary":"Each Bitcoin halving sees Bitcoin miners rewarded with a smaller block subsidy, but ViaBTC is optimistic that innovative Bitcoin applications will more than cover these needs, as Satoshi Nakamoto envisioned.","title":"Bitcoin’s Ordinals, Runes key to solving the mining subsidy problem: ViaBTC","detailed_content":"Bitcoin transaction fees from applications such as Ordinals, Runes and BRC-20s will be key to making sure miners stick around even as more halving events occur, according to a cryptocurrency mining pool.\n“[The Bitcoin network’s] evolution has led to an expanding array of use cases and a growing user base [which] has significantly impacted miners’ fee income from on-chain transactions,” ViaBTC told Cointelegraph in a recent interview.\nPrior to the Ordinals protocol’s launch in January 2023, miners relied on peer-to-peer transaction fees to accompany the block subsidy — which halves every 210,000 blocks and thus has an “indisputable” impact on miners’ revenue over the long haul, ViaBTC said.\nMining revenue can also increase with a rise in Bitcoin’s (BTC) price, but further development at the application layer will increase network activity, broaden its utility and thereby compensate miners handsomely, ViaBTC explained.\nViaBTC experienced this first hand on April 20 when it mined the highly sought-after halving block, at block 840,000, which came with a record-setting 37.6 BTC transaction fee — worth $2.4 million at the time.\nThe reward, which totaled 40.7 BTC when factoring in the new 3.125 BTC block subsidy, came from memecoin and nonfungible token enthusiasts competing to inscribe “rare satoshis” and fungible tokens via the new Runes token standard, which launched at the halving block.\nSource: 10x Research\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nViaBTC told Cointelegraph it had a “premonition” that transaction fees would eventually break the 30, 40, 50 BTC barrier but didn’t expect they would be the beneficiaries of such a massive reward — let alone at the halving block.\nWhile Bitcoin miners cashed in an eye-popping $78.3 million on halving day, they’ve also made more from fees than Ethereum stakers and Uniswap liquidity providers in nine of the last 20 days since the halving, according to Crypto Fees.\nFees by blockchains and protocols on April 20. Source: Crypto Fees\nBitcoin’s pseudonymous creator, Satoshi Nakamoto, predicted that transaction fees would eventually become miners’ main compensation source as the block subsidy halves, ViaBTC noted.\nRelated: Bitcoin post-halving price consolidation could last 2 months — Bitfinex\n“If these transactions find broader utility in the future and make significant technological advancements, they may garner increased attention and recognition,” ViaBTC added.\nHowever, Ordinals inscriptions, Runes and BRC-20s have seen several rises and falls in popularity since each protocol launched, which has brought about some instability in miner revenue.\nViaBTC has endured three halving events since it started operating in 2016, with block 840,000 being the 37,534th block that it had mined in its 2,900-day existence.\nThe mining pool’s hash rate is sourced from miners in 118 countries.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-10","tags":["#Bitcoin","#Blockchain","#Satoshi Nakamoto","#Business","#Bitcoin Mining","#Mining Pools","#Halving","#Bitcoin Halving","#BRC","#ViaBTC","#Bitcoin Ordinals","#Runes Protocol"],"author":"by Brayden Lindrea","category":null}