{"id":"5a02e676-e4b9-43ff-a60d-ca8ac4abd681","article_link":"https://medium.com/@ilaNihas/0g-setting-up-your-validator-node-48216a1886d0","website_source":"Medium","article_type":"Blog Post","summary":"UPDATE [April 25, 2024]: It appears that the 0g-evmos repository has been removed, making it no longer possible to set up the 0g-evmos…","title":"🌍0G: Setting Up Your Validator Node","detailed_content":"UPDATE [April 25, 2024]: It appears that the 0g-evmos repository has been removed, making it no longer possible to set up the 0g-evmos node. However, you might consider setting up a 0g-storage-node instead. As I don’t currently have a guide for this, I recommend consulting the official documentation available here: 0g-storage-node Setup DocumentationA\nfter a brief break, I’m back exploring exciting cryptocurrency projects, and today I’m introducing 0G, short for ZeroGravity, a project that’s developing a modular AI blockchain designed to transform AI dApps. This platform offers an easy-to-use environment for developers by using a scalable Data Availability (DA) layer that separates data handling into two parts: data publishing and data storage. This setup helps avoid bottlenecks and ensures that large data volumes can be managed efficiently and securely.0G stands out because it has a scalable system that doesn’t just store data but also ensures it is easily accessible for anyone who needs it. This is important for applications that rely on fast and reliable data retrieval, such as AI technologies and advanced Layer 2 networks.The system works by allowing nodes to earn rewards not just for storing data but for proving that data is accessible when needed. This encourages nodes to perform well and helps the network scale effectively. 0G also supports a variety of data types, thanks to its multi-layer storage system that includes both unstructured and structured data management.Basically 0G.ai is not just creating a data storage solution; it’s enhancing the accessibility and usability of data in blockchain applications, making it an exciting project to watch in the growing landscape of Web3 and decentralized technologies.0G Labs, the team behind 0G.ai, has successfully raised $35 million in a pre-seed funding round with support from notable investors like Alliance, Animoca Brands, Delphi Digital, Samsung Next, Symbolic Capital, and OKX Ventures. This funding highlights the strong interest and confidence in the project’s potential.The project has already launched its Newton Testnet on April 10th, allowing for testing and further development. 0G Labs is also preparing for a significant step forward with the planned launch of its Mainnet in the third quarter of 2024, which will bring the platform fully online.To get started with installing your node, you’ll first need to rent a VPS (Virtual Private Server). Using a VPS offers several advantages, such as enhanced performance, scalability and reliability. I’ll guide you through the process of renting a VPS at a lower cost, and show you how to configure it. Follow the steps below to get your VPS ready for the node installation.Research VPS providers: Take some time to explore different VPS providers available in the market. Consider factors like pricing, reputation, and customer reviews to find the right fit for your needs. Look for plans that offer the appropriate amount of resources (CPU, RAM, storage) to support your node. Contabo is my preferred choice due to their combination of affordable pricing, reliable performance, and user-friendly interface.I personally use and trust Contabo for my blockchain nodes. I’ve recently joined their affiliate program to recommend their services. If you decide to use my affiliate links for Contabo, you’ll be supporting my work at no extra cost to you. This support is important for continuing our journey together in the fascinating world of crypto, and using these affiliate links is a direct and impactful way to back my efforts. Thank you very much for your support!Minimum hardware specifications needed for this node:In setting up the node, we’ll follow the recommended hardware guidelines and choose the Cloud VPS 2 package.I will initially select a rental period of 1 month, with the flexibility to extend it later if needed:Make sure to choose the option “European Union (Germany)”:For the best storage solution, I recommend selecting the 400GB SSD storage type:Navigate to either the “Popular” or “OS” tab and choose the standard Ubuntu 20.04 image from there:To prioritize security, I highly recommend to generate a password and securely store it to ensure maximum protection:For the final step, it’s recommended to leave the sections titled “Object Storage”, “Networking”, and “Add-Ons” in their default state without any modifications. If you are new to Contabo, please create an account; otherwise, login using your existing credentials. Provide your personal data by filling in the required fields. Complete the remaining fields with your personal information, and click the “Next” button to proceed with the payment. After successfully completing the payment for your order, you will receive an initial email. Within approximately 15–30 minutes, you will receive a second email containing all the information needed to connect to your VPS.Download and install most recent edition of PuTTY by visiting the official website:You will find the IP adress of your VPS in the second email. Launch PuTTY, enter the IP address of your VPS and click “Open”:Once the server interface is open, you will be prompted to provide login details; simply enter “root” as the user and use your chosen password:Congratulations! You are now successfully logged into your server:To continue, we can update the packages by running the following commands in the terminal. The first part of the command updates the package lists for upgrades, and the second part actually performs the upgrades with the “-y” flag allowing for automatic confirmation of prompts during the upgrade process:In this step, we’re preparing the system by installing essential build tools. Specifically, curl and git are used for downloading and managing code repositories, jq for processing JSON data, lz4 for compression and decompression, and build-essential for compiling software from source etc.Make sure you install the latest version of GO, whether it’s a fresh installation or an update:To install the latest version of the 0G-evmosd project from 0G Labs, you’ll first need to download the project’s source code from GitHub and then compile it:Check the releases page to see if there is a newer version than v1.0.0-testnet. If there is, replace v1.0.0-testnet with the latest version in the following command:Once you’ve built the binaries for the 0G-evmosd project, you’ll need to organize them for use with Cosmovisor, a process manager for Cosmos SDK applications:These steps ensure that your0G-evmosd binary is properly stored and managed for easy upgrades and maintenance using Cosmovisor. This setup helps in simplifying the update process and keeping your node operational with minimal downtime.To ensure the 0G-evmosd binary is easily accessible and managed effectively with Cosmovisor, we will create symlinks. These links will help in switching versions and managing the binary execution paths more efficiently:Cosmovisor is a important tool for managing updates and processes for Cosmos SDK applications like 0G-evmosd. It ensures seamless upgrades by automatically restarting the application with the new version without manual intervention:To ensure that your0G-evmosd node runs as a resilient and automatically restarting service, it's effective to configure it using systemd, a system and service manager for Linux operating systems. This setup allows the 0G-evmosd node to start at boot and keep running even if it encounters errors:To finalize the setup and ensure your0G-evmosd node service is operational and configured to start automatically when your system boots, follow these steps:To configure your node for operation, you’ll need to set several parameters. This involves specifying the chain ID, keyring backend, and the node endpoint. These commands are important for properly configuring your node to interact with the network, manage keys securely, and communicate with other nodes effectively:To start setting up your node, we need to initialize it with a specific node name and chain ID. Before running the command, decide on a unique name for your node. This name will identify your node within the network. Replace YOUR_NODE_NAME with the actual name you’ve chosen for your node:This command sets up the basic configuration for your node, including generating the necessary directories and files for operation. The --chain-id parameter ensures that your node is set up to connect to the specific blockchain network identified as zgtendermint_9000-1.The genesis file is a fundamental component of any blockchain network. It contains the initial configuration and state of the blockchain. For your node to correctly join and sync with the specified network, we need to download and place the genesis file in the correct directory:After downloading the genesis file, it’s good practice to check that the file is not corrupted and is correctly placed. If the genesis file has been downloaded correctly and is complete, you can exit the text editor by pressing CTRL + X:To fully integrate your node into the network and configure it for proper communication, we’ll need to update its configuration with the correct peers, seeds, and port numbers:Before making changes like a reset, it’s important to backup the validator state. This file contains the state of your node’s validator at the last block it signed:Download the latest blockchain state from a snapshot to quickly sync your node up to a recent block. This command streams a compressed snapshot file and extracts it directly into your .evmosd directory:After the snapshot is extracted and your node data is essentially reset, restore your original validator state to avoid any potential issues with block signing:To make sure that your service is updated with any configuration changes and is running smoothly, follow these steps:Many thanks to the Core Node Team for providing this snapshot. Their support has significantly reduced our setup time. Check them out on Twitter.To monitor the real-time logs of your service, you can use the journalctl command. This tool is part of the systemd suite and provides a powerful interface for querying and displaying logs from systemd and the services it manages, which is useful for troubleshooting and ensuring that your node is operating as expected:To create a new wallet on your node, you will need to use the following command. Replace YOUR_WALLET_NAME with your chosen wallet name in the command below. Decide on a name for your new wallet. For this example, I suggest using “wallet” as the name to keep things straightforward:This command generates a new wallet including a public/private key pair and gives you access to the associated address on the blockchain network.After you define a keyring passphrase, make sure to securely store the output, especially your mnemonic phrase, as it is essential for recovering your wallet if needed:To extract and convert your wallet address to the Ethereum hex format, you can use a combination of evmosd commands and shell utilities. If your wallet name is \"wallet\", here’s how you should format your command:To export your wallet’s Ethereum-compatible private key from the node, you’ll need to use the unsafe-export-eth-key command. This command extracts the Ethereum private key from your Evmos wallet in an unencrypted format. Make sure you handle and store any output securely:To obtain testnet tokens, access the Faucet Page. Now, input your wallet address in the Ethereum hex format that you prepared earlier and complete the captcha. Next, click on the “Request A0GI Token” button to initiate the token transfer.Once the transaction is processed, you should see a “Transaction Successful” message indicating that the tokens have been transferred to your wallet:Check the Sync Status: To verify if your node has completed syncing with the blockchain, use this command:When catching_up is false, your node is fully synced and ready for the next steps. This indicates that your node is up-to-date with the latest blockchain state and can participate in the network. The output will look like this:Before you proceed with creating your validator, make sure that you have received the testnet tokens in your account. You can check your wallet’s balance by using the following command:Expected output:Now you’re set to run the create-validator command. Make sure to replace YOUR_MONIKER with your node’s name. If you have a website, replace YOUR_WEBSITE with its URL; if not, you can leave it empty. Then, replace YOUR_DETAILS with information about yourself as a node operator:Expected output:To delegate tokens to your node, use the command provided below. As of this writing, you must delegate a minimum of 1 A0GI to rank within the top 500. Your ranking is determined by the amount of aevmos you delegate. Here’s how the conversion works:To check your validator status you can run this command, which will also display your operator address:Next, navigate to the ⚡┃node-status channel on the 0G Discord server and type !val followed by your operator address. For example:You should see an output similar to the example below. Please be aware that as of this writing, you need to delegate a minimum of 1 aevmos for your status to change to “active”:Next, import your wallet into Metamask by using the private key you exported earlier in Step 16. For detailed guidance on importing an account into Metamask, you can read the instructions here. Then, visit the 0G scan and connect your wallet. Ensure you add and switch to the 0G Chain Testnet.For the following step, click on the “Add or drop files here” button, choose any image(s) you’d like to upload, and then click the “Upload” button. Confirm the transaction to proceed.If the transaction is successful, your storage submissions will appear in the list below:In the last step, join the 0G Discord server and obtain the @Node operators, @Developer, and @Testnet Validator roles. You can do this by going to the roles channel and clicking on the corresponding emojis to claim these roles:As always, I recommend staying informed about the project by following their updates on Twitter and joining their Discord community. This way, you can keep up with all the latest news and information. For troubleshooting, consult the official documentation first, and if needed, seek assistance on the official Discord server or feel free to reach out to me directly on our Discord community.Hey everyone, I’m excited to share that I’ve partnered with Dotcom Canvas, a standout German brand known for its exquisite crypto-themed wall art. Their acrylic glass pieces are particularly impressive.Discover their unique collection via my affiliate link. For a special treat, use the code CRYPTOTRIBE at checkout to get a 15% discount. To see these art pieces in their full glory, take a peek at this promotional video. It’s a great way to visualize how they could elevate your space.Let’s enjoy some awesome crypto art together!Disclosure: By using my affiliate link for purchases, I receive a commission.Hi! I’m ilaNihas, a big football fan (or soccer, if you prefer). After 13 years in IT, I paused my career to explore crypto, blockchain, and Web3. I’m fascinated by the potential and constantly searching for interesting projects, airdrops, and new nodes to explore. Join me as I combine my passions for sports, writing, and tech. Let’s dive into the world of crypto and blockchain together!Thanks for reading! Please share your feedback in a comment and follow me on my socials if you enjoyed the article. I’ve also set up a Discord community where we can get together and have discussions about interesting crypto-related topics. You’re welcome to join us and be part of the conversation → https://discord.gg/zN4dH35JJZPlease note that the content provided on this blog is intended solely for educational, informational, and entertainment purposes and should not be considered as financial advice. In summary, always do your own research, evaluate the information critically, and seek professional advice when necessary. Stay informed, exercise caution, and make well-informed decisions based on your own unique circumstances.","creation_date":"2024-04-13","tags":["0g","Airdrop","Bitcoin","Cryptocurrency","Blockchain"],"author":"ilaNihas 🌍","category":null}