{"id":"5a26042f-e1a0-4c85-97bc-562e3b8d1302","article_link":"https://cointelegraph.com/news/pantera-capital-invests-open-network-ton-crypto-investment","website_source":"Cointelegraph","article_type":"News Article","summary":"The Telegram-TON hookup opens up a broad spectrum of Web3 opportunities for Telegram’s 900 million monthly users, Pantera Capital said.","title":"Pantera invests in TON with high expectations for Telegram’s future","detailed_content":"Pantera Capital has invested an undisclosed amount in The Open Network (TON). It is the crypto-focused venture capital firm’s “latest” investment in TON and motivated by its connection to the Telegram messaging service, the company said.\nTelegram’s decision in April to incorporate TON gives TON “potential to become one of the largest crypto networks,” Pantera said in a long and enthusiastic blog post on its website. Telegram, with its 900 million monthly users and 36.7 million monthly downloads, “is well positioned to bring crypto to the world because of its shared Web3 ethos.”\nIn a laundry list of TON’s virtues, Pantera said the architecture of the TON blockchain provides performance and scalability that compares favorably with leading blockchains, and its wallet offers high utility with a simple interface.\nA comparison of scalability among major blockchains. Source: Pantera Capital\nPantera also praised the mini-apps TON enables on Telegram:\n“Earlier this year, we observed how memecoin trading tools like BonkBot generated tens of millions of dollars in revenue through Telegram’s user interface. TON-based applications, such as StormTrade, now enable users to trade perpetuals, cryptocurrencies, stocks, and equities using the same interface.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nFurthermore, Telegram is offering new opportunities for monetization, such as ad revenue sharing and tradable customized usernames, virtual phone numbers and emojis.\nRelated: Tether issued on TON blockchain at a ‘great start,’ says CEO — Now at $60M\nThe Telegram-TON linkup was a notable achievement, Pantera noted. TON was originally designed to integrate with Telegram, but its initial attempt was foiled by the United States Securities and Exchange Commission. Telegram was able to reunite with TON after the network was relaunched by independent developers, making it the only major messaging platform to incorporate Web3.\nSource: Ryan Barney\nMessenger was unable to overcome regulatory hurdles to incorporate Meta’s Libra coin and gave up the effort. WeChat’s use of the digital yuan has “limited scope,” Pantera said.\nPantera has $5.2 billion of assets under management in four funds. It announced the formation of a new $1 billion fund in April.\nCointelegraph reached out to Pantera for more information but did not receive a response by the time of publication.\nMagazine: 6 Questions for Paul Veradittakit of Pantera Capital\nExchange or buy TON\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-03","tags":["#Blockchain","#Business","#Investments","#Pantera Capital","#Telegram","#TON"],"author":"by Derek Andersen","category":null}