{"id":"5b3f6fc6-0344-4c3e-8a5f-8eb42d328e30","article_link":"https://www.wired.com/story/ethereum-shanghai-update-crypto-rift/","website_source":"Wired","article_type":"News Article","summary":"Ether is finally untethering itself from mining—and driving renewed debate about bitcoin’s environmental impact.","title":"Ethereum’s Shanghai Update Opens a Rift in Crypto","detailed_content":"AT 19:27 EASTERN time on April 12, the Ethereum blockchain, home to the world’s second-most-popular cryptocurrency, ether, will finally sever its links to crypto mining. Within the Ethereum bubble, a sense of anticipation is building; some are planning “viewing parties” for the occasion. Codenamed “Shanghai,” the update to Ethereum caps off a process, after “The Merge,” which fundamentally changes the way transactions are verified and the network secured. \nUnder the old system, proof-of-work (PoW) mining, the right to process a batch of transactions and earn a crypto reward is determined by a race to solve a mathematical puzzle. The greater the computing power miners throw at the problem, the greater their chance of winning the race. Under Ethereum’s new proof-of-stake (PoS) system, there is no race and there are no miners; instead, the winner is determined by raffle. The greater the amount of ether somebody locks up on the network—or stakes—the greater the chance they hold a prize-winning ticket.\nBy demonstrating that a large-scale blockchain can shift from one system to another, Shanghai will reignite a debate over whether the practice of mining that still supports bitcoin, the most widely traded cryptocurrency, is viable and sustainable. Figures from the University of Cambridge suggest the Bitcoin network consumed 107 terawatt-hours of energy in 2022—equivalent to that of the Netherlands—of which only just over a quarter came from renewable sources. Prior to The Merge, Ethereum consumed roughly two-thirds as much energy as the Bitcoin network. But the move away from mining has cut that consumption, according to analysis by Alex de Vries, data scientist at De Nederlandsche Bank and creator of Digiconomist, a source of crypto emissions data, by at least 99.84 percent.\nFEATURED VIDEO\nInside the Largest Bitcoin Mine in The U.S.\n“The energy consumption problem is Bitcoin’s achilles heel,” says de Vries. “It’s a simple fact that as the price of bitcoin gets higher, the energy consumption problem gets worse. The more money miners make, the more they will typically spend on resources: hardware and electricity.\nBut many bitcoiners dispute the characterization of the network as energy-guzzling and carbon intensive, saying that mining is increasingly powered by renewable energy. And, they say, PoS is inferior to PoW—prone to centralization (crypto’s great nemesis), concentrating influence and wealth in the hands of the wealthy, without any mitigating forces, like energy costs, pulling in the opposite direction. All of this makes Shanghai a proxy battle over the future of crypto.\nIn bitcoin’s infancy, the cryptocurrency could be mined effectively with just a personal computer and simple software. But as the level of appetite for bitcoin increased, the industry professionalized. Today, the mining scene is dominated by large companies—some publicly traded, like Marathon Digital and Riot Blockchain—that operate gargantuan facilities with rack upon rack of hardware. The largest of these mines, many of which are located in Texas, can draw upwards of 700 MW of power.But bitcoin proponents claim that looking at the absolute amount of energy that the industry consumes misses important context. Far from triggering investment in new fossil-fuel plants, miners say they are incentivizing renewable energy development, by plugging the gaps when demand is low.\n“Only the miners with the cheapest energy can survive, so bitcoin is driven to areas of low or no demand,” says Yan Pritzker, cofounder of the bitcoin trading platform Swan Bitcoin. “Sources of wind and solar are unreliable and therefore have to be overprovisioned. But bitcoin miners are coming in and acting as a buyer of last resort.”\nBy purchasing energy from renewable sources when it isn’t needed by the grid, the argument goes, bitcoin miners can increase the profitability of solar and wind farms and accelerate the transition to sustainable energy sources. Miners also say consumption figures like those compiled by the University of Cambridge don’t take into account the amount of off-grid energy sources used to power mining, nor the circa 1 percent that run on methane—a byproduct of oil extraction that is otherwise vented or burned away.\nA common argument among bitcoiners is that rather than focusing on trying to cut down how much energy is consumed by the network, critics should look at how the network can help expand the amount of renewable energy on the grid. “Bitcoiners understand that the way to reduce emissions is not to use less energy, but to generate orders of magnitude more low-emissions electricity,” says Chris Bendiksen, bitcoin research lead at investment firm CoinShares. “In order to do that, producing low-emission energy must be profitable, something that PoW mining ensures in a wholly unique manner and at scale.”\nAlthough compelling at a surface level, these arguments do not stand up to scrutiny, say bitcoin critics. Pete Howson, an assistant professor on the Environmental Sciences faculty at Northumbria University, likens the common defenses of bitcoin mining to “magic tricks''—sleights of hand that obscure inconvenient truths and “provide the illusion of clean and profitable investment.”\n“The only difference between flaring methane and flaring methane for bitcoin,” says Howson, “is that the latter makes fossil-fuel companies more profitable, slowing the transition to green alternatives.” There are even a handful of examples—in New York and Montana—of the additional revenue generated by bitcoin mining giving new life to fossil-fuel plants that had either closed or were scheduled for closure.\nMeanwhile, in countries like Iceland, Howson says, bitcoin miners are outcompeting other energy consumers, like recycling plants, which “can’t get access” to otherwise plentiful sources of renewable energy. “There is no such thing as wasting energy sustainably,” he says.\nWhether it’s really a waste is at the core of the debate.\nThe scrutiny of bitcoin’s environmental credentials, says Pritzker, is out of proportion with the emissions it produces, which best estimates place somewhere between 0.1 percent to 0.15 percent of the global total. He asks why bitcoin is singled out, when other industries pollute in larger volumes or are powered by a dirtier mix of energy. The simple answer is that the argument hinges on a matter of personal opinion; it comes down to whether somebody believes that crypto serves a purpose.If bitcoin is agreed to be of greater societal value than tobacco, say, an industry responsible for a greater volume of emissions, its footprint becomes easier to justify. But if instead, bitcoin is just one big Ponzi scheme, the sums will never line up.\nThis ideological battle, and the strength of the animosity between bitcoin evangelists and their critics, means that it’s hard to have a nuanced discussion about the industry, and both sides have become entrenched in their positions.\nAccording to de Vries, it would be perfectly possible, from a technical perspective, for Bitcoin to follow in the footsteps of the Ethereum network. “Bitcoin could move to PoS, no problem,” he says. “But it’s a social challenge.”\nDe Vries is often attacked by bitcoiners, who claim he is incentivized by his affiliation with central banking to criticize bitcoin, that his data is incorrect, and that he fails to account for the nuances in bitcoin’s relationship with the environment.\nBitcoiners have locked horns with environmental charities. On March 23, activists at Greenpeace unveiled an art installation named the Skull of Satoshi, an allusion to the pseudonymous creator of bitcoin, Satoshi Nakamoto. Standing 11 feet tall, the skull is decorated with old motherboards, its eye sockets glow red, and chimneys eject smoke from the crown. The installation was intended to represent the dual contribution of crypto mining to carbon emissions and e-waste, says Rolf Skar, campaign director at Greenpeace USA. But the skull was quickly appropriated by bitcoin supporters on Twitter, who described the skull as “metal” and “badass.” Some used it as a new profile picture. \n“The reaction was predictable, but disappointing,” says Skar. “It’s not surprising, but it’s a bad look to trivialize these very real issues.”\nThe artist that designed the sculpture, Benjamin Von Wong, bore some of the backlash too. On March 25, he published a Twitter thread saying that he had revised his “black and white” assessment after conversations with bitcoiners. But he also pointed to the forces standing in the way of productive debate: “There are people on both sides who believe the other is naively optimistic, misguided and misinformed,” he wrote.\nThe Skull of Satoshi, which is being taken on a tour of US cities, is part of a broader Greenpeace campaign called “Change the Code, Not the Climate,” the purpose of which is to push for changes in the Bitcoin code base that would reduce the network’s emissions. Skar says the intention is to prevent fossil-fuel plants from “roaring back to life,” courtesy of bitcoin, but Bendiksen calls the effort a “smear campaign.”\nBoth parties also accuse the other of bad-faith misrepresentations of facts and data. The Greenpeace campaign, Pritzker and Bendiksen say, is funded in part by Chris Larsen, founder of Ripple, a company with interests in promoting XRP, a cryptocurrency that was launched as a direct competitor to bitcoin. But by the same token, says Howson, arguments in favor of bitcoin mining are often founded on data supplied by the Bitcoin Mining Council, a coalition of mining companies led by Michael Saylor, CEO of MicroStrategy, a business with hundreds of millions of dollars invested in bitcoin.The impasse is worsened by the ideological opposition to PoS among bitcoiners, separate from the environmental considerations. Some find unthinkable the idea of tampering with Satoshi Nakamoto’s original invention, and others, like Bendiksen and Pritzker, believe PoS introduces greater risk of centralization and censorship—and therefore represents a threat to crypto’s founding principles. “PoS is essentially the fiat system,” says Pritzker, “because whoever has the gold makes the rules.” For this reason, explains Bendiksen, bitcoiners will “never agree” to a shift.\n“Any attack on bitcoin is an attack on their morality, values, and often their net worth. This makes everything feel personal,” Von Wong told WIRED. “Because most people don’t see themselves as intrinsically bad, they feel misjudged and misunderstood, which is a terrible place to start a conversation.”\nThe result is a situation in which both parties lob insults across the void but register none of the legitimate or well-intentioned complaints. Any morsel of information that might be used to discredit the opposition is also seized upon. And Von Wong worries about becoming a morsel himself.\n“The hardest part about being in the center of a controversy is feeling like a chess piece,” he says. “I don’t feel like I can speak freely in public without someone, somewhere, taking what I say out of context and trying to leverage it against the opposite side.”","creation_date":"2023-04-10","tags":["","CRYPTOCURRENCY","BITCOIN","BLOCKCHAIN","ETHEREUM","ENVIRONMENT"],"author":"BY JOEL KHALILI","category":null}