{"id":"5b99151c-a94f-4d07-99d4-da0db1f0ed3a","article_link":"https://cointelegraph.com/news/circle-launches-usd-coin-ethereum-zksync","website_source":"Cointelegraph","article_type":"News Article","summary":"A surge in DeFi applications building on zkSync has led to demand for stablecoins that support the blockchain.","title":"Circle launches USD Coin on Ethereum zkSync","detailed_content":"Stablecoin issuer Circle has expanded support for its native stablecoin, USD Coin\nUSDC\n$1.00\n, to Ethereum zero-knowledge layer-2 solution zkSync.\n“Many leading ecosystem apps and DeFi protocols are expected to support native USDC on zkSync for payments, trading, borrowing, lending,” wrote Circle in its April 9 announcement. Developers can use USDC on zkSync to build on a stable foundation that is built to last and officially supported by Circle. With the addition of zkSync, USDC is now supported on 16 blockchains, including Ethereum, Solana, Base, Arbitrum and others. \nZero-knowledge proofs determine the integrity of a transaction without disclosing the supporting evidence. Meanwhile, rollups bundle transactions off the Ethereum main layer and club them into a single transaction. Together, they form the core of the zkSync technology, which processes transactions at record speed and low cost at layer 2 and sends the finalized proof back to the Ethereum mainnet. As of April 9, 2024, the zkSync ecosystem includes over 180 decentralized applications and over 5.7 million unique active wallet addresses over the last 30 days.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nLike USDC on other blockchains, the zkSync USDC can be redeemed one-for-one for U.S. dollars directly via Circle or via digital wallets and exchanges. The zkSync USDC can also be swapped for other USDCs via cross-chain bridges. Institutional investors can also access the stablecoin via Circle Mint. “Businesses and developers use zkSync to benefit from fast, low cost transactions and native account abstraction,” Circle wrote, adding that “zkSync is on a mission to increase Ethereum’s throughput, and to fully preserve its foundational values.”\nCircle has been mostly expanding access to USDC to other blockchains, although it has halted such efforts from time to time. On Feb. 21, Circle abruptly ceased USDC minting on the Tron blockchain but did not give a reason for ending Tron support, only saying it “continually assesses the suitability of all blockchains” as part of its risk management process. \nLast year, the United States Securities and Exchange Commission sued Justin Sun and the Tron Foundation alleging they offered unregistered securities and conducted manipulative trading, which Sun denies.\nRelated: Binance follows Circle and drops USDC support on Tron\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Blockchain","#Cryptocurrencies","#Circle","#Ethereum","#Adoption","#USD Coin"],"author":"by Zhiyuan Sun","category":null}