{"id":"5b9ff9da-3174-4ead-8e7e-5dc335d5f73a","article_link":"https://medium.com/@mscribeio/mscribes-first-blockpad-launch-partner-announced-the-royals-7e13acc354a8","website_source":"Medium","article_type":"Blog Post","summary":"We are excited to introduce The Royals official branding behind the highly anticipated <Redacted> launch on Mscribe’s new Blockpad!","title":"Mscribe’s First Blockpad Launch Partner Announced “The Royals”","detailed_content":"We are excited to introduce The Royals official branding behind the highly anticipated <Redacted> launch on Mscribe’s new Blockpad!For the past two months leading up to the launch of this pioneering UNAT collection, the official name has been Redacted in order to preserve the proper token ticker. Now that the deployment inscription has been made, the official claim of the ticker “theroyals” belongs to Kingpunkape and the community that has come together to take part in this launch.The Royals are poised to introduce DMT to the rest of the Ordinals and NFT ecosystem in a major way. The Royals mint will be the first ever display of the Mscribe blockpad experience, demonstrating a multiplayer player versus player minting arena. We saw this similar minting method on display for Bitmap and $NAT block claiming, but this will be the first multi-player shared experience for a blockout claim event.For official details from The Royals team, follow @TheRoyals_DMT newly created community channel on X.Official launch will begin on May 13th, roughly 9pm UTC. Phase one of the mint will last for roughly 24 hours giving Bitcoin Babby community ample time to select their blocks. Phases two, three, and four will ongo for 6 hour incrimental periods each.The countdown begins for the first ever privilege authority blockpad mint. This is a foundational event for the history of non-arbitrary creation that will set a forever precedence for new artists looking to leverage the DMT framework in their process.We are excited to see the results of this launch and to witness the birth of a new DMT community with parallel energy to Natcats.To stay engaged and be a part of the DMT community, join us on Discord and follow us on our public YouTube channel where we frequently discuss development progress and updates.","creation_date":null,"tags":[],"author":"Mscribe","category":null}