{"id":"5c998b15-cc6a-4c67-9cde-640057a192d6","article_link":"https://cointelegraph.com/news/parcl-withdrawals-hit-74-million-after-airdrop","website_source":"Cointelegraph","article_type":"News Article","summary":"Parcl users started pulling their funds from the protocol earlier this month after it said it took a snapshot for its recent airdrop.","title":"Withdrawals from real estate betting platform Parcl hit $74M after airdrop","detailed_content":"Investors providing liquidity to the Solana-based real estate betting platform Parcl have pulled more than $74 million from the protocol following its airdrop snapshot earlier in April.\nParcl distributed its native PRCL tokens to eligible users on April 15 after announcing that it had taken a snapshot of users' point balances on April 3.\nUsers began pulling funds shortly after the snapshot was taken. Parcl’s total value locked has fallen 39.6% to $112.1 million from its $185.6 million peak on April 2, per DefiLlama data.\nParcl users have withdrawn more than $74 million since the snapshot. Source: DefiLlama\nParcl is a decentralized real estate trading platform that allows users to speculate on the price movements of real estate markets in major cities.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIts users who participated in the airdrop campaign were allocated 80 million PRCL tokens — 8% of the total 1 billion token supply.\nThe platform’s PRCL token debuted at a price of $0.62 and fell as low as $0.45 in the four hours following the airdrop. It has since slightly recovered to around $0.55, according to CoinGecko.\nParcl’s is down 12.5% over the past 24 hours. Source: CoinGecko\nAmid a wider market tumble that has seen Bitcoin\nBTC\n$62,974\nfall more than 7% on the week, recently airdropped tokens on the Solana network have been among the worst performers.\nRelated: How Solana developers are tackling network congestion challenges\nThe native W token of the cross-chain bridging platform Wormhole is currently down 54% from its launch on April 3. At the time, the Wormhole airdrop saw more than $800 million distributed to eligible users.\nSimilarly, TNSR — the native token of the Solana-based NFT platform Tensor — has tumbled 52.6% from its launch on April 3.\nSolana-based tokens have been weighed down by a significant decline in the price of Solana\nSOL\n$153\nitself, which is currently down 30.7% on the month.\nAdditionally, the Solana network has been plagued by congestion issues, which saw a record 75% of user transactions fail on April 5.\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Altcoin","#Real Estate","#Airdrop","#Solana"],"author":"by Tom Mitchelhill","category":null}