{"id":"5ec79863-b092-443b-a380-bd3cdb343d83","article_link":"https://cointelegraph.com/news/bored-ape-floor-price-sinks-nasa-training-astronauts-metaverse-nifty-newsletter","website_source":"Cointelegraph","article_type":"News Article","summary":"NASA has turned to Web3 tech, such as the metaverse, as well as virtual reality, to train astronauts to live in space.","title":"Bored Ape floor price sinks, NASA training astronauts in the metaverse: Nifty Newsletter","detailed_content":"Welcome to the latest edition of Cointelegraph’s Nifty Newsletter. Keep reading to stay up-to-date with the latest stories on nonfungible tokens. Every Wednesday, the Nifty Newsletter informs and inspires you to dig deeper into the latest NFT trends and insights.\nRead about how NASA uses virtual reality (VR) technology and the metaverse to train its astronauts in this week’s newsletter. What’s behind the decline in the floor price of Bored Ape Yacht Club (BAYC) NFTs? And Cointelegraph has exclusive updates from Paris Blockchain Week, including Ubisoft’s blockchain gaming plans.\nNASA created a VR metaverse to prep astronauts for life on the lunar space station\nWhile most of us spend our time in the metaverse trading assets or bopping around in virtual reality on legless avatars, astronauts working with the National Aeronautics and Space Administration (NASA) and SpaceX are using the metaverse to prepare for life aboard a lunar space station that has yet to be built.\nThe first humans to make their homes in deep space, according to NASA, will be the team tasked with operating a space station currently under development called “Gateway.”\nContinue reading\nUbisoft teases new blockchain game at Paris Blockchain Week\nAAA game studio Ubisoft is edging closer to releasing its first blockchain-based game after releasing the first gameplay trailer for Champions Tactics Grimoria during Paris Blockchain Week.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe tactical player-vs-player role-playing game’s lead developers gave Cointelegraph an exclusive playthrough at the conference. The RPG allows players to craft blockchain-based figurines with unique features and characteristics that can be combined into a team of three for the turn-based game.\nContinue reading\nBored Ape NFT floor price hits lowest point in over two and a half years\nThe floor price of BAYC NFTs has fallen over 90% from its peak to 11.1 Ether (ETH) — its lowest point since August 2021.\nBAYC is now approaching a sub-10 ETH floor price after a 50% fall since March 1 alone, according to NFT Price Floor.\nThe NFT collection’s fall from a peak of 128 ETH set on May 1, 2022, is part of an industry-wide decline in popularity for digital art NFTs.\nHowever, it should be noted that a few BAYC NFTs have continued to sell significantly above their floor price, which is calculated by taking the lowest-priced NFT in a given collection.\nContinue reading\nVeChain announces tokenized gloves in partnership with UFC\nAccording to an April 12 blog post from VeChain, gloves worn by Ultimate Fighting Championship (UFC) fighters will soon be tokenized, and their identities will be tracked on the VeChainThor network.\nThe gloves will contain VeChain near-field communication chips that record fight data, proving the authenticity of each pair, the post stated. After the fight, the athletes will “donate and give away” their gloves, making them into collectors’ items.\nThe chips inside each pair will allow a buyer to check the item’s authenticity via a VeChainThor network smart contract. Fighters began wearing the gloves at UFC 300 on April 13.\nContinue reading\nThanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.\nExchange or buy APE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-18","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Cryptocurrency Exchange","#Metaverse","#NFT"],"author":"by Prashant Jha","category":null}