{"id":"5f8f3172-de44-46cb-ad01-d85a6755a17c","article_link":"https://medium.com/@bitpushnews/eigen-airdrop-the-evolution-of-ethereum-e39bb646ac18","website_source":"Medium","article_type":"Blog Post","summary":"EigenLayer recently made headlines with its plans for the EIGEN token — the most talked-about airdrop of 2024. However, this highly…","title":"EIGEN Airdrop: The Evolution of Ethereum","detailed_content":"EigenLayer recently made headlines with its plans for the EIGEN token — the most talked-about airdrop of 2024. However, this highly anticipated event was not without its share of controversy. The airdrop, which was supposed to be a straightforward distribution of tokens, was marred with issues such as confusing schedules, non-transferability, and a multi-phase approach. In this analysis, we delve into the complexities of EIGEN, from its airdrop to its utility, and explore the potential implications for the cryptocurrency market.EigenLayer, a restaking protocol, empowers users to re-stake their staked ETH, thereby providing cryptoeconomic security for a diverse range of protocols. This innovative concept transforms ETH into a versatile asset capable of securing entities beyond the Ethereum mainnet, such as oracles, zero-knowledge provers, and Layer 2s. Since its mainnet launch last year, EigenLayer has emerged as the second-largest DeFi protocol, trailing only liquid staking provider Lido, with a staggering total value locked of over $15 billion, or 5 million ETH. This remarkable achievement is largely attributed to their incentivization system, which has rewarded users with points expected to eventually convert into an EigenLayer token.On April 29th, the Eigen Foundation announced the EIGEN token in arguably the most anticipated Ethereum event of the year. Despite the initial excitement about its release and its potential to be valued at over $50 billion and instantly become a top token, the community swiftly turned critical of the tokenomics and the airdrop’s structure. The airdrop will be divided into three seasons of points farming, each with 5% of the total overall supply. The first season will be split into two phases, with phase 1 (90% of tokens) primarily allocated to native restakers and phase 2 (10% of tokens) to complex DeFi users. The second phase will not be released for another month, and the EIGEN token will not be transferable until further notice. These factors and stringent geo-blocking measures that barred access to the claims page for numerous countries and VPNs sparked outrage on Crypto Twitter.Some of this frustration was quelled through further updates, which stated that DeFi users are getting a fair share of the distribution and were not capped at 10% of the supply. Additionally, since this represents the majority of retail depositors, the early whales in Phase 1 will not be able to sell tokens because of their non-transferability. Two issues that have not been resolved are that 55% of tokens go to VCs whose vesting period starts while the token is non-transferable and that it could legitimately be six months to a year until the token is exchangeable. Their stated reason for enacting this limitation is to ensure proper decentralization of the protocol, which we will explore shortly.The EIGEN whitepaper is 43 pages long and provides a detailed explanation of the value and utility of the token. EIGEN will be a work token, meaning that it is rewarded to operators of the network of actively validated services (AVSs) and protocols using EigenLayer’s restaked ETH to secure their protocols. Many other tokens can be classified as work tokens, like ETH or DePIN tokens like Helium’s HNT rewarded to hotspot runners. However, these tokens have two main limitations: first, they are special-purpose and can only be used on a specific application. Second, they can incentivize honest behavior through objective, on-chain attributes like whether or not an ETH validator voted for two separate blocks in the same slot. EIGEN tackles the first problem by allowing for restaking and handles the second through its dual-token approach to truth-seeking. ETH is used as collateral for the system’s objective security concerns and cryptoeconomic security. The EIGEN token will act as collateral for intersubjective security — that which could not be decided by a distinct rule or piece of code but could reasonably be agreed upon by two humans.To keep the token from going chaotic in the case of potential disagreements about a vote, it has a built-in forking process that keeps the token simple for holders while still providing ultimate flexibility. bEIGEN is the staked version of EIGEN, which can be forked during intersubjective forks. EIGEN is simply a wrapper for this token and will follow the fork of social consensus. The intersubjective process allows someone to put down collateral and state that someone else is acting maliciously. Then, EIGEN holders vote, and if proven correct, that user gets rewarded, the malicious actor gets slashed, and the token forks to a new version that goes to everyone except the malicious entity. Even when the majority is dishonest, the minority token will still exist for people to build on and eventually decide to use as the canonical instance. Given the important role of EIGEN in this process, it can be understood why a tradable token on launch would be messy for the early days of the protocol. Still, this does not excuse the lack of transparency around the unlock process or how VCs get to vest during this period.EIGEN’s token model is unlike anything we’ve seen before and unlocks infinite new opportunities for onchain protocols and applications that could previously not be governed. Though the concept is complex, it is abstracted away for EIGEN holders and requires no active maintenance of the token — the perfect mix of utility and simplicity. Even though the airdrop was initially controversial, and the non-transferability of the token hardly makes this a real airdrop until it’s exchangeable, EIGEN seems to be the next great evolution of the Ethereum ecosystem.By Lincoln MurrFollow Bitpush News on Twitter!","creation_date":"2024-05-01","tags":[],"author":"Bitpush News","category":null}