{"id":"5fa3b603-958e-4e54-8df8-d647cce0adbf","article_link":"https://cointelegraph.com/news/eigenlayer-users-complain-restrictive-airdrop-others-say-generous","website_source":"Cointelegraph","article_type":"News Article","summary":"Ethereum restaking protocol Eigenlayer has promised to allocate 15% of EIGEN supply to the community, but not everyone was happy about it.","title":"EigenLayer users fume over restrictive airdrop, others say it’s ‘generous’","detailed_content":"Users who felt left out of the recently announced EigenLayer airdrop have lashed out at the restaking protocol’s Monday announcement — highlighting its non-transferable token structure, aggressive geo-restrictions, and an apparently short snapshot period.\nEigenLayer — the second largest protocol with $15.67 billion in total value locked (TVL) — unveiled the specifics of its long-expected “stakedrop” in an April 29 blog post.\nDespite the protocol never officially confirming an airdrop until Monday, speculators seemed to be more than fine with adding their already-staked Ether\nETH\n$3,032\nto EigenLayer — adding more than $15.7 billion to the protocol since its inception — hoping to receive an airdrop at some point in the future.\nIn its announcement, Eigen Foundation shared that it would allocate 15% of EIGEN’s total supply of 1.67 billion tokens to the community, however, only 5% of the initial would be allocated to early users who participated in Season One. The remaining allocation would be distributed to users in the following “seasons.”\n5% of EIGEN’s total supply would be distributed in Season One. Source: EigenLayer\nSome users protested that this was a relatively small allocation and claimed the documents detailing airdrop allocations were “confusing”\nUntransferrable tokens and linear distribution\nHowever, stakedrop critics directed the bulk of their ire at the fact that while users could claim their EIGEN tokens starting from March 10, they would not be able to transfer or sell them until an undisclosed date.\nThe Eigen Foundation wrote that this control was put in place to ensure that key features including payments and slashing parameters were “well established” before EIGEN became transferable among users.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“We believe this approach will best support the long-term growth and maturity of the EigenLayer ecosystem.”\nAdditionally, some users aimed heat toward EIGEN’s linear distribution model — meaning that the number of points users earn directly correlates with the number of claimable EIGEN tokens — which they say unfairly favors large restakers.\n“Honestly the linear approach is f-cking stupid. Basically makes 1000-2000 Eigen stakers happy at the expense of 100k who will get peanuts,” shared one user on X.\nHowever, EigenLayer is not the first protocol to leverage a linear model for token distribution, with several major protocols, including Solana-based protocols Kamino Finance and Parcl, opting for the same distribution model in their respective airdrops last month, though that didn't appear to attract the same level of criticism at the time. \nAnother major concern for critics was the harsh geographic restrictions placed on users looking to claim their airdrops.\nAccording to EigenLayer’s legal documentation, users from 30 countries including the United States, Canada, China, and Russia would not be able to claim EIGEN tokens.\nSource: BoneCondor\nThe foundation noted they had taken extra steps to ensure that users trying to skirt these restrictions with VPNs wouldn’t be able to do so.\n“Accepting stake from those countries and not rewarding them isn’t right. They took a very real risk for nothing,” wrote one user in response to the protocol’s geoblocking efforts.\nRelated: EigenLayer on the brink of potential yield crisis\nAnother pseudonymous crypto user on X described all of these factors as “bummers” which had taken away from the expected hopes of the EIGEN airdrop.\nSource: GarretZ\nCritics are ‘trying to find reasons’ to be upset\nDespite the outrage around the stakedrop, Henrik Andersson, the chief investment officer of the Australian crypto investment firm Apollo Capital said many of EigenLayer’s critics were simply “trying to find reasons to be upset.”\nSpeaking to Cointelegraph, Andersson described EigenLayer’s total 15% allocation to users as “generous,” and counted it among several “positive items” contained within the protocol’s stakedrop process.\nHe said the Foundation had made its distribution model quite clear, and described the confusion around allocations to certain DeFi protocol users as misplaced.\n“The stakedrop is linear which in my opinion is the fairest way to do this and effectively eliminates issues related to Sybil attacks,” he added.\n“The cherry on top is you don't need to connect your wallet or sign anything to check your stakedrop — well done EigenLayer!” said Andersson.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-30","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Ethereum","#Investments","#Airdrop","#Staking"],"author":"by Tom Mitchelhill","category":null}