{"id":"5ffded47-bbe5-4b2c-aea0-3fac8e8a42cf","article_link":"https://cointelegraph.com/news/depin-and-ai-are-set-to-collide-interview-with-futuremoney-group","website_source":"Cointelegraph","article_type":"News Article","summary":"DePIN holds the key to the future of Web3, and this VC firm is helping Asia-based startups build the next big thing for DePIN.","title":"DePIN and AI are set to collide: Interview with FutureMoney Group","detailed_content":"Simply known as DePIN, decentralized physical infrastructure networks bring a fresh take on Web3 and blockchain by offering real-world usability and value for providers and network participants, and investors are taking notice.\nEstablished in 2017, FutureMoney Group is an Asia-based venture capital (VC) focusing on the DePIN industry and artificial intelligence (AI) with an asset management scale of $50 million. The company covers alpha primary and secondary investment layouts of projects from different scales in varying ecological niches.\nIn this interview, FutureMoney Group co-founders Steven Li and Eo Hao draw an insightful image of the current DePIN landscape and how it can expand the Web3 space.\nCointelegraph: How do you see the current state of the DePIN ecosystem?\nSteven Li: FutureMoney Group has been focusing on the DePIN area and has invested in many portfolios. We have tried our best to cover the different subdivisions of the DePIN sector so we have a more intuitive understanding of the development of the DePIN ecosystem. \nThe DePIN ecosystem mainly has the following characteristics: \nDePIN is an important starting point and manifestation of the extension of the Web3 field to the traditional world.\nCompared with other popular tracks such as Bitcoin (BTC) ecology, including layers, modular blockchains and restake, DePIN is the easiest to be accepted by traditional funds and understood by traditional users.\nThe DePIN and AI tracks mostly overlap, and there is a tendency for the tracks to merge.\nDePIN is closely integrated with hardware. Currently, the main focus is on the mobile terminal, vehicle terminal and mining machine terminal.\nThe narrative of DePIN is mainly the combination of hardware and token economics. By adding the AI track and emphasizing the staking function, DePINFi and AIFi will explode in the future, with DePIN as the core.\nCT: FutureMoney Group is known as the first VC focusing on the DePIN field in Asia, closing a $20 million fund to invest in DePIN-related products and services. What has attracted the FutureMoney Group to the DePIN space?\nEo Hao: The reason why we chose DePIN is that, on the one hand, we believe that after experiencing multiple rounds of bull markets, the overall market value of Web3 has expanded several times, and the Bitcoin ETF has been passed, the possibility and necessity of being connected to the real world has become imminent.\nDePIN is a good starting point and expression that combines the two worlds. On the other hand, because some of the LPs behind us include the largest hardware manufacturers in the Asian market, including electric vehicle manufacturing companies and mining farms listed in the United States, we pay special attention to the upstream and downstream related to blockchain and hardware.\nEO is sharing DePIN opportunities on Web3 festival 2024. Source: FutureMoney Group\nCT: Could you share the story of the FutureMoney Group? When did you establish the company?\nSL: Co-founder Eo Hao and I started to invest in blockchain and encryption projects in 2016. In addition to buying BTC and Ether (ETH), we are also individual investors in BAT, Loopring, Qtum and other projects. After experiencing the ICO craze in 2017, we started investing in early crypto projects in early 2018 with a total of $1.5 million from our family, friends and our own savings.\nThe two co-founders of FutureMoney Group are Eo Hao and Steven Li. Source: FutureMoney Group\nAlthough this amount cannot be counted as our official first fund, we started from a personal landmark event when an investor transformed into a company.\nCT: What was your initial goal when starting FutureMoney Group, and what are your goals now?\nSL: Because Eo and I both have financial technology backgrounds, our initial interest in blockchain technology also came from the belief that it would revolutionize the financial system. We established this fund to find the next generation of “money\" through investment, so the company Named FutureMoney.\nAfter several years of development and upgrading, we have developed from the initial venture capital business to a holding company in the crypto field covering asset management, mining, fund of funds and incubators, so after 2021, we officially changed the company name to FutureMoney Group. We hope to continue supporting early-stage startups by delving deeper into the crypto field through our methods while opening the window for more Asian investors to allocate crypto assets.\nCT: Where does FutureMoney Group stand now? Could you detail your investment practices and portfolio?\nEH: Our current investment theme is the Future of Work. As mentioned, FMG is the most professional investment institution on the DePIN track. Messari has included us, and DePIN Buddy has listed us as one of the most professional investment institutions on the DePIN track. Together with Borderless, Multicoin is equally famous.\nOur expertise is reflected in the depth and breadth of our DePIN Portfolio layout. We have three products:\nDePIN Surf focuses on very early and low-market-value Alpha projects. Over 50 projects have been applied, of which we selected a total of 23 in the two phases and for projects that have issued tokens.\nDePIN Index covers 24 high-quality projects in the industry, including RNDR, TAO, Theta, Nosana and Mobile. We have established positions in all of them; from its establishment on Dec. 28, 2023, to now, the overall revenue in one quarter has nearly doubled, reaching 91.9 percent.\nIn addition, we have major market investments: 25 projects, including Powerpod, JDI, GEDONET and ETHStorage.\nCT: What are your most significant milestones so far?\nSL: We successfully launched the world’s first DePIN Index and were listed by Messari as a representative DePIN VC in Asia in their DePIN mapping.\nWe cooperate with the IOTEX Foundation for the Depin Surf. We are also working with China Bridge Capital and well-known hardware equipment manufacturers that supply hardware to Apple and Tesla.\nCT: How do you see the future of the DePIN space?\nEH: If many hot spots such as BTC ecology, decentralized finance (DeFi) and Ethereum are the in-depth internal builds of the Web3 industry and seek deeper research, then DePIN, AI and RWA are helping Web3 expand its breadth.\nBoth have huge market potential, and the Bitcoin ecosystem is also a trillion-dollar market. But, in the real world, we strongly believe that DePIN will have huge development potential and wealth space.\nLearn more about FutureMoney Group\n#Blockchain\n#Asia\n#Business\n#Decentralization\n#Venture Capital\n#Investments\n#Adoption\n#Web3\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-08","tags":["#Blockchain","#Asia","#Business","#Decentralization","#Venture Capital","#Investments","#Adoption","#Web3"],"author":"by Serkan Keskin","category":null}