{"id":"60f16e96-f644-4879-9a7d-abe1ace1d2ad","article_link":"https://cointelegraph.com/news/worldcoin-beefs-up-security-open-sourcing-biometric-data","website_source":"Cointelegraph","article_type":"News Article","summary":"Worldcoin Foundation open sources a secure multi-party computation (SMPC) system to enhance biometric data protection and confirmed that users can now securely delete old iris codes.","title":"Worldcoin beefs up security by open-sourcing biometric data system","detailed_content":"As organizations increasingly rely on biometric data for various applications, from access to physical spaces to financial services, the frequency and impact of data breaches continue to escalate. \nOn May 15, the Worldcoin Foundation, the organization behind the Worldcoin iris biometric cryptocurrency project, announced that it open-sourced its secure multi-party computation (SMPC) system.\nThe new SMPC system, which is responsible for encrypting iris codes into secret shares held by multiple parties, enables the Worldcoin Foundation to permanently delete iris codes generated through its previous uniqueness-checking system.\nRemco Bloemen, the head of protocol at Worldcoin Foundation, told Cointelegraph that this development, open-sourcing the SMPC system, offers a potential solution for “enhanced biometric data security.”\n\"With the development and open sourcing of a new secure multi-party computation (SMPC) system, Worldcoin Foundation aims to continue to increase the robustness of the Worldcoin protocol while also setting a new standard for security. \"\nThe Worldcoin Foundation said that its SMPC approach is even effective against quantum computing. \nA report by Fortune Business Insights released on April 29 predicted that the global biometric system market will grow from $30.77 billion in 2022 to $76.70 billion by 2029.\nMeanwhile, research from MIT’s Stuart Madnick revealed that there has been a significant rise (20%) in data breaches between 2022 and 2023, with the number of affected individuals doubling.\nRelated: Worldcoin: Should you let Sam Altman scan your eyeballs for WLD?\nWorldcoin Foundation data protection officer Jannick Preiwisch, said the Worldcoin community is committed to developing and deploying advanced privacy-focused technologies to improve trust online and increase access to the global economy. \n“The development of this new system demonstrates an unparalleled commitment to further compliance with the EU General Data Protection Regulation and other data protection regimes across the world.”\nHe said it also “complements” Worldcoin's intention to provide users more of a choice — and control — as to where their data is going, including personal custody and the ability to un-verify their World IDs.\nWorldcoin has previously found itself in hot water with regulators around the world — and in Europe in particular with its GDPR measures — over its practices with user data. \nHowever, it has since taken measures to signal its willingness to comply. In March 2024, it made the software of its iris-scanning Orb open-source and implemented a new “personal custody” privacy feature for user data.\nA month later, in April, it said it would be tightening privacy checks and allowing users to un-verify their World ID.\nAt the beginning of this year, Worldcoin saw new milestones for its active daily user count, which soared past one million for its wallet app. It also saw its token WLD surge by 141%.\nMagazine: ‘Sic AIs on each other’ to prevent AI apocalypse: David Brin, sci-fi author\nExchange or buy WLD\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-15","tags":["#Blockchain","#Security","#Privacy","#Worldcoin","#Biometric Security","#Data"],"author":"by Savannah Fortis","category":null}