{"id":"6138c02c-4c75-48b9-a5a9-6dc4c578cb28","article_link":"https://cointelegraph.com/news/banks-flood-stablecoin-market-new-payment-act-passes-senate","website_source":"Cointelegraph","article_type":"Tweet","summary":"The Lummis-GillibrandPayment Stablecoin Act introduced to the Senate could see big banks encouraged to take steps into the stablecoin market, says S&P Global Ratings.","title":"Banks could flood into stablecoins if new bill passes: S&P Global","detailed_content":"A new stablecoin-focused bill introduced to the United States Senate could “encourage” U.S. banks to step into the stablecoin market, says global ratings firm S&P Global Ratings. \nIn an April 23 research note, S&P shared that proposals outlined in the Payment Stablecoin Act — introduced to the Senate on April 17 — could encourage banks to get involved in issuing U.S. dollar-pegged stablecoins and potentially spell trouble for large non-U.S entities that issue stablecoins such as Tether.\nDescribing stablecoins as a potential “key pillar of financial markets,” the ratings agency looked to BlackRock’s recently launched BUIDL fund as evidence for the “efficiencies and enhanced settlement security” of stablecoins in tokenizing assets and digital bonds.\nNotably, the Lummis-Gillibrand Payment Stablecoin Act proposed introducing a $10 billion issuance limit on non-bank stablecoin firms, banning “unbacked” algorithmic stablecoins, as well as requiring stablecoin issuers to hold one-to-one cash or cash-equivalent reserves.\n“Assuming the bill is approved, and that relevant banking regulation follows, the new rules may offer banks a competitive advantage by limiting institutions without a banking license to a maximum issuance of $10 billion,” it said.\nThe ratings agency also noted that the introduction of a $10 billion issuance on non-bank firms could spell trouble for Tether which — with a market cap of $110 billion — is currently the largest U.S. Dollar-pegged stablecoin issuer on the market.\nRelated: Crypto advocacy group claims stablecoin bill would ‘violate free speech rights’\nTether, the largest stablecoin by outstanding volume, is issued by a non-U.S. entity and therefore not a permitted payment stablecoin under the proposed bill,” S&P Global said.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“This means that U.S. entities couldn’t hold or transact in Tether, which may reduce demand while boosting U.S.-issued stablecoins.”\nS&P noted that much of Tether’s transaction activity occurred primarily outside of the United States and was driven in large part by transactions in emerging markets, retail activity, and remittances.\nSource: Senator Kirsten Gillibrand\nDemocrat Senator Kirsten Gillibrand said passing a regulatory framework for stablecoins was “absolutely critical to maintaining the U.S. dollar’s dominance, promoting responsible innovation, protecting consumers, and cracking down on money laundering and illicit finance,” when introducing the bill last week.\nNot everyone was pleased with the proposals outlined in the bill, however.\nCrypto advocacy organization Coin Center expressed concerns with the bill, saying it would be “bad policy” to ban algorithmic stablecoins, and described it as an unconstitutional act under protections of the First Amendment.\n7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExchange or buy USDTSOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-25","tags":["#Blockchain","#Cryptocurrencies","#Business","#Banks","#Circle","#Adoption","#United States","#Tether","#Stablecoin"],"author":"by Tom Mitchelhill","category":null}