{"id":"6257f6b8-ce72-4984-84a0-ae4acfb1f73b","article_link":"https://cointelegraph.com/news/worldcoin-reaches-10-m-users-70-m-transactions-dozen-goats-ubi","website_source":"Cointelegraph","article_type":"News Article","summary":"OpenAI CEO Sam Altman’s identity coin startup Worldcoin’s World App now has more daily users in April than its entire monthly user count to start 2024.","title":"Worldcoin reaches 10M users, 70M transactions and at least 13 goats bought","detailed_content":"Worldcoin’s World App has reached 10 million total users signed up, with an average of 2 million users a day and more than 5 million a month. \nThese milestones come less than a year after the service’s launch in June 2023, and according to Tiago Sada, head of product for Worldcoin’s parent company, Tools for Humanity, the project now has more daily users than its total monthly user count in January 2024.\nUniversal basic income\nWorldcoin is a cryptocurrency project aimed at creating a universal basic income. Users register their identity with the company’s “World App” by having their eyes scanned in-person by machines referred to by the company as “Orbs.”\nRemco Bloemen, head of blockchain at the Worldcoin Foundation, said in a statement that World App wasn’t intended to be the only solution on the Worldcoin protocol:\n“Our hope is that this will encourage other contributors to develop additional wallets for the protocol, as different users have different needs and preferences for their wallet apps. In other words, down the road the Worldcoin community has expressed interest in alternatives to World App, so that a wider range of people can engage with Worldcoin as they choose.”\nGoats\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOne of the more noteworthy use cases for World App, as of late, has been the viral story of a user in Kenya who expressed their gratitude over being able to purchase a goat with the funds they received from a Worldcoin airdrop.\nThe crypto community rallied to the person, sending an undisclosed amount of cryptocurrency which they reportedly used to purchase even more goats bringing their total to “13 and counting.”\nSource: Nic Carter\nThe goat pictured above was even given a proper name: “Sam.” When asked on X why the owner chose to name it that, they responded that it was named after Sam Altman, the co-founder of Worldcoin.\nAltman is also the co-founder and current CEO of unicorn artificial intelligence (AI) startup and former not-for-profit company OpenAI. The company’s ChatGPT product is currently viewed as the state-of-the-art for generative AI technology.\nRelated: Worldcoin tightens privacy checks, allows users to unverify World ID","creation_date":"2024-04-12","tags":["#Blockchain","#Altcoin","#Business","#Ethereum","#Adoption","#Kenya","#AI","#Worldcoin","#DeFi","#OpenAI"],"author":"by Tristan Greene","category":null}