{"id":"628b9146-ccd2-4524-bdd1-431b708cfa6d","article_link":"https://cointelegraph.com/news/bitget-exchange-volume-tops-1-6-trillion-q1","website_source":"Cointelegraph","article_type":"News Article","summary":"The exchange’s Q1 2024 report highlights a growing customer appetite for complex crypto products during the crypto bull market.","title":"Bitget exchange volume topped $1.6T in Q1","detailed_content":"Futures and spot volume on crypto exchange Bitget topped $1.4 trillion and $160 billion in the first quarter, growing substantially from the $658 billion in futures trading volume and $59 billion in spot trading volume, respectively, in Q1 of 2023. \nAccording to its Q1 2024 report released on April 11, the exchange now has more than 25 million users through its trading platform and Web3 wallet. “Q1 2024 has been notable for several key developments in crypto,” the exchange wrote, adding: “February saw a robust market recovery, with Bitcoin soaring to unprecedented heights. Together with the buzz around Solana and advancements in the AI [artificial intelligence] sector, this underscored the market’s dynamic nature.” \nDuring the quarter, the exchange listed 186 new tokens, with Solana memecoin Dogwifhat (WIF) and rollup utility token Altlayer (ALT) witnessing gains of over 1,000% post-listing.\nBitget’s spot and futures trading volume 2023–2024\nAt the same time, the exchange’s native token, BGB, surged to an all-time high of $1.38 and a gain of over 400% year-over-year. The exchange is currently valued at $2.6 billion per its BGB market cap. By Q2, Bitget plans to roll out an additional BWB token as the native coin of its Web3 wallet. An airdrop for the event is currently ongoing. \nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAccording to research from CCData, the exchange’s derivatives market share grew by nearly 2.5% in March, the highest among all centralized exchanges. “Among the top 12 derivatives exchanges, Binance leads with a market share of 47.0% of total volumes in March,” researchers wrote. This was followed by OKX with a market share of 21.8% and Bitget with a dominance of 12.8%.” Simultaneously, the open interest of futures and derivatives on Binance, OKX and Bitget grew by 37.8%, 34.7% and 104%, respectively, in March 2024. CCData researchers noted:\n“Across the three exchanges analyzed, funding rates increased significantly to new highs before falling to levels at the beginning of the month, as the market sentiment remained positive with Bitcoin nearing its all-time high. The funding rate on the exchanges was positive throughout the month, increasing steadily, highlighting the leverage in the market.”\nOn Jan. 16, Cointelegraph reported that Bitget pledged $10 million to help kickstart women-led startups in the Web3 and blockchain industry. At the time, Bitget staff said that the move was to “elevate blockchain knowledge and open up funding avenues for women” after noting that women-led crypto startups received less than 7% of overall venture funding. \nRelated: Bitget surpasses 20M users as wallet integration spurs trading volumes\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-11","tags":["#Blockchain","#Cryptocurrencies","#Business","#Cryptocurrency Exchange"],"author":"by Zhiyuan Sun","category":null}