{"id":"629ab219-f326-4951-9c51-a9857a202a21","article_link":"https://cointelegraph.com/news/rfk-jr-put-us-budget-on-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"Robert F. Kennedy Jr. is a big time Bitcoin and decentralized tech advocate who has promised to back the U.S. dollar with BTC if elected as president.","title":"RFK Jr. wants to put the entire US budget on a blockchain","detailed_content":"United States presidential candidate Robert F. Kennedy Jr. wants to put the entire U.S. budget on the blockchain. \nDuring a Michigan rally on April 21, he proposed the idea and said the move would allow every American to look at “every budget item anytime they want, 24 hours a day.”\n“We’re gonna have 300 million eyeballs on our budget, and if somebody is spending $16,000 for a toilet seat, everybody’s gonna know about it.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nKennedy’s plan would allow for more transparency and accountability, allowing taxpayers to see where their tax dollars are spent.\nThe blockchain proposal was lauded by many crypto advocates on social media, where people claimed it would be revolutionary and end corruption.\nOne user wrote that transparent public accounting might be the best use case for blockchain tech besides the supply chain: “checks and balances in our government doesn’t work if the branches are in on the corruption together (president and congress particularly) it’s time the people hold them accountable.”\nSome, however, have criticized the plan, claiming Kennedy is advocating for a central bank digital currency (CBDC) via his blockchain plan. However, in the past, Kennedy has vowed to end U.S. efforts to move toward a CBDC, claiming it infringes on privacy.\nRelated: Bitcoin price hits all-time highs across Argentina, Nigeria and Turkey\nKennedy is running as an independent candidate in the upcoming U.S. presidential election after ending his bid to be the Democratic Party nominee in October 2023.\nHe is a strong advocate for Bitcoin\nBTC\n$63,026\n and blockchain and has been among the few presidential candidates who have endorsed Bitcoin and decentralized technology.\nHe is also the first presidential candidate to accept Bitcoin for campaign donations. Kennedy also revealed his plans to back the U.S. dollar with Bitcoin if elected president.\nIn recent years, more politicians have advocated against centralized government systems — particularly financial ones — as decentralized financial alternatives have grown in popularity.\nIn December 2023, Bitcoin-friendly candidate Javier Milei won the Argentine presidential election on the back of a campaign promising to slash the size of government. \nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-22","tags":["#Bitcoin","#Blockchain","#Bitcoin Regulation","#Adoption","#United States"],"author":"by Prashant Jha","category":null}