{"id":"6479dc10-25bb-49e6-bbcd-e7274ce0376b","article_link":"https://www.wired.com/story/wine-skiing-and-loans-how-silicon-valley-bank-became-startups-best-friend/","website_source":"Wired","article_type":"News Article","summary":"Founders and investors say the bank opened doors—and offered perks—no other bank would. Now companies may face a funding gap.","title":"How Silicon Valley Bank Became Startups’ Best Friend","detailed_content":"WHEN REAL-ESTATE-STARTUP COFOUNDER Vai Gupta visited downtown San Francisco from the suburbs last year, he borrowed a conference room at a branch of Silicon Valley Bank to host a quick business meeting, just like he has several times over the past decade. Gupta also has leaned on the bank for networking events, financial tutorials, and discount codes for business software and services. Other banks offer competing perks, but SVB’s total package had won Gupta’s loyalty, until the tech-focused financial giant cratered last week.\nNow Gupta is among thousands of customers wondering whether they will ever again find a financial institution that offers the unique blend of benefits, savvy, and speed that SVB delivered to entrepreneurs. Founded about 40 years ago by a Stanford University professor who teamed with banking experts after noticing students struggling to fund business ideas, Silicon Valley Bank treated startup founders like royalty long before their companies ever generated a profit or even raised significant funding.\nBy offering loans, guidance, and bountiful bottles of fine wine and all-expenses-paid ski trips to companies too small in sales for bigger banks to handhold, SVB quickly became the go-to bank for anyone intersecting with the San Francisco Bay Area’s globally known startup community. Clients who have grown with SVB’s help include Cisco, Coinbase, and Etsy.\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nBut a bad bet on interest rates staying low—they have risen sharply since the start of 2022—and poor crisis communications led to its customers launching a run on the bank over fears about SVB’s financial health. Regulators took control of the bank on March 10, and the US Federal Deposit Insurance Corporation stepped in over the weekend to fully guarantee the remaining deposits.\nSVB’s future remains uncertain, and several entrepreneurs say they are finding that financial institutions rushing to fill the void are falling short in matching its suite of services and extras. Most of all, they wonder what it might mean for them and startups more broadly to lose a trusted partner that helped early-stage companies and founders survive difficult times and secure mortgages or loans others wouldn’t provide. \n“They understand our innovation ecosystem and build all of their offerings around that,” says Hemant Taneja, the chief executive and managing director of General Catalyst, a venture capital firm that banks with SVB. “They have the trust of the VC community that they will help these companies through thick and thin.”\nTaneja’s firm joined several others yesterday calling for companies to restore their deposits and lending with SVB, describing it as “now one of the safest and most secure banks in the country.” The bank posted on its website yesterday that under the oversight of federal regulators it is honoring all existing loans and welcoming new clients. SVB deferred a request for comment for this story to the FDIC, which declined the invitation. A source at the bank says a few dozen companies expressed interest yesterday in securing new loans.\nSVB's at-least temporary demise has added to existing economic uncertainty in tech. Rising interest rates have throttled startups’ access to cheap cash from investors over the past year. Losing access to the loans and connections that SVB provided could accelerate the collapse of some companies and force others to pare their ambitions—and potentially payrolls—until consumer and investor confidence in the economy rebounds.Gupta, the real estate entrepreneur, is already missing SVB. He wires money internationally at least a couple of times a month for his startup BonfireDAO, which aims to lower barriers to buying properties using blockchain technology that underpins cryptocurrencies. He estimates that Chase, his new bank, will charge him $5,000 a year for the transfers, which SVB provided for free.\nSVB also offered customers freebies through a dedicated section in its mobile app long before other banks dangled similar discounts to startups, says Gupta, who from SVB has taken advantage of Amazon Web Services cloud computing credits and free DocuSign e-signature services. He attended over a dozen SVB events, including sessions on finding cofounders and pitching investors. The bank would also let him stop by for a free lunch or to use a meeting room during business trips. “They were very hospitable,” Gupta says. He says he might now have to shell out for a WeWork membership.\nEntrepreneur Adam Zbar has enjoyed the use of an SVB ski house with a dock on California’s Lake Tahoe. As CEO of meal delivery company Sunbasket, he would use it to host weeklong retreats for his management team. The bank would bring in a top chef for a night and exclusive wines from SVB’s winery clients. “It was phenomenal,” Zbar says.\nSVB sponsorships also helped pay for trips for Los Angeles tech entrepreneurs to ski at Mammoth Mountain in California and surf at a human-made ranch constructed amid farms, says Zach James, co-CEO of ad tech company Zefr. SVB would take clients to race fancy cars, go backstage at music festivals, and meet vintners at private sessions at Napa Valley wineries to the point that it hosted 300 wine-related events one year.\nRivals had ramped up. JPMorgan Chase announced hiring several top bankers from SVB over the past few years. First Republic Bank was making progress adding tech clients. But their main focus remained elsewhere. \nLaw firms and recruiting and consulting companies are also major sponsors of tech industry schmoozing, though none of them—and certainly no other bank—came close to matching SVB’s largesse toward companies far away from listing on Wall Street, the entrepreneurs and several investors say. “They were one of the key underwriters of the community,” says Paige Craig, who has been a customer of the bank as an entrepreneur and a venture capitalist. “It’s a big hole to fill.”\nFor all the fancy perks, the ease of borrowing money from SVB has been the biggest draw for many companies. Startups take out bank loans to diversify their financing, and they often can secure the dollars without giving up as many shares as they have to provide venture investors.\nZefr’s James has taken out loans for his company several times through SVB after shopping around. In some cases, the bank takes a small ownership stake in the borrowers. Other times it defers principal payments for a year or two or allows for repayment in a single lump sum. “It was the catch-all for startups,” James says of SVB.Generally, it offered among the least-restrictive terms and equally competitive interest rates, entrepreneurs say. If a borrower failed, SVB was known to handle it more gracefully than other lenders. Effectively, according to language seen by WIRED, SVB would support companies as long as their venture capital backers, often clients of the bank, did not abandon them. “Bankers become a lifeline when you get into trouble, and if they stand by you, I take that seriously,” says James of his loyalty to the now crushed bank. \nRoger Smith, SVB’s founding CEO, told the Computer History Museum in 2014 that the bank did not sacrifice profits by being flexible. “When the music stops, we want two chairs, not just one,” he said. “But we were able to help people grow and … we were part of the flow.”\nJust ask Zbar, the former Sunbasket chief. He dreamed up the meal delivery company in 2013 after he had spent through the venture funding he had raised for a different idea. He had no money to pay back a bank loan. But his banker at SVB loved the Sunbasket pitch, and investors were supportive, so SVB agreed to allow Zbar to keep operating month-to-month on new terms as the food venture progressed.\n“I remember having some unpleasant conversations where I was like, wow, you know, you took a piece of my hide, but my business still survived,” says Zbar, now chief executive of HamsaPay, which uses blockchain for commercial loan financing. He believes other banks are less flexible than SVB. “They just freeze it, and you're done,” he says.  Zbar even welcomed his SVB banker as a bachelor-party guest. \nTo be sure, Silicon Valley Bank’s reliance on relationships and knowledge of venture capitalists to guide its lending decisions raises questions about whether it perpetuated exclusion of women, racial minorities, or other groups historically overlooked by the startup financing industry. Investors say some of those issues may be valid, but the bank did open up opportunities.\nSVB fronted cash to people of underrepresented backgrounds trying to buy into venture capital funds, says the investor Craig, who runs Outlander VC. It provided home mortgages to investors early in their careers who couldn’t get them elsewhere, based on a deep understanding of the tech companies its customers were betting on, Craig says. “I really hope they rebuild and reconstitute. No one understood founders and innovators as well as SVB,” he says.  \nAs entrepreneurs have fanned out to other banks in recent days to shift their deposits from SVB, their experiences have reminded them of what they enjoyed about SVB. James’ Zefr has not found a single bank that can offer every service he wants, so he is using one to borrow money and another for conventional accounts. He does not expect Zefr’s growth to slow, but says his company “will have to suffer worse terms or take on a bit more risk.”\nGupta, who is chief technology officer of BonfireDAO, recalls how he was able to open an account with SVB entirely online while in Singapore at his previous startup a decade ago, an option he has not found as he now searches for SVB alternatives. “They were just the first one to really propose solutions,” he says of his early interactions with SVB. “I never shopped around again.”\nHe wrote on LinkedIn last week that “many startups like [his] have lost a valuable friend, partner, and source of support.” He says his heart wants to stick with SVB if it resurrects, but he’s no longer sure it’s financially prudent to do so, no matter the constant aid, invaluable discounts, or occasional free conference room.","creation_date":"2023-03-15","tags":["","FINANCE","VENTURE CAPITAL","STARTUPS","MONEY","CRYPTOCURRENCY"],"author":"BY PARESH DAVE","category":null}