{"id":"64b087b1-9adf-4557-8ed4-631c3247a607","article_link":"https://cointelegraph.com/news/is-kelp-the-key-to-a-more-stable-future-for-crypto-ama-recap","website_source":"Cointelegraph","article_type":"News Article","summary":"Achieving long-term price stability in a volatile market is a constant challenge for crypto. Kelp offers a compelling answer with a blend of blockchain, on-chain data, and monetary theorem.","title":"Is Kelp the key to a more stable future for crypto: AMA recap","detailed_content":"With traditional fiat currencies facing inflation concerns and the volatility of cryptocurrencies posing a challenge, Kelp offers a novel solution. CEO and co-founder Edward Bishop discussed Kelp's unique monetary policy-based approach during Cointelegraph's recent AMA.\nKelp AMA - Achieving Stability in Crypto https://t.co/Cuu1nDfjIR\n— Cointelegraph (@Cointelegraph) April 22, 2024\n\"We're neither a traditional fiat-backed stablecoin nor an algorithmic coin, but rather a flatcoin,\" Bishop said, describing the essence of Kelp. \"It's a hybrid of the two that adjusts its supply to inflation in the real economy and maintains its purchasing power over time. We use a monetary theory called the quantity theory of money. It is codified in our protocol, which monitors economic activity and predicts the ideal circulating supply to maintain price stability.\"\nThe Kelp Protocol, at the heart of the Kelp ecosystem, uses various economic indicators to understand market conditions. For example, if Kelp experiences rapid price increases, the protocol could adjust supply to reduce volatility.\nCurrently, Kelp is in a seed phase, which Bishop described as \"very experimental.\" He identified two main goals for this phase: to reach parity with the U.S. dollar and to ensure a minimum amount of coins are in circulation. Once these goals are achieved, the price is expected to find equilibrium and fluctuate naturally. The price range may adjust based on market demand, and may expand as demand for Kelp increases.\nBishop mentioned several levers to achieve these goals: \"We have different systems to get there. For example, staking helps us temporarily lock up supply. Basically, it incentivizes users to hold $KELP instead of trading it, effectively reducing the amount of supply in circulation. On the other hand, we have a variable taker fee, which is tied to the liquidity pool and increases when the price goes down.\"\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHe then delved into the seed phase they're going through: \"Part of the initial phase is getting Kelp Protocol to make accurate predictions, so we do a lot of simulations to figure out what the expected effect is. There are algorithms that determine interest rates and token release strategy, which is our guiding protocol for the seed phase. For people who want to sell, we have Liquidity Guard. If we take these three emission sources and then use the difference between what the Kelp Protocol tells us and what our supply should be, and use it to modify different variables in our ecosystem, we can achieve our short-term goals.\nBishop described the Liquidity Guard as a smart contract that allows users in challenging situations to sell their Kelp holdings through the contract at an optimal time, bypassing the variable taker fee. In return, Kelp manages the sale responsibly to minimize market impact. The contract prioritizes user needs with different fee tiers based on urgency.\nCompared to traditional central banks, Bishop highlighted Kelp's quicker adjustments because Kelp uses on-chain data, allowing for faster and more accurate monitoring of economic activity. At the same time, he acknowledged the need for a delicate balance, as overreaction can be detrimental. In the event of extreme market volatility, Kelp can use collateralized assets as a backstop, similar to how central banks conduct open market operations, meaning Kelp can perform buybacks to stabilize the price during a crash.\nAccording to Bishop, Kelp prioritizes building a large user base and targets 1-2 million users for the official launch. They are allocating 25 billion Kelp tokens through the Kelp Reservation Program, which can be earned through referrals or by completing gamified tasks. All of this is available through the Kelp app, which also serves as a self-custodial Web3 wallet.\nBishop also mentioned an upcoming feature for the Kelp app - K.A.T.E, an algorithmic trading engine. It will analyze users' risk profiles and investment goals, and use hedge fund algorithms to create personalized investment portfolios that suggest assets (crypto, stocks, or both) to buy and hold.\nKelp is currently in its third round of pre-sales. Bishop emphasized that Kelp avoids VC funding and prioritizes raising funds through the pre-sale and user base to ensure wider accessibility and align with their \"money for all\" philosophy.\nHe continued: \"We are trying to reach a certain liquidity threshold because we want to do this in a very responsible way and make sure that we have a substantial liquidity pool. It's essential for a number of functionalities, including facilitating K.A.T.E. operations and strengthening Kelp's overall collateralization. When we get to a certain liquidity threshold, we'll move into a launchpad for the IEO scenario.\"\n\"Our goal is not to control the market, but to make it behave a certain way,\" Bishop emphasized. \"Kelp is definitely very different from, say, Luna and Terra. We don't try to control supply or have a two-token system, we avoid controlling the market with brute force. We are just pulling different levers - interest rates, variable fees, supply increases that are allocated to different programs. Ultimately, we want to become a reliable unit of account, something people use for everyday transactions.”\nLearn more about Kelp\n#Blockchain\n#Tokens\n#Stablecoin\n#DeFi\n#Liquidity\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-07","tags":["#Blockchain","#Tokens","#Stablecoin","#DeFi","#Liquidity"],"author":"by Victoria Li","category":null}