{"id":"652f4732-a95f-4362-93a8-bc99341f4047","article_link":"https://cointelegraph.com/news/make-immutable-smart-contracts-avoid-jail-coin-center-exec","website_source":"Cointelegraph","article_type":"News Article","summary":"Smart contracts that can be turned on and off by a multisig mechanism or governance vote are potentially problematic, says Coin Center’s Peter Van Valkenburgh.","title":"Make your code immutable to avoid jail, policy exec advises devs","detailed_content":"Developers building decentralized applications (DApps) should ensure the backing smart contracts can’t ever be changed — that way, they’re less likely to be liable for scams occurring on the platforms, a policy executive claims.\n“From a regulatory standpoint, this is actually really important,” Coin Center research director Peter Van Valkenburgh said in an April 9 panel at the 2024 Bitcoin Policy Summit in Washington, D.C.\nHe said Bitcoin developers looking to build DApps on the blockchain’s layer-2 networks who don’t want to “end up in jail” should ensure immutability is enforced into these smart contracts from the get-go.\nOn the other hand, those who allow the smart contract to be switched on and off by a multisignature mechanism or via a governance vote are much more likely to be found liable should illegal activity occur on the platform.\nChoosing not to open-source the smart contracts isn’t a wise decision either, Van Valkenburgh added.\n“In that world, you have very hard questions of whether everybody who’s participating [is] liable for the activities of that smart contract [...] I don’t see those questions having good regulatory outcomes.”\nSource: Yaël Ossowski\nFor Bitcoin developers, the Ethereum ecosystem will serve as an “interesting model for avoiding regulatory choke points by virtue of truly building something that [is] not controlled by any human discretion,” Van Valkenburgh explained.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHe added the recently dismissed Uniswap lawsuit demonstrated his point. The court ruled that an individual who drafts computer code should not be liable for a third party’s misuse of that platform.\nRelated: Advocacy groups warn of ‘adverse repercussions’ for crypto in case against Tornado Cash co-founder\nThe indictment of Tornado Cash’s founding developers, however, shows immutability-enforced contracts haven’t guaranteed developers freedom from prosecution.\nAlexey Pertsev, the crypto mixer’s developer, spent eight months behind bars in the Netherlands on suspicion of being involved in using the protocol for money laundering.\nFellow Tornado Cash developer Roman Storm, meanwhile, has pleaded not guilty to United States charges of conspiring to operate a money transmitter or facilitate money laundering and sanctions evasion. The protocol’s other co-founder, Roman Semenov, is at large.\nVan Valkenburgh said there will be more clarity in the U.S. when Storm’s case is finalized.\nMagazine: Tornado Cash 2.0: The race to build safe and legal coin mixers\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-10","tags":["#Bitcoin","#Blockchain","#Law","#Business","#Smart Contracts","#Court","#DeFi","#Uniswap","#Tornado Cash"],"author":"by Brayden Lindrea","category":null}