{"id":"66ca72a5-2cd0-4304-9fc2-01d97c270cf1","article_link":"https://medium.com/@playhoneyland/honeyland-hxd-airdrop-is-live-b0abfb0ee93f","website_source":"Medium","article_type":"Blog Post","summary":"Our 5 million + HXD Airdrop is live! Collect points to climb the leaderboard. Top 5000 will receive prizes! All the details are below.","title":"Honeyland $HXD Airdrop is Live","detailed_content":"Our 5 million + HXD Airdrop is live! Collect points to climb the leaderboard. Top 5000 will receive prizes! All the details are below.QUICK LINKS\n∘ Bugs getting squashed\n∘ Certified Beekeeper\n∘ Staking Airdrop Points\n∘ Referral Airdrop Points\n∘ Bonus Tasks\n· ADDITIONAL INFORMATION\n∘ Retweet of the DayThe Airdrop Pass is live! Click the new “Airdrop Pass” button from your Hive. There are daily tasks, season long tasks (missions, breeding, etc.), milestones to earn airdrop points, bonus tasks, and a daily spin wheel for free points!0:40 — Some bugs have been reported and we are working on them. If any of the following issues are affecting you, you don’t need to open a support ticket. We will post an in-game announcement as soon they are fixed (within 24–48 hours is the expected time frame). We also have a game update coming that will correct some of problems that have been reported including:1:38 — It has worked for thousands of people and some players are still having trouble. A walkthrough of the certification process including screenshots is here. If you are having trouble, please review that article.Here are some additional tips:The Airdrop ends on May 31, 2024. You will need to become certified by then to qualify for the Airdrop. The top 5000 players on the Airdrop leaderboard will receive HXD.5:12 — Right now you can’t claim Airdrop points for HXD stakes you created before May 10th. We are correcting this and you will be able to claim those points soon. If you stake today, you will be able to claim the points immediately. You have until May 31st to claim points for staking HXD, so there’s plenty of time.5:48 — Corey explains the reasoning behind the referral part of the Airdrop. We are using this Airdrop to grow our player base. We want to reward you for sharing the game with others. If you don’t want to participate in the Airdrop, you don’t have to. You can keep playing Honeyland either way.9:45 — The bonus task for buying HXD will be available before May 31st, it’s not live yet. We are finalizing the testing.The points for holding certain NFTs and/or tokens will be available after the snap shot on May 31st. All you need to do is hold them in your game wallet on that day. See this article for details on the partnerships.If you preordered the Solana Mobile Chapter 2 check your wallet to see if you have our Honeyland X Chapter 2 NFT (we airdropped 30,000 of them). If you don’t see that NFT, fill out this form so we can send one to you. Be sure to hold your Honeyland X Chapter 2 NFT in your game wallet on May 31st to qualify for those points.Points for retweeting are not working for all players. It is being updated and will be fixed very soon.There is one difference between the iOS and Android process for retweets. On Android, the repost prompt appears automatically when the X app opens, but on iOS, users have to manually repost it.With the upcoming update to the game, the post that needs to be retweeted to earn points will open automatically when you tap the retweet daily task.Explore Honeyland to discover unique Lands and Universes bursting with rewards. Take part in the epic story to help the Bees of Honeyland find their way back home.Build your swarm, Hunt and Harvest, complete Quests, and win PvP Raids to strengthen your Bees.With vibrant graphics and intuitive gameplay, Honeyland is the perfect game for anyone who loves strategy games and adorable Bees. Start earning Honey (HXD) and manage your Hive today. Visit your App Store to download Honeyland today!Follow us on Medium to receive notifications when we publish updates. Click the green Follow link at the top of this page.Website || Twitter || YouTube || Discord || Facebook || Spotify || Telegram || The Story of HoneylandHoneyland: Apple iOS Store || Google Play Store\nWord Buzzle: Apple iOS Store || Google Play Store\nNot Another Web3 Gaming Show: YouTube || Spotify || Twitter/XHXD is available on the following exchanges:\nRaydium || BitMart || MEXC || Gate.io || Cube || Coins.ph || Coinstore","creation_date":null,"tags":["Airdrop","Web3","Solana Network","Crypto","Blockchain"],"author":"Honeyland","category":null}