{"id":"66e3df57-3363-44c5-b2aa-07904455498d","article_link":"https://cointelegraph.com/news/vechain-tokenized-gloves-partnership-ufc-community-responds","website_source":"Cointelegraph","article_type":"News Article","summary":"The new gloves will contain NFC chips that track fight data and provide blockchain evidence that they are genuine.","title":"VeChain announces tokenized gloves in partnership with UFC — community responds","detailed_content":"According to an April 12 blog post from VeChain, gloves worn by UFC fighters will soon be tokenized and their identities tracked on the VeChainThor network. \nThe gloves will contain VeChain near-field communication (NFC) chips that record fight data, proving the authenticity of each pair, the post stated. After the fight, the athletes will “donate and give away\" their gloves, making them into collectors’ items. The chips inside each pair will allow a buyer to check the authenticity of the item via a VeChainThor network smart contract. Fighters will begin wearing the gloves at UFC 300, which is scheduled for April 13.\nVeChain UFC tokenized gloves. Source: VeChain.\nIn its post, VeChain claimed that the system will help prevent fraud in the secondary market, which is a common problem for buyers who seek to own the gloves worn during particular fights. The new items use aspects of VeChain’s ToolChain system, a supply-chain management system that some enterprises use to track items and make sure they make it to the intended recipient.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nVeChain announced that an initial set of 12 exclusive gloves will be given to “A-list” celebrities, including Joe Rogan. UFC CEO Dana White will also be making a live presentation to announce the partnership.\nOn VeChain’s Reddit board, holders of the VeChainThor (VTHO) token had mixed reactions to the news. Some were excited about the new use case for the network. “[W]e're going to be minting rwa [real world asset] gloves as [non-fungible tokens] every ufc event!” said pez86. Another user, VETterDaysAhead, also saw the announcement as positive, stating, “Gloves and merchandise tracking sound great. Hoping they do QR code scanning on TV for events that burns VTHO as well.\" 🔥🔥🔥”\nRelated: What is VeChain, and how does it work?\nBut not everyone was impressed. Some users thought the new gloves would not burn enough VTHO from transaction fees to have any appreciable effect on the price. “Hey man, that's like a whole 10 VTHO burned per year. UFC gonna topple Walmart China in usage,” stated tkim91321 in a sarcastic reply to another user who had complained about the overhyped announcement. \nIn another post, tkim91321 elaborated on their position, asking rhetorically, “And this would burn how many VTHO per month?” and then answering, “Nothing materially significant.”\nAccording to Coinmarketcap data, VeThor’s market cap was over $283 million as of April 12, making it one of the top 300 cryptocurrencies in the world. In May 2022, the network’s foundation had $1.2 billion in its treasury. In June of that year, the VeChain Foundation began its relationship with UFC, entering into a $100 million sponsorship deal with the mixed martial arts promotion.\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-04-13","tags":["#Blockchain","#Business","#Logistics","#VeChain","#NFT"],"author":"by Christopher Roark","category":null}