{"id":"66e899a4-173c-4e19-b8e5-ce8b6e59e376","article_link":"https://www.wired.com/sponsored/story/how-to-think-about-the-metaverse/","website_source":"Wired","article_type":"News Article","summary":"The metaverse is a nebulous idea. Rather than getting lost in its unknowns, instead focus on its underpinning technologies...","title":"How to Think About ‘the Metaverse’","detailed_content":"THE METAVERSE IS a fuzzy concept. It’s generally taken to be a vision for a future internet comprising a network of virtual experiences. But there are differing takes on what this might look like. Most versions of the idea feature certain key technologies such as virtual reality (VR), augmented reality (AR) and virtual worlds – but do conventional devices such as PCs also have a role to play? Would the virtual worlds be interoperable? Is blockchain core to the idea or just a sideshow? And is this prediction for the future of the web even likely to happen in the first place?\nThe fuzziness is compounded by the word itself. It was coined by sci-fi author Neal Stephenson in his 1992 sci-fi novel Snow Crash, where the metaverse was an alternate, digital reality. When the word was appropriated by Silicon Valley around two years ago, its usage was generally aligned with Stephenson’s idea. But, since then, it has broadened almost to the point of meaninglessness. \nSo, how should business leaders approach this subject? Here’s a suggestion. Rather than getting lost trying to untangle the competing definitions and assess the likelihood of the grand forecasts, it can be helpful to go back to basics. The metaverse might be a nebulous concept, but it encompasses technologies and ideas that are real things in the here and now. Separating out those component parts, assessing them on their own terms and considering whether they may have relevance for the organisation – regardless of whether 'the metaverse' happens – can prove fruitful. Here are five key areas to follow…\nVirtual reality\nWhen most people talk about the metaverse, the group of technologies they have in mind typically includes VR. This is an immersive digital experience achieved using a headset with near-eye displays and motion tracking. VR can be used with a variety of media – innovations such as 360-degree cameras, for instance, allow live action films to be shot for VR – but in the metaverse context it is most associated with exploring virtual worlds. \nThe earliest such computer-generated environments were the text-based games of the 1970s, such as Colossal Cave Adventure, in which the software describes the surroundings and narrates the action. As computers became more sophisticated, so did the virtual worlds these games could conjure. Text turned to graphics – initially 2D, later 3D – and then they shifted online. As this happened, virtual worlds came to be used for purposes other than what might be strictly understood as gaming. Platforms emerged where users could collaboratively create content, for example, and game worlds morphed into social spaces where users might gather in large groups to watch a digital concert as much as fight out a battle royale. This has led to a recent proliferation of virtual realms encompassing everything from brand-built experiences to purpose-built ‘alternate reality’ platforms. Many are simply accessed over a computer or phone in the conventional manner, but a number of these offer VR support and some commentators expect this to become increasingly commonplace. “This will be a game changer,” says Sam Hamilton, creative director of Decentraland, a browser-based virtual world. “Virtual worlds work best when people are fully immersed in them, and only then will digital life feel more like a human experience.”So, what else does the future likely hold for VR? Beyond hardware improvements (see below), two trends stand out. One is the ability to support ever larger numbers of simultaneous users in the same virtual environment. Right now, technical constraints mean hosting more than around 100 users without trade-offs in functionality is a challenge, but improvements in computing power are starting to change that. The other trend is the rise of hardware that can capture data from the physical world – satellites, 3D scanners – and feed this into a digital environment. Some speculate this could lead to computer-generated simulations looking increasingly like reality. \nHow is this changing business?\nCommercial activities in virtual worlds typically centre around brand marketing and selling virtual goods. As for VR more broadly, organisations are experimenting in a variety of ways, albeit cautiously. For the entertainment industry, say, VR is a new potential revenue stream – and not just for gaming. The NBA broadcasts basketball live in VR, allowing users to watch the action as if they were sitting courtside. The remote audience is represented as digital avatars; viewers can move around the ‘venue’ and interact with each other.\nIt’s not just about consumer applications. Whether it’s meetings, co-working or onboarding, a range of traditional ‘back end’ business activities are being trialled in VR. Meta Horizon Workrooms, for example, integrates meeting rooms, video calls and presentation tools. Some believe VR experiences improve on the conventional approach. If the creative team at a car company is collaborating on a new design, for example, being able to view it in VR can aid understanding. Or consider training, which can be made safer in a simulation – if you’re learning to operate a crane, say, the stakes are much higher in real life. VR can also enable new forms of learning. Taking apart a virtual model of the machinery you’re being taught how to fix is arguably more compelling than studying a 2D diagram.\nAugmented reality\nThe idea of bridging the physical and virtual worlds is central to the metaverse conversation, which is why augmented reality is seen as a core technology. But the concept of using screens to overlay digital content on the real world has been around for decades. Consider the ‘head-up displays’ long used by fighter pilots to view flight data without having to look down at instruments. But it wasn’t until the smartphone hit its stride in the late 2000s that augmented reality came into its own. The combination of portable high-definition screen, web connection, fast processor and integrated camera has enabled a wave of AR apps that turn the phone into a ‘window’ for mediating the physical world. Many of the use cases are practical: replacing foreign language text with a translation, or previewing how a piece of furniture might look in your home. But AR is also being used for entertainment, allowing users to view geolocated digital artworks, add filters to social video posts, and play games that place characters in the world around them. \nSome futurists predict that AR devices – mobile phones but also emergent wearables such as AR glasses – will eventually come to incorporate 3D scanners and powerful graphics chips. These could rapidly map the dimensions of the physical environment relative to the device and overlay reality with a richness and seamlessness that is currently impossible. This is often referred to as ‘mixed reality’ – ‘true AR’ – where the physical and digital worlds are blurred in a manner that is completely persuasive. Imagine walking down the road wearing AR glasses, for example, and seeing present day London re-skinned as a William Gibson-style cyberpunk city. How broad are the use cases?\nAugmented reality is not just focussed on consumers. Use cases are emerging across a range of domains, from industrial maintenance to military logistics. A particularly promising area is medicine. A number of start-ups offer dedicated AR-based medical devices and some doctors are already using these as a matter of course. Take Dr. Timothy Witham, professor of neurosurgery and orthopaedic surgery at Baltimore’s Johns Hopkins University School of Medicine. Since 2020, he has been using an AR headset made by Chicago-based company Augmedics to assist with inserting spinal instrumentation – screws and rods – during spinal surgery. \n“The spinal cord and nerve roots are literally millimeters next to where you're putting in these screws, which demands very high accuracy and precision,” says Witham. Traditionally, he would rely on X-rays and his understanding of anatomy to insert those items freehand. The view through Augmedics’ headset, however, overlays the spine with the patient’s CT scan imagery – a little like X-ray vision. “When we're going to put a screw in, I can see exactly where it's going with millimetre accuracy,” he says. “This technology is about 98 percent accurate, which compares favourably to any other method for doing this.” \nWitham believes augmented reality holds significant potential not only for other types of spinal procedure – he has successfully trialed it for removing spinal tumours – but also for other areas of medicine. “Eventually it will spill over into other disciplines, I'm confident about that,” he says. “I think it will be applicable to removing brain tumours in the future, and I do think it will have applications in other types of surgery such as orthopaedics and abdominal surgery.”\nHardware\nThe range of hardware that falls under the metaverse umbrella is broad. It spans everything from regular smartphones and computers, on the basis that these can be used to access virtual worlds, through to motion-tracking wearables for operating avatars. But the device category that most people have in mind is dedicated headsets for AR and VR. Over the past decade and a half, there has been a renewed interest in developing this hardware among tech companies such as Meta – and other major players are rumoured to be entering this market in the near future. The ambition is to create affordable, powerful, small headsets that can offer a high-definition experience. Those who believe that ‘the metaverse’ is the future of the internet foresee this hardware becoming so compelling that it comes to enjoy mass market, smartphone-level adoption globally.\nShould businesses expect this shift any time soon?Headsets are still evolving, and their prices are still high. This, in turn, has stunted the predicted boom in VR and AR adoption. That’s because this hardware represents an almighty technical challenge: it has to operate within many technical constraints yet be more capable than even the most powerful games console. A major issue is miniaturisation: packing a broad range of systems into a small space – motion trackers, cameras, high-resolution displays – alongside the required processing power and battery life to render high-quality graphics on the fly. This is not only a computing problem, it’s also a manufacturing problem, because it can’t be solved by combining off-the-shelf components. Much has to be made from scratch. \n“AR eyewear has more challenges than VR,” says Simon Windsor, co-founder of Dimension Studio, which makes volumetric content for major brands. “If you want to re-skin the world around you – for virtual content to genuinely and believably coexist in our physical world – you're reliant on performant eyewear, you're reliant on computer vision, you're reliant on compute, graphics and connectivity. There's lots of technologies, which are required to synchronise to provide a seamless and compelling experience. We don’t have those capabilities in an optimal form yet.”\nAvatars\nAn avatar is a graphical representation of a human that allows them to interact with other users and the virtual world around them. Indeed, more than a billion Meta avatars have now been created. The word itself comes from Hinduism, meaning the ‘descent’ of a god to Earthly form, but was first used in the contemporary sense in 1985 with the game, Ultima IV: Quest Of The Avatar. Rabindra Ratan, an associate professor who studies avatars at Michigan State University, says that there are three main types, although they do overlap. First, avatars that are simply tools for performing tasks – you probably think of your car in a driving game as a utilitarian object more than ‘you’. Secondly, avatars as social others – when you play as Mario, you likely see him as having a different identity and narrative from your own. Finally, the avatar as ‘me’ – you identify with the avatar as a self-representation. “In most metaverse conversations, we're thinking about this latter usage,” says Ratan. “Though, of course, you might represent yourself differently from who you really are.” \nIndeed, avatar aesthetics range from the anthropomorphic to the fantastical, and can be further adapted with clothes and accessories. New generative AI tools are making it easier to create all kinds of avatars, notably ones that can imitate the user with uncanny photorealism. The reason many virtual world platforms opt for low-fi or cartoonish avatars is to reduce processing requirements, but this constraint may lift as Moore’s Law takes its course.In terms of the future, Ratan is particularly excited about “the potential for ownership over a single avatar that could be used across multiple digital contexts”, adding that it could nevertheless adapt its look to specific situations – more formal for work purposes, say, more expressive for social purposes. “That would let us feel even more identification with the avatar, and I think the locus of identity for humans will start to shift once we can do this.” People may feel more authentically represented by their avatar than their real self, he says – especially if augmented reality glasses let others view us re-skinned as an avatar in the real world. “But that’s an even further future direction.”\nWhy is this relevant to businesses? \nRight now, business applications centre on helping people create avatars and selling digital clothing. For companies exploring digital fashion, the notion of a future where an avatar can represent you consistently across multiple virtual experiences is an exciting one. That’s because it implies a degree of interoperability between virtual experiences. If that becomes possible, then it seems reasonable to think that those digital belongings may be able to move with the avatar. This would give customers a greater reason to buy those items, and also presents brands with a bigger marketing opportunity.\nIn years to come, other kinds of opportunities may arise outside of the bounds of virtual worlds themselves. If AI enables photoreal, ‘digital twin’ avatars become widespread, for instance, fashion retailers could use these to let customers preview e-commerce purchases of physical items.\nNFTs\nA non-fungible token (NFT) is a record on a blockchain that certifies ownership of a digital asset, such as an artwork. The idea took off in the developer community in the mid-2010s, and gained wider popularity in 2017 through online games based around trading NFTs. Since then, independent creators and major businesses alike have sold everything from digital wearables to music as NFTs – and the marketplace has been on a rollercoaster. At its peak in 2021, NFT artworks were being auctioned for tens of millions of dollars. But as crypto markets tanked over the course of 2022, so did the market for NFTs.\nNevertheless, NFTs still feature prominently in metaverse discourse because a virtual economy relies on being able to prove ownership of digital files, and also because an NFT establishes scarcity and, therefore, value. If there are only 10 NFTs for an artwork, it constrains perceived supply of an infinitely copyable asset.How are brands using NFTs?\nNFTs have been used as rewards in games, membership cards and loyalty program points. Generally, however, brands are gravitating towards two main applications: virtual art and virtual clothing. Virtual fashion platform RTFKT, for instance, made headlines two years ago when it sold 620 pairs of digital trainers for $3.1 million in seven minutes. It has since been acquired by Nike. \nWhat do people get wrong about NFTs?\nNFTs are freighted with misapprehensions. Although the term is often used to refer to the virtual objects over which you have ownership, an NFT is technically just a digital record on a blockchain. That record is associated with your unique crypto wallet ID and includes a link to the digital file in question, which is hosted externally. This establishes provenance, sure, but let’s be clear: that file is not itself ‘stored on the blockchain’. The digital assets themselves are thus more vulnerable than many believe. It’s also a common misconception that these files can be ported with ease between different digital platforms.\nWhy are people buying NFTs?\nClearly, much of the market is driven by speculation. But Benoit Pagotto, founder of RTFKT, says that’s not the whole story. “For sure, a lot of people are doing it initially for investment, but then they realise they have become part of a community. I think that’s what makes people stay in the end. They have a sense of belonging to something greater than themselves, which is I believe a cultural revolution powered by blockchain technology in the background. And the thing with blockchain is it’s transparent – you can see what everyone is buying – so you can tell who is here to speculate and make money and who's here to collect and stay for the long run.” \nBut aren’t NFTs just a mechanism to create artificial scarcity? “There are lots of brands that could make a lot more output than they do – that controlled scarcity is just part of how you build your brand and your product. That’s true in the watch industry, the car industry, the diamond industry,” he says. “But on the digital side, we never had that option until now.”\nWhat’s happening at the cutting edge?\nThere’s an increasing interest in using NFTs to merge the physical and digital worlds. RTFKT sells physical trainers that contain NFC (near-field communication) chips. “We call them ‘World Merging chips’,” says Pagotto. The user scans the chip with their phone to acquire an NFT version of the shoes. “This helps authenticate the item. Counterfeiting is a big problem in the luxury industry. And these chips are opening a lot more possibilities of the future where, for example, we could do physical events where you can only enter if you have the physical sneakers with the chip inside.”\nThe future\nTechnology does not develop deterministically. No matter how much innovators attempt to will a technology into existence, it’s up to the market to decide if it wants it. What’s more, the evolution of technology is recursive rather than linear: new tools give rise to new behaviours which give rise to new use cases and therefore new technologies. These two factors make future gazing a precarious exercise. \nSome anticipate that the notion of the metaverse – if we still use that term in years to come – will eventually incorporate frontier technologies such as volumetric video screens (which show 3D images without the need for special glasses) and brain-computer interfaces (which let users operate computers via thought alone). This is clearly highly speculative. But so too are many of the forecasts we’ve been discussing. \nSo, where does this leave organisations who need to strategically plan for the future? Here are a few guiding principles. For one, keep time horizons short – trying to forecast beyond two or three years is practically impossible. For another, unless you need to be at the bleeding edge, look at what others are doing in the here and now, track those that innovate early, and learn from the mistakes of the early adopters. Finally, remember: the future belongs to those who not only can best weed out the signals from the noise, but who are most able to adapt when that future arrives – whatever form it may take. After all, the only certainty is change.\nLearn more about marketing in the metaverse on meta.com.\nThis article was originally published by WIRED UK","creation_date":"2023-05-17","tags":["","BRAND LAB","PROMOTION"],"author":null,"category":null}