{"id":"66f4325f-bb61-4989-b5e1-6434f9c9b2c3","article_link":"https://cointelegraph.com/news/north-korean-lazarus-linkedin-target-steal-assets","website_source":"Cointelegraph","article_type":"News Article","summary":"Lazarus group first surfaced in 2009, and since then, it has primarily targeted crypto firms, stealing billions of dollars worth of assets.","title":"North Korean Lazarus hacker group using LinkedIn to target and steal assets: Report","detailed_content":"The North Korean hacker group Lazarus is using LinkedIn to target vulnerable users and steal their assets via targeted malware attacks.\nThe incident came to light after blockchain security analytics firm SlowMist revealed that Lazarus group hackers are pretending to look for jobs as blockchain developers in the cryptocurrency industry through LinkedIn.\nSlowMist claimed hackers steal confidential employee credentials after inviting access to their repository to run relevant code. The code snippets the hacker runs contain malicious code that steals confidential information and assets.\nSource: SlowMist\nUsing LinkedIn for targeted attacks is not a new method, and the North Korean hacker group used a similar tactic in December 2023, posing as a fake Meta recruiter.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAfter contacting victims via LinkedIn, the fake recruiter requested that the targeted “applicants” download two coding challenges as part of the hiring procedure. These two coding files contained malware, and when they were run on a work computer, they released a Trojan that allowed remote access.\nLazarus has stolen over $3 billion in crypto assets. It is among the most notorious and organized hacking groups that first surfaced in 2009 and continues to target crypto firms despite numerous sanctions against it.\nLazarus is known for using innovative ways to target and steal funds. In August 2023, the group used fake job interviews to steal $37 million from crypto payment firm CoinPaid. The hackers attempted to infiltrate CoinsPaid infrastructure by targeting individuals through fake high-salary job offers.\nRelated: US Treasury sanctions crypto mixer Sinbad, alleging North Korea ties\nThe group has been behind some of the biggest heists in the crypto industry. The 2022 Ronin Bridge hack is its biggest, with $625 million stolen.\nThe hacker group often uses crypto mixing services to launder its stolen funds back to North Korea, which, according to many reports, are used to fund the country’s military operations.\nAlthough crypto firms are often the target of hacker groups, the decentralized nature of blockchain makes it difficult for them to move their funds. Once identified, they are often tracked and blocked with the help of crypto platforms.\nIn February 2023, Huobi and Binance froze $1.4 million worth of crypto assets linked to North Korea. Similarly, $63 million worth of assets linked to the Harmony Bridge hack was also frozen by crypto exchanges.\nMagazine: Deposit risk: What do crypto exchanges really do with your money?\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-24","tags":["#Blockchain","#Adoption","#Hackers","#North Korea","#Regulation"],"author":"by Prashant Jha","category":null}