{"id":"670cc221-3271-4fc7-8d4b-6e45ed1d1033","article_link":"https://medium.com/marker/the-great-blockchain-of-being-ea604c56de8","website_source":"Medium","article_type":"Blog Post","summary":"What the origin story of the Reformation tells us about the future of cryptocurrency and blockchain technology.","title":"The Great Blockchain of Being","detailed_content":"500 years ago the world was forever changed by a bad review.On October 31st, 1517, a plump, anxious friar and theology professor named Martin Luther nailed a list of complaints — his 95 theses — to the door of a monastery in Wittenburg. Luther was vicious, thorough, and attacked just about every aspect of Roman Catholic doctrine. He hated the new taxes anytime a new bishop was elected, the absurd yearly mass for the dead, the endless pilgrimages. But he saved special venom for indulgences.The indulgences were medieval pay-to-play, a way for the naughty to offset their peccadillos with a payment to the church. Covet your neighbor’s wife? Eat too many eel pies on Easter Sunday? Give a bag of silver or gold to your local bishop and you too could still walk through those pearly gates. For Luther it was a step too far — a greedy, cynical ploy by the Church that implied humans could haggle with God. It was widely hated, and when someone finally had the gall — or stupidity — to complain about it, people listened. Including, of course, the authorities.In 1521, Luther was called by the Holy Roman Emperor Charles V to recant at a formal papal assembly, or “Diet,” in the city of Worms. Luther was a small-time friar, used to woolen frocks and mutton sausages, untrained in the pomp and majesty of the court. But though he may have looked modest, Luther had a powerful weapon on his side — popularity.In the four years since Wittenburg, Luther had been a content machine, publishing almost 25 books, pamphlets, and religious tracts. His words made him a folk hero, the voice of a new religious movement that dared to defy the Catholic church. He had taken the printing press and weaponized it. And the threat this new technology posed to the iron grip of the Church was immense.For almost a thousand years the Catholic Church had been the center of medieval religious, economic, and social life, a kind of supramanager of the feudal order. It maintained that order through a vast set of rituals — attending Latin mass, making a pilgrimage to the bones of a saint — that publicly affirmed the power of the Church. God lived — quite literally in the eucharist — in the social body.But since the 14th century, major changes had destabilized the feudal order and the legitimacy of the church. The first major blow came with the arrival of the Black Death in 1349. By killing off half the population of Europe, the plague increased the supply of free land and decreased the supply of laborers, giving them both freedom from — and bargaining power over — their feudal lords. Feudal lords’ power further diminished with the discovery of New World markets in the 15th century. Financing expeditions, processing raw materials, and managing credit systems all necessitated an increasingly sophisticated economic system that shifted power away from rural aristocratic lords towards a market economy run by a burgeoning, urban middle class. And then came the printing press.Invented in 1440 by Johannes Gutenberg, a German goldsmith, the printing press was the key technology of the early modern era. During the middle ages, books were hand copied, slow to produce, and prohibitively expensive. Gutenberg’s invention made written material cheap and relatively quick to mass produce. Although literacy was still low, the ability to rapidly spread new ideas through space and time was massively destabilizing to the Church’s thousand-year monopoly on the truth. If the Bible was the Word of God, and I have a copy, then what are the priests for? The revolution was already there, in any banker, journeymen, or cobbler’s hands; all Luther did was articulate it.In this way, the printing press did more than increase access to information, but radically changed the way medieval people imagined the world. There was no need for incense, Hail Marys, or magic spells; God was an idea, whose will could be divined privately by decoding his Words in a book. There was no need for priests or bishops; God’s truth was right there, waiting to be read. The printing press manifested its own theology. The old medieval world — where Heaven and Earth were unified in the Great Chain of Being — was suddenly split into new, opposing spheres: Church and State, public and private, body and mind.By nailing up his 95 Theses, Luther was the first to fully publicize this revolutionary shift. And now, at the Diet of Worms, it was time to defend his ideas — and his life — before some of the most powerful men on the continent.At the assembly, Luther summed up this movement in two phrases: sola fide, sola scriptura — by faith and the Word alone. The Bible, not the Church, was the only source of truth and legitimacy. This made all the Church’s intermediaries — popes, priests, monks — redundant. Then Luther took it a step further. He claimed (correctly) that the Church’s most sacred rituals — the eucharist, infant baptism, the cult of the saints — were pure inventions, with no evidence in scripture. It was all a puppet show used to keep bishops fat off the toil of serfs. To Luther, salvation was a private affair between God and an individual; no matter how much they paid for an indulgence, only God could forgive sins. He asked the court to find anything in the Bible that could refute his claims, a passage that showed that God required them — the well-fed, silken robed papal authorities seated before him — or their rituals. It didn’t go over well.The Diet quickly came to a decision. Luther was excommunicated from the Church — canceled, you might say — and told he could safely return home. But it was obvious that Luther was a marked man. He was too popular, too outspoken to be allowed to freely roam — or publish — in Germany. Before long, Luther would be arrested, sentenced, and executed for heresy. Thankfully, a sympathetic patron, the Elector of Saxony, Prince Fredrick III, staged a mock kidnapping in the woods outside of Worms and brought Luther back to his castle in Wartburg. Luther, probably without even knowing it, was saved from his own martyrdom.For the next two decades, Luther lived the life of a comfortable Influencer — writing full time and growing fat on ale and gravy-soaked roasts. In 1534, he produced his crowning achievement, the first German translation of the Bible. Now, any Bohemian cobbler or journeyman had unfiltered access to the Word of God.Over the next century, the movement that Luther defined — Protestantism, after the Latin protestari, “to publicly testify” — quickly spread across Europe. And it was more than a religious movement; it was a fundamental restructuring of Western society where the individual would be the center of the State.What came next, so the story goes, was the scientific revolution, the Enlightenment, modernity. This eventually culminated in the triumph of the secular, scientifically rational world we live in today. And it all started with Luther, a lone hero whose dogged pursuit of truth, and challenge of the status quo, changed the course of history. Or maybe with the printing press — that singular technology that broke the intellectual stranglehold of the Catholic Church and helped birth an individualized and abstracted subjectivity. Take your pick; or better yet, combine the two. Because the story of Luther and the printing press is being told everywhere — on the pages of Wired and The New York Times, on Reddit forums and from TikTok influencers, in Apple ads and tweets from billionaire-entrepreneurs.It’s the story of messianic, techno-solutionism, the belief that advances in science and technology are inherently progressive; that history is not a struggle of social, economic, or environmental forces, but the inevitable triumph of better and better ideas (discovered and then propagated by some charismatic genius). Luther’s story still holds such sway because it is the genesis of this myth, the symbolic moment we stole fire from the gods. Techno-solutionism has become so ingrained, so necessary as a part of our cultural mythos that to deny it — even when the invention is digital-junk being touted by hucksters looking to make a quick buck — is to challenge a worldview that is as fervently, and irrationally, believed in as the dogma of the medieval Church of Rome.Five hundred years from the Diet of Worms, we are told we are on the cusp of another revolution. One that promises to eliminate our dependence on the State once for all, to create a utopia where everyone is their own master. It’s a story where everyone is getting hilariously rich, where unicorns drive Lamborghinis (“lambos”) to the moon and an ex-Hollywood child actor creates a $100 billion dollar currency. A journey into the future where everything is transmuted into software — the State, money, art, your identity.Behold, the blockchain.2008 — the year of the global financial crisis — was a good year to start a religion.A decade of cheap credit and a lax regulatory environment had turned the American economy into one giant casino. When the bookie finally came knocking, and no one could pay, central banks like the Federal Reserve conjured trillions of dollars out of thin air, and then promptly gave it back to the same self-dealing, corrupt bankers who had engineered the scam. Most of the public was too shocked or confused to know better. “Quantitative easing,” “mortgage-backed derivatives” — these “solutions” were as arcane and incomprehensible as a medieval Latin mass. But the message was clear: Money was magic, and only we — the high priests of finance — know the spells.That year, a mysterious coder named Satoshi Nakamoto proposed an alternative: a digital currency built on a decentralized system that was anonymous, hack-proof, and inflation-proof. There would be no central bank — new coins would be “mined” by computers solving complex math problems and then added to a cryptographically secure chain of code. The currency would provide a way for anyone in the world to exchange value free of the oversight of their government. One year later, Nakamoto released the proof of concept — Bitcoin, the world’s first cryptocurrency.Unlike Luther, Satoshi’s theses weren’t nailed to a bank’s door, but published in a white paper on an obscure cryptography mailing list, disguised in jargon and mathematics that were only decipherable to the coder-Elect. Soon, a legion of digital apostles formed to follow in Satoshi’s footsteps, creating their own alternative currencies — or alt-coins — and get fabulously, stupidly rich off of them.In 2015, a teenager named Vitalik Buterin developed Ethereum, an open-source rival to Bitcoin. (He’s now worth $1.5 billion.) In 2017, Bitcoin’s price soared almost 10,000%, from $900 to $20,000. In 2018, the ex-Mighty Ducks star Pierce Brock co-founded Tether, a “stablecoin” with a $100 billion dollar market cap. It was alchemy, code became cash, Priuses transmuted into lambos. Prices were going to the moon, and no idea became too stupid to make a buck off.A banana company in Laos created Bannancoin, pegged to the price of one kilo of Lady Fingers. Then there’s Dentacoin, a dentistry token that at one point had a market value of $2 billion. Dogecoin, with a cute little icon of a Shibu Inu as its mascot, started out as a joke — a memecoin. But after tech prophet Elon Musk tweeted about it, its value skyrocketed. Its current market cap: $18 billion dollars. Clearly, the ability to create billions out of nothing was the sign of a new era. Tether’s other founder put it bluntly: “This is the first time in human history anyone other than kings or governments or gods can create their own money.” King Solomon was minting his own mines.But, for the true believers the real promise in Satoshi’s paper wasn’t godlike wealth but the blockchain, the system of decentralized, distributed ledgers that Bitcoin is built upon. To put it (not that) simply, the blockchain is a massively shared, simultaneously accessed spreadsheet visible to everyone, but alterable only when certain conditions are met. Blockchain would fulfill the original promise of the Internet, as a free and open system that would disperse power rather than centralize it.The current Internet is a distributed system, where information is stored on servers that are accessed through a central router. This centralization has a lot of benefits — it’s simple, stable, and resilient — but there’s one major catch. Anyone who has control over this system has an incredible amount of power. Malicious state or corporate actors can shut down key routers to silence protests, hide bad PR, or even cripple whole economies. The Internet, as it was originally designed, favors the accumulation of power. Which is one reason why four companies — Facebook, Google, Apple, and Amazon — completely dominate it.In contrast, the blockchain is a decentralized system, built on peer-to-peer connections. Control is diffused, independent of direct state or corporate control. In a global blockchain system there would be no central node to control, no server farm to take over, just a Great Blockchain of Being — billions of individuals connected through a web of code. To its true believers, blockchain could redefine property rights, legal systems, and the very idea of a State for the 21st century.Anything that is added to the blockchain stays there — a digital version of Moses’ golden tablets. Through the use of NFTs, or non-fungible tokens, individuals could store virtual property or inscribe their own names on this tablet — own their digital identity and decide how it would be shared, reproduced, or monetized. NFTs could be used to create a new kind of property that would be legitimized by code, rather than state authority. When combined with smart contracts — basically self-executing algorithms — the possibilities are, to the crypto faithful at least, endless.Smart contracts are a way to enforce the terms of an agreement without a middleman. With one swoop, you could replace lawyers, notaries, and bureaucrats with software. Instead of agonizing wait times at the DMV, your Bitcoin linked account could automatically pay — and guarantee the legitimacy of — your yearly registration. But, in theory, you could program these smart contracts to do anything — to replace legal systems, citizenship, even the State. A few brave crypto pioneers have already plunged into the wilderness to try just that.In 2021, Wyoming approved the creation of Decentralized Autonomous Organizations (DAO) — blockchain-based entities in which members use crypto-tokens to vote on actions. That year, a group of investors banded together to purchase 100 acres of sagebrush steppe in central Wyoming. (Showing the creative power of consensus, they named it CityDAO.) In the spirit of liberty and freedom, citizenship is open to all. For .25 Ether — about $1000 — you can buy “basic” citizenship to CityDAO, which includes access to a Discord, voting rights, and the option to settle land (after the first “founding citizens,” of course). No word yet on when the next tier of citizenship will be released.To its boosters, CityDAO is proof that blockchain and crypto can transform the world. If a group of strangers can create a country in the middle of the Wyoming wasteland, then anything is possible! Puff that idea up to a global scale and you have the next stage of social evolution — Web 3.0 — a global blockchain-based state that gets rid of all the rigid authority, messy politicking, and gross inefficiency of a human-run government.As of 2022, CityDAO is still out there, building Eden in a sea of tumbleweeds. But that’s not to say it, and the entire cryptocurrency industry, hasn’t had its share of growing pains. In mid-January 2022 a hacker gained control of the CityDAO’s admin account and stole 26.67 ETH (about $95,000). The same week that CityDAO was duped, hackers stole $30 million from Crypto.com. In 2021 alone, over $21 billion was stolen from cryptocurrency exchanges. It’s a pirate economy built by, and for, thieves.13 years after Satoshi’s paper the only thing that cryptocurrencies have proven useful for is money laundering, tax evasion, outright scams, and most importantly, financial speculation. You can’t buy a house, or even a pizza, with Bitcoin. (Or, why would you want to if the price could change by 10% in ten minutes?) Ultimately, cryptocurrencies are not currencies, but speculative assets: stocks that have no dividends, post no earnings, and are ultimately worth exactly zero dollars.And then there are the environmental costs, usually downplayed by crypto-boosters. Bitcoin mining alone uses 91 terawatt-hours of electricity yearly. That’s more electricity than Sweden, 91 times more energy than Google, and .5% of energy consumption worldwide. And that’s all without providing anything as delicious as a kottbullar, or as ergonomic as a Gursken.What Bitcoin shows is the widespread disbelief that technology can fail; that innovation and adoption (or usefulness) are two different things. Instead of the techno revolution promised in Satoshi’s white paper, we have a giant carbon-spewing, Ponzi-scheme whose main innovation is to promote the sound investment advice of “buy low, sell high”.Despite all the obvious economic, environmental, and social hazards involved with crypto, there’s got to be something to it. I mean, everyone is getting in on it — influencers, celebrities, probably your nephews. And why not? As long as the line keeps going up, we’re all going to get rich? And you want to be rich, don’t you?And what about the blockchain? Surely, given all the hype there’s bound to be something useful there? Who wouldn’t want a digital vending machine that sells titles, wills, or citizenship instead of Snickers bars, or be able to make a few cents from NFT-minted digital identity every time Facebook sells your info to marketers?Unfortunately, the same qualities that make blockchain appealing — its decentralization, security, immutability — also make it incredibly slow, wasteful, and devoid of any privacy or consumer protections. The fact is, anything that you can do on blockchain can be better done on a centralized server. As blockchain skeptics have attested, it’s a solution looking for a problem.But even if no one uses Shibu Inu coin, or gets their Excitable Slug NFT marketplace off the ground, it doesn’t mean that the impacts of these new speculative assets won’t be far-reaching. There is now $3 trillion dollars invested in cryptocurrency, tied, more than ever, with larger markets through publicly traded companies like Coinbase, ETFs, and soon even your 401k. And like the mortgage-back derivatives of the early 00’s, the more these totally unregulated, fraud-ridden assets infiltrate the financial system the more unstable it will become. What started as a critique of the financial crash, will probably soon repeat it.But, the push for a technology that (so far) obviously fails to deliver on any of its promises portends something deeper than just cheap populism. Crypto and blockchain are appealing to venture-capitalist vampires like Peter Thiel or McKinsey & Company because they are another step towards a digitized, financialized future where everything and everyone can be bought in the market. An anarcho-libertarians' utopia where there are no gods, no masters, only the Market. Sola coda, sola blockchain.This paradise is sold as the only means of escape from the increasingly dreary, hopeless future that most young people find themselves in. Would you rather retire early after betting it all on Shibu Inu coin or slave away for the foreseeable future as an Instacart serf? And like most utopian projects — whose eminence is always just around the corner — faith fills in the meantime. It doesn’t matter what blockchain can do, but what you believe it will do. It doesn’t matter that most cryptocurrencies are clearly scams, only that they will — as long as that line goes up — free you from your shitty job.What the rise of crypto really shows is the failure of any social or political movements to provide a meaningful answer to the post-2008 financial crisis. Instead of instituting new democratic controls on the market, we turned our rage at the financial system into a speculative commodity. If that’s not what makes America great, what does?What this desperate need for social mobility at any cost fuels is techno-fetishism pumped to new religious heights. Because the technologies are so clearly useless, all we’re left with is the empty, irrational belief that messianic geniuses and magical technologies can save us from our political, social, and environmental ills. (And get us all rich doing so, of course.) And this belief is backed by the same basic myth of the printing press, rewritten to the digital age: where new technologies, and the social changes they produce, are seen as teleological. Basically, God’s will.Unfortunately, the origin story of the printing press — the Ur-myth about the socially transformative power of technology— falls apart after a cursory glance at its history.The first use of moveable type technology — the basis for the printing press — was invented 150 years before Gutenberg by a Korean minister named Choe Yun-In. Although Yun-In’s press produced a few religious works, it ultimately failed to have any immediate, long-term impact in East Asia. Even in Europe, the adoption of printing technology was fairly slow. For the first hundred years after Gutenberg’s invention in 1450, books were still mainly a hobby for the upper classes, a luxury item used to gain prestige, a way to continue the scholarly religious debates of the middle ages, or even used as loan collateral.In short, technologies are always a product of, and used within, a social order. The printing press was not some overnight revelation, but was slowly adopted and expanded over a period of hundreds of years. What accelerated its expansion in the early 16th century were changing social, economic, and environmental conditions. Luther’s 95 Theses spread so quickly because they landed in the fertile ground of medieval Catholic Europe. A thousand-year order was being undermined by the growth of market-based economies, rising competition between proto-Capitalist states, and the failure of a feudal agricultural system to deal with the colder climate of the Little Ice Age. But the Reformation didn’t happen overnight. Luther’s ideas had been building for centuries before they finally reached a critical mass. It was then through the spread of the written word that they metastasized — and eventually helped destroy — the feudal order.In contrast, the fact that crypto and blockchain has exploded so rapidly onto the market shows that this isn’t a real social or technological movement, but a religious one.What we’re witnessing is a grift disguised as a revival. At the forefront are pump-and-dump preachers hawking junk technologies whose rapid, zealous adoption only shows their speculative superficiality. What they created with cryptocurrencies is a new casino for desperate people to gamble their savings away as a way to escape the misery of their own lives. And it doesn’t matter how much money is lost, stolen, or scammed, as long as the fantasy is maintained: a techno-heaven where nobody works and everybody gets rich. And who wouldn’t want to step through those pearly gates? All you have to do is roll the dice, and pray.","creation_date":"2022-02-08","tags":[],"author":"Chad Oelke","category":null}