{"id":"67143f4a-1d14-4761-b4f2-5ef9f05e21e4","article_link":"https://cointelegraph.com/news/binance-return-india-2-m-fine-non-compliance","website_source":"Cointelegraph","article_type":"News Article","summary":"Binance and nine foreign crypto exchanges were blocked in India over non-compliance with local AML regulations.","title":"Binance to return to India after paying $2M fine for non-compliance: Report","detailed_content":"Binance crypto exchange is set to return to India after a four-month ban by paying a $2-million fine for non-compliance, according to a report published in The Economic Times.\nBinance will be the second overseas exchange after KuCoin to mark a return to the country after India’s financial regulatory body blocked access to crypto exchanges for non-compliance.\nThe Indian Ministry of Finance’s Financial Intelligence Unit (FIU) blocked access to nine foreign crypto exchange’s URLs and mobile applications, including Binance, in the first week of January for failing to adhere to the country’s Anti-Money Laundering Act.\nBinance reportedly accounted for more than 90% of Indian crypto trading volume before its ban in January earlier this year.\nIndian users flocked to foreign crypto exchanges like Binance to bypass the severe tax impositions, which prompted the government to ban overseas exchanges not registered with FIU.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nNow, with FIU registration, foreign crypto exchanges like Binance have to adhere to the same rules and regulations as Indian exchanges.\nKuCoin has started a 1% tax deduction at source (TDS), and other foreign crypto exchanges looking to mark an entry into India will have to follow the same.\nRelated: Taxman: India’s new tax policies could prove fatal for crypto industry\nA person with knowledge of the matter told The Economic Times that it is “unfortunate that it took (Binance) more than two years to realize there is no room for negotiations, and (that) no global powerhouse can command special treatment, especially at the cost of exposing the country’s financial system to vulnerabilities,” reported ET.\nBinance has a long history in India. It was believed to have acquired the local crypto exchange WazirX in 2019 but later claimed the deal never went through.\nBinance claimed it only provided wallet services for WazirX as a tech solution and that WazirX was responsible for all other aspects of the exchange, including user sign-up, Know Your Customer (KYC), trading and initiating withdrawals.\nWhile KuCoin and Binance have decided to become FIU-registered entities in India, OKX, another leading crypto exchange among the nine blocked crypto exchanges, shut its operations completely, citing the regulatory burden.\nCointelegraph has approached Binance for comment but has yet to hear back.\nMagazine: Bitcoin Halving will pump games, Shrapnel’s ‘simple’ secret revealed: Web3 Gamer\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Business","#India","#Binance","#Regulation"],"author":"by Prashant Jha","category":null}