{"id":"67cf84b1-3fe4-407d-aa91-e00c6fae2708","article_link":"https://cointelegraph.com/news/defi-lending-protocol-nexo-allocates-12m-incentives","website_source":"Cointelegraph","article_type":"News Article","summary":"The rewards will be active until July 7 and incentivize users to trade, earn, deposit and borrow on the platform.","title":"Crypto lending platform Nexo allocates $12M for ecosystem incentives","detailed_content":"Crypto lending protocol Nexo is allocating 10 million NEXO tokens, worth $12.5 million at the time of publication, to its users. \n“Stack points, multiply your gains, and unlock more surprises,” Nexo wrote in a blog post on May 8 regarding the protocol’s sixth anniversary. “The Nexonomics-inspired hunt is designed to reward new and existing users for exploring the Nexo ecosystem.”\nFrom now until July 7, Nexo users can receive up to 0.01 points per $1 of asset top-ups, 10 points per Nexo Card activation, 0.04 points per $1 in fiat borrowed through the Nexo protocol, 0.03 points per $1 invested in Nexo Earn products, and 0.05 points per $1 of boosted trading on Nexo Exchange. The point-to-NEXO-token conversion ratio will be determined at the end of the event. \n“Keep in mind that certain actions can reduce your points balance,” the team also warned, writing, “For instance, withdrawing crypto assets from your Nexo account will result in a loss of 0.01 points for each $1 withdrawn. Withdrawing BTC will result in a loss of 0.001 points for each $1 withdrawn.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nDepending on their activity, users can also receive multipliers of 1.2x–1.5x on points earned and loyalty rewards up to 100% of the points value. The Nexo staff illustrated the following example: \n“Suppose you haven’t funded your account yet and want to buy $2,000 worth of BTC during the first week of the hunt. In this case, you will receive 450 points (2,000 purchase value x 0.03 points for each $1 purchased x 1.5 Weekly Multiplier x 5 New User Multiplier).”\nDue to regulatory restrictions, citizens and residents of the United States, the United Kingdom and Canada are ineligible for the campaign. \nSince its launch six years ago, the popular decentralized finance lending platform has attracted $537.56 million in total value locked. On March 6, the platform received regulator approval in the United Arab Emirates for its local entity Nexo Services FZE for virtual asset lending and borrowing. \nRelated: Nexo seeks $3B in damages from Bulgaria over dropped investigation\nExchange or buy NEXO\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Blockchain","#Cryptocurrencies","#Business","#Nexo"],"author":"by Zhiyuan Sun","category":null}