{"id":"68476902-6957-4388-b547-85d506110f38","article_link":"https://cointelegraph.com/news/nyse-gauges-interest-24-7-stock-trading-like-crypto","website_source":"Cointelegraph","article_type":"News Article","summary":"While cryptocurrencies can trade and settle all day and night, stock trading has traditionally followed office hours.","title":"NYSE gauges interest in 24/7 stock trading like crypto: Report","detailed_content":"The New York Stock Exchange (NYSE) is reportedly getting a gauge on whether traders would embrace 24-hour stock trading, similar to how cryptocurrency markets operate.\nTo test market sentiment, NYSE’s data analytics team put out a survey asking market participants whether they would support 24/7 or 24-hour weekday trading and if so, what systems should be put in place to protect traders from overnight price swings, according to an April 22 report from the Financial Times.\nNYSE — along with the Nasdaq and Chicago Board Options Exchange — currently trade Monday to Friday between 9:30 am to 4:00 pm Eastern Time.\nIn the United States, assets such as cryptocurrencies, United States Treasurys, foreign exchange and leading stock index futures can already be traded 24/7, while some brokerages offer \nRobinhood and Interactive Brokers are such platforms, offering 24-hour weekday access to U.S. stocks by facilitating a “dark pool” trading venue allowing international retail investors to trade shares during their daytime hours.\nHowever, last week, reports emerged that Robinhood halted its 24-hour trading services following increased tensions between Israel and Iran, raising investor concerns about the sustainability of around-the-clock trading.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nManaging liquidity in a 24/7 trading arena has al proven a tough task for trading platforms in the cryptocurrency industry.\nIt often creates a “mismatch between the operating hours of traditional financial institutions and the needs of large crypto traders and market makers,” noted cryptocurrency research firm Kaiko. Sleepless nights are a common complaint for traders when the market becomes extremely volatile too.\nWhile results of NYSE's poll haven’t been released, Skylands Capital senior trader Tom Hearden posted a poll of his own asking his 19,300 X followers whether they would support NYSE moving to 24/7 trading hours — with over 70% of the 1,459 respondents voting “No.”\nSource: Tom Hearden\nNYSE’s poll comes as startup firm 24X National Exchange is seeking approval from the Securities and Exchange Commission (SEC) to launch the first round-the-clock exchange in the country.\nRelated: Stocks and crypto at the edge of ‘significant’ correction: 10x Research\nThe SEC still has “months” to review the requested rule change, while other stakeholders involved are already looking at pertinent issues, such as who should bear costs and the role of clearing houses, FT said, citing two sources familiar with the matter.\n“I have no idea how much volume they’re going to be doing in the middle of the night. But it’s really not up to the SEC to decide whether it’s commercially viable or not,” said James Angel, a finance professor at Georgetown University to FT.\n“I’m in favour of letting the market decide. If it succeeds, we’re all better off and if it doesn’t, well, the exchange’s investors lost.”\nIt marks the second attempt at SEC approval after the firm withdrew a proposal in March 2023, citing operations and technical issues.\nMagazine: Jameson Lopp: Skeptical of spot Ether ETFs, BTC price prediction dilemma: X Hall of Flame\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-23","tags":["#Blockchain","#Business","#NYSE","#SEC","#Adoption","#Cryptocurrency Exchange","#Stocks","#Robinhood","#Stock Investment","#Liquidity","#Stock Exchange"],"author":"by Brayden Lindrea","category":null}