{"id":"6915cc38-5dc7-4418-9bef-e4a315b325ea","article_link":"https://cointelegraph.com/news/tether-usdt-stablecoin-ton-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"Tether’s and Telegram’s Web3 ecosystems are coming closer together with USDT and XAUT launching on the TON blockchain.","title":"Tether’s USDT stablecoin goes live on TON blockchain","detailed_content":"Stablecoin operator Tether is strengthening ties with Telegram’s Web3 ecosystem by launching its U.S. dollar-pegged USDT\nUSDT\n$1.00\nstablecoin on The Open Network (TON).\nTether made the announcement on April 19, also revealing it would launch the gold-pegged Tether Gold (XAUT) stablecoin on TON as well.\nThe announcement was made during a joint keynote speech involving Tether CEO Paolo Ardoino, Telegram founder Pavel Durov and The Open Platform CEO Andrew Rogozov at the crypto event Token2049 in Dubai.\nAt the same event, Tether also announced it would be restructuring and introduced four new business divisions: Tether Data, Tether Finance, Tether Power and Tether Edu.\nThe Open Platform CEO Andrew Rogozov, Telegram CEO Pavel Durov, Tether CEO Paolo Ardoino (from left to right) at the Token2049 in Dubai\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAccording to Ardoino, TON and Tether share a vision of an open, decentralized internet and a borderless financial system.\n“The launch of USDT and XAUT on TON will allow seamless value transfer, increasing activity and liquidity while offering users a financial experience that can match those found in the traditional financial system,” the Tether CEO stated.\nThis latest development marks another milestone in Tether’s expansion across multiple blockchains, bringing its coverage to 15 chains, including Tron and Ethereum.\nThe milestone is also essential for the TON network, whose native token, Toncoin (TON), overtook Dogecoin\nDOGE\n$0.15\nas the ninth-largest cryptocurrency by market cap on April 16.\n“The TON blockchain works with Telegram, meaning USDT and XAUT on TON have the potential to provide a simple, borderless experience for peer-to-peer payments for Telegram’s user base which Telegram estimates at over 900 million global users,” the announcement reads.\nRelated: Crypto-like communication devices could break gov’t surveillance — Telegram founder Durov\nSomething unique about USDT’s launch on TON is that the TON ecosystem enables transfers between fiat and crypto and has ambitions to beat traditional finance in efficiency and ease of use, TON Foundation’s marketing head, Jack Booth, told Cointelegraph. He ad:\n“[There are] built-in on-ramps for fiat at the launch and global off-ramps to bank cards and accounts coming soon. This will be the first time a mass audience will be able to use crypto infrastructure for global payments.”\nUSDT’s launch on TON isn’t the first instance of the two ecosystems intersecting. Since at least 2023, USDT has been one of the default cryptocurrencies available on Wallet, a third-party custodial wallet available to Telegram users, alongside other coins like Bitcoin\nBTC\n$63,002\nand Toncoin.\nAt the time of writing, the Tron network is the default blockchain available for USDT on Wallet, enabling TRC-20 USDT. According to Halil Mirakhmed, chief operating officer of Wallet, TON-based USDT will become another option on Wallet, while TRC-20 USDT will stay.\nThe Tron blockchain accounts for the biggest share of issued USDT at the time of the announcement, according to data from Tether.\nThe news comes a few weeks after Tether launched a recovery tool in March 2024 that allowed users to migrate USDT between different blockchains. On March 4, USDT crossed an all-time high market cap of $100 billion.\nAdditional reporting by Felix Ng.\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think\nExchange or buy USDT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Altcoin","#Telegram","#Dubai","#TON","#Tether","#Stablecoin"],"author":"by Helen Partz","category":null}