{"id":"69bfba7f-d53e-4752-81e6-b79d48444fdf","article_link":"https://cointelegraph.com/news/dogecoin-copies-bitcoin-ordinals-runestone-nft-airdrop","website_source":"Cointelegraph","article_type":"News Article","summary":"The Doginal-based Runestones were given away for free, just like its Bitcoin Ordinals original.","title":"Dogecoiners clone hyped Bitcoin Ordinals ‘Runestone’ airdrop","detailed_content":"Dogecoin blockchain natives have just finished handing out its own “Runestone” airdrop inspired by the nonfungible token (NFT)-like giveaway done through Bitcoin Ordinals last month.\nFinishing up on April 2, a total of 30,272 of the inventively titled “Doge Runestone” Doginals — Dogecoin’s name for its Ordinals — were handed out to wallets that held at least one Doginal from a list of collections outlined by Robo AI, the airdrop’s organizer.\nThe Doge Runestones are now trading at a floor price of 185 Dogecoin\nDOGE\n$0.15\n, worth about $32, and have seen a 24-hour volume of just over $2,000, according to data from the Ordinals Wallet marketplace.\nDoge Runestones, which are all the same, resemble a golden rock etched with the DOGE logo. Source: Ordinals Wallet\nThe airdrop copied the buzzy Bitcoin Ordinals-based Runestone airdrop in March, where a community-run effort handed out over 112,000 Runestones to the protocol’s early adopters.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nBitcoin Ordinals are NFT-esque assets such as images or documents that are embedded into sats — the smallest unit of Bitcoin\nBTC\n$62,992\n.\nDogecoin is a fork of a fork of Bitcoin — which is why it’s able to have Ordinals — and its Doginals protocol was launched by an anonymous developer in February last year, a month after Bitcoin Ordinals.\nThe protocol also opened up the possibility for the launch of the DRC-20 token standard in early May 2023, taking its namesake from Ethereum’s ERC-20 standard and Bitcoin’s similar BRC-20 standard.\nRelated: ‘No such thing as spam’ — OKX exec on Bitcoin Ordinals\nThere are 149 Doginal collections and nearly 68,000 DRC-20 tokens with a combined market capitalization of $120 million, according to Doginal Explorer data.\nThe 1993 classic shooter game Doom has also been inscribed on the Dogecoin blockchain as a Doginal — a continuing meme of video game porters that have run Doom on random hardware such as washing machines and toothbrushes.\nDoom on Dogecoin. Source: Dogecoin Ordinals\nThe Doge Runestone airdrop didn’t seem to positively affect DOGE, which is trading at $0.1718 — down 2% in the past day and 20% on the week, per Cointelegraph Markets Pro.\nMagazine: Real-life Doge at 18 — Meme that’s going to the moon\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-05","tags":["#Blockchain","#Dogecoin","#NFT","#Bitcoin Ordinals"],"author":"by Jesse Coghlan","category":null}