{"id":"6ab55aba-9eb7-48c4-bcc1-6699eea2682f","article_link":"https://cointelegraph.com/news/tether-discredits-ripple-ceo-comments-us-scrutiny","website_source":"Cointelegraph","article_type":"News Article","summary":"Tether has highlighted its compliance efforts after Ripple’s CEO said the U.S. government has its sights set on USDT.","title":"Tether discredits Ripple CEO comments over US scrutiny","detailed_content":"Tether CEO Paolo Ardoino has hit back at Ripple CEO Brad Garlinghouse over his recent comments that the United States government is “going after” the world’s largest stablecoin issuer, Tether.\nArdoino took to social media platform X to clear the air around potential U.S. agency action against the firm and called out Garlinghouse for spreading “fear about USDT.”\nArdoino suggested that Garlinghouse’s comments were hypocritical, given that Ripple is being investigated by the U.S. Securities and Exchange Commission and is trying to launch a competing stablecoin to Tether’s (USDT).\nSource: Paolo Ardoino\nRipple plans to enter the stablecoin market in 2024 amid its ongoing lawsuit against the SEC.\nThe Tether CEO said that USDT is the largest stablecoin by market share, with millions of users across the world, and it has helped bank users in developing economies. He added:\n“USDT proved over time to have strong price stability, highly liquid reserves, top tier custodians and profound compliance.”\nArdonio also listed several factors that make USDT compliant and one of the most widely used stablecoins. He said Tether has collaborated with 124 law enforcement agencies across 40+ countries and has blocked over $1.3 billion worth of assets linked to scams, hacks and money laundering since it launched. Of the $1.3 billion in blocked assets, Tether blocked more than $639 million by working with U.S. law enforcement.\nRelated: Tether slams Deutsche Bank over suggestion its stablecoin could fail\nArdonio also revealed that in the last 12 months, Tether has voluntarily complied with 198 requests from law enforcement to block wallets, 90 of which came from U.S. law enforcement agencies. It has complied with 339 requests in the last three years, of which 158 were from U.S. law enforcement.\nArdonio concluded his tweet with a quip on competing stablecoin issuers. He said Tether cooperates directly with law enforcement agencies while other issuers only comply with judicial orders:\n“While other stablecoins, although they claim to be ‘more compliant,’ they require a judge order, allowing hackers, scammers and criminals a long time to move funds around.”\nThe Tether CEO’s response came after Garlinghouse claimed a “100%” chance of another crypto-related black swan event during a podcast interview. The Ripple CEO said the U.S. government is going after Tether without elaborating on the reasons behind his assessment. However, Garlinghouse also acknowledged Tether's role in the crypto market.\nMany in the crypto community saw Ripple CEO’s comments as an ominous hint of the upcoming U.S. regulatory action. Others claimed it was just a competitive tactic as Ripple will launch a stablecoin soon.\nCointelegraph reached out to Tether for comments but has yet to receive a response.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-13","tags":["#Blockchain","#Cryptocurrencies","#Ripple","#Adoption","#Tether","#Regulation"],"author":"by Prashant Jha","category":null}