{"id":"6ad21bc1-99bd-44ce-a074-14c84a020b39","article_link":"https://cointelegraph.com/news/worldcoin-launches-human-centric-blockchain-network","website_source":"Cointelegraph","article_type":"News Article","summary":"Worldcoin introduces World Chain, a new blockchain initiative designed to prioritize human users, enhance efficiency and foster real-world utility in Web3 applications.","title":"Worldcoin launches its own ‘human-centric’ blockchain network","detailed_content":"Worldcoin, an identity and financial network founded by OpenAI CEO Sam Altman, is furthering its “human-centric” approach to the Web3 space with its new blockchain network, World Chain. \nOn April 17, Worldcoin announced World Chain, which is a new blockchain initiative designed to prioritize human users, enhance efficiency and foster real-world utility in Web3 applications.\nWorldcoin recently surpassed 10 million World IDs created and 75 million completed transactions, signaling the project’s rapid expansion. Its own dedicated network has been designed to scale alongside the broader Ethereum network as a layer 2 to meet the project’s needs.\nCointelegraph spoke with Tiago Sada, the head of product, engineering and design at Worldcoin, to better understand the project’s intention with its network and how it plans to keep humans in the center.\nRelated: Worldcoin: Trail of Bits audit shows no direct vulnerability for Orb software\nSada said that while technically, World Chain will act similarly to any other L2 and Ethereum, its nuance is that it prioritizes humans over bots, with blockchains often facing congestion due to bot activity. \n“Usually, the way it works is that every account is fighting for block space. Usually, since bots can move faster and they can outbid humans,” he said, “the networks get saturated with all the transactions for bots, and humans have whatever is left — many times, they can’t even get in.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nWorld Chain’s solution tries to troubleshoot this by favoring transactions completed by verified World ID holders:\n“It’s going to be an open and permissionless network like everyone else, but we are going to prioritize transactions for humans so that their transactions definitely get in, and then the remainder of the block space is just like any other blockchain.”\nAdditionally, Sada explained how verified users will receive a free gas allowance, minimizing friction for newcomers. The protocol aims for an equilibrium where bots and power users ultimately cover gas fees for casual users.\nHe explained how the Worldcoin Foundation would provide an “allowance” to verified humans, which would make their couple of monthly transactions gas free.\n“The idea with that is just to make it a lot easier for people to get started, so that one does not need to go through the pains of unwrapping and understanding all these things.”\nThe network aligns with Ethereum and also collaborates with projects like Optimism and Base. Worldcoin anticipates a full launch in the summer, with a soon-to-be-expected developer preview.\nThis announcement comes on the heels of a series of changes the project has been implementing, including tightening its privacy checks to improve the protection of user data and ensure that its platform is available only to people over 18 while also allowing permanent deletion of the user’s iris code. \nOn March 22, Worldcoin even made its orb software open-source and implemented a new “personal custody” privacy feature.\nThese moves follow scrutiny from world governments over its privacy practices, which have led to some temporary bans on operations in countries such as Portugal, Kenya and Spain.\nResponding to the scrutiny, Sada said it is only the natural process of introducing a new protocol that is “fortunately” scaling at Worldcoin’s pace.\n“When any project starts getting to scale, it’s the government’s job to go in and make sure that everything that the project is saying is actually true. And I think that’s completely natural.”\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Adoption","#AI","#Worldcoin","#Layer2","#OpenAI"],"author":"by Savannah Fortis","category":null}