{"id":"6bd4b4a9-e804-498e-9f86-e5750a80f83c","article_link":"https://www.wired.com/story/ukraine-crypto-refugee-aid/","website_source":"Wired","article_type":"News Article","summary":"The UN’s refugee agency has partnered with blockchain and money transfer companies to get vital aid to people displaced by conflict.","title":"In Ukraine, Crypto Finds a Purpose","detailed_content":"IN THE 12 months since Russia began its full-scale invasion of Ukraine, more than 14 million Ukrainians have been forced from their homes in what the United Nations has described as “the fastest, largest displacement in decades.”\nAllied governments and humanitarian organizations have supplied tens of billions of dollars in aid to support refugees. But, as in past crises, figuring out the right way to get aid to people has been a huge challenge. For people who have been displaced, the best support is cash. Unlike in-kind assistance like food or clothing, cash can be used for anything, and it’s flexible for when circumstances change. “We always ask ourselves: Why not cash?” says Carmen Hett, treasurer for the United Nations High Commission for Refugees (UNHCR), the UN refugee agency.\nIn Defense of the Future\nThis story is part of WIRED30, our special 30th anniversary series. Read more here.\nThe humanitarian sector has historically been reluctant to distribute cash to refugees over fears—since debunked by multiple studies—that the money would be squandered on so-called temptation goods, like alcohol or tobacco. But cash has played a bigger role than ever in the Ukraine crisis. Nearly half of all of the aid delivered by the Disasters Emergency Committee, a coalition of UK-based charities, in the first six months of the war was in cash.\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nHowever, cash is difficult to move around. It either has to be shipped physically by the pallet-load into war zones and disaster areas, creating logistical and security headaches, or delivered electronically via the traditional banking system, the rigidity of which can pose problems for people whose documentation has been lost.\nRecognizing these limitations, the UNHCR has moved to deploy an alternative system, partnering with the Stellar Development Foundation, a nonprofit that supports the growth of the Stellar blockchain network. The two organizations are working alongside money transfer company MoneyGram and Circle Internet Financial, issuer of the USDC stablecoin, to rig up a system for sending aid directly to Ukrainian refugees using crypto. Cryptocurrencies have often been dismissed as being useful only for financial speculation, but in Ukraine the technology may be a solution to a real-world problem.\n“This project is a prototype but a very real one,” says Dante Disparte, chief strategy officer at Circle. “If you can solve the gaps in money logistics in such an acute conflict, it stands to reason that these types of innovations would be meaningful” in other contexts too.The system works like this: The UNHCR delivers USDC, a crypto coin locked to a $1 valuation and hosted on the Stellar network, to a digital wallet that can be accessed via smartphone. The recipient then exchanges their coins for local currency at any MoneyGram facility.\nThe UNHCR is also using standard bank transfers to distribute aid. However, as Hett says, although the Ukrainian banking system has so far proven resilient, if a bank were to fail, its customers would be left without access to the aid in their accounts. But a stablecoin is hosted on decentralized infrastructure and in the custody of individual wallet owners, which means funds cannot be withheld. Digital wallets are also available to people who don’t have a bank account.\nThe Ukrainian government has put in place strict capital controls to prevent money from flowing out of the local economy, meaning that refugees who have left the country face restricted access to funds in their bank accounts. But stablecoins are geography-agnostic; the only restriction in this context is the proximity of a MoneyGram location, of which there are 4,500 in Ukraine and roughly 350,000 worldwide.\nCrypto has been tapped to collect donations during humanitarian crises in the past. It has been successful in bringing together pools of money, but it can be difficult to actually use on the ground. In Turkey and Syria, after a huge earthquake in February that killed more than 50,000 people, recipients of crypto donations complained that they couldn’t spend the coins or turn them into fiat currency, limiting their usefulness. \n“The challenge is that there’s not a lot someone can do with crypto once they have it in their possession,” says Alex Holmes, MoneyGram’s CEO. “It’s not a form of payment that a lot of [vendors] accept.” \nThe UNHCR pilot overcomes this problem by building in a mechanism to convert crypto into cash. \nFor now, the stablecoin program in Ukraine is being piloted on a microscopic scale, with fewer than 100 participants in the cities of Kyiv, Lviv, and Vinnytsia. The UNHCR is preparing to expand the initiative to up to 5,000 wallets by April, but this would still represent only a fraction of the number of Ukrainians displaced by the war.\nHett declined to reveal how much cash has already been distributed via the program—information she describes as “not so important”—but insists the system is ready to scale. “It’s not about how many millions have flowed through,” she claims, “it’s about how many millions will flow through going forward.”\nUkraine may be an ideal proving ground for experimental financial services of this kind. Even before the war, the country was nurturing plans under President Volodymir Zelensky to become a digital-first economy and build a central bank digital currency—a blockchain-based version of Ukraine’s hryvnia.\n“You’ve got a community that is used to change, with high consumer technology penetration, and generations of people scattered across the globe,” says Dora Chomiak, board member at the Ukraine-focused nonprofit Razom. “Combine all of those things, and going beyond formal banking makes sense.”The process of launching the project has, in its own way, been radical for a humanitarian system known for its often ponderous bureaucracy.\nThe project was incubated for 10 months before being launched in December, far quicker than its backers anticipated, according to Denelle Dixon, CEO at the Stellar Development Foundation. As well as the usual red tape, the job of convincing stakeholders of the technology was made harder by the implosion of crypto exchange FTX in November, which sparked a crisis of confidence in the sector. “But I think that’s mostly behind us now,” says Dixon.\nThe goal is not to replace traditional cash-based intervention, say the UNHCR and its partners, but to arm humanitarian organizations with alternative rails for distributing aid that support the full range of scenarios refugees may find themselves in. “The real breakthroughs here are more evolutionary than revolutionary,” says Disparte. “It’s about extending the brick-and-mortar banking system beyond its many limitations.”\nIt is also important to avoid scenarios in which crypto is applied to problems that do not exist, says Dixon. “You never want crypto to be a square peg in a round hole. This is just another option—another tool in the toolbox.”\nIrrespective of the small scope of the initial pilot, the partners on the UNHCR scheme believe that projects like their own, as well as the $78 million in crypto donated to Ukrainian causes since the war began, hint at a permanent change in the way humanitarian aid will be distributed.\nThe UNHCR is investigating the potential for the same system to assist those displaced by the economic crises in Venezuela and Argentina, says Hett. And Holmes points to potential applications in Turkey and Syria.\n“Having portable access to money, no matter where they are, gives people the options to move on in life,” says Hett. “The question is now, how can we do more of this? Because we know it works.”","creation_date":"2023-03-15","tags":["","CRYPTOCURRENCY","BLOCKCHAIN","UKRAINE","RUSSIA","WIRED30"],"author":"BY JOEL KHALILI","category":null}