{"id":"6c17b8e1-b5ce-4738-b7a0-2e751a639163","article_link":"https://cointelegraph.com/news/patricia-ceo-debunks-closure-rumors-crypto-exchange","website_source":"Cointelegraph","article_type":"News Article","summary":"Patricia came under scrutiny following a hacking incident in May 2023, which led to a significant loss of customer funds.","title":"Nigeria’s Patricia exchange CEO refutes closure rumors","detailed_content":"Fejiro Hanu, the CEO of Nigerian crypto exchange Patricia, has denied rumors of its closure, calling them a media ploy for clicks and confirming that the exchange is still operating.\nIn a post on X, Hanu claimed that despite granting interviews and sharing information with media houses, they distorted the narrative to attract views and fit their agenda:\n“Good news doesn’t sell as fast as hate/bad news. So everyone is quick to jump on a narrative.”\nPatricia came under scrutiny following a hacking incident in May 2023, which led to a significant loss of customer funds.\nDespite claims that customer funds were secure, users have encountered persistent challenges accessing them since April 2023. This lack of access to users’ funds fueled speculation about concerns regarding a potential exit scam, raising fears for customers with funds stuck on the platform.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIn a recent post on X, Hanu claimed that despite providing interviews and sharing information with media outlets, they twisted the narrative to garner more attention and align with their own agenda.\nSource: Hanu Fejiro\nIn response to customer requests, Patricia converted the value of customer assets into its native Patricia Token (PTK) in October 2023, guaranteeing future repayment. Patricia highlighted its commitment to integrity and customer trust, introducing PTK as an internal customer asset.\nPatricia stated it is committed to reimbursing holders with 1 Tether\nUSDT\n$1.00\ntoken for each Patricia token, ensuring asset recovery after the security breach. Patricia clarified that PTK is not on-chain but serves as an internal token representing debt and is managed by the company.\nRelated: Losses from crypto hacks plunge 67% in April to $60 million\nIn the X post, Hanu updated users on Patricia’s status and assured them that Nigerian security services are dealing with the case.\nHanu mentioned that Patricia is currently awaiting the prosecution and conviction of the suspects involved, emphasizing that efforts are underway to resolve the situation.\nIn November 2023, an arrest was made in connection with the Patricia crypto wallet heist. The Nigerian Police Force (NPF) apprehended politician Wilfred Bonse, who was accused of stealing over 200 million Nigerian naira ($246,153) from Patricia Technologies’ crypto wallet.\nThe NPF said that the case includes criminal conspiracy, the unauthorized alteration of computer systems and network data and the illicit diversion of funds, as outlined in a petition submitted to the inspector general of police.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-02","tags":["#Blockchain","#Cryptocurrencies","#Business","#Nigeria","#Hackers","#Cryptocurrency Exchange","#Hacks"],"author":"by Amaka Nwaokocha","category":null}