{"id":"6c614752-cc24-4706-ba96-bacb2da62e08","article_link":"https://medium.com/@artela_network/your-guide-to-interacting-with-artelas-public-testnet-527410aa9faf","website_source":"Medium","article_type":"Blog Post","summary":"Since the launch of Artela Public Testnet a few days ago, we’ve received an overwhelming amount of positive feedback. We’ve also introduced…","title":"Your Guide to Interacting with Artela’s Public Testnet","detailed_content":"Since the launch of Artela Public Testnet a few days ago, we’ve received an overwhelming amount of positive feedback. We’ve also introduced exciting incentive plans for builders and validators, but many members of our community have been curious about how regular users can get involved and be rewarded for participating in the Artela Testnet.Here it comes! your guidance on interacting with Public Testnet! Artela and its ecosystem projects have prepared 2 usecases for you to begin interacting and experience the Artela Public Testnet.Website: https://jit-gaming-wje9.vercel.app/Through Aspect programming, we’ve introduced a fully on-chain NPC (Non-Player Character) to the fully on-chain games on Artela! In this immersive gaming world, players can register their accounts as automated NPC players who engage in battles with other real players based on algorithms.The image below shows a game where the player controls character 209 while player 24 is a fully on-chain NPC, uncontrolled by off-chain components, battling alongside real players in the Royale world.To get started with JIT Gaming:Once the game is loaded, you’ll find your player ID at the bottom. Identify your character’s position on the game board by looking for the red icon in the upper-right corner of each character. Now, you can control your character using the WSAD keys, arrow keys, or by clicking on the on-screen arrows. When your character shares a grid with other players, you can eliminate them, earning 1 point. Achieve a total of 5 points in your game wallet to complete the galaxy mission.If another player defeat you, you’ll see the following screen. You can rejoin the game by clicking “Rejoin Game,” and being eliminated doesn’t cost you any points.Website: https://www.artscription.xyz/Artscription is the first inscription project in Artela Blockchain, utilizing its unique Aspect programming to realize the secure and incentivized indexer and unlock composability and programmability for inscription.Upon successful completion of the transaction, you can see the balance on the ‘Token’ page. The successfully minted inscription balance will be recorded. Completing any inscription minting activity (balance > 0) during the campaign is considered a task completion.Here’s how to participate in Inscription:With these two exciting use cases, you can dive into the Artela Public Testnet, have fun, and earn rewards while testing our platform in our upcoming campaign. Join us in this adventure and become a part of the Artela community today! Stay tuned for more incentive campaigns in the near future.Originally published at https://artela.network.","creation_date":"2024-03-15","tags":["Artela","Blockchain","Crypto","Layer 1"],"author":"Artela Network","category":null}