{"id":"6dc7adaf-84d0-4025-a56a-f737aa628cb0","article_link":"https://medium.com/unificationfoundation/unode-public-beta-beyond-56fbc071a2f3","website_source":"Medium","article_type":"Blog Post","summary":"The UNoDE Phase 1 public beta is live! We’re still doing some last minute optimisations and tweaks, but everything is ready.","title":"UNoDE Public Beta & Beyond","detailed_content":"The UNoDE Phase 1 public beta is live! We’re still doing some last minute optimisations and tweaks, but everything is ready.Pretty much everything that has been previously outlined for Phase 1:2. Anonymity — no mandatory email address or names for end-users during registration. No logging — unless explicitly enabled by you, the user, for purposes of, for example, resolving issues and debugging. Logs are transitory and wiped when logging is disabled and no longer required.3. Crypto payments with special offers and bonuses for FUND paymentsPerfection. Whilst we have endeavoured to find/fix bugs and optimise the platform, it’s still a beta, so there will be issues that were not picked up during our smaller scale alpha testing. Bugs are an inevitability with software, and the wider scale public beta will help us catch and kill anything we missed, overlooked or were not even aware of during alpha testing. This is, of course, all a part of a large scale changes required as we move into Phase 2.Since this is a beta, we will be offering bug bounties. Details to follow.In parallel with bug fixing and optimising Phase 1 during the public beta, we will soon be starting planning and development for UNoDE Phase 2 — beginning the SaaS chapter of UNoDE.With Phase 2, we aim to develop tools to allow potential operators to spin up their own RPC infrastructure and join the UNoDE family. Along with revenue sharing, this will help propel UNoDE into becoming a truly decentralised NaaS platform unlike any existing options today.Phase 2 of the UNoDE project aims to focus on implementing the SaaS (software as a service) aspect, in order to provide a decentralised network of NaaS RPC nodes.UNoDE aims to offer a suite of scripts and tools allowing potential third party UNoDE Operators to deploy their own RPC nodes and connect them to the UNoDE API.The UNoDE backend will maintain a list of “healthy” third party nodes, allowing the end-user API to route requests to these nodes. We aim to have these requests be load balanced, and also routed based on IP geo-location to reduce potential network latency incurred by third party nodes being situated in a different physical location.The UNoDE backend also aims to maintain a history of the number of requests successfully routed to and served by third party nodes, so that some of the revenue earned from UNoDE subscriptions can be shared with third party UNoDE Operators.What does all this mean? For the vast majority of end-users (developers, traders etc.), this should be a seamless implementation, and no changes should be required on their part. Existing API keys will remain the same, so the transition should be smooth.For potential Node Operators, there will be some new sections in the UNoDE UI, allowing the generation of a new API key which is used specifically for registering their RPC nodes to the UNoDE network. Additionally, Node Operators should have access to a new area of the UI giving an overview of their nodes and data such as health status, number of requests served, and their current share of revenue, history etc.We will be reaching out to our existing alpha testers during Phase 2 development, and will also eventually open up registration for new alpha testers.True network decentralisation — including revenue sharing, and sustained growth together — has been the bastion pillar of Unification and will continue to a much deeper chapter as we expand our development into the next phase of UNoDE. We look forward to having you join us as users, supporters, developers & operators into the next chapter.GitHub: https://github.com/unification-comTelegram: https://t.me/unificationfoundationDiscord: https://discord.com/channels/725618617525207042Website: https://www.unification.com","creation_date":null,"tags":["Unode","Unification","Fund","Blockchain","Privacy"],"author":"Codegnosis","category":null}