{"id":"6eaa02ce-6447-47c1-b2a4-7e425e97c420","article_link":"https://medium.com/babylonchain-io/babylon-testnet-4-pre-launch-announcement-234ea3fa9077","website_source":"Medium","article_type":"Blog Post","summary":"The Babylon team plans to launch a new testnet towards the end of May 2024. This announcement explains the purpose of this testnet and how…","title":"Babylon Testnet-4 Pre-Launch Announcement","detailed_content":"The Babylon team plans to launch a new testnet towards the end of May 2024. This announcement explains the purpose of this testnet and how to prepare for it.Our current testnet, bbn-test-3, allows Bitcoin stakers to engage in a full range of activities including staking, unbonding, withdrawing, claiming rewards, and experiencing the slashing mechanism. We will sunset it at 12PM UTC 16/May/2024. Of course, it is only a testnet and no real BTC were used.Community feedback has been very positive on the user experience so far, while also emphasizing a key consideration for participating in such as protocol: the security of their staked Bitcoins. Users want assurance that their Bitcoin won’t be stolen, can unbond and withdraw anytime, and won’t be slashed.Therefore, the new testnet (bbn-test-4) will focus on the security of the staked Bitcoins by testing the user’s interaction with the BTC Signet test network.Here’s what this means for users:In addition,Bitcoin stakers: If you are interested in participating, please consider unbonding and withdrawing your Signet Bitcoin from the existing testnet (btcstaking.babylonchain.io). We will also reopen Discord faucet very soon.Finality providers: Please read this guide (networks/bbn-test-4/finality-providers at main · babylonchain/networks ) to register yourself if you would like to appear in the initial finality provider list of the staking web dapp with proper information display (name, logo, etc).This testnet is NOT incentivised. Its purpose is to allow interested parties to evaluate and get familiar with Bitcoin staking related operations.We would also like to emphasise that Signet Bitcoin is only a simulated Bitcoin for testing that can be used only for the BTC Signet test network. It does not carry any monetary value, and it is not redeemable or tradable.We appreciate your continued support and enthusiasm as we work together to refine and secure the future of Bitcoin staking.","creation_date":null,"tags":["Cryptocurrency","Bitcoin","Staking","Blockchain","Technology"],"author":"Editor @ Babylon","category":null}