{"id":"6ecd3ee8-b2f0-4499-a408-d9afaffd8b37","article_link":"https://www.wired.com/story/death-technology-memory/","website_source":"Wired","article_type":"News Article","summary":"These past few years have been visceral reminders of our mortality. But new technologies can offer a way for us and our loved ones to live on.","title":"Digital Eternity Is Just Around the Corner","detailed_content":"IT’S HUMAN NATURE to want to keep the memory of the deceased alive. Photography, for instance, has served as a powerful tool to help us do this. I’ve explored this with my 2020 project ALIVE: Lost for Words, where I photographed people against a projected image of their lost loved ones. \nRecently, the pandemic left us feeling closer than ever to death, forcing us to confront our own mortality and the legacy we leave behind. With our normal lives disrupted by social distancing, digital tools also radically impacted our traditional death rituals. We said final goodbyes over FaceTime, mourned together via Zoom, lit virtual prayer candles from our laptops. \nREAD MORE\nThis story is from the WIRED World in 2023, our annual trends briefing. Read more stories from the series here—or download or order a copy of the magazine.\nIn 2023, technologies such as artificial intelligence and blockchain will allow us to create new forms of posthumous digital presences. The adoption of these technologies is already opening our minds to the idea of living forever in the virtual world. For instance, in 2020, hologram experts Kaleida collaborated with Kanye West to create a hologram of Kim Kardashian’s late father for her 40th birthday. Genealogy platform MyHeritage has created Deep Nostalgia, a deep-fake tool that animates the faces of departed relatives in family photos. Stonses, a blockchain-powered memorial platform, can store digital NFT replicas of our treasured possessions, affording a permanence to the memories we associate with them.\nFEATURED VIDEO\nChess Pro Answers Questions From Twitter\nIn 2023, the increased adoption of Web3 technologies will take this concept to the next level. Immersive virtual reality combined with multisensory stimulation will also allow us to interact with the image of our lost loved ones in an emotionally visceral way. We’ve already seen such technology used in the entertainment industry, with premium cinema startup Positron creating a range of Voyager VR chairs that amplify cinematic experiences with haptic pillows and scent dispensers. Reimagined for memorial purposes, this tech will allow us to not just see the image of the deceased, but also smell their signature perfume and physically feel their presence on our skin.\nIn 2023, technology will also be used to not only preserve our conversations with those who have passed on, but also replicate them. This will be possible with tools such as the hyperrealistic online chatbot Project December, which uses AI to emulate the style of whatever text is fed to it. Through learning from the remnants of their digital trails—text messages, blog posts, 3 am tweets—AI will let us talk with a chatbot that mimics someone no longer with us.\nAs these technologies develop and become more accessible, they will increasingly be used in combination, creating “intelligent avatars” of ourselves that continue to “live” long after we have died. We are seeing the beginnings of this with the metaverse company Somnium Space, whose Live Forever mode allows users to create “digital clones” built from data they have stored while alive, including conversational style, gaits, and even facial expressions. \nThis sense of immortality may be reassuring, but there is a catch. AI avatars will rely on us feeding their algorithms a huge amount of personal data, accumulated through the course of our lives. If we want our digital selves to live on, this is the exchange we must accept: that the unfiltered beliefs and opinions we express today may not only be archived, but consequently used to build these posthumous personae. In other words, we can have a voice in the afterlife, but we cannot be certain about what it may say. This will force us to reconsider how our behaviors today might influence digital versions of ourselves set to outlive us. Faced with this prospect of virtual immortality, 2023 will be the year we broaden our definition of what it means to live forever, a moral question that will fundamentally change how we live our day-to-day lives, but also what it means to be immortal.","creation_date":"2022-12-15","tags":["","VIRTUAL REALITY","AUGMENTED REALITY","THE WIRED WORLD IN 2023","ARTIFICIAL INTELLIGENCE","DEATH","MEMORY"],"author":"BY RANKIN","category":null}