{"id":"6f27633d-2fa6-432a-bc31-85fcac0abe38","article_link":"https://cointelegraph.com/explained/mapping-on-the-blockchain-explained","website_source":"Cointelegraph","article_type":"News Article","summary":"Utilizing blockchain-based mapping enables decentralized storage of huge data, resolving latency concerns during data access and sharing.","title":"Mapping on the blockchain, explained","detailed_content":"Can blockchain-based location mapping replace GPS mapping?\nThe global positioning system (GPS) calculates a person’s location, merges it with their environment, and displays it live on their mobile device via a real-time interface. Blockchain-based systems make it transparent and resistant to interference.\nUsing GPS-based navigation devices has become ubiquitous. People use tools such as Google Maps, OpenStreetMap and Foursquare, which rely on GPS. However, these services are plagued by a common fault — centralization — which makes them prone to opaque functioning and a central point of failure when it comes to hacking.\nBlockchain technology offers several advantages over centralized systems and helps users tide over the limitations of traditional tools like GPS mapping. It improves transparency, increases resilience to hacking attempts and enables faster data processing. Unsurprisingly, several businesses have begun to use blockchain technology or are actively exploring its application.\nThe inefficiencies in current interactive maps\nThough the current system of GPS-based interactive maps has been around for more than a decade, it has its share of inefficiencies. The data from these systems may sometimes be inaccurate and slow to load on devices.\nGPS mapping entails processing and storing enormous amounts of data, usually on centralized servers, which might cause delays when accessing and sharing. As these technologies track a person’s whereabouts in real time, they may jeopardize user privacy. Traditional GPS system development and maintenance might also be prohibitively expensive for businesses.\nCentralized mapping relies on proprietary data that may be outdated, failing to adequately reflect recent advances in roads, highways and infrastructure due to rapid change. GPS also faces difficulty in adequately mapping dense metropolitan areas. Creating interactive maps in regions with narrow lanes necessitates hard work from the mapping provider to document each area, which is both time-consuming and costly. Moreover, in civil applications such as surveying and transportation, GPS is unencrypted, lacks proof-of-origin or authentication features and is susceptible to cyberattacks, jamming and spoofing. \nMost mapping projects use crowdsourcing to enable their operations. In OpenStreetMap, for instance, a large number of contributors use GPS devices, aerial imagery and low-tech field maps to update map data. As the world pushes into the age of the Internet of Things (IoT), new crowdsourcing use cases are likely to emerge. However, problems like difficulty with accuracy and top-down policy implementation — which crowdsourcing projects have generally grappled with — may pervade. Blockchain-based mapping provides a viable alternative.\nHow blockchain augments interactive digital maps\nThe decentralized structure blockchain technology works on may provide effective answers to common difficulties in the usual interactive digital maps.\nGPS mapping requires processing and storing large amounts of data, usually stored on a single or a few servers. The centralized nature of GPS mapping can lead to processing and delivery delays due to the strain of handling large amounts of data on limited servers. Decentralized apps (DApps), however, distribute data over several network devices (nodes), reducing latency and allowing for smooth data access.\nAs these applications rely on a decentralized network of nodes to continuously validate transactions and data updates rather than a single centralized authority, they can keep location information more current and accurate. The blockchain’s consensus process, which needs confirmation from several nodes before accepting changes, preserves data integrity and protects it from illegal changes.\nBetter privacy is another advantage of using blockchain for mapping. Traditional GPS mapping compels consumers to send their location data to major organizations, which can then monetize this geotagged information without the users’ consent. On the other hand, Blockchain functions without centralized authority that can make unanimous decisions, with data spread across multiple nodes, improving user privacy.\nCan blockchains be used for spatial verification?\nSpatial verification in blockchain is the process of authenticating the physical location of an event, object or user within a decentralized network.\nSpatial verification refers to the confirmation that things are at the place where they claim to be. It is very useful in various industries, especially supply chain management.\nFor instance, when an Amazon delivery drone drops off a package at an owner’s door, the cost is charged to the owner’s account, relying on spatial verification. This eliminates problems with dishonest delivery persons and disagreements over charges for products that go missing.\nSimilarly, if someone has a broken windshield, they can use blockchain-based spatial verification to back up their insurance claim by sending a photo and documentation proving the time and location. This helps streamline insurance claim processing, reduces disputes and helps combat fraud.\nWhen one creates a new bank account remotely, spatial verification allows them to verify the residence by merely being present at their home rather than providing proof of address such as utility bill copies.\nA smart contract built in a blockchain-based proof-of-location (PoL) protocol would do spatial verification in these use cases. By providing a trustless way to prove location, PoL systems enhance transparency and efficiency in various industries.\nWhat is proof-of-location protocol?\nPoL uses a combination of cryptographic algorithms and consensus procedures to ensure the authenticity of a user’s location data without relying on a single authority.\nIn blockchain, PoL is the validation of a user’s physical position within a decentralized network. PoL assures the precision of location-based transactions and services in a range of applications, including supply chain management, asset tracking, decentralized finance and more. \nOne frequent approach to PoL is to use a network of trustworthy nodes or oracles to collect and validate location data from an array of sources, including GPS satellites, WiFi signals and cellphone towers. These nodes then verify the user’s location by broadcasting signed messages or proofs to the blockchain. \nBy implementing PoL into blockchain systems, users can securely engage with location-conscious smart contracts and DApps while maintaining privacy and trust. This technology expands the possibilities for location-based services and enables innovative use cases that require verifiable location data on the blockchain.\nCore elements of a PoL smart contract\nLocation data submissions, verification mechanisms, data storage, and linking spatial verification to specific actions are the core elements of a PoL smart contract.\nLocation data submission\nThe smart contract would define how users or devices submit location data, including: \nGeotagged photos or videos.\nGPS coordinates from a mobile device.\nSensor readings from IoT devices confirming a location.\nVerification mechanisms\nThe contract would need ways to verify the submitted location:\nUsing reputation systems to assess the reliability of data providers.\nCross-checking with multiple data sources.\nEmploying cryptographic techniques to prevent location spoofing.\nData storage\nA tamper-proof record would be created by securely storing the verified location data on the blockchain.\nTriggering actions\nThe spatial verification would be connected to particular activities by the smart contract, such as paying out in supply chain situations, approving claims made by insurance, or granting access upon verification of physical presence.\nWhat are the limitations of a proof-of-location protocol?\nDespite its potential, PoL has several drawbacks, including reliance on external data sources, scalability difficulties and variable applicability across geographies, among others.\nWhile PoL offers several advantages, it has significant limitations. One problem is the reliance on external data sources, which can lead to vulnerabilities for manipulation or spoofing. Additionally, PoL may face scalability concerns because confirming location data for a large number of transactions demands significant processing resources.\nMoreover, PoL solutions may not be universally applicable across geographic regions or situations, resulting in inconsistent verification accuracy. There are no standardized methods for incorporating geographic locations, physical addresses or coordinates into smart contracts. \nEach developing platform has its own hardware infrastructure, protocols and business models. Addressing these restrictions is critical to the general adoption and efficacy of PoL in blockchain applications.","creation_date":"2024-04-19","tags":[],"author":"by Dilip Kumar Patairya","category":null}