{"id":"6f3b2a30-5498-4fbd-8dac-b36df6acc16e","article_link":"https://cointelegraph.com/news/bitscrunch-ama-the-future-of-blockchain-data-is-decentralized-accessible-and-intelligent","website_source":"Cointelegraph","article_type":"News Article","summary":"Unlike many projects, bitsCrunch prioritizes building a functional network. It tackles the challenge of interpreting blockchain data, making it valuable for businesses and individuals alike.","title":"bitsCrunch AMA: The future of blockchain data is decentralized, accessible, and intelligent","detailed_content":"Cointelegraph’s latest AMA featured Vijay Pravin, data expert, founder and CEO of bitsCrunch. The discussion revolved around bitsCrunch - a decentralized, AI-powered data network for NFTs and other public chain digital assets recognized by PwC and Ernst & Young. Its partners include Mastercard, Unstoppable Domains, DappRadar, and other key players in the industry.\nAMA: Unveiling the Future of NFTs with bitsCrunch CEO Vijay Pravin https://t.co/XcthGSwQLs\n— Cointelegraph (@Cointelegraph) March 25, 2024\nPravin began the interview by elaborating on bitsCrunch’s mission to democratize access to blockchain data: “Blockchain data is quite tricky and not human readable, which is why there are many tools and protocols in the space. We want to make this data accessible to both companies and individual users.\"\nThe platform is already user-friendly: anyone can access Bitscrunch’s data APIs with a valid internet connection and an API key, which can be generated instantly or within 48 hours. \"The moment you get access, you can start querying data, making API calls, and building your own dashboards,\" Pravin continued. “We plan to make the whole experience easier, especially for non-techy people, like adding drag-and-drop interfaces.”\nThe company differentiates itself by offering forensic analysis in addition to traditional analytics. This would involve identifying suspicious activity within the broader blockchain ecosystem, going beyond the NFT focus. \nIn addition, Bitscrunch also offers insights into in-game analytics, providing data on player behavior and in-game asset trading. This type of data can be invaluable to gaming companies looking to understand and target their audience.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nbitsCrunch also has an impressive library of historical data. “Just to give you an example, we can provide prices of up to 250,000 tokens on Ethereum since its inception. Or tell you the price of Chainlink on any given day. Very few players can do that,” Pravin pointed out, comparing to established data providers like CoinMarketCap and CoinGecko.\nWhen discussing their token BCUT, bitsCrunch also doesn’t go for hype and is more interested in building a functional network. “We believe in slow and steady growth,” the speaker noted. The bitsCrunch network will rely on node operators to distribute the data load, similar to how services like Amazon and Google work. BCUT tokenholders can participate by delegating their tokens to these node operators, which allows them to choose operators who offer the best value to the network.\nThe results have been promising so far. According to Pravin, in just one month, over 4.22 million BCUT tokens have been staked on the Bitscrunch network mainnet. Additionally, 48 leading node operators, including industry heavyweights like 0xFury, Nodes.Guru and Impossible Finance are already contributing to the network. In the near future, staking will be open to the public.\n“We’re big fans of existing solutions like Graph Protocol and Covalent,” Pravin said about the inspiration for the BCUT token. “Such data protocols usually follow Delegated proof-of-stake (DPoS) algorithms and sets of node operations. And that’s what we’re going with, we don’t want to reinvent the wheel since it has already been tested on the market. Instead, we want to focus on our core competencies – data analytics, AI, and machine learning,” he added.\nBitscrunch is taking a big step toward DAO status by launching the “Contributor” role. This program allows the community to actively participate in the development of the network and earn perks. “We want the community to come in, contribute, and then be rewarded for their work,” said Pravin. The first opportunity to contribute is through asset labeling, which allows users to identify wallet types and their origins. These labels are then verified internally, and all contributors are rewarded on-chain through a transparent system powered by Chainlink’s oracles.\nThe next step in community engagement is the “Indicator” role. Currently, the Bitscrunch team decides which blockchains to index, which algorithms to use, and which data analytics to share publicly. However, the future vision is for the community to have a say in these decisions.\nThe ultimate goal for bitsCrunch is to be a comprehensive data hub, not just for NFT information, but to be the destination for all things blockchain data. Pravin gave a glimpse of what’s to come, such as the addition of some major blockchains and potential exchange listings. “The next big integration and transition to a more decentralized operator model is exciting,” he concluded.\nLearn more about bitsCrunch\n#Blockchain\n#DAO\n#Games\n#NFT\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-04","tags":["#Blockchain","#DAO","#Games","#NFT"],"author":"by Victoria Li","category":null}