{"id":"6f4f07f6-219a-4281-8ef0-d48a6b45265c","article_link":"https://cointelegraph.com/news/altcoin-season-inbound-ethereum-fees-fall-six-month-lows","website_source":"Cointelegraph","article_type":"News Article","summary":"The Ethereum network had its cheapest day in over six months, which could suggest altcoins could rally “sooner than many may expect.”","title":"6-month low Ethereum fees suggest altseason is inbound — Santiment","detailed_content":"Gas fees on the Ethereum network have plunged to a six-month low even as the price of Ether rallied slightly over the weekend, which analysts from crypto analytics platform Santiment say could signal an upcoming altcoin rally. \nOn April 27, the average fee for an Ethereum translation fell as low as $1.12, according to an April 28 X post from Santiment.\n“Traders historically move between sentimental cycles of feeling that crypto is going ‘To the Moon’ or feeling that ‘It Is Dead’, which can be observed through transaction fees,” wrote Santiment.\nSource: Santiment\nSantiment explained that fees tend to peak around local market tops and fall back to “resting state” lows around the time of market bottoms.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nGas fees on Ethereum reached an eight-month high in February amid a tidal wave of interest in an experimental token standard called ERC-404.\nThe analytics platform suggested the low gas fees could indicate a future uptick in Ethereum network activity and herald the beginning of an altcoin rally.\n“With markets mainly retracing over the past 6 weeks, the lack of demand and strain on the network may help turn ETH and associated altcoins around sooner than many may expect.”\nIt comes as the price of Ether\nETH\n$3,032\nrallied slightly, gaining 4.3% in the last week, according to CoinGecko data.\nRelated: Franklin Templeton lists Ethereum ETF on DTCC\nOn April 27, the native tokens of Ethereum layer-2 networks Optimism, Arbitrum and Polygon accounted for three of the top five best-performing assets in the top 50 cryptocurrencies by market cap, gaining 11.7%, 3.5% and 2.8%, respectively.\nSource: Luke Martin\nMeanwhile, the lowered activity on the network has seen the circulating supply of Ethereum surge to its highest point in the last month.\nIn the last 30 days, 74,458 new ETH were issued while just 57,516 were burned, resulting in a net supply increase of 16,979 new Ether (ETH), according to data from ultrasound.money.\nThis stands in stark contrast to the previous five months, which have consisted of steady deflation. Despite the recent uptick in ETH inflation, more than 437,000 ETH has been burned since the network’s switch to a proof-of-stake consensus mechanism, dubbed the Merge, which occurred on Sept. 15, 2022.\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-29","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Ethereum","#Fees","#Trading","#Ether Price","#Ethereum Price"],"author":"by Tom Mitchelhill","category":null}