{"id":"70e58d57-55f0-4a1b-8155-979ea7ec41bd","article_link":"https://cointelegraph.com/news/mango-markets-fake-diamond-ring-scam-prosecutor","website_source":"Cointelegraph","article_type":"Tweet","summary":"Avi Eisenberg’s alleged Mango Markets exploit was a “modern twist” on a classic con, prosecutors argued, but Eisenberg is adamant his actions were legal.","title":"Mango Markets heist like a fake diamond ring scam: Prosecutor","detailed_content":"Avraham “Avi” Eisenberg’s alleged $110 million exploit of the Solana decentralized exchange Mango Markets is no different from a fake diamond ring scam, prosecutors have claimed.\nUnited States Assistant Attorney Tian Huang said in opening arguments in a Manhattan federal court that Eisenberg’s actions on Oct. 11, 2022, constituted fraud and market manipulation, according to an April 9 Inner City Press X post.\n“Consider this scam. A person sells a fake diamond ring, worthless plastic. The con man disappears and runs off. This case is a modern twist on that. That man, Avraham Eisenberg? He ran.”\n“He inflated the price of cryptocurrency by 1,000% in 20 minutes. He convinced Mango Markets he owned a lot, and conned Mango Markets,” Huang added.\n“He borrowed over $110 million of cryptocurrency,” he continued. “He wasn’t really borrowing it — he was stealing it. He ran off with crypto.”\nSource: Inner City Press\nEisenberg has long rejected the assertion he exploited Mango Markets and said he “operated a highly profitable trading strategy” and that his actions were “legal open market actions.”\nIn court, his lawyer Sanford Talkin rejected the claims and explained Eisenberg risked $13 million of his own funds and could have lost it all had the trade failed.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“During this trading strategy, at any moment, he could have lost everything. It was not a sure bet, and it wasn’t a secretive bet. The bet he made could be seen by anyone,” Talkin said.\nThe Mango Markets exploit occurred out in the open and the public nature of blockchain transactions meant that anyone could have taken the other side of the trade, he added.\n“If his counterparties had seen them and opted to, they could have traded against him,” Talkin asserted. “He executed a successful trade.”\nIn October 2022, Eisenberg inflated the value of the platform’s native token, MNGO, relative to USD Coin\nUSDC\n$1.00\n.\nHe then took out a series of loans against the inflated MNGO price, which drained Mango Markets’ treasury of around $110 million worth of various cryptocurrencies.\nRelated: ParaSwap DAO votes to compensate hack victims\nDays later, on Oct. 15, Mango Markets confirmed that $67 million in various crypto assets had been returned. Eisenberg publicly confessed on X to his actions on the crypto exchange, saying he believed they were legal and permitted by the platform's smart contract.\nDespite some of the funds being returned, the team behind Mango Markets sued Eisenberg for $47 million in damages plus interest.\nCrypto lawyer weighs consequences\nThe final ruling on Eisenberg’s case could be more important to the future of the crypto industry than the criminal trial for Sam Bankman-Fried, said crypto lawyer Gabriel Shapiro in an April 9 X post.\nSource: Gabriel Shaprio\nShapiro, the former general counsel at Delphi Labs, said he was “fine” with the government’s charge that Eisenberg committed market manipulation but took issue with the specifics around Eisenberg’s requirements.\n“The problematic claim against Avi is that he breached some kind of loan agreement implied in his use of the protocol — this is absurd [and] not how DeFi works,” Shapiro wrote.\n“Imagine you get liquidated on Aave, but the network was congested, the price of your collateral fell too much and thus the protocol got bad debt — do you want AaveDAO to be able to sue you to collect the debt?”\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-10","tags":["#Blockchain","#Cryptocurrencies","#Law","#Court","#Scams","#DeFi","#Regulation"],"author":"by Tom Mitchelhill","category":null}