{"id":"710987ad-c105-4832-896b-0aa1e28fa043","article_link":"https://cointelegraph.com/news/zero-knowledge-systems-chatgpt-moment-telos","website_source":"Cointelegraph","article_type":"News Article","summary":"Cointelegraph asked professionals working with zero-knowledge technology to get their insights on the current state of ZK.","title":"ZK systems will have their ChatGPT moment — Telos Foundation","detailed_content":"As zero-knowledge (ZK) systems progress, an executive envisions a future where they experience a breakthrough akin to what occurred with the artificial intelligence chatbot ChatGPT.\nA ZK-proof is a method to authenticate information while maintaining privacy. It allows one party to prove that another party is being truthful without revealing any concealed information. \nZK allows public blockchains to validate the existence of hidden data. With this, crypto users can confirm the legitimacy of information without disclosing its content.\nWhile the technology is still in its early beginnings, some believe it will have a similar impact as ChatGPT and gain similar waves of interest when it gets broader implementation.\nChatGPT moment for ZK\nIn a Cointelegraph interview at Token2049 in Dubai, Telos Foundation executive director John Lilic said there is no way to ignore ZK, as it is fundamental. Lilic described the technology as the “end game.”\nLilic believes that people won’t pay much attention to ZK soon because they find the concept hard to grasp. However, the executive is confident that there will come a time when ZK systems will garner the same level of attention as ChatGPT did when it was initially introduced. Lilic said:\n“Nobody’s going to care so much. And then, suddenly, everything all at once will come onto the networks that have the best ZK systems. You see how fast the ChatGPT thing came. Suddenly, it was everywhere. That’s how I think it’s going to go with ZK.”\nOn April 19, Telos Foundation partnered with Ponos Technology to develop a layer-2 network, leveraging Telos’ SNARKtor, a decentralized recursive proof aggregator. According to Lilic, the move was part of their efforts to become a “network of networks.”\nStill in its early stages\nWhile ZK systems have a lot to be excited about when it comes to the future, the ChatGPT moment for these technologies might not happen in the near future.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRichard Meissner, the co-founder of Safe (formerly Gnosis Safe), which utilizes ZK systems for cross-chain ownership proofs, said that ZK tech is still in its “early stages of development.”\nThe executive said that more optimization is still needed to encourage adoption. Meissner explained:\n“There has been interest in the tech and in the last couple of months, it was possible to see prototypes for all kinds of use cases based on ZK-proofs. For example, cross-chain ownership proofs for smart accounts.”\nMeanwhile, Terence Kwok, the founder of Humanity Protocol, which uses ZK systems within its ecosystem, described ZK’s current state as “promising and evolving.” Kwok expressed optimism toward ZK’s role in shaping a more secure, private and decentralized environments.\nKwok added that there are ongoing research and development efforts that aim to address ZK’s limitations and expand its applicability.\n“With innovations on the horizon, such as improved scalability and usability, ZK technology holds immense potential for further adoption across diverse domains,” Kwok added.\nWhy people should care about ZK\nMeissner pointed out that blockchains are transparent by principle. However, the executive also noted that publicly visible transactions may not be appropriate for all use cases.\nHe said that any interaction between two parties that may not fully trust each other might require ZK technology to “verify certain credentials without revealing sensitive details to enable trustless transactions.”\nRelated: Ernst & Young taps ZK-proofs on Ethereum to automate contracts\nMeanwhile, Lilic gave examples of why people should care about ZK technology. The executive said the basic idea is “proving that you know something without disclosing what it is.”\nLilic said that a potential use case for this technology lies in car rentals using a blockchain system with crypto payments integrated. The ZK director said that if people wanted to rent a car, a blockchain system might not be optimal if it would show a person’s identity documents to others.\n“You’re not going to use a blockchain system to rent that car if it means your license and your identity documents are on-chain forever for everyone to see. Okay? It’s just not worth it.”\nHowever, Lilic said that with ZK, people can simply go into the car rental shop and generate proof on their device that they have a valid license and meet the requirements for people who can drive a car.\n“And instead of giving them your license, you simply share proof that you have a license. And it’s valid. And these attributes are valid,” Lilic added.\nWeb3 scalability relies on ZK\nApart from these, Kwok recognized that ZK technology is crucial for Web3 as the industry continues to empower individuals with control over their personal information. Kwok said:\n“In a time where data breaches and privacy violations are all too common, ZK technology serves as a shield, allowing individuals to assert their identity and authenticate transactions without exposing sensitive details.”\nKwok believes that users should try to understand the concept behind ZK as it will allow them to make more informed decisions about the Web3 applications they use and share their data with.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-30","tags":["#Blockchain","#Privacy","#Adoption","#zk-STARK"],"author":"by Ezra Reguerra","category":null}