{"id":"725e4814-12df-462e-b0c2-2ba0d2ce14cf","article_link":"https://cointelegraph.com/news/chainlink-co-founder-expects-more-crypto-etfs-token2049","website_source":"Cointelegraph","article_type":"News Article","summary":"Chainlink co-founder Sergey Nazarov believes the crypto space will “keep pushing the limits” of what’s possible.","title":"Chainlink co-founder expects more coins to have ETFs — Token2049","detailed_content":"With the crypto space looking for the next narrative to power it higher, Sergey Nazarov, the co-founder of blockchain oracle platform Chainlink, shared some of his ideas on what might be next for crypto. \nIn an interview with Cointelegraph at the Token2049 event in Dubai, Nazarov shared how the crypto exchange-traded fund (ETF) space could develop and what could spur further mainstream adoption for Web3 and digital assets.\nCointelegraph reporter Ezra Reguerra with Chainlink’s Sergey Nazarov at the Token2049 event. Source: Cointelegraph\nAccording to Nazarov, with Bitcoin\nBTC\n$63,026\nETFs being approved, the crypto space could expect more ETFs of other coins and tokens. The executive highlighted that beyond BTC and Ether\nETH\n$3,032\n, other tokens have the potential to get approved for their own ETF. Nazarov explained:\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“I think what’s next is more ETFs about coins other than Bitcoin and Ethereum. So, I think the ETF dynamic is going to continue during this year and just grow and grow and grow.”\nFurthermore, the executive also explained how tokenized real-world assets (RWA) may be generated by Web3 companies and banks in the near future. The executive believes that the Web3 world will further converge with traditional finance through RWA. \n“Eventually, I expect the Web3 assets to be bought by the banks and the bank assets to be bought by the Web3 protocols for various reasons why they would want each other’s assets.”\nThe executive expects these things to happen in three to four years.\nRelated: Crypto community triumphs: Token2049 attendees brave Dubai storms\nNazarov also explained that crypto needs to improve its usability to achieve wider mainstream adoption. “I think the usability of crypto still has a long way to go,” he said.\nThe executive added that user experience is “nowhere near what it needs to be” and that there’s still a lot of work to be done in that aspect.\nThe Chainlink co-founder also shared four main pillars that need to be addressed to spur further adoption into the mainstream. He said:\n“I would say the usability, the scalability, the connectivity and the privacy are the four main pillars of what I look at the crypto industry when I think about how it is developing.”\nNazarov explained that the space is moving closer to these goals and will “keep pushing the limits on what’s possible.”\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExplore more articles like this\nSubscribe to the Cointelegraph Research Newsletter\nSelect the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays\nSubscribe","creation_date":"2024-04-20","tags":["#Blockchain","#Event","#Adoption","#Chainlink"],"author":"by Ezra Reguerra","category":null}