{"id":"726ee13e-a770-4513-96df-7068ce7134d9","article_link":"https://cointelegraph.com/news/coinbase-coin-stock-price-plummets-undervalued-base-ethereum-layer-2-blockchain","website_source":"Cointelegraph","article_type":"Tweet","summary":"Crypto analyst Will Clemente believes Coinbase is “the biggest kind of venture style bet in public markets” since Tesla.","title":"Coinbase shares slump, but Base revenue signals it’s undervalued — Analyst","detailed_content":"Coinbase (COIN) shares have plummeted 16% over the past five days, mirroring broader volatility in the crypto and stock markets, though one analyst suggests that investors may not be seeing the potential buying opportunity.\n“The street isn’t really pricing in the crypto native revenue that I think a lot of the crypto natives understand,” crypto analyst Will Clemente said in a recent Unchained Crypto podcast.\n“I think Coinbase is the biggest kind of venture-style bet in public markets since maybe Tesla about five years ago,” Clemente added.\nClemente claimed that traditional investors still view Coinbase “purely as an exchange” despite it making many changes to its business structure over the past 12 months.\n“Throughout the bear market, they made a lot of strategic pivots to shift toward what I’m calling a crypto super app,” he declared.\nIn particular, he noted Coinbase’s Ethereum layer-2 network, Base, which now has a total value locked (TVL) of $5.35 billion and oversees 30.81 daily transactions per second.\n“Over the last 30 days, Base has done $30 million of top-line revenue for Coinbase just based on the sequencer fees, which annualizes out to like $360 million a year,” he explained while suggesting that traditional investors are overlooking the significant activity taking place on-chain.\n“The street doesn’t even know what Base is, and they’re definitely not extrapolating out the potential of a ton of activity taking place there and the sequencer fees that Coinbase may benefit from that.”\nAt the time of publication, COIN is currently trading at $218.08, down almost 16% over the past five days, per Google Finance data.\nCOIN has plummeted 15.96% over the past five days. Source: Google Finance\nCoinbase is expected to release its earnings report for the first quarter of 2024 in the next few weeks.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nOver the past five days, the S&P 500 is down 3.12%, while Bitcoin\nBTC\n$63,002\nhas declined approximately 4.67%.\nMeanwhile, more downside is expected for both markets as geopolitical tensions escalate in the Middle East after there were reports of explosions at Isfahan airport in central Iran.\nRelated: Coinbase cleared in lawsuit over crypto transactions\nThe news comes amid Cathie Wood’s ARK Invest continuing its selling spree of COIN.\nOn April 15, it was reported that ARK sold 3,689 COIN shares worth approximately $824,000.\nIt was only a month ago that ARK sold off a staggering amount of the stock amid its price seeing a year-to-date increase at the time of approximately 54%.\nOn March 21, Cointelegraph reported that ARK sold 199,526 Coinbase shares from its exchange-traded funds.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-19","tags":["#Blockchain","#Coinbase","#Adoption","#Cryptocurrency Exchange","#Stocks"],"author":"by Ciaran Lyons","category":null}