{"id":"728d8596-e26e-48e9-9a45-029676d45d24","article_link":"https://www.wired.com/sponsored/story/web3-future-internet/","website_source":"Wired","article_type":"News Article","summary":"The Web3 faithful believe that the next era of online life will be built on blockchain. The truth is probably more nuanced…","title":"Is Web3 Really the Future of the Internet?","detailed_content":"THE HYPE AROUND WEB3 IS WILD. Last year, investors pumped $23.7bn into startups associated with the idea, while Google search traffic for the term jumped by almost 10,000 percent. To some, this supposed ‘next version of the web’ promises not only a new era of online life, but nothing less than a new stage in the evolution of capitalism. “We're witnessing the birth of a new economic system,” wrote Artfunder founder Salvatore Delle Palme in his December blog post ‘On The Promise Of Web3’. “Its features and tenets are just now being devised and refined in transparent ways by millions of people around the world. Everyone is welcome to participate.”\nWIRED Consulting brings WIRED's network and knowledge to businesses and thought leaders. It is an independent entity separate from WIRED's newsroom. For more information visit consulting.wired.co.uk\nNot everyone has accepted the invitation. Some of the biggest names in technology have publicly poured scorn on Web3. Twitter co-founder Jack Dorsey dismissed it as a venture capitalist ploy. Elon Musk said it was just a marketing buzzword. Computer scientists and software developers have written eviscerating, widely shared essays with titles like ‘The Web3 Fraud’, ‘Web3 Is Bullshit’ and ‘Web3 Is A Stupid Idea’.\nSo what exactly is Web3, and is it the future? A January survey of 1,500 US consumers found that 54 percent had never even heard of it.\nWell, here’s the pitch. Web 1.0 was the first phase of the World Wide Web. This was the age of GeoCities, Netscape and bright blue hyperlinks. Webpages were static, interaction was minimal, and the online world was effectively a giant digital library – with added GIFs. This lasted until the mid-2000s when Web 2.0 came along. Suddenly, to publish something on the internet, you no longer needed to make a website and find someone to host it – and thus the web’s content consumers were now also its content creators. Blogs, comments, updates, posts, tweets and likes were everywhere. Where once you might have looked at Encarta online, you now searched Wikipedia – and perhaps also contributed to an entry. To quote Tim O’Reilly, the influential technologist who popularised the term Web 2.0 in 2004, this was “the web as platform”.\nHowever, some spied a problem. While Web 1.0 felt open and community-driven, Web 2.0 – which remains the web we have today – is dominated by a small number of companies. To critics, these tech giants account for a troubling share of internet use and global computing that focusses undue power in their hands. What they see as an unsettling business model also prevails: a devil’s bargain whereby users give up their data in exchange for free access to online services. Since the platforms control that data, you can’t easily take it with you if you wish to use a competitor. Oh, and all the clever things you post on social media? They don’t necessarily make a penny for you – but they make the platforms rich. In Web 2.0, we are the product.\nBut fear not, say the acolytes of Web3 (as they like to style it). In the next era we are going to fix all that. How? As if you needed to ask: blockchain.\nA QUICK OVERVIEW. Blockchain is the technology behind Bitcoin and other cryptocurrencies. Simply put, it is an exhaustive record of all the transactions that happen within a network but it isn’t held on one central computer. Instead, all of the computers in that network have a complete copy of the record. New transactions are only added to the blockchain when a set threshold of computers agree they’re valid. That makes it theoretically tamper-proof and, if a government or hacker shuts down one computer, no bother: there are copies on countless other machines. A consequence of this model is that you don’t need a trusted third party to facilitate an interaction or grant permission for it to occur. Contrast that to paying a bill from your regular current account – the banks, and the regulators that govern them, mediate the whole process. With blockchain, power is decentralised, spread among the users of the network.\nTo those who believe that tech is too centralised, blockchains seem ideally suited to remake it. This is because they aren’t just about peer-to-peer currency. They can also run code. A blockchain like Ethereum, for instance, not only sustains the Ether cryptocurrency but also provides the means to run decentralised applications (known as dApps) or create decentralised business structures (Decentralised Autonomous Organisations, or DAOs). Unlike a regular app, a dApp doesn't require a central entity facilitating interactions (and typically taking a slice of the pie in return). Instead, users are connected directly with one another over a blockchain. Activities are automated by “smart contracts”: decentralised computer programs that also run on the blockchain. Ideally, the whole thing would be open-source, although in practice many dApps don't yet meet this criterion. But anything from a game to a social network could theoretically be a dApp. \nAn array of dApps already exist. LooksRare, for example, is a marketplace for buying NFTs that was built on the Ethereum blockchain. Right now, however, most are financial applications such as currency exchanges or lending platforms. That’s because “finance is just the area where centralised technology sucks the most”, Ethereum co-founder Vitalik Buterin told the Ethereum Community Conference in Paris last year. “I can send you a centralised email, and you will get it within one second. And sure, maybe various intelligence agencies will read it, but… at least you can read it one second from now. International bank wires do not work that way.”\nThe business models for dApps aren’t about gathering and selling data. Instead, they are typically predicated on “crypto tokens” (effectively a form of cryptocurrency). People who contribute to the dApp – perhaps by creating popular content or adding to its code – could be rewarded in these tokens. Users might also be able to acquire tokens either through buying them or via “staking” or “yield farming” – essentially, parking their tokens on the platform and earning interest on them. Ideally, these tokens would play into a governance model that furnishes holders with voting rights over the direction of the project. \nOf course, there has to be some other reason to consider these tokens valuable, so the dApp will come up with a way to create demand for them. If the dApp is a game, perhaps the tokens can buy you new weapons for your character, or if it’s a social network maybe the tokens can be exchanged for advertising space. The dApp’s value is thus distributed among its users rather than channelled towards a CEO. Theory goes, the desire to accumulate tokens and see them improve in value means that everyone is working in each others’ best interests.\nCrucially, because all user data sits on a blockchain – and individual users own and control their own data – they can take it with them if they wish to migrate from one dApp to another. In Web3, say proponents, we are no longer exploited.\nIn the case of a DAO, the business takes the form of a cooperative, owned by its members. There is no executive board wielding power, as all of the entity’s operations and transactions are managed by software: everything happens automatically according to predefined rules. dApps that aim to be truly decentralised are therefore usually managed by DAOs.\nThe DAO's software yet again takes the form of smart contracts. The only way their rules can be changed is by a vote – voting being the mechanism through which all human decision-making takes place. Again, crypto tokens are key. Typically, those who invest in the DAO receive tokens specific to the project, and those who carry out work for the DAO are also rewarded in these tokens. Those with more tokens have greater voting power. “A DAO is a group of people that come together around a shared community and a shared resource,” is how the software engineer Jonah Erlich explained it to The Verge in December. “The most fun description I’ve heard is that a DAO is a group chat with a bank account.” In November 2021, a DAO called ConstitutionDAO – in which Erlich had a key role – raised $47m to buy an original copy of the US Constitution at Sotheby’s. It failed, but only because it was outbid. \n“I think this is as big as it gets,” Nitin Sharma, general partner and global Web3 lead at the venture capital firm Antler, tells WIRED Consulting. “We're talking about essentially a completely new internet. It's not a sector. It's not a segment. It's really a layer. So it's essentially talking about how in five, 10, 20 years, everything we know about the internet could be different.”\nTHE IDEA OF WEB3 ISN'T NEW. The first person to use the term in the current sense was Ethereum co-founder Gavin Wood back in 2014. Writing on his blog, Wood argued the Edward Snowden leaks made clear that “entrusting our information to organisations in general is a fundamentally broken model”. He came up with the notion of Web3 as a possible solution, although – in light of Snowden – his vision for it also put an anonymous messaging system front and centre.\nIn late 2021 the term was rediscovered by Silicon Valley and became its buzzword of the moment, thanks in large part to the influential venture capital firm Andreessen Horowitz. In October 2021, Chris Dixon, who runs its crypto investments, wrote a Twitter thread that went viral. “Web 3 is the internet owned by the builders and users, orchestrated with tokens,” he tweeted. “Before Web 3, users and builders had to choose between the limited functionality of Web 1 or the corporate, centralized model of Web 2. Web 3 offers a new way that combines the best aspects of the previous eras. It’s very early in this movement and a great time to get involved.” And get involved they did. Now you can’t move for “Web3 startups” – and seemingly any crypto-oriented idea or any new vision of how we’ll use the internet of tomorrow gets labelled “Web3”. Case in point: the so-called metaverse. “The metaverse” typically refers to a hypothetical network of virtual worlds – these don’t necessarily have to be built on a blockchain. But in some quarters the word “metaverse” has become almost interchangeable with “Web3”.\nCan you say bubble? Many have. More cynical commentators see the whole thing as a ruse to create demand for cryptocurrency – a way of bringing more people into the great crypto Ponzi scheme. Others have a more sober take: for all the excitement, Web3 does not actually exist. As Elon Musk put it in a tweet: “Has anyone seen web3? I can’t find it.” Sure, we have plenty of cryptocurrencies and NFTs; we even a multitude of dApps and DAOs – but the Web3 promise is that these will attract such overwhelming numbers of users that they will usher in a new phase of digital life. The term “Web 2.0” described a shift that had already happened, but Web3 is merely a forecast – and a bullish one at that. In 2021, Meta, Amazon, Netflix and Alphabet reported combined annual revenues of $876bn, up 29 percent year-on-year. With the resources and expertise at these companies’ disposal, what are the chances that a new wave of community-driven projects will gain such force they will displace the old guard? The open source movement has shown the limitations of rule-by-crowd – progress tends to be sluggish, and the user experience often not up to muster.There’s also a good reason that centralised platforms emerged in the first place, as articulated forcefully by Moxie Marlinspike, founder of the messaging app Signal, in a January blog post. “In my mind the explanation is pretty simple: people don’t want to run their own servers, and never will…I don’t think this can be emphasized enough.” In other words, truly distributed infrastructure – which is what an ideal Web3 would depend on – may be a non-starter. And that’s before we get to the debates around the environmental costs and computational inefficiencies of such a setup. As the software engineer Stephen Diehl put it on his blog: “The Ethereum virtual machine has the equivalent computational power of an Atari 2600 from the 1970s except it runs on casino chips that cost $500 a pop and every few minutes we have to reload it like a slot machine to buy a few more cycles. That anyone could consider this to be the computational backbone to the new global internet is beyond laughable.” We asked him: does he not think the natural course of technological advance will ultimately address these shortcomings? After all, anyone living in the 1960s would have been wrong to write off a personal computing revolution simply because of the size and cost of existing computers. “I don't think this is just like the early internet or somehow the march of progress will somehow fix it,” he tells WIRED Consulting. “You solve this problem by doing one thing – by centralising it – at which point you've destroyed the entire premise of Web3.”\nBut let’s put those issues to one side for a moment. Let’s imagine that Web3 materialises and the blockchain becomes the online master spirit. Would it actually cure the web’s ills – or, as many fear, would the lack of central governance lead to a rise in hate speech, inappropriate content and criminal activity? There’s a site called Web3IsGoingJustGreat.com which chronicles the crises and follies of the crypto world. At the bottom is a counter that shows “a running total of the amount of money lost so far to grifts and scams”. When we last visited, the number was $10.896bn. Lavinia Osbourne, founder of Women In Blockchain Talks and creator of the Crypto Kweens NFT marketplace, tells WIRED Consulting that the answer will be legislation. “You don't have the same moderating element, but this is why regulation and compliance come into place,” she says. “Decentralisation is not the devil – it is how people choose to use it, just like the internet, just like the Bible.” Right now, how those laws would work is a matter of conjecture. “They don’t exist yet because the infrastructure’s not there yet. Until you have the problem, you can't create a solution to it. If you try and preempt it, then that means sometimes you can be a little bit too heavy handed.”\nDetractors also question the premise that the Web3 model would necessarily lead to decentralisation. Why shouldn’t it merely lead to concentrations of power elsewhere? The Wall Street Journal reports that 0.01 percent of Bitcoin users control 27 percent of all Bitcoin in circulation – would ownership of a DAO necessarily be any different? And when organisations such as cryptocurrency exchanges are so important in the crypto ecosystem, wouldn’t they just become the new tech giants? Certainly the billions of dollars in venture capital flows driving the current Web3 mania seem incompatible with the idealism: VCs tend to want the enterprises they back to end up making a lot of money. Hence Twitter founder Jack Dorsey’s broadside in December. “You don’t own ‘web3.’ The VCs and their LPs do,” he tweeted. “It will never escape their incentives. It’s ultimately a centralized entity with a different label. Know what you’re getting into…”Chris Dixon, the Andreessen Horowitz VC who popularised the term, responded:\n“first they ignore you\nthen they laugh at you\nthen they fight you 👈 we are here\nthen you win”\nIT'S TELLING HOW VIGOROUS the debates about Web3 can get. Partly that’s because to talk about it is a discussion about politics as much as technology.\nThe early web was wrapped up in a profound conviction that it could mend humanity. The zeitgeist was captured neatly by the digital-rights activist John Perry Barlow in his 1996 paper “A Declaration Of The Independence Of Cyberspace”:\n“We are creating a world that all may enter without privilege or prejudice accorded by race, economic power, military force, or station of birth. We are creating a world where anyone, anywhere may express his or her beliefs, no matter how singular, without fear of being coerced into silence or conformity…We will create a civilization of the Mind in Cyberspace. May it be more humane and fair than the world your governments have made before.”\nIn the years that followed, the prevailing tone of the tech world shifted away from that kind of utopianism. But Web3 has spurred a revival; to true believers, the web once again holds the promise of salvation. And that element of faith – faith that Web3 will happen, faith that it will restore digital life to its prelapsarian state – perhaps offers a useful way to consider our original question: is Web3 the future?\nLike most doctrines, it surely contains a kernel of truth. Whatever your views on it, this Web3 moment at the very least signals widespread discontent with the current state of the internet – and brings home how pressing it is that this must be tackled. “But these are not technical problems, these are problems of business design and policy,” the futurist Gerd Leonhard tells WIRED Consulting. In his view, the aims of Web3 – privacy, encryption, bringing power back to users – are therefore not going to be achieved by introducing “some miraculous technology”. He expects that meaningful solutions will come in more conventional form than blockchains. These might be new regulations that insist on making user data portable, say, or simply the proliferation of business models that don’t incentivise companies to watch and track our behaviour online. “We're going to start paying for things like search engines and social media sites,” he says. “This payment-based approach is going to really make a very big difference. The model of surveillance is dying, because we are moving into a world where in 2030, we're going to have roughly nine billion people on the internet. Today it’s 4.6 [billion]. So you can only imagine that if we perfect surveillance and tracking, then we're gonna live in a total panopticon. That's just not going to be good for anybody.”\nWe would venture that another truth of Web3 is that blockchains aren’t going away. So, might “Web3” ideas – digital currencies, NFTs, dApps – gain further traction while centralised internet businesses continue to exist? That doesn’t seem like a stretch. Clearly, the notion that the internet has distinct “versions” is an artificial construct.Perhaps, then, a more useful question than whether Web3 is the future is: which blockchain-based projects are the ones that really matter? In his 2005 essay “What Is Web 2.0” Tim O’Reilly reflected on the dotcom bust, and how it sifted the wheat from the chaff among early internet companies. When bubbles burst, he argued, “the pretenders are given the bum's rush, the real success stories show their strength, and there begins to be an understanding of what separates one from the other.” If the crypto economy weathered a similar shakeout, which “Web3” ideas would live on?\nChances are, the survivors would offer something that wouldn’t be as effective in non-blockchain form, and which would present the user with an overwhelmingly good reason to use them instead of more traditional alternatives. The successful projects are also likely to be the ones where the technicalities fade into the background, and notions of blockchains are as far from the user's mind as HTML or DNS. The user doesn't care if an app's ‘decentralised’ – they just want it to work.\nIf such apps do materialise, they may do things we can't conceive of yet, in the same way as somebody using a home computer in the 1980s could not have imagined what problems that tool would end up solving. We might think we know what Web3 or Web 2.5 or Web 10 – or whatever you want to call it – will look like. But nothing ages as fast as the future.\nFor more information about WIRED Consulting, visit consulting.wired.co.uk\nThis article was originally published by WIRED UK","creation_date":"2022-10-18","tags":["","WIRED CONSULTING"],"author":"BY CHARLIE BURTON","category":null}