{"id":"73693dde-7f01-4a49-8e99-2a82f86a08c4","article_link":"https://cointelegraph.com/news/arkham-accuses-competitors-spreading-false-rumors-amid-token-selloff","website_source":"Cointelegraph","article_type":"Tweet","summary":"The company alleged that “two of our competitors are spreading false rumors about ARKM movements in an attempt to create FUD.”","title":"Arkham accuses competitors of spreading ‘false rumors’ amid token sell-off","detailed_content":"Blockchain analytics firm Arkham has accused its fellow competitors of “spreading false rumors” in an effort to create fear, uncertainty and doubt (FUD) after questions arose regarding the firm’s transfer of its native ARKM tokens. \nAlthough Arkham did not name the dissenting competitors, just a few days prior, a post published by fellow blockchain analytics firm Nansen claimed that Arkham “moved over 25.2m ARKM (>$56m) over the past 2 days” to unlabeled wallets and cryptocurrency exchange Binance. “Let’s take a look at what’s going on because they won’t show you,” wrote Nansen, noting that the ARKM was sent to different Binance addresses with no prior activity, as well as to a fresh wallet address. \nMeanwhile, Arkham replied in its April 9 post that the ARKM movements “are of unlocked tokens as per the published tokenomics.” In its first transfer, 20 million ARKM were sent to a novel wallet address as per an approved protocol proposal titled “Deploy ARKM-secured Chainlink DON for Intel Verification; Add Support for Solana; Establish Treasury Pool I; Implement Bounty Joining.” At the same time, Arkham stated that 5 million ARKM sent from its ecosystem fund were unlocked as per its tokenomics.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nWhen questioned regarding the discrepancy between the number of tokens in its vesting wallets versus the stated number in its tokenomics paper, Arkham explained that vesting wallets will be “deployed overtime” as it receives addresses from non-crypto investors and as new hires are made. “There have been no early unlocks and all team and investor tokens remain fully locked and trackable using the top holders feature on our platform,” the firm stated.\nAt the time of publication, ARKM’s fully diluted market cap is $2.047 billion. Despite a spectacular run-up over the past year, in part due to hype surrounding the firm’s use of artificial intelligence in its blockchain analytics, ARKM has lost nearly 40% of its value in the past month. The firm received an undisclosed investment sum from Binance Labs last November. \nRelated: Arkham Intelligence identifies MicroStrategy Bitcoin holdings pooled with Fidelity\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Adoption","#DeFi"],"author":"by Zhiyuan Sun","category":null}