{"id":"73cbf814-59ce-4b16-b058-a29c51e7847e","article_link":"https://www.wired.com/story/we-tried-vertus-web3-phone-it-scared-us/","website_source":"Wired","article_type":"News Article","summary":"The luxury phone maker refuses to die. We tested its new Metavertu handset and were led down a rabbit hole of legal disputes and security concerns.","title":"We Tried Vertu’s ‘Web3’ Phone. It Scared Us","detailed_content":"WHY WON’T VERTU die? It’s the cockroach of phone companies. The once huge LG made its smartphone exit in 2021. HTC and Sony are just about clinging on by their fingertips. And yet the ultra-niche Vertu just recently announced a phone as bold and bombastic as anything it has made to date: the Metavertu. \nIt starts at £2,787 ($3,330), then tops out at a mind-boggling £34,534 ($41,262) for the borderline offensive Himalaya Alligator Leather 18K Gold & Diamond model. And that may not even be the most eye-opening part: Vertu markets this thing as the “world’s first Web3 phone,” a claim that would set off alarm bells had they not already been ringing since first sight of the Vertu name.\nA History of Violence\nWhy? Over the years, Vertu has been responsible for some of the most tasteless and gaudy phones to roll off a production line. However, it started off as a Nokia side brand in 1998. Those early years gave us some undeniably striking phones, like the relatively elegant Vertu Signature from 2003. \nFEATURED VIDEO\nScam Fighters Answer Scam Questions From Twitter\nBy 2012, Nokia’s phone market share had dropped from heights of 50.8 percent to under 5 percent. Vertu was sold to a private equity group, then bounced between owners from Turkey and China. This period saw a handful of handset designs that could be compared to handbags that hang around season after season in TJ Maxx stores (“TK Maxx” if you’re outside of the US). There was a great deal of rampantly embossed leather and contours. \nAlmost all Vertu phones have been criticized for their outdated tech and sky-high pricing. They are, and always have been, phones for people with more money than taste or sense. \nVertu's Metavertu “Alligator Leather Flame Red”—yours for £5,408.\nPHOTOGRAPH: VERTU\nHowever, the Vertu Metavertu feels quite different. It is a legit high-performance phone, and while the base design is pedestrian and some of its specs are slightly past their prime, like the Snapdragon 8 Gen 1 processor, components available at the phone’s October 2022 launch were not drastically better. The MetaVertu has a bold OLED screen and a responsive triple rear cameras that included a powerful 5x zoom. Its stereo speakers are loud, and just lack a little of the bass impact of the very best. My Metavertu review sample has 1 TB of storage and an almost over-the-top 18 GB of DDR5 RAM. \nIt even comes with a tempered glass screen protector attached, perfectly matching the slick curved glass of the display—even top-end phones use basic plastic protectors, if they have one at all. \nSurprisingly, this feels like a true flagship Android in a way no Vertu phone really has since the pre-iPhone era. But to look at Vertu as a company in 2023, it all makes very little sense. \nVertu’s Not-So-Secret Base\nThe company address that Vertu lists on its homepage is that of a single room on the fifth floor of an office block in Kowloon, Hong Kong. Search for it online and you’ll also find an accountancy firm, a furniture exporter, an advertising agency, and a toy company all registered to the same “room 505.” \nBack in the old days, one of the key selling points of a Vertu phone was that it was “made in England.” The handsets were assembled at a small factory in Church Crookam, a village next to Fleet, in Hampshire, about 90 minutes’ drive from London. However, that factory was demolished in 2020 to make way for a supermarket. According to Google Street View, you’ll find Aldi and Home Bargains in the spot where Vertu’s old headquarters stood.\nVertu’s days at that factory did not end well. “Here was a tech business where one day their landlords came into the HQ—the factory you mentioned—and took away the toilet rolls, as they had not paid their bills,” says a source who worked with the brand for many years. “The business collapsed, owing £65 million ($80 million) and laying off 200 staff,” they told us. WIRED was unable to independently verify these numbers; however, at the time, the BBC and Daily Telegraph newspaper reported that the money Vertu owed was even higher, at £128 million. \nWhile Vertu may still have “Vertu England” on its Facebook posts, the brand has nothing to do with the UK anymore, besides trying to flog phones to the occasional rich person there. \nBut if Vertu went bankrupt rather catastrophically in 2017, how is it alive today, with the same Godin Holdings figure, Gary Chen (or Chen Gang), at its head giving the new phone's launch presentation in 2022?\nThe Hidden Hand Behind Metavertu\nThe Metavertu has at least 10 references to ZTE in the phone’s hardware tags.\nPHOTOGRAPH: VERTU\nA closer look at the phone reveals some clues. Hardware data scraper app Device Info uncovered at least 10 references to ZTE in the phone’s hardware tags—the cameras, the battery, the “builder” tag, and more.ZTE is a phone manufacturer known for both its own phones and ODM (Original Design Manufacturer) models, where a brand partners with a manufacturer in order to make use of their existing factories and supply chains. You provide the design specifics, they crank out the units. This was how phone networks like Vodafone made own-brand handsets. If the handset is made by ZTE, perhaps this is the only way making the Metavertu could have been viable, particularly as a smartphone likely to sell in tiny numbers?\n“Vertu has changed hands lots of over the past decade, but is still being run by a bunch of folks based out of Hong Kong, very close to the Chinese supply chain,” says Neil Shah of Counterpoint Research. “These folks with renewed focus are rebadging existing models from brands—ZTE, for example—with luxury materials and advanced hardware and software.”\nTake another look at the Metavertu with this in mind, and you’ll find it looks very similar to the ZTE Nubia Z40 Pro from early 2022. They have eerily similar camera sensors, lens and flash placement, processor, and display specs, and even share a red accented power button on the side. From the front they look nearly identical.\nSlap an expensive carbon fiber, ceramic, and sapphire backplate on the £500 to £800 Nubia Z40 Pro, and you’ll get a Metavertu, more or less. And if this Basic Carbon Fiber £2,915 ($3,592) design doesn’t do it for you—looking, as it does, a little like an Asus ROG gaming phone—why not upgrade to the red alligator leather version for a mere £6,073 ($7,464)?\nThe Metavertu is no ordinary phone, for sure, but it would seem someone else has had a hand in the “creating extraordinary” factor you’ll see mentioned on Vertu's self-aggrandizing lock-screen images.\nIt’s All In the Web3\nThis all leaves Vertu’s software as potentially the more substantive draw of the Metavertu experience. And given it is supposedly the “world’s first Web3 phone,” that makes sense. “The positioning is ‘geek luxury’—completely different versus the ‘fashion luxury’ of older Vertu phones,” says Shah.\nClassic Vertu models came with a concierge service, which was outsourced to a third-party company. The Metavertu still has a concierge of sorts, but this time it’s in the shape of hotel, air ticket, and restaurant reservation forms that quite literally link you to a Google Sheets page inside a Vertu Life app.\nThe process is much like booking directly on a website for yourself, but is sure to put hackles up about privacy and security. Or at least it should. Alternatively, you can call the “concierge line” phone number, but this is exactly the same generic customer service number found published on Vertu’s own website. Luxury service, indeed.\nWe Offer No Guarantees\nStill, the concierge service is old news. It’s not Web3; it’s not even Web 2.0. But what is a Web3 phone? Many of you may be wondering what Web3 even means. \nThe term Web3 refers to technologies such as cryptocurrencies, ideas of turning video games into commodities marketplaces (more than they currently are), and pretty much anything to do with the blockchain. Now, Web3 has interesting potential and is a honeypot for venture capital investment, but is also replete with opportunists ready and willing to exploit the credulous.This VC clientele chimes with Vertu’s approach. “The target market seems to be tech investors, investment bankers, crypto buffs, and so forth,” says Shah of the Metavertu’s seemingly ideal customer. \nVertu owner Gary Chen played this angle hard at the phone’s London launch at the end of last year, which was attended by many crypto enthusiasts and fashion types, and barely any technology reporters. He spouted seemingly-endless meandering twaddle about Web3 while at one point even misrepresented the phone itself. Contrary to the company head’s claims, for example, the Metavertu does have Google Play access.\nA Web3 Reality\nWeb3 lives in the Metavertu as a stack of custom apps that range from the prosaic to the bizarre. They all sit in a password-protected Meta Space base app, which claims to be encrypted. You input a password to enter it, like a “secure”-file-store app you may have tried before. \nInside, there’s a place to store your crypto wallet details, called Value. Vbox offers cloud storage. Dappstore is an app store that is, at the time of writing, empty aside from Vertu’s own stuff and a few web shortcuts posing as apps. Venture is a custom web browser whose homepage is stacked with crypto links, and VShot is a camera app that lets you “mint” up to five images a day.\nThis last one is sure to pick up some attention. Minting typically refers to the creation of an NFT. A phone that mints NFTs? That’s the dream (for some). However, while Vertu calls this an NFT camera, it appears to primarily be a way of proving copyright ownership by linking the file to a unique ID (DID). It’s not clear whether there’s any blockchain action going on here. \nWhy can’t we tell you definitively? Vertu demands you supply not just your real name and either your drivers license number or passport number to use Vshot, but a picture of its information page and a picture of you holding your ID. You’re left waiting up to five minutes with the load bar spinning before you’ll see this bizarre info request, too.\nIf this doesn’t make you worried, it should. Vertu’s terms of service claims this ID is required by the People’s Republic of China, and goes on to leave one with the impression that maybe you shouldn’t bet the bank on any “due diligence” from Vertu in checking the apps made available through the Dapp store, among other worrying clauses. The entire poorly written script doesn’t quite reach the levels of “if you use this software, you are on your own should something go wrong,” but let’s just say it is very different from the T+Cs pages you'd expect from any “normal\" app store. We’re certainly not in the Google Play Store anymore. \nNever before have I used a phone where I felt so unsafe, one that feels like it could be used to scam me—though, to be clear, I have no evidence that it is. This really is a Web3 phone, then, just perhaps not in the sense the aspiring crypto bros hoped for.If you’re about to dismiss this as anti-Web3 paranoia, just wait a minute. Right now at least two versions of Vertu exist online. There’s the Vertu that makes the Metavertu, based in Hong Kong and China, and Vertu AK France.\nVertu AK France accuses the current Chinese incarnation of Vertu of “massive accounting and financial fraud” on its website, and claims to be the “real” Vertu online while selling classic Vertu handsets that must have been manufactured years ago. \nVertu AK France is not your classic underdog, though. It is owned by Hakan Uzan, a man exiled from Turkey amid fraud investigations that led to 219 companies under the Uzan umbrella being seized, and his brother Cem Uzan being sentenced in absentia to 23 years in prison for racketeering. Members of the Uzan family have been living in France, having been granted political asylum. In 2021, Hakan and Cem Uzan attempted to sue Vodafone, Motorola, BlackRock, and other entities for a combined $68 billion for those assets seized almost two decades prior. \nThe Metavertu “Basic” Carbon Fiber handset and the flagship Himalaya Alligator Leather 18K Gold & Diamonds model, which costs £34,534.\nPHOTOGRAPH: VERTU\nWIRED contacted Vertu AK France in an attempt for clarification. Vertu AK France did not respond. We asked Vertu in Hong Kong to provide proof of ownership and explain how both it and Vertu AK France could claim to own the Vertu brand. In response, Vertu Hong Kong gave us documentation appearing to show that it has owned the trademark for the name “Vertu\" in more than 40 countries but notably not in France.\nThis leaves Vertu in the position where two companies are claiming ownership of the brand, each accusing the other of substantial fraud. \nMetavertu’s luxury facade is a fragile illusion, and the Vertu story just gets weirder the closer you look. As pleasant as the Metavertu is to use, we do not want to hand over our passport details just to use its questionable software features, and you shouldn’t either.","creation_date":"2023-02-25","tags":["","WEB3","PHONES","SMARTPHONES","GEAR","VIRTUAL REALITY"],"author":"BY ANDREW WILLIAMS","category":null}