{"id":"73ea9da4-f474-4182-beee-72b6dc832602","article_link":"https://medium.com/@joshgans/why-economists-dont-like-bitcoin-part-ii-8f0b0808916e","website_source":"Medium","article_type":"Blog Post","summary":"Let’s take a look at some good reasons","title":"Why Economists Don’t Like Bitcoin (Part II)","detailed_content":"Last week I documented and looked at the reasons why economists don’t like Bitcoin. After this week, it is safe to say that more and more people are with them. That said, as I argued, the reasons economists give for not liking Bitcoin don’t really stack up with their own usual ways of looking at things. Namely, it is not clear that it is driving illegal payments, its missing foundation makes it more like money, and in terms of wasting resources, economists usually look for market failures to evaluate that and, in the case of Bitcoin, it is unclear the market failures are there.Nonetheless, I left that discussion hanging in that I actually think there are some legitimate economic concerns about Bitcoin. But this requires us to look beyond the usual competitive markets framework and, instead, focus on one thing economists usually don’t focus on (irrational behaviour) and another thing they definitely do worry about (market power).In doing this, I am going to divide my analysis into two in order to answer the question of what economic service Bitcoin is providing. On the one hand, I will consider it as a store of value — digital gold if you will. On the other hand, I am going to characterise it as purely a game — a gambling game. Crypto enthusiasts aren’t going to like that. The reality is a mix of the two. It just serves my purpose to separate them out analytically as you will see. With that warning, let’s go to it and start by offending people as much as possible.Noah Smith wrote about the potential uses of Bitcoin. He considered four theories but, for some reason, however, he did not consider Bitcoin to be purely a gambling game. But to an economist, that is pretty much what it looks like. And games fall into the category of being potentially legitimate economic activity so it is an odd omission.To see Bitcoin has a game you have to strip away the surrounding language that it may be a payment instrument or a normal financial asset. (By the way, much of what we consider ‘normal’ financial assets trade in markets in ways that are very game-like too so this characterisation is not unique to cryptocurrency it is just that so many people want to view it as something more that they shy away from the obvious).The game is pretty simple and was first identified by John Maynard Keynes in the General Theory. You’ll have to excuse the 1936 sensibilities here but here is how Keynes described a common newspaper game:He found that this pretty much described the stock market. You put money in the market and you get more if you can correctly anticipate stocks that other investors will find attractive. Now part of that calculation may be best on what we often call ‘the fundamentals’ but that may just be a narrative. There is little reason why any old stock couldn’t be suddenly found and then become attractive — I’m looking at you GameStop.The fewer fundamentals there are to point to, the more likely it is going to be a pure gambling game. You aren’t guessing from a static set, however, but you are playing a game of timing — or more critically, a game of chicken.In the game frame, you put money into Bitcoin because you anticipate that others are going to do so and keep doing so. That causes the price to go up which is what players in the game expect. But the players also know that this process can’t go on forever. To ‘win’ at this game, you want to sell right as there are more people about to become sellers than buyers. There are plenty of people selling early — after all, without that the price can’t continue to go up. And there will be plenty of people who sell late. But you want to get to the peak. So each day, you make a calculation — “is today the day?” You read the tea leaves or more properly look at the mood of other players on Discord or Reddit. You always want to egg people on. There’s no sense in convincing anyone that it is time to sell. Hence, there is plenty of enthusiasm and even if things get bumpy those incentives remain. After all, if you have potentially held on too long, you want to convince others that things will bounce back.The thing is, playing a game is a legitimate economic activity. For electronic games (sans cryptocurrency) spending is in excess of $50 billion per year and growing. In the US alone, casino gambling tops $40 billion per annum. Those sound like small change compared to Bitcoin but this isn’t about market value — it is about how many dollars (on net) have been exchanged for Bitcoin. So for all we know it could be quite comparable. So lamenting Bitcoin is a little like lamenting Second Life. It’s not for everyone but that isn’t our call to make.Interestingly, the Bitcoin and crypto games get their own add ons. DeFi allows more complex trading strategies and hedging of various risks. NFTs allow you to speculate on off-shoot assets — each their own separate game of chicken — and each with their own narratives making them literally a digital beauty contest. All of this broadens the strategies and so adds to the complexity and, one presumes, potential enjoyment of it all.One reaction to this is that this might just be a ‘bad’ game. Some might argue that people could play a similar game without, say, all the electricity consumption. That may be true but one of the things that make Bitcoin work is that it is a global game free of regulation. It may not be able to get to that point without proof of work. And if there were a better game, there is nothing stopping someone from making it. (Of course, that is easier said than done and, as I will argue below, things aren’t quite as simple as that).More critically, it is a gambling game. Gambling, from casinos to financial markets, is regulated. They are regulated precisely because many people can be convinced that it is not a game but it is instead ‘investing.’ Thus, they are not aware of the zero-sum nature of it all. If people are not the fully rational, calculating agents that economists often assume, we want to regulate these games to protect people from themselves. We don’t want people to lose their savings. We don’t want to facilitate addictive behaviours. And we don’t want people to be vulnerable to fraudulent claims — and as I pointed out, the Bitcoin game is primed for claims without basis. Indeed, that can be the whole game. Thus, it is very important that people know when they are playing and understand the rules.Therefore, one reason economists don’t like Bitcoin is that it can be problematic when people are not fully rational. What to do about it is another matter but that is, at the very least, a basis for legitimate concern.Let’s now move to the other extreme interpretation that Bitcoin is a financial asset that acts as a store of value — that is, it is a digital version of gold (or at least the common idea of gold).I don’t want to get into the debate about whether Bitcoin (or indeed gold) is a good store of value (like being an inflation hedge or something). Noah Smith has doubts, Vitalik Buterin thinks in a broad way it may achieve that aim. The perspective I want to take is to presume it is functioning as a store of value and then evaluate what economic problems might emerge from that.There are two ways of thinking about storing value. One way is in terms of use. If you hoard toilet paper (as if *that* could ever happen), you are doing so because you have calculated your expected lifetime use of toilet paper and decided it is worth getting all of that shopping out of the way now rather than overtime. The point is that the reason you are doing that, storing rather than buying, is because of potential value in use.The other way is in terms of exchange. This could apply to toilet paper too but let me use a less messy example: gold. Gold has uses but it is a store of value because it is anticipated that you can use it to buy stuff you need in the future. So it has value in exchange. Of course, while you might normally think that something has to be useful to someone else to have value in exchange (like toilet paper), gold has the property that if enough people think it can be valuable in exchange, then it can be valuable in exchange for anything. So it is fungible. The problem with this value is that it relies more heavily on expectations and a kind of beauty contest like effect than simply value in use.The nature of these expectations supported store of value is that the more people you anticipate agreeing that it is a store of value, the better and, indeed, more valuable it is as a store of value. This means that any given candidate for digital gold has built into it a network effect. One consequence of this is that there is an equilibrium where no one values it. But at the same time there is an equilibrium where people value it.The critical challenge is that if people do value it, it may be difficult to shift them out of that equilibrium. Now that isn’t a problem if you are choosing between two equivalent things as potential stores of value. The fact that one wins out is OK because one was always going to win out.But what we want is for that store of value to be productively efficient. We want people to be storing stuff at the least possible cost. After all, if we all agree on what value is being stored, isn’t it better that we store it in a cheap thing if possible.The problem is that new ways of storing value might arise over time. For instance, it may be that proof of stake is a lower-cost store of value than proof of work. (This isn’t a given by the way.) But Bitcoin was a ‘first mover’ and so potentially has become a store of value ahead of other cryptocurrency innovations. Given this, how can we be assured that Bitcoin is now the most efficient use? If something else came along, would people switch?In economics language, the concern is that Bitcoin has monopoly power in that we cannot rely on competition to efficiently generate alternative stores of value given that expectations are somewhat ‘locked in.’ Hence, when economists say they are worried about the waste they should be saying they are worried about market power. What’s worse here is that there is no obvious regulatory way of dealing with any potential market power on the part of Bitcoin because no one is in charge.I should add that even this argument is suggestive rather than proven. People’s expectations are clearly not quite ‘locked in’ to Bitcoin. But they could easily get that way in the future. Then in twenty years, we might be asking whether it is the best system we could have and be frustrated that there is no way to answer that question let alone change the system if there is something better. That sort of situation makes economists nervous.Economists have been glib in their assessments of Bitcoin. There are actually legitimate economic concerns but they rely on consumer irrationality or market power arguments rather than simple distaste or even market failure. If economists are going to engage properly on their concerns, they need to articulate those concerns within standard and well-developed frameworks. At present, they look more like children saying “they just don’t like it” or conservative people saying “it’s not the way we do things.” That isn’t helping.","creation_date":"2022-05-16","tags":[],"author":"Joshua Gans","category":null}