{"id":"7403f8e8-c259-4692-9705-349df70affb4","article_link":"https://cointelegraph.com/news/us-senators-child-abuse-crypto-payment","website_source":"Cointelegraph","article_type":"News Article","summary":"Senators Elizabeth Warren and Bill Cassidy are asking federal agencies about their technical capacity to combat crypto payments in the sale of child abuse material.","title":"US senators target cryptocurrency use in child abuse trade","detailed_content":"A crackdown on individuals buying and selling child sexual abuse material (CSAM) using cryptocurrencies is underway in the United States.\nU.S. Senators Elizabeth Warren and Bill Cassidy want to ensure that federal agencies are fully equipped to track down crypto transactions linked to the sale of child abuse content.\nIn an effor to bring an end to CSAM, the Department of Justice (DOJ) and Department of Homeland Security (DHS) were asked to reveal their current technical capacities.\nThe senators cited a Chainalysis study from January 2024, which suggested an increase in the use of cryptocurrency in the illicit trade of CSAM.\nChainalysis found that sellers of child abuse materials are using “mixers” and “privacy coins” like Monero\nXMR\n$130\nto launder their profits and evade law enforcement.\nCSAM vendors’ usage of instant exchangers that allow for Monero conversion has increased significantly over the last few years. Source: Chainalysis\nWriting to Attorney General Merrick Garland and Secretary of Homeland Security Alejandro Mayorkas, the U.S. senators asked for the DOJ’s and DHS’s current capabilities to identify and prosecute these crimes.\n“Existing Anti-Money Laundering (AML) rules and law enforcement methods face challenges in effectively detecting and preventing these crimes.”\nThe letter contained six questions, three of which were aimed at gauging the federal agencies’ independent findings on cryptocurrency’s link to CSAM. The rest were to identify the need for new tools to identify and prosecute sellers and buyers.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe senators requested a response to the questions by May 10.\nRelated: Crypto users fooled by fake Elizabeth Warren letter proposing crypto tax\nThe DOJ’s current technical capacity to examine crypto transactions led to the indictment of cryptocurrency exchange KuCoin and two of its founders.\nOn March 26, the DOJ charged KuCoin and its two founders with “conspiring to operate an unlicensed money transmitting business” and violating the Bank Secrecy Act.\n“In failing to implement even basic Anti-Money Laundering policies, the defendants allowed KuCoin to operate in the shadows of the financial markets and be used as a haven for illicit money laundering.”\nAccording to the Justice Department, KuCoin received more than $5 billion and sent more than $4 billion of “suspicious and criminal funds.”\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-26","tags":["#Blockchain","#Payments","#Senate","#Sex","#Bitcoin Payments","#United States","#Regulation"],"author":"by Arijit Sarkar","category":null}