{"id":"75df30a5-4d66-465c-97e7-74fc9d530b38","article_link":"https://www.wired.com/story/gadget-lab-podcast-574/","website_source":"Wired","article_type":"News Article","summary":"This week on Gadget Lab, we do our best to break down the social media platform many Twitter users are flocking to.","title":"What You Should Know About Switching to Mastodon","detailed_content":"AMID ALL THE Twitter hubbub, the lesser known social site Mastodon has seen a surge of new users. Mastodon is a loosely connected network of individually run servers, which all play by their own rules and answer to their own moderators. It's a very different environment than Twitter. But even though Mastodon aims to be a new form of social media, it could be prone to the same troubles that have plagued the platforms that preceded it.\nThis week on Gadget Lab, WIRED senior editor of security Andrew Couts joins us to talk about the ins and outs of Mastodon, and whether something like the decentralized network can ever truly replace Twitter.\nShow Notes\nRead more about how Mastodon is handling the influx of users. And here's how to find your friends on Mastodon.\nRecommendations\nAndrew recommends Fi smart dog collars. Mike recommends So Much Things to Say: The Oral History of Bob Marley, by Roger Steffens. Lauren recommends the new season of the HBO show White Lotus.\nFEATURED VIDEO\nJames Hoffmann Answers Coffee Questions From Twitter\nAndrew Couts can be found on Twitter @AndrewCouts He's on Mastodon at @couts@mastodon.social. Lauren Goode is @LaurenGoode. Her Mastodon handle is @laurengoode@mastodon.social. Michael Calore is @snackfight. He is not on Mastodon yet. Bling the main hotline at @GadgetLab. The show is produced by Boone Ashworth (@booneashworth). Our theme music is by Solar Keys.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Gadget Lab podcast and our huge library of narrated articles.\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for Gadget Lab. If you use Android, you can find us in the Google Podcasts app just by tapping here. We’re on Spotify too. And in case you really need it, here's the RSS feed.\nTranscript\nLauren Goode: Mike.\nMichael Calore: Lauren.\nLauren Goode: Mike, are you on Mastodon?Michael Calore: Nope.\nLauren Goode: Do you think you will join Mastodon?\nMichael Calore: Maybe if there's a compelling community there. If there's a server for Swedish psych pop.\nLauren Goode: You are never going to live down Swedish psych pop. I think you mentioned that at a conference, in like a mixed crowd a few years ago, and now you're just Swedish psych pop guy.\nMichael Calore: I am perfectly happy with that.\nLauren Goode: I don't know if there's a Mastodon server for Swedish psych pop, but I am curious whether or not you think we could technically set one up in the time it takes to record this podcast.\nMichael Calore: Maybe.\nLauren Goode: Probably not.\nMichael Calore: I don't really know much about it.\nLauren Goode: Well, on the upside, someone is going to demystify Mastodon for us today.\nMichael Calore: Sweet. Let's do it.\n[Gadget Lab intro theme music plays]\nLauren Goode: Hi everyone. Welcome to Gadget Lab. I'm Lauren Goode. I'm a senior writer at WIRED.\nMichael Calore: And I'm Michael Calore. I'm a senior editor at WIRED.\nLauren Goode: We're also joined this week by WIRED senior editor Andrew Couts, who is coming to us from a hamlet in upstate New York.\nAndrew Couts: Hi, everybody.\nLauren Goode: I just wanted to say hamlet. Hey, Andrew. How many people live in this hamlet?\nAndrew Couts: 188.\nLauren Goode: Seriously?\nAndrew Couts: Yes.\nLauren Goode: That's incredible. Are you like mayor there?\nAndrew Couts: Nope, but I probably could be if I wanted to. I don't know if we even have a mayor. We have a board, but it's very small. It's quaint. It's nice.\nLauren Goode: I'm willing to bet that of everyone who lives in your hamlet, you have the most followers on Mastodon.\nAndrew Couts: That is probably true. I kind of hope it's true, because if it's not, then that means my neighbors are weirder than I think they are.\nLauren Goode: And you need to go friend them immediately. All right, well, we've definitely tipped off what we're talking about today. Right now, if you're active on any popular social media platform like Twitter or Facebook or Instagram, you're using a centralized social media app. What does this even mean? Basically, it means that one body or one corporation holds all the power over that network. It might also mean that you really experience one primary feed when you log on to the app, but in the first two extremely chaotic weeks of Elon Musk's ownership of Twitter, another narrative has emerged, one about decentralized social media apps. And one in particular, it's called Mastodon. Now Mastodon looks and feels a little like Twitter, but it's pretty different at its core, so we've invited Andrew on to talk about it—because Andrew, I think you, like me, spent all weekend banging your head against the keyboard trying to figure out Mastodon. Is that correct?Andrew Couts: Yes. I have spent far too much time on Mastodon. I think my weekly screen report said I was up 16 percent over the past week, and almost all of that was spent on Mastodon, and definitely the most increase was on Mastodon. I am a little bit obsessed with it.\nLauren Goode: OK, so what is it?\nAndrew Couts: So Mastodon is, like you said, a decentralized social network. It looks very similar to Twitter in a lot of ways. It has some different vocabularies, it has some different rules or at least social norms than Twitter does, but overall, it's a very similar experience. The big difference is the decentralized bit, which means that my account might exist on a different server than your account, but they can talk to each other, and there's no reason to be too concerned about that. It's just a little bit different in the way it's set up, and it can have big implications for content moderation and all types of different aspects that make up our overall social experience there.\nMichael Calore: So the thing that people often talk about when they talk about Twitter, and the thing that I would argue makes Twitter special, is its role as the great public square of the internet. It's the place where everybody is hanging out in the same spot talking about whatever they want to talk about with their individual communities inside that public square, but there's no fence that you have to hop over to go from one community to another. It's just one big community. So how is Mastodon different in that way? How much of a public square can it be?\nAndrew Couts: I think it could be the same kind of public square as Twitter. There's very little friction between the different servers, and really you don't recognize when you're talking to somebody on a different server than the one you're on. It all looks the same, and you can follow people from different servers. There is the option for a server to not be connected to the network, so you could have your own little social network with only people who know your server and it never communicates with another server. That's something somebody could do. However, it's really easy to connect a server to another one. For example, if I boosted a post from Lauren's server, and a boost is very similar to a retweet, that would automatically connect her Mastodon instance or Mastodon server to the rest of the Mastodon network. And so just as little as a retweet or a boost is something that can introduce your server to the rest of the Mastodon ecosystem, which is then part of a bigger, they call it a Fediverse, that are other applications that are on top of this thing. All these terms are what make this all a big barrier to entry for people, and it makes it really confusing, but it's not really that complicated once you're actually using it.Lauren Goode: So take us through some of these wonky terms. You mentioned boosts. They are also something called toots. There's the Fediverse. What do we need to know?\nAndrew Couts: Toots is the, I would say, unfortunate word for tweet. And honestly, I think it's going out of favor. People are just saying post, and it's kind of normalizing it, but Mastodon's been around since I believe 2017.\n[Correction, 11:23 am on 11/10/22: Mastodon has been around since 2016, actually.]\nAndrew Couts: And so it developed its own little culture. And until we all invaded that space over the past two weeks, they had their own little ways and norms that were, I think, really smart and wise in some ways to keep it a good community. But other things, like “toot.” might go out of favor. The Fediverse is the name for everything that is connected that's using the same protocol as Mastodon. And so you can have a video-sharing platform or a photo-sharing platform, and those exist on the Fediverse, and you can connect your Mastodon account to those accounts and use the internet a little bit differently with these decentralized social media apps.\nLauren Goode: And that's short for Federated Universe, is that correct?\nAndrew Couts: Yes, that's correct. Sorry, I should explain that. “Federated” is what it means when … I'm going to botch this, and someone's going to yell at me. But basically, it just means that it's a bunch of networks that are connected together where you can see everything that's on all the connected networks.\nMichael Calore: So when I log to Mastodon and I land on my server, what do I see? Do I just see the people's posts on my server, or do I see people's posts from the Fediverse? Is there a way to select what I see? Because when you show up on Twitter, there's this algorithmically generated stream that shows me all of the tweets of all the people that I'm following. Or if I'm not following a lot of people, it suggests a bunch of people for me to follow. What's the login experience like on Mastodon? What do I see when I show up?\nAndrew Couts: So when you first log in, you will only be able to see posts from everyone on your server. So for example, I'm on the mastodon.socialserver. I believe that's the first one that was set up, and it's one of the largest, if not the largest server. So everybody who is on there, I can see it on my local tab, so “local” is everybody on your server. There's also the Federated tab that will show you everybody within all of Mastodon. And then there's your home tab, which is the one that I use most frequently now that I have a good number of people I'm following. And so the home tab is just people you follow regardless of what server they're on, so it's going to be the most similar to what you see on your Twitter feed based on who you follow. So the home tab is where it's at.Lauren Goode: So even though this is a decentralized network, I'm curious about who runs it and who funds it. Is there any kind of leadership or chief executive or, as Elon Musk is now describing himself, like the chief hotline? What is a chief complaint hotline operator? Is there someone you can basically ring up or drop a line to and say like, “Hey, I want to talk to you about this,” and who is funding Mastodon?\nAndrew Couts: So nobody owns Mastodon overall. It's basically a protocol, and then whoever runs your server owns that instance of Mastodon. And so that's one of the things that makes it a lot different than Twitter. There's no one person to complain to. Probably if you were going to say, \"Hey, I'm getting harassed by a bunch of trolls,\" you would go to the admins of your server. There is somebody who founded Mastodon and kind of is in charge. His name's Eugen Rochko,  and he's the main developer and the main person behind Mastodon. But only in the, I believe, the Mastodon.social instance or any other one that he's involved in would you want to complain directly to him. He's really active on Mastodon. I think he seems pretty accessible. But in general, you're going to want to talk to whoever the admins are of your instance, or you could start your own instance and you could complain to yourself.\nLauren Goode: And what about funding?\nAndrew Couts: I don't actually know the answer to that. It's a nonprofit, so I believe it's mostly crowdsourced funding. I know they have a Patreon page, and so that's who you would be giving to. You would be giving to the main Mastodon nonprofit. But besides that, I'm sure that there are Patreon pages for individual servers, individual instances, and it's mostly just a crowdfunded thing. Nobody owns it, so there's nobody to pay or anything of that nature. You're not going to be charged $8 for using Mastodon. And if you were, you could move to another Mastodon server and ignore that.\nLauren Goode: All right. Well, we have to take a quick break, but when we come back, we're going to talk more about this whole concept of a decentralized social network.\n[Break]\nLauren Goode: Mike, do you have a better idea now of what Mastodon is?\nMichael Calore: Yes, it's all becoming clear to me.\nLauren Goode: Are you ready to join your Swedish psych pop server? Maybe you can start one.\nMichael Calore: I could start one, yes. It would be like me and four other turbo nerds.\nLauren Goode: All right. Well, I want to talk to Andrew more about what it means to be on a decentralized social network, and if it's self-governed, how secure that all is. Andrew, what would you say are the biggest considerations that people should have when they join something that is decentralized?Andrew Couts: The biggest thing to consider when joining a decentralized network is to recognize that the person who runs your instance or server or the people who run it have access to everything you do there. This is also true with Twitter, and it's one of the big reasons why everyone is fleeing now that Elon Musk is the person who controls that on Twitter. But on Mastodon, you have any number of people who can control that depending on what instance you're on, so it's really you need to trust who your instance admins are, and that's a big reason why a lot of people are starting their own instances, because they don't want somebody else to be in control of their direct messages, things like that. Another thing I would say about … This isn't about decentralized networks in general, but one thing about Mastodon is that direct messages work a lot differently. DMs are posts, but you just control who can see those posts, and you can set it to be only the people who are mentioned within those posts. If you happen to mention another user, you put their at handle in there, they will automatically be included in those DMs. So you don't want to go talking behind somebody's back and mention them in a DM, because they're going to get access to that DM, as an example. Again, as a security editor, I'm always recommending that if you really want to say something private, don't say it on a social network regardless. Take it to Signal. You could take it to WhatsApp or even Telegram, where things are, to one degree or another, end-to-end encrypted. That's where you want to keep your private messages. But just one thing to know about Mastodon is that DMs work a little bit differently, and they might surprise you how they work if you do it a little bit wrong.\nLauren Goode: In this case, is decentralization tied in any way to the blockchain? Is this a bigger part of the whole pitch around Web3?\nAndrew Couts: As far as I know, there's no direct connection between Mastodon and Web3 or the blockchain at this point. Decentralization is definitely something that is talked about as part of Web3, but it's decentralized in a slightly different way. We're not talking about blockchain-based technology, we're talking about a different protocol essentially.\nMichael Calore: How does moderation work on these servers? Because in a centralized model, if somebody is being a jerk on the platform, they get booted from the platform. So if somebody's being a jerk on my instance or on my server, and I boot him from my server, can he just go be a jerk somewhere else on somebody else's server?\nAndrew Couts: Moderation works a little bit differently on Mastodon. So to answer your question, yes, that person could go and sign up for another server. However, you also have the option to block entire servers. So for example, if some neo-Nazis created a Mastodon server where it's just a bunch of neo-Nazis, you could block that entire server and a lot of other people could block them too, and so they essentially get cut out from the main conversations, and they're not able to wage these campaigns, so there is some democratized moderation that happens. Moderation also happens at the server level. So whoever runs your instance or your server can create the rules that they want to create and enforce those rules how they say fit. They're the masters of their domain. I kind of think of instant admins as benevolent dictators and we are all in these little fiefdoms of Mastodon, and so they can enforce the rules how they want. You also have the ability as a user to block whoever you want to block, including blocking entire servers.Michael Calore: I want to play devil's advocate a little bit here and say that we've tried in the past to build social environments on open-sourced, decentralized systems before on the internet. And some of them will survive if they're very well maintained and the community has a definite long-view purpose, like a list serve or a newsgroup that is still going. But for social media at a really large scale, it seems like the centralized platforms have always won. Twitter, Reddit, Facebook, Hacker News. They all have owners. They all have rules. Those rules could change. We're sort of at their mercy. So I mean, I understand the vision, but practically, this can never be as big as Twitter.\nAndrew Couts: I would say practically speaking, it's going to be difficult for it to get to that scale. However, we've already seen the network deal with a massive influx of people. I think they're up to over 6 million users at this point, which is far more than they had before Musk bought Twitter and everybody started fleeing, so it remains to be seen. It depends on how invested people get. If there are enough people willing to run servers, if there are enough people willing to pay to maintain those servers, then yeah, we could see it grow to be as large as Twitter, which is much smaller itself than Facebook or TikTok or a lot of other social networks, but it just remains to be seen. I'm cautiously optimistic about Mastodon's potential. I think it really just depends on whether people stay interested when we're outside of this whirlwind of news and Musk seemingly doing some drastic shift every 10 seconds. We'll see how it goes, but so far so good. They've survived this influx of people, and they've been around for years now, so I don't think it's going anywhere. Whether everybody wants to keep using it, that remains to be seen.\nMichael Calore: Yeah, that's a good point.\nLauren Goode: I will say, despite the fact that Mastodon has been around since 2017, right now, it does have that chaotic, but good chaotic, energy right now. That early web, let's-fuck-around-and-find-out, let's tinker with things, look at this new feature, who else is here for the hang? It's kind of fun to spend time on once you get over that initial hurdle of finding a server and actually signing up, which took an entire weekend for me.\nMichael Calore: Yeah.\nLauren Goode: I was just waiting and waiting for a verification email and it finally came through. Twitter feels chaotic right now, but it's a very dark timeline. We're taping this on election day, and so it's like, how is Twitter going to disrupt democracy yet again, and it's not a good chaotic energy, and Mastodon still feels new.\nMichael Calore: It's going to be a wild two years. I do think that a lot of that onboarding experience that you're talking about, Lauren, that is something that could be solved by a good user experience. And the barrier of the server, you need to find a server to hook up to, just the concept of that is very difficult for a lot of people to understand. So some of that can be solved with changing the name or creating a very clear signup flow. I haven't seen one yet. I'm also curious about the apps, if there are good mobile apps for posting to Mastodon and browsing Mastodon, and how do those fit into the Federated environment and the decentralized environment?Andrew Couts: So just to go back to the user experience part for a moment, I think one of the things that makes … I agree with Lauren, one of the things that's really exciting about Mastodon is that it doesn't feel new, it feels old. It feels like the internet that I grew up with, and I think part of that is that there's not just passive consumption or even passive content creation. You can also build things for it. You can maintain your own server, but you can also create tools. And you see a lot of people doing that. There's a real creator energy to the space right now, and I think that having some greater control than you do over a centralized network and your experience there has really invigorated people to want to invest in a different way. And so I think that that's really exciting. And I think one of the ways we can see that evolving is people creating a better onboarding experience and not just being a few overworked engineers who work for the mass nonprofit there, it could be somebody else entirely who's completely independent, who just creates something that makes the users experience a lot better. I do think we'll see an evolution of the terms and people either getting familiar with things like instance and Fediverse and all that kind of stuff, or just people stopping using those terms and explaining it a little bit better. So we'll see how that goes. As far as the apps are concerned, there's a bunch of different apps. There's the main Mastodon app, which I don't actually like that much. I found it to be a little bit glitchy at this point. I'm currently using one called Metatext, and it kind of has all the features that I would want on Twitter, to the extent that Mastodon mirrors those same experiences, and it's been really stable. I did have some lag last night. My personal take on it is that having to be patient a little bit with your tech isn't a bad thing. I've kind of found it to be like, OK, it's not working right now. I'm going to go do something else. And it kind of stops the cycle of doomscrolling. And it's like the glitch is the same as that random person on TikTok who jumps up and says, \"Hey, you've been on TikTok for way too long, you dirt bag. Maybe go do something else and spend time with your family,\" or whatever they say. I always scroll past it too fast to know actually what the whole message is, but I think that there's … I found it to be more relaxing to have kind of a built-in pause button on my consumption of i,t because I did go a little bit overboard this weekend, so we'll see how it evolves. There's a bunch of other apps too, though. There's Toot, which is a paid app. I believe it's available on both iOS and Android, that a lot of people like. There's five or six of them on iOS. I think there's a few others. If you search the app stores, you'll be able to find them. I recommend Metatext. It's worked really well for me, and it's free. No in-app purchases or anything like that.Lauren Goode: Andrew, can I tell you something? Mike actually pays attention to those warnings when they pop up on his phone, where they're like, “Oh, you've spent 15 minutes on this app. It's time to go do something else.” He actually heeds the warnings.\nMichael Calore: I do.\nLauren Goode: I don't know anyone else who does. It's amazingly disciplined. I admire it.\nMichael Calore: Well, thank you.\nLauren Goode: But to me, it's just hitting snooze. It's like …\nMichael Calore: It's just a good habit that I've developed over the last three or four years. I don't know what it is. I just kind of trained my brain to do it. I know that not everybody can do it, but … The thing you're talking about, Andrew, reminds me of the fail whale. The early days of Twitter, when Twitter used to crash all the time, and then you sort of had to take a break from Twitter. And like you were saying, Lauren, it had that chaotic-in-a-good-way energy, because the fail whale could pop up at any time.\nLauren Goode: It's big whale energy.\nMichael Calore: Yeah. People were joining. People were like, “Hey, what's going on this side?” That kind of curiosity, not really knowing what to post. So it's been kind of fun to watch that happen elsewhere, even if I'm doing it from afar.\nAndrew Couts: One of the things I've liked about the Mastodon experience is people are willing to be earnest in a way that they were not on Twitter. People are just being a little bit more vulnerable or just being themselves or just saying things that they actually mean. It's not all just either yelling at each other or jokes or just people posting news or announcements or whatever it is that non-journalists do on Twitter. I found it to be just kind of refreshing in that way. One of the things I've learned is that the way that the community has arisen is by being very much about communication and conversation, in a way that Twitter evolved to not be that, and evolved to be the worst place possible for that. And I think we're going to see changes there, and they're probably not going to be good ones. But at the moment, the DNA of the Mastodon community is trying to dictate it being a, not a friendly place necessarily, but a respectful place and a good place to have conversations. And I've had the best interactions I've had with people online on Mastodon over the past couple of weeks. I have to say, I hope that stays the same.\nLauren Goode: It really does feel like right now is the best of the internet and the worst of the internet all happening at once. All right, let's take another quick break. And when we come back, we're going to do our favorite segment: recommendations.[Break]\nLauren Goode: Andrew, you're up first. What is your recommendation this week?\nAndrew Couts: My recommendation, I'm going to go with a classic gadget recommendation, is the Fi dog collars. The privacy side of my brain hates them because it tracks the location of my dogs and my phone constantly, so I'm sure that there's good reasons to not want to use this device, but all my dogs got really fat, and this has made them get less fat. And I really like it. It tracks all their steps and everything. It makes it much easier to be a good, responsible dog owner and keep your dogs healthy, because you push them a little bit farther than you really want to on their walks and things like that, and it really helps your dogs stay trim. And it can also track them if they get lost, which mine have. Fortunately, knock on wood. But yeah, Fi dog collars.\nLauren Goode: We're going to need to know everything about your dogs quickly, their names. You can rattle them off Matt Damon-style and their ages and their breeds, please.\nAndrew Couts: Sure. I have three dogs. My first dog is Sajo. He's a 12-year-old German shepherd. We also have Lucho who is a 3-year-old German shepherd, and Truffle who is an 11-month-old yellow lab. Lucho and Truffle are both dropouts from Guiding Eyes for the Blind, which is a guide dog school where my wife runs the adoption program, so both of them had some slightly not guide dog traits, and so we got to adopt them when they were little puppies, and they're good.\nLauren Goode: That's amazing. So Truffle, you said?\nAndrew Couts: Truffle, yes.\nLauren Goode: Yeah, It sounds like he was just being set on the path to be a wee bit pudgy.\nAndrew Couts: Yeah, and she came in after we got the Fi call for Lucho, who was the main fat one. Truffle is actually jacked. She's like a jacked little puppy because of Lucho. she weighs around 60 pounds. Lucho is a little over a 100 pounds, not fat, and so she thinks she's a 100-pound German shepherd and plays like one. She's the fittest of the bunch.\nLauren Goode: Oh, so she's going to stand on the podium with you when you accept your bid for mayor.\nAndrew Couts: Exactly.\nLauren Goode: How much do these collars cost?\nAndrew Couts: I think they're around $80, but there seems to be a perpetual sale, so I'm not sure. And I think they just came out with a new one, the Series Three, which I have deemed not worth my money yet. So we'll see.\nLauren Goode: A series-three dog collar. Like they're Apple. This is the next generation. Good morning, this is our new dog collar.\nMichael Calore: We're all past the point now where it does not feel weird to do things like charge our dog collars or charge our basketball shoes or charge our surfboards.Lauren Goode: No, I do not charge a surfboard. All right, thanks again for that awesome recommendation. More dogs on Gadget Lab.\nMichael Calore: More dogs.\nLauren Goode: Mike, what's your recommendation this week?\nMichael Calore: I'm going to recommend a book. It's a book that I just finished. It's called So Much Things to Say: The Oral History of Bob Marley, and it's written by Roger Steffens. It's an oral history, so it's a book of interviews, but our guide through the history of Bob Marley's life is Roger Steffens, who is a longtime broadcaster, reggae scholar, and one of the world experts on Bob Marley and that world of Jamaican music known as reggae music, which I'm a big fan of. And I've read a lot of Bob Marley books. There are a ton of Bob Marley books, and I've read most of them, and this one is by far the best one I have ever read. It's excellent. Roger Steffens has about 40 years worth of interviews with all of the people around Bob, his family members, his band members, former band members, business associates, lovers, children, and he's assembled this book that takes us through Bob's very early years, right up until his death at 36 from melanoma. And it is just really interesting because it's the only book that I've read about Bob that paints him as a real complex, three-dimensional individual. A lot of times when there's a figure who is a really big, important figure for a lot of people ... In many parts of the world, Bob Marley is considered like a prophet. He's considered a saint. He's above human. And a lot of the books about him sort of take that stance where his life is viewed through the lens of somebody who is destined for immortality. This book really presents him as a real human being, a man with problems and joys and sadness and setbacks and successes. It's just phenomenal. The best part about it, of course, is hearing all of the voices of his friends and family talk about him and all of his complexity. So I could definitely recommend it to anybody who is a lover of reggae music or has read Bob Marley books or is just interested in hearing more about his life because he was such a big figure in music. And even if you're jaded, because I'm jaded, like I said, I've read all these books, I did not need another one in my life until this one came along, and then I realized that this is the only one that you really need to read. So, So Much Things to Say, by Roger Steffens. That's my recommendation.\nLauren Goode: Awesome. Thanks Mike.\nMichael Calore: Sure. Always happy to squeeze in these obscure musical references about some of the best-selling artists in history for you.\nLauren Goode: That's not obscure though. I know last week, was it last week or the week before, I said something about an obscure artist and you said, \"She's not obscure.\" Bob Marley is not obscure.Michael Calore: Right. What's your recommendation?\nLauren Goode: My recommendation is White Lotus, season 2 on HBO Max.\nMichael Calore: Never heard of it.\nLauren Goode: You've never ... Really?\nMichael Calore: No, I'm kidding.\nLauren Goode: I was going to say, we've got to get you up to speed. I have not watched the whole season yet. HBO is trickling them out week by week, so you can't really binge-watch it unless you wait several weeks to watch it all at once. I have watched five episodes, because that's what was available to the press when HBO handed out their digital screeners. There are only two that are available to broader audiences right now, but it's great. It's brilliant. It's created by Mike White. It revolves around a murder. Again, the very first episode you learn that multiple someones have been murdered, and you sort of just see a body floating by, but it's hard to tell who it is, and so then all of these characters are introduced. And White Lotus is the name of a resort chain. Last season was in Hawaii. This season is in Sicily, so a bunch of incredibly wealthy people are at the White Lotus Resort again. And it's an ensemble cast. It's like a handful of different couples, and they don't all know each other, but then they sort of interact in different ways throughout the season. And yeah, I would say this so far, this season doesn't feel quite as masterful as the first one. I think the first one was new and the concept was great. The writing was great. You sort of felt very invested in characters, whether they were the resort guests or people who actually worked at the resort, but the second season does maintain the element of escapism. That's makes it really fun to watch, and it's kind of like a soap opera, and there's all this sexual tension and total weirdness and this underlying darkness that you're just waiting to rear its ugly head. And I'm really enjoying it so far. I can't wait to watch the final two episodes.\nMichael Calore: You'll have to live toot them.\nLauren Goode: Yeah. I will indeed have to live-toot them or boost others who are live-tooting about it. Are we going to start doing that for live events? Are we going to go cover a big event and be like, \"Are we doing a live toot?\"\nMichael Calore: I look forward to all of your toots, live or not, about the finale of White Lotus season 2. I should be caught up by then.\nLauren Goode: I look forward to your toots about Swedish psych pop. And Andrew, thanks again for joining us.\nAndrew Couts: Thanks so much for having me.\nLauren Goode: And thanks to all of you for listening. If you have feedback, you can find most of us on Mastodon and all of us on Twitter, because we're still there. Just check the show notes. We'll put our handles in. I guess we should probably start putting our Mastodon handles in.\nMichael Calore: We absolutely should.\nLauren Goode: Why not? Our producer is the excellent Boone Ashworth, who's sitting here wearing a wooly mammoth costume in the studio.\nMichael Calore: It's a Mastodon costume.\nLauren Goode: Oh, all right. We'll be back next week. Thanks for listening.\n[Gadget Lab outro theme music plays]","creation_date":"2022-11-10","tags":["","GADGET LAB PODCAST","PODCASTS","TWITTER","SOCIAL MEDIA"],"author":"BY WIRED STAFF","category":null}