{"id":"7616e402-84cc-4458-a090-a078bdb3facd","article_link":"https://medium.com/0chain/artemis-hardfork-progress-community-testing-soon-256ea1caf868","website_source":"Medium","article_type":"Blog Post","summary":"The Artemis Hardfork is currently underway. The team has been working around the clock to prepare the Apps for community testing. Please…","title":"Artemis Hardfork Progress: Community Testing Soon!","detailed_content":"The Artemis Hardfork is currently underway. The team has been working around the clock to prepare the Apps for community testing. Please wait for our official announcement before starting testing, as the update has not yet been completed. We kindly ask you to hold off on testing until our official announcement. For more details, check our release notes.An AWS customer was charged an exorbitant $1300 USD fee for its empty bucket, exposing AWS vulnerabilities and how buckets can be vulnerable to unauthorized request charges. The customer created an empty bucket for testing purposes, which received millions of authorized requests from a company using the same name as the test empty bucket the customer had created.This incident exposes a potential pitfall for AWS users: A customer created a private S3 bucket for testing purposes. Unknowingly to them, a popular open-source tool with a default configuration used the same name for storing backups. This resulted in a surge of unauthorized requests to the customer’s empty bucket, ultimately leading to a hefty $1,300 bill.Because of that, the misconfiguration caused the requests to be sent to this empty bucket, leading to exorbitant costs. Even though AWS refunded the client, they emphasized that it was an exception. This highlights how unclear and unpredictable fees can be on a centralized platform, leaving customers in the dark about how much they will be charged — risking paying substantially more than they planned and could afford.Rest assured, alternatives like Züs are designed with your security in mind. There are no hidden costs. There is no charge for requests, bandwidth, or egress. You do not have to worry about paying more for unauthorized requests because the price is paid upfront and only once. Service providers are committed to protecting you from such unexpected behaviors with restrictions that can be easily set on the blockchain to prevent bad actors or misconfigurations from ever posing a risk to you or your clients.Wrapping it up for today! Look forward to next week.Züs is a decentralized high-performance multi-cloud storage with high-security features and no vendor lock-in.Website | Telegram | Twitter | Discord | GitHub","creation_date":null,"tags":["Updates","Blockchain","Cryptocurrency","Crypto","Cloud Storage"],"author":"Tiago Souza","category":null}