{"id":"767e067a-ad30-4e3e-b55b-7a3dd8b04854","article_link":"https://cointelegraph.com/news/a16z-crypto-memecoins-like-risky-casino","website_source":"Cointelegraph","article_type":"Tweet","summary":"The chief technology officer of VC firm Andreessen Horowitz said that memecoins are like risky casinos that deter real builders from the crypto ecosystem.","title":"Memecoins are like a ‘risky casino’ — Andreessen Horowitz exec","detailed_content":"The chief technology officer of the United States-based venture capital firm Andreessen Horowitz (a16z) has compared the ongoing memecoin frenzy to a “risky casino.”\nA16z's Eddy Lazzarin said in an X post that memecoins hamper the long-term vision of crypto that has kept so many of the original builders in the space.\nHe added that these memecoins aren’t technically exciting or attractive to builders and alter how the public, regulators and entrepreneurs see crypto:\n“At best, it looks like a risky casino. Or a series of false promises masking a casino. This deeply affects adoption, regulation/laws, and builder behavior. I see the damage every day.”\nHe also addressed whether memecoins can find a place in mainstream investments like other crypto assets such as Bitcoin\nBTC\n$63,041\n. The raging debate on the memecoin frenzy comes amid a recent report that suggests hedge funds are being lured into memecoin investment, looking for hefty returns.\nThe a16z executive received a lot of flak from the memecoin community, who were quick to point out the venture capitalist also funds investments in nonfungible tokens, which have seen prices tumble.\nSource: 0xen\nThe memecoin frenzy in this bull market has seen explosive growth and hefty returns for tokens that are barely a couple of days old.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nFor example, the Book of Memes (BOME) token surged over 30,000% within a week of its launch and garnered a billion-dollar market cap before being listed on centralized exchanges.\nRelated: SEC lawyers resign after ‘gross abuse’ of power in crypto case — Report\nSimilarly, another popular memecoin, Dogwifhat (WIF), which launched in November 2023, has risen to over $3 billion in market capitalization, placing it in the top three memecoins.\nHalf a dozen memecoins have grown to gain mainstream media attention this cycle. However, that is only half the picture, as thousands of other memecoin projects have either orchestrated rug pulls or were dumped on the market straight after launching.\nThe stories of traders turning a few hundred dollars into millions often lure hundreds of new inexperienced traders to the crypto market.\nHowever, most traders lose money chasing that one memecoin that could turn their fortunes around. Thus, just like gambling, these memecoins are a way for newcomers to try their luck.\nPro-crypto enthusiasts have voiced their opinions against memecoins, saying they don’t have any use case or real-world value.\nMagazine: ChainLinkGod was in High School when he started the account! X Hall of Flame\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#Cryptocurrency Exchange","#NFT","#Regulation","#Memecoin"],"author":"by Prashant Jha","category":null}