{"id":"773a8010-996c-474d-ab0d-8d2ad890d2a0","article_link":"https://cointelegraph.com/news/bitcoin-fees-crash-after-daily-average-record-halving-day","website_source":"Cointelegraph","article_type":"News Article","summary":"The surge in block fees on the halving day was more than making up for the halved block subsidy miners were hit with — but that’s not the case anymore.","title":"Bitcoin fees crash after record daily average of $128 on halving day","detailed_content":"The average fees paid on Bitcoin have sharply fallen just a day after reaching a record average of $128 on April 20 — the day of the fourth Bitcoin halving.\nAs of April 21, Bitcoin\nBTC\n$63,026\n fees have fallen to an average of $8–$10 for medium-priority transactions, according to mempool.space.\nAverage daily transaction fee on Bitcoin over the last five years. Source: Y Charts\nOnly one day before, Bitcoin clocked $78.3 million in total fees, beating Ethereum by over 24 times, according to Crypto Fees.\nThe day included a staggering 37.7 BTC ($2.4 million) paid to Bitcoin miner ViaBTC in the Bitcoin halving block at block height 840,000 — making it the most sought-after piece of digital real estate in the network’s 15-year history.\nMuch of the demand at block 840,000 came from memecoin and nonfungible token enthusiasts competing to inscribe and etch rare satoshis via the Runes protocol, a new token standard that launched at the halving block.\n3,050 transactions were included in that block, meaning the average user paid a little under $800.\nLargest fees by blockchains and decentralized finance projects on April 20. Source: Crypto Fees\nThe higher-than-normal block fees continued until about block 840,200, according to mempool.space; however, block fees have since fallen to around 1–2 BTC.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: Bitcoin halving 2024: How to keep BTC mining efficient as rewards decrease\nThe large block fee payouts to miners throughout on halving day meant they weren’t initially impacted by the block subsidy halving from 6.25 BTC to 3.125 BTC.\nBut that’s no longer the case now that the average block fee is well below 3.125.\nTotal fees for block 840,266 came out at 1.64 BTC. With the new block subsidy of 3.125, total rewards came out at 4.76 BTC. Source: mempool.space\nMeanwhile, fees on Bitcoin have now topped Ethereum for six consecutive days between April 15 and 20, with its seven-day fee average now at $17.8 million.\nThe halving event didn’t have a material impact on Bitcoin’s price, which is up 1.5% since then to $64,840, according to CoinGecko.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-22","tags":["#Bitcoin","#Blockchain","#Mining","#Adoption","#Bitcoin Mining","#Fees","#Mining Pools","#Bitcoin Halving"],"author":"by Brayden Lindrea","category":null}