{"id":"78fff759-6cbf-4564-ac02-fab83f3dcbfc","article_link":"https://www.wired.com/story/gadget-lab-podcast-578/","website_source":"Wired","article_type":"News Article","summary":"This week on Gadget Lab, we talk about the development of the Ledger Stax, a cryptocurrency wallet designed by Tony Fadell.","title":"You’re Gonna Need a Crypto Wallet","detailed_content":"EVEN IF YOU own no bitcoin, no ether, and no NFTs, crypto wallets—pocket-friendly hardware lockers that store digital assets—will be a part of your future. They’re essential tools for securing not only coins and tokens, but also the next generation of passports, drivers licenses, and concert tickets. A French company called Ledger, one of the leaders in digital wallets, is trying to take the technology mainstream with the help of Tony Fadell, one of Silicon Valley’s most celebrated hardware designers. Fadell designed the iPod and the Nest thermostat, and now he’s designed Ledger’s next product, a crypto wallet called Stax.\nThis week, WIRED editor at large Steven Levy joins the show to tell us about the time he spent with Fadell and the Ledger team in Paris (we know, tough gig) to witness the birth of the Stax. We cover all you need to know about crypto wallets, why they are safer places to store digital assets than exchanges, and how digital wallets will be useful beyond the world of cryptocurrencies.\nShow Notes\nRead Steven’s story about the development of the Ledger Stax. You can also read about Fadell’s Paris-based consultancy business. Read all of WIRED’s cryptocurrency coverage.\nRecommendations\nSteven recommends Paxlovid, the antiviral treatment for people suffering from Covid symptoms. Lauren recommends the second season of HBO’s White Lotus and also Zebra Sarasa Grand pens. Mike recommends dusting off your old iPod.\nFEATURED VIDEO\n Steven Levy can be found on Twitter @StevenLevy. Lauren Goode is @LaurenGoode. Michael Calore is @snackfight. Bling the main hotline at @GadgetLab. The show is produced by Boone Ashworth (@booneashworth). Our theme music is by Solar Keys.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Gadget Lab podcast and our huge library of narrated articles.\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for Gadget Lab. If you use Android, you can find us in the Google Podcasts app just by tapping here. We’re on Spotify too. And in case you really need it, here's the RSS feed.\nTranscript\nMichael Calore: Lauren.\nLauren Goode: Mike.\nMichael Calore: Lauren, how do you secure your cryptocurrency assets? All your dogecoin and NFTs?Lauren Goode: I think I have exactly one US dollar of ether, and I keep it in a regular old app, no hardware. So you can have at it if you manage to get into it.\nMichael Calore: Do you have your pass key written down on a post-it note that you keep in your glove box?\nLauren Goode: Yeah, it's P-A-S-S-W-O-R-D, all lowercase.\nMichael Calore: Perfect. Have you ever considered a wallet?\nLauren Goode: I have a wallet.\nMichael Calore: Do you have a crypto wallet?\nLauren Goode: No, I do not have a crypto wallet.\nMichael Calore: Do you know about crypto?\nLauren Goode: Do I need this for my one USD in ETH? I've heard of crypto wallets, because I've heard about the extreme measures people have to go to to hack into them.\nMichael Calore: Well, we're going to learn more about them right now.\nLauren Goode: I'm excited.\nMichael Calore: Hi everyone. Welcome to Gadget Lab. I am Michael Calore. I'm a senior editor at WIRED.\nLauren Goode: And I'm Lauren Goode. I'm a senior writer at WIRED.\nMichael Calore: We're also joined this week, once again, by WIRED editor at large Steven Levy. Steven, welcome back to the show.\nSteven Levy: Thank you. It was always a thrill to be on the show.\nLauren Goode: Steven, we have to tell you that as we were reading your latest feature and preparing for this show, Mike and I looked at each other and said, “Steven's a really good writer.” We knew that already, of course. But it was underscored. You really are. It's like you've been doing it for a while. A fantastic writer.\nSteven Levy: I think I have a pretty good lead on everyone else for the most features in WIRED magazine.\nLauren Goode: Incredible.\nMichael Calore: Yeah, and I don't think I'm going to challenge you on that.\nLauren Goode: No, we're never going to catch up.\nMichael Calore: Well, Steven, your latest feature for WIRED is a story about cryptocurrency. Most of our listeners probably know at this point that we are in the midst of a crypto winter where the values of many digital currencies have fallen. Exchanges are under intense scrutiny. The NFT market has crashed, and the whole scene is going through a lot of difficult times. So this particular moment feels like the right time to step back and take a long-term look at the crypto world and think about where it might be going in the next few years. Now, one company thinking far into the future is Ledger. Steven just wrote a big story for WIRED about this company, a French business that sells cryptocurrency wallets. Ledger's newest wallet is called Stax. It's making waves primarily because it's designed by Tony Fadell, the guy behind the iPod and the iPhone and the Nest thermostat. Tony's a big deal. If Tony Fadell is making Ledger's next crypto wallet, then it'll get the attention of more than just the crypto bros. But let's start with some basics. Steven, can you please tell us what is a cryptocurrency wallet?Steven Levy: Right, OK. So the wallet we're talking about is something that holds not only cryptocurrency but other kinds of digital assets, which could range from NFTs to papers about your identity. Think of it as a tiny secure vault that holds your private key, which is sort of a stamp you make to authenticate that you are you. So when you have a crypto asset, whether it's a bitcoin or an NFT, it lives on this ledger called the blockchain. And your direct connection is that the owner of the digital asset is logged on this ledger. So the question is, how do you prove that it's you? How do you prove that you're the owner? And that's because there's a little key, which when you unlock it, it says, bam, it's you. And you have to hold this key in the tightest, most secure place, because anyone who has the key is automatically the owner. It's definitional: The person who has the key owns that asset. So the crypto wallet is a way where that power is literally in your hands, where you have this piece of hardware which holds that digital key very, very closely. And if it hasn't been hacked, so as you mentioned, that's very important. You can prove that those assets are yours.\nLauren Goode: How does this differ from using something like secure ID on an iPhone? Apple often talks about how secure it is to use something like face unlock and store your biometric info on their secure ID. Because that is something that the company does not have access to, and you're sort of holding that in your hand. How is this different?\nSteven Levy: Well, one thing I learned about studying crypto, and I actually wrote a book about it at one point, is that the amount of effort you put into protecting something pretty much has to be in sync with how important it is to protect it. So if it's very, very, very important, you need the most secure way to lock something down. And as it turns out, the phone is not the most secure way. There's companies that sell to other governments a way to hack it outright. And the biometrics like face recognition and fingerprints you use can be relatively easy to hack. They're public, people can see your face, they can fake it, they can get your fingerprint, they can cut your finger off. I just watched the movie about that, where some guy cut his finger off.\nLauren Goode: Let's put a pin in that and come back to it.\nSteven Levy: Yeah, it's not the most secure way to do things. So this company has put its bet on people saying, “Hey, if I'm going to have these digital assets that are so secure, I don't have to trust anyone in the world, any kind of institution or bank or anyone else, I want maximum security.” And that can only come from something which is an unhackable way to protect your key.Michael Calore: So this company that you wrote about, Ledger, they make these cryptocurrency wallets. That's their primary business. Tell us more about Ledger.\nSteven Levy: So Ledger is a French company, which in 2014 began making these wallets. So not the only company that makes them, but they become the leader of the field. And right now they look like an old USB stick, the kind that had a jackknife sort of scheme where you put a metal sheath over it and flipped it open. And right now the passcode you use is in this tiny little microscopic display they have, and it isn't even a keypad. It's hard to use, but it's very, very secure. And I think something like 20 percent of the world's cryptocurrency is protected by Ledger wallets and maybe 30 percent of NFTs. So they're definitely one of the leading companies in the field. But still, it's pretty hard to use, it's something really reserved for the hardcore crypto crowd. So my story begins when the people at Ledger thought, “Gee, how can we open this up and appeal to an audience beyond the geeks, beyond the crypto bros, and make it so a wider swath of the population can adopt this technology?”\nLauren Goode: So enter Tony Fadell. To be clear, he didn't found Ledger, but he got involved a little bit later because something was really irking him about the products. He was consulting, and then he ended up saying, “Let's redesign the whole thing.” Talk about that.\nSteven Levy: Even before Tony, there was another person named Ian Rogers who came to the company, and this guy's a fascinating guy. I mentioned that he had a lot of trophy jobs, but trophies they usually don't find in the same case. He was kind of a skateboard kid who took computer science and worked at Yahoo and headed Yahoo Music. And then he went to work for Beats and did their music software and then started Apple Music when Apple bought Beats. And then he became the head of these luxury fashion brands. And the CEO of Ledger, this guy named Pascal Gauthier, thought, “I need Americans to market my product, because the French are too stodgy and I want to be a global company.” So he tapped this guy Ian to come and work for him, but Ian had a friend in Paris who he said, “Can you look into this for me?” And that friend was Tony Fadell. And Tony, in doing due diligence, got excited about the prospect of rethinking the crypto wallet and agreed to do the redesign for a wallet. He didn't join the company; he got a little piece of the company, but he became the defacto design head and father of this new product called Stax.\nLauren Goode: And you mentioned earlier that some of the previous crypto wallets from Ledger, they had a tiny screen, they weren't super easy to unlock, and in your story you mentioned that the directions say, allow yourself 30 minutes to even set this thing up. And then in comes Mr. iPod, who reinvented the literal wheel. So what was his vision for this new wallet?Steven Levy: So he looked at this and he thought, “Gee, this is just like digital music was when I was charged to lead the iPod project from Steve Jobs.” The first MP3 players were really clunky to use; it was hard to even pick out the single song you wanted to listen to. They were bulky, and they were definitely not cool and fun. So he said, “I could do the same thing for wallets. Instead of having this tiny little display and no buttons, I could do a touchscreen. And what's more, I can make the touchscreen really cool in a credit-card-size device. Where this screen, and it's an E Ink screen, wraps around the side, and on the side you could read it like the spine of a book. And maybe you'll have a bunch of different assets in different categories that you could use together, and you could stack them up like a big pile of a hundred dollars bills.” So they made them magnetic so they would snap in order. And you could put your NFTs on the display. They had a long battery life so you could put it in a drawer and it would be good for months. So he decided to make this thing easier to use and cooler, and sell it for a reasonable price and make it a more welcoming product for people considering getting into self custody for digital assets.\nMichael Calore: I think both Ian Rogers and Tony Fadell told you at some point in your reporting, and this is in the story, that they believed that what we're looking at right now is a moment that goes back to about 15 years ago. When most people believed that when the iPhone came out, that it wouldn't necessarily be a product for everybody. Not everybody is going to want a smartphone. That was obviously wrong. And Ian Rogers says that something similar is happening right now with cryptocurrency, where it doesn't really feel super vital to daily life for everyone at the moment. But that in the future, most humans will end up owning digital assets. I wonder if that's really true.\nSteven Levy: I think the long-term vision is valid. Ian said something really interesting to me. He said he attended a conference in New York recently, and it was a bunch of crypto people and you needed a crypto token to actually get in. It was your ticket. And he thought how weird it was that the technology he used to get into this party basically was more secure, more sophisticated, and easier to use than what you used to get into a country. I think eventually you can make the case that our passports will be digital assets and our driver's licenses and our Taylor Swift tickets. It'll be a long process. But I think it makes sense that somewhere down the line, I don't want to put how many years it's going to take, that this is going to be the way that we hold everything dear to us that can be digitized.Lauren Goode: As I was reading this story, that's exactly what I was thinking. I was wondering if it was eventually going to become more than just a crypto wallet. If it was going to store our passports and licenses and vaccine cards. Because as someone who loses things quite a bit, I was thinking, “OK, this thing is $249. I would probably spend that amount on a really secure digital wallet if it meant I wasn't replacing all the other things I lose throughout the year.”\nMichael Calore: And just don't lose your wallet.\nSteven Levy: But definitely, I think that's it. Now, they don't have a clear roadmap on how to make this happen in two years. And Ian actually said to me, “I'm a little wary that we're going to be like the Nokia or Blackberry of this space.” Because they're there now, and maybe down the road someone will come up. But right now their hope is to build this big head start, and since they're already the most popular product in this pre-cool-device era of wallets, yhey're hoping they can just put the stake in the ground, and as this happens, they will be the platform that people use for these other digital assets.\nMichael Calore: All right. Well, let's take a quick break and we'll be right back.\n[Break]\nMichael Calore: All right, welcome back. Now obviously, when Ledger first started planning the Stax release and got Fadell involved to build it, the crypto world was doing OK, and then a lot of cryptocurrencies tumbled in value. The NFT market crashed, and now the FTX Exchange is the target of a fraud investigation. And the whole crypto world seems to be in a pretty serious crisis. Some people might point to all of the recent news and say, “Wow, lousy timing for Ledger to release this wallet.” But others like Fadell and his team would say, “No, this is actually perfect timing.”\nSteven Levy: That's right. It is been a challenging year for crypto in general, but not disastrous. At the time, I went to Paris and had to suffer my way through the City of Lights while reporting the story. A couple weeks later, the team came to New York, and during that period we learned about FTX and SBF, and the whole crypto market just collapsed and was shrouded in doubt and fear and loathing. So when I brought this up to them, they said, “Well, we're the solution.” And they noted to me, and we had discussed this before, then when your money is in a crypto exchange like FTX, it's the same principle as a bank. If you have money in a bank, they don't earmark your dollars with your name on it in a red marker. They just put it in a big pile. And if everyone wants it all at once, they have to have enough money to pay people back. If they don't, it's a big trouble. As Samuel Bankman-Fried learned, and we all learned from FTX, with self custody, it doesn't work that way. The money is actually earmarked for you and linked to your little private key. So that could not happen if your money was protected by self-custody and a crypto wallet. The question is how successful the whole market is going to be. Whether this casts a big enough shadow on the whole crypto market that people are going to ignore it. I said, “Is this going to be introducing a great cocktail on the Titanic just before it hits the iceberg?”Lauren Goode: So wait a second. If someone had, let's say, made an investment that was tied to Sam Bankman-Fried's coin FTT, or let's say they invested directly in the FTT coin, and it was stored on a ledger wallet. Then if the value of that coin goes down significantly, how does having it on a ledger wallet, a hard wallet make it any different than just having it stored in an exchange or having a record of it on an exchange?\nSteven Levy: Well, if the currency itself is worthless, you're right. But if you are trying to get your assets, a lot of people had their money not in the magic beans that SPF invented, but in bitcoin and ether and other markers of value that still have some value. If they have their money in there, and they couldn't get it out, they couldn't get it paid back. So if money is involved in a currency which is worth something, you could recover it. In this case, there was real money that disappeared. They said, “Oh, there's a line in the spreadsheet for 8 billion that we forgot about.” Kind of like, “There's one little line, and if you want your money back, sorry, we can't deliver that because this line in the spreadsheet disappeared.” And if you buy an NFT, at the least you want to say that my ownership in this NFT is verified. And I don't have to trust anyone else to be able to claim what I purchased.\nLauren Goode: I think I'm still trying to wrap my brain around the idea of a hard wallet and what it points to if you were to use an analog to a current banking app. When I use authentication on my iPhone to get into my current banking app, I don't believe that what I'm looking at is the actual repository of dollars. I'm looking at a digital representation of dollars that are stored somewhere else. With the hard wallet, it's another form of identity verification, and it's holding the keys that point to assets that are somewhere else.\nSteven Levy: Yes.\nLauren Goode: Am I understanding that? It's not like you're looking at the NFT itself on this little wallet.\nSteven Levy: The difference is that with your bank, there's a third party involved that you have to trust. If your bank goes bust, you might have had a thousand dollars in that bank, but you're not getting that thousand dollars. This is more like saying, “I have a thousand dollars in a safety deposit in this bank, the bank went broke, but I still have access to the safe deposit box.”\nMichael Calore: That's a good analogy. I think the idea of a cryptocurrency wallet saves us from some of the abstraction that's involved when thinking about exchanges. Because it's a physical token that you hold in your hand that you can manipulate via the touchscreen if you have a Stax. And it's not something that sort of exists in the sky that you access through a browser. So I do think that eliminating that abstraction of dealing with exchanges is helpful for the cryptocurrency market. Because it gives something that people who are less familiar with it or who still find it confusing and weirdly obfuscated, it gives them something to literally hold on to, literally and figuratively hold on to. And I know that that was Fadell and Roger's goal in building this wallet, making something that was even more accessible to get people into wallets. And I think maybe the real hump they have to get over is not giving people something that they can use to help them understand cryptocurrency. But giving them something that they can use to help them understand the difference between a physical wallet and an exchange.Steven Levy: And the idea is, and I didn't really realize this until I did the story, is that the word trust is a pejorative in this world. The idea that you have to trust someone is anathema to the true crypto people. They don't want trustworthy places to deal with, because that implies that you have to extend trust. They want trust-proof systems where you don't have to rely on anyone, no matter how trustworthy they look. So again, it muddies the conversation to limit it to talk about cryptocurrencies, because as Lauren pointed out, cryptocurrencies might go bust. It's more to say digital assets, digital identity markers that are going to be protected in your digital vault. Because these things are emblazoned on the ledger that there's many copies of, and you can't forge it. And then you have the direct connection with your private key and that you don't really do other kinds of manipulation with this wallet. It's almost like in medieval times, they had a seal, and you had your own personal seal that you would stamp it with to verify it's you. This is a much more secure, high-tech version of that. You don't need to trust anyone. I mentioned Taylor Swift tickets—they're super, super valuable. If you want a non-forgeable Taylor Swift ticket, this would be the way to do it. You wouldn't have to trust a scalper, you wouldn't have to trust Ticketmaster. That would be your proof that you're the owner of a general admission ticket to see Taylor Swift.\nLauren Goode: Steven, before we go, I have to ask you, have you purchased a Ledger Stax wallet, and are you investing in crypto?\nSteven Levy: Well, I don't have the new one yet. They did send me the current version to test out, and I managed to get it going. But I actually came down with Covid before I actually wanted to confer with their people, before I moved my wealth of crypto assets over to it. I wrote about this, I do own some crypto because in 2014 I went to a demo of a bitcoin ATM and put $20 in and at one point it got to be a lot of money. But now it's still worth over a thousand dollars.\nLauren Goode: Nice.\nMichael Calore: Nice.\nSteven Levy: Which I thought was ironic, because all these investors were going to this Y Combinator Demo Day figuring out which company would be a return on their investment. And they just should have funneled a lot of money into that ATM machine, they would've done better.\nLauren Goode: But what I'm hearing you say is that, and by the way, we're sorry that you were dealing with Covid, and we're glad that you're better and back on the show. But it sounds like you are waiting for something to move those crypto assets onto this new wallet. Does that mean you don't fully trust it?Steven Levy: I don't trust myself to do it correctly. And this is the one scary part about wallets, is ultimately the responsibility is yours. If someone gets your passcode and the passcode for these wallets … the way the private key is generated, I think like 26 different words that you have to write down. And if you lose that, and if someone else comes across it, they can basically claim your assets. So it's up to you to protect your password for that private key. And if you screw up, it's gone.\nMichael Calore: Yeah. Well don't screw up.\nSteven Levy: Yeah. Well, yeah. I don't want to lose my fortune in bitcoin.\nMichael Calore: All right, let's take another break, and when we come back we'll do recommendations.\n[Break]\nMichael Calore: OK. Steven Levy, you are our guest. So please tell us, what do you recommend to our listeners that they check out.\nSteven Levy: Paxlovid.\nMichael Calore: Paxlovid?\nSteven Levy: Yes. It's this medicine, this drug that is an option to take, and you get it free, the government pays for it actually. If you've come down with Covid and you do it in the first five days of symptoms, it can lessen the symptoms by maybe a couple days. And cut the odds if you've been vaccinated, they're already pretty low, but further cut them, that serious bad things will happen. The drawback is that it tastes very bad. And in my newsletter I did some tasting notes and I said, “There's a bouquet of a porta potty and an underfunded jam band concert.” And other kinds of things. To me, because I had some very uncomfortable flu-like symptoms to cut a couple days out of, that was worth it. So I recommend Paxlovid.\nMichael Calore: That's great. And I know that if you have symptoms and you're worried that you might have Covid, and you go to get tested at a facility like a hospital or a public testing site or the local library or your doctor's office, they will ask you if you are you interested in receiving Paxlovid. And they'll give it to you if you do test positive.\nSteven Levy: Yeah, it's very easy to get. Originally when they first came out, it was tough to get. Now it's super easy. Basically, my doctor, who I had a telemedicine appointment with, went over with it, and actually he was sort of on the fence. Because some people reported you get a bounce back, so you have to sort of crunch some numbers. Supposedly it lessens the odds you'll get long Covid. But I weighed all the factors and decided to get it. And my pharmacy delivered it within an hour from there. So I took the five days of Paxlovid.\nMichael Calore: And you can taste things again now.\nSteven Levy: Yeah, yeah. I never lost my sense of taste, but I was hyper aware of the taste of Paxlovid.Lauren Goode: Once again, Steven, we're very glad that you have recovered.\nSteven Levy: Well, thank you.\nMichael Calore: Indeed. Lauren, what is your recommendation?\nLauren Goode: My recommendation is going to seem rather nonessential compared to Steven's. But if you happen to be, oh, I don't know, staying home with Covid and you're looking for something to watch, I recommend White Lotus season two. I recommended this earlier this year when I first started watching it. Now the season has wrapped up. It's an incredible series; check it out. Don't go on Instagram if you don't want it spoiled for you. If you don't want to know who dies. I recommend staying away from Evan Ross Katz's profile in particular, because he screenshots a lot of memes from the show. He's hilarious. But yeah, White Lotus season two, just to follow up on that one. And then my actual recommendation this week is related to our podcast producer, Boone Ashworth, because Boone uses these amazing pens. They're by the brand Zebra, they're called the Sarasa, what are they called?\nMichael Calore: Sarasa Grand.\nLauren Goode: Sarasa Grand, they're these amazing gel weighted pens. And our pod here, not our podcast pod, but our pod at work here, we sometimes exchange some holiday gifts. And Boone, after I raved about his pen the other day, he was kind enough to get me a gift set of the Zebra Sarasa Grand pens, and they're awesome. So thank you, Boone. And if you're looking for a good pen or a nice little gift set to give to someone who likes pens, I recommend these.\nMichael Calore: Lauren says we sometimes exchange gifts because some of us have exchanged gifts, but I being the cad and forgetting that most people are not going to be around next week, I haven't gotten anybody gifts yet. So hang tight you all.\nLauren Goode: It's OK. Your presence is a gift.\nMichael Calore: No, yeah, it is. But also I do have things in mind that I'm going to get you. So please hold for those. I appreciate it.\nLauren Goode: And Mike, what's your recommendation?\nMichael Calore: OK. My recommendation is on-topic for this week, because last week I was going through our storage closet here at work, and I found a Bowers and Wilkins Zeppelin Air, which was the big sort of dooby-shaped black speaker that you put an iPod on. And it has a 30-pin connector on top of it. So it's like an iPod dock, but it's amazing. It sounds wonderful. I think it was a thousand dollars when it came out. So I went further into the closet, and I found my old iPod, and I charged it up and I put it on that thing. And I spent two days just listening to my iPod. And I have to say, owning music and listening to music that you own on a device that is not connected to the internet just feels different. There's something about it. There's something that is sort of like you are settling for what's in your library and not constantly poking around for something else to listen to. There is nothing else to listen to. You have very limited choice, and it really helps you make focused decisions about what you're listening to. So I'm the type of person who fills as many minutes of my day with music as I can, at work, while I'm walking around, at home, while I'm in the kitchen. Even when I'm going to sleep, I listen to music. So having this iPod and having a limited choice of things to listen to has made me revisit a bunch of albums that I normally would not pick if I was just surfing Spotify. So if you have an iPod and you haven't listened to it in a while, bust it out, because there's all kinds of great music on there that you actually own.Steven Levy: Well, here's the thing. I have an iPod Classic, the last one with a good hard drive. And I'm terrified that it's going to die, because when it dies, you can't replace it. So I love to listen to that iPod on a plane ride where I can shuffle my whole collection. But I have to judge whether the trip is going to be worth it to take it, and spend some more time in what is ultimately a limited amount of life left in this pod. So the question is, is this trip iPod-worthy, in the sense that in Seinfeld, Elaine had the sponge-worthy metric on whether she wanted to use a certain kind of contraceptive. So I'm constantly thinking, \"Gee, do I want to listen to music enough to pull out my great clickwheel iPod? Is this iPod-worthy?\"\nMichael Calore: Well, I'll say two things. One, that you can still get iPods. You can buy them on the internet, you can refurbish them, you can get a tool kit and get a hard drive and pop them open and replace the hard drive inside of them. If the hard drive dies, of course, you have to refill it with music, but you can still plug a USB cable somehow into your computer and refill it with music if you have to. So I wouldn't worry so much about losing that particular piece of hardware, because the hardware still for the next few years anyway, will be replaceable. The second thing I'll say is, ride it into the ground. Absolutely. Break that thing. Listen to it so much that it falls apart.\nSteven Levy: Well, after Covid it's all carpe diem for me. So I guess I'll take your advice.\nLauren Goode: There was a period of time when I was using this little waterproofed iPod. What was it, the Nano?\nMichael Calore: The Nano.\nLauren Goode: The one that doesn't have any screen, just the clickwheel.\nMichael Calore: Oh, that's the Shuffle.\nLauren Goode: The Shuffle.\nMichael Calore: The first Shuffle.\nLauren Goode: Yeah. I found this company, I wrote about them at one of my previous jobs. This company, I want to say they were in, I don't remember where they were, Oregon maybe, Washington state. And it was just a father-and-son team who would buy these iPod Shuffles in bulk, and then they would waterproof them, and they were for swimming. And they were great. I bought these little waterproof headphones, I clipped the iPod Shuffle to the strap of my bathing suit. And I would listen to music as I was swimming laps. I loved it.\nMichael Calore: That's great.\nLauren Goode: Loved it. And then eventually, I think it just, no matter how well you waterproof it, it got corroded, because it was really not designed to be underwater. Pretty cool though. That's the last one I used.\nMichael Calore: Oh, that's great. All right, well that is our show for this week. Steven, thank you again for joining us.\nSteven Levy: It was all I hoped for. Thank you.\nMichael Calore: And we're glad that you're feeling better. It's good to see you.\nSteven Levy: Thank you.\nMichael Calore: And thank you all for listening. If you have feedback, you can find all of us on Twitter, still there. Just check the show notes. Our producer is Boone Ashworth, and we will be back next week. Goodbye.\n[Gadget Lab outro theme music plays]","creation_date":"2022-12-15","tags":["","GADGET LAB PODCAST","PODCASTS","CRYPTOCURRENCY","BLOCKCHAIN","WALLETS"],"author":"BY WIRED STAFF","category":null}