{"id":"79f74e9e-0d73-4687-bb79-ee3eb39098c7","article_link":"https://cointelegraph.com/news/visa-provides-stablecoin-analytics-dashboard-noise-filtered","website_source":"Cointelegraph","article_type":"News Article","summary":"The financial services giant wants to make data about stablecoin usage clear and accessible, which requires some processing.","title":"Visa provides stablecoin analytics dashboard with ‘noise’ filtered out","detailed_content":"Visa has premiered an Online Analytics Dashboard for stablecoins. The website seeks to cut through the “noise” to provide easily accessible and digestible data on four stablecoins across nine blockchains.\nIn a blog post introducing the new service, Visa head of crypto Cuy Sheffield stated that stablecoin data, despite being publicly available in real time, requires interpretation before they can be compared to activity on traditional financial networks.\nSource: Cuy Sheffield\nThe noise in stablecoin data is the result of their varying use cases. Smart contracts, or “bot programs,” are used for arbitrage, liquidity provision, market making and other functions in decentralized finance (DeFi) that are not comparable to “settlement in the traditional sense.” Visa applies filters out bot activity:\n“When we apply a simple heuristic that removes inorganic data, we see that transfer volume for the last 30 days can be adjusted from $2.65T to $265B.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nFurthermore, stablecoin accounting is represented differently from traditional transactions. Sheffield noted in an X post:\n“If a consumer converts $100 of USDC to PYUSD on Uniswap, this is counted as $200 of total stablecoin volume ($100 of USDC from the consumer's wallet to the Uniswap contract, and $100 of PYUSD from the contract to the consumers wallet).”\nIn the Visa analytics, that transaction would be considered $100 in volume. The website provides data on USD Coin\nUSDC\n$1.00\n, Tether\nUSDT\n$1.00\n, PayPal USD\nPYUSD\n$1.00\nand Pax Dollar (USDP) supply, transactions and users using charts and graphs. Off-chain transactions with stablecoins are not captured in the data.\nStablecoin transaction volumes, with and without heuristic adjustment. Source: Visa Onchain Analytics Dashboard\nVisa is engaged with crypto and blockchain technology on several fronts. It announced a project to “drive mainstream adoption of public blockchain networks and stablecoin payments” in 2023 and it already supports USDC. It has also partnered with MetaMask to allow crypto withdrawals on its debit cards.\nRelated: Bitcoin to surge to $80K as stablecoins overtake Visa in 2024 — Bitwise\nVisa participated with the Hong Kong Monetary Authority and two banks on a project using central bank digital currency and tokenized deposits in 2023. This year, it was one of 11 financial institutions that experimented with use cases of the U.K. Regulated Liability Network.\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-26","tags":["#Blockchain","#Visa","#Business","#Analysis","#Stablecoin"],"author":"by Derek Andersen","category":null}