{"id":"7c1dd911-b20c-4a52-8cc2-a975f6c32e9b","article_link":"https://cointelegraph.com/news/mastercard-standard-chartered-test-hong-kong-sandbox","website_source":"Cointelegraph","article_type":"News Article","summary":"Mastercard’s Multi-Token Network enabled an atomic swap of a tokenized carbon credit for cash in a bank account.","title":"Mastercard, Standard Chartered test tokenized deposit transaction","detailed_content":"Mastercard and Standard Chartered Bank Hong Kong (SCBHK) have completed the first live test of Mastercard’s Multi-Token Network (MTN). They ran a proof-of-concept pilot that tokenized carbon credits within the Hong Kong Monetary Authority (HKMA) Fintech Supervisory Sandbox.\nIn the project, a client of SCBHK’s virtual bank, Mox Bank, deposited funds into Mox and requested to buy a carbon credit. Mox requested that SCBHK tokenize the carbon credit through tokenization service provider Libeara, launched in Standard Chartered’s venture arm SC Ventures. MTN tokenized the deposit, and an atomic swap — a real-time swap that takes place across different blockchains — of the two tokens was performed.\nRelated: Hong Kong regulator issues tokenized investments requirements amid demand\nMastercard launched the MTN in June 2023. It was built on Mastercard’s private blockchain. It had previous trial runs in conjunction with the Reserve Bank of Australia using wrapped central bank digital currency (CBDC) and the HKMA using its e-HKD CBDC. Neither of those CBDCs is live. Mastercard managing director of Hong Kong and Macau Helena Chen said:\n“As the […] HKMA further develops Hong Kong as a leading digital assets hub, Mastercard is fully committed to supporting its efforts to drive fintech innovation and the advancement of the tokenization market in Hong Kong.”\nThe HKMA reportedly has pressured Hong Kong banks, including SCBHK, to provide better service to cryptocurrency exchanges. SCBHK is involved in the HKMA’s Project Ensemble, which is currently being developed, and its e-HKD pilot program, as well as the multinational Project mBridge. The e-HKD pilot project announced the beginning of its second phase in March.\nSource: MetasgameOfficial\nFarther afield, Standard Chartered has also participated in projects with SWIFT using CBDC and U.K. Finance using the Regulated Liability Network. In November, SC Ventures set up a crypto fund in the United Arab Emirates.\nHSBC bank and China’s Ant Group tested tokenized deposit transactions in an HKMA sandbox using Ant Group’s blockchain in November. HSBC also offers Bitcoin ad Ethereum futures exchange-traded fund trading in Hong Kong.\nMagazine: Hong Kong Bitcoin ETF launch in ‘top 20%,’ STRK scam suspect busted: Asia Express\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Hong Kong","#Business","#Tokens"],"author":"by Derek Andersen","category":null}