{"id":"7cfc4139-ac1d-4d8b-bdd1-6677816ed82d","article_link":"https://cointelegraph.com/news/blockchain-education-initiatives-crypto-bull-market","website_source":"Cointelegraph","article_type":"News Article","summary":"Despite strong demand for crypto-savvy workers, there exists a shortage of highly-experienced employees.","title":"Blockchain education initiatives take off amid crypto bull market","detailed_content":"Amid an industry boom, crypto education initiatives are quickly gaining traction. \nOn May 7, organizers of the Women in Tech Global Summit 2024 announced that they would incorporate Unstoppable Domain’s technology for its own Web3 top-level domain (TLD). Dubbed “.WITG,” the digital identity domain, assignable to each participant, will allow users to network as well as access education and training at the intersection of technologies such as blockchain and artificial intelligence. \n“The .WITG TLD is designed to foster a strong sense of community and identity among women in tech, facilitating networking, mentorship, and collaboration opportunities,” wrote the organizers of the Women in Tech Global Summit. By “using the tech to learn the tech,” this pioneering domain aims to provide women with the tools they need to succeed and excel in the digital space, they added. \nThe Women in Tech Global Summit 2024 Main Event\nIn a recent survey by crypto exchange KuCoin, 88% of young adults in a worldwide sample of 1,900 respondents said that they are “eager” to pursue careers in the blockchain space, with 75% demonstrating a “very high” interest in the Web3 sector.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThat said, only 15% of respondents surveyed said they possess more than three years of experience in blockchain. The exchange has since launched the KuCoin Campus initiative, which offers a series of offline events at schools and colleges around the world to teach students about digital finance. \nSimilarly, crypto exchange Bitget recorded over 6,000 participants on the one-year anniversary of its $10 million Blockchain4Youth initiative from last May. Over 51 universities participated — such as University College London, National Technological University of Argentina, Royal Melbourne Institute of Technology, National Taiwan University’s Blockchain Club, Philippines Ateneo De Manila University, and others — issuing more than 2,000 Web3 certificates for participants who completed the courses and passed the final exams. \n“Blockchain4Youth’s future plans include providing more scholarships worldwide and launching more online courses and content featuring different influencers in the field on crypto-related topics to further garner youngster’s attention,” exchange staff wrote. The initiative is ongoing and will last until May 2028. \nEven Changpeng “CZ” Zhao, co-founder and former CEO of crypto exchange Binance, is turning his attention to education after stepping down from office in November 2023. “We wanted the @GiggleAcademy logo to show youth, fun, positive energy, and growth, we also want to show respect to our Binance heritage,” wrote CZ in a tweet promoting his newest educational initiative.\n“Initially, our dev capacity may lag behind a bit, but we intend to catch up once we get to the scaling phase,” he wrote in a separate post in reference to Giggle Academy. \nCointelegraph previously reported in November 2023 that the Institute of Crypto-Assets, a first-of-a-kind scientific board, opened at the Léonard de Vinci Centre in the business district just outside of Paris. A committee of six practitioners, including Ledger co-founder Nicolas Bacca and Paymium founder Pierre Noizat, will oversee the institute's work.\nRelated: Open-source Bitcoin education aims to spread global financial literacy\nExplore more articles like this\nSubscribe to the Cointelegraph Research Newsletter\nSelect the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Cryptocurrencies","#Education","#Business"],"author":"by Zhiyuan Sun","category":null}