{"id":"7d40c655-e315-4c0a-9cce-c28264705039","article_link":"https://www.wired.com/story/oneplus-pad-android-tablet/","website_source":"Wired","article_type":"News Article","summary":"Plus: Netflix expands its efforts to end password sharing, Apple’s “buy now, pay later” entry creeps closer, and we scrutinize your Bitcoin spending.","title":"OnePlus Now Has Its Own Android Tablet","detailed_content":"THERE’S NO SHORTAGE of tablets in the world, from the ever-dominant iPad to an assortment of Android options and Fire tabs to the niche weirdos like the E-ink and stylus Kindle Scribe. Now, OnePlus, a Chinese manufacturer known for its speedy, solid smartphones, is throwing its own Android tablet onto the table. The company announced the OnePlus Pad this week, along with the second generation of its Buds Pro bluetooth earbuds, and an all new mechanical keyboard.\nThe aluminum-bodied tablet looks to be a sleek addition to the often clunky world of Android tablets. Most notable is its 11.6-inch screen with an aspect ratio of 7:5. That’s odd for a tablet; most iPad screens are 4:3, which is the same as a classic television set. When you hold the OnePlus Pad in landscape mode, the tablet’s screen should be a little taller than you might be used to on a tablet. \nThere's a 13-megapixel camera on the back of the tablet (and an 8-megapixel selfie cam on the front).\nPHOTOGRAPH: ONEPLUS\nAlso notable is the matching keyboard that attaches magnetically, and the stylus for pen input. Both are sold separately. OnePlus claims the battery life is good for over 12 hours of continuous video playback; you can watch Seven Samurai three times plus a couple episodes of The Office before recharging. It is available in one color (green) and will be available for preorder in April for an undetermined price. Hovering ominously in the background here is the notion that Google is expected to debut its newest Android tablet later this year, possibly in May.\nFEATURED VIDEO\nHow Vinyl Records Are Made (with Third Man Records)\nHere are some other stories from the world of consumer tech.\nNotflix\nLast week, Netflix accidentally leaked the news that it will crack down on password sharing. Then it hastily walked that back after a public outcry. But now Netflix has officially announced it is implementing rules that prevent people who don’t live in the same home from sharing a single Netflix account. The unlucky first victims of this policy are subscribers in Canada, New Zealand, Spain, and Portugal.\nIn its announcement, Netflix detailed its plans for limiting account sharing. Now, anyone not living in the same household as the account holder will be prompted to transfer their profiles to a new paid account or be cut off. Netflix says the restrictions will roll out more broadly within months. It also said the service would “refine these new features based on member feedback.” As you might imagine, that feedback has been not great.\nThe streaming service has been building to this for a while now, testing out these restrictions in countries with a smaller customer base. The crackdown hasn’t come for the US yet, but that it will seems about as likely as Netflix canceling one of its shows after a single season. (Which is to say, very likely.)\nApple Tests Buy Now, Pay Later\nBuy-now, pay-later plans are all the rage, allowing customers to pay for stuff in interest-free installments rather than one bank-breaking chunk. Financial services like Klarna and Affirm have become very popular among cash-strapped consumers, who have even used them to buy food and holiday gifts. Of course, they’ve got some problems. (Who doesn’t love the idea of not paying full price and then potentially getting wracked by debt months later?)\nApple is eager to get in on the BNPL game under its own proprietary system, of course. Apple first announced the feature at its 2022 Worldwide Developers Conference, but it has yet to make its way to the public. Recently, Apple expanded its testing of the plan to employees at its retail stores, a move that has often preceded other Apple service announcements. That seems to indicate that the broader rollout of its BNPL plan is imminent.\nThe Crypto Keeper\nBack in the day, all the cool kid criminals used crypto. Blockchain-based currencies like Bitcoin were hailed as an anonymous, untraceable means of payment. Aspiring lawbreakers could use crypto to buy even the darkest of dark web contraband with impunity, their identities shrouded in the mystery guaranteed by their means of payment. Or so many people thought.\nTurns out, Bitcoin and other cryptocurrencies are in fact entirely traceable. You just have to know where to look. And unfortunately for some crypto-carrying criminals, federal law enforcement officers knew exactly how to track them down.This week on Gadget Lab, WIRED senior writer and author of the book Tracers in the Dark Andy Greenberg digs into the cat-and-mouse game that is uncovering crypto cybercrime, and why even the people who depended on the complexity of crypto the most failed to understand the digital trail that it leaves behind.","creation_date":"2023-02-11","tags":["","GEAR ROUNDUP","TABLETS","ANDROID TABLETS","NETFLIX"],"author":"BY BOONE ASHWORTH","category":null}