{"id":"7dc2afe5-52ec-4046-b266-ffd67333f364","article_link":"https://cointelegraph.com/news/ethena-announces-integration-exchange-wallets","website_source":"Cointelegraph","article_type":"News Article","summary":"The move allows users to earn Ethena USDe yields directly from Binance, Bybit, OKX and Bitget wallets.","title":"Ethena announces integration with exchange wallets","detailed_content":"Synthetic stablecoin protocol Ethena Labs has integrated with centralized exchange wallets of Binance, Bybit, OKX, and Bitget as of April 10.\n“Users locking USDe for at least 7 days through exchange Web3 wallets are eligible for a 20% reward boost starting today,” said Ethena developers.\nThe incentives, issued in the form of “Ethena sats,” can be converted to its native ENA token at the end of each campaign. To earn sats, users must first deposit Ethena USDe stablecoins into their exchange wallets, connect to the Ethena decentralized finance (DeFi) protocol, and stake their holdings. The protocol has a total value locked of $2.274 billion at the time of publication, generating an annualized revenue of $178 million.\nSource: Ethena Labs\nThe protocol’s ecosystem rewards have attracted considerable attention and usage. As told by blockchain analytics firm Lookonchain, since the start of Ethena Staking Season 2, the top 10 wallets have withdrawn a total of 37.5 million ENA ($51 million) and staked them.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOn March 8, less than one month after launching its USDe stablecoin, Ethena became the highest-earning decentralized application in crypto when it offered a 67% annual percentage yield (APY) on USDe. The protocol currently has an APY of 24% on its stablecoins. However, the yield is not without risks, as it relies on trading income of complex Ethereum derivatives to pay out promised returns. \nAmid concerns over its high yield, Guy Young, founder of Ethena Labs, told Cointelegraph in an interview on Feb. 22 that comparisons to the failed Terra stablecoin, TerraUSD (UST), were just “knee-jerk reactions” and that the firm’s yields were organic and sustainable.\n“The biggest piece we’re trying to get across is that Anchor’s yield was just totally made up,” Young said. “It was just venture capital firms putting money into [USTC yield protocol] Anchor and then paying out a yield, which came from nowhere.”\nMeanwhile, Ethena’s yields, which are publicly verifiable, are derived from a combination of Ethereum consensus layer inflation rewards, execution fees paid to Ether\nETH\n$3,030\nstakers, maximal extractable value fee captures acquired by Ether stakers, and trading income provided by Ethena Labs. Specifically, the firm opens short derivative positions when it receives long-position collateral assets for minting USDe. The spread, or difference in value between the two positions, is then paid out to USDe holders as yield. \nRelated: Frax Finance dives into DeFi liquidity with $250M USDe allocation\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-11","tags":["#Blockchain","#Cryptocurrencies","#Wallet","#Ethereum","#Adoption","#Stablecoin","#DeFi"],"author":"by Zhiyuan Sun","category":null}