{"id":"7ea3f219-8e2d-4755-abc3-6132bb0ed688","article_link":"https://cointelegraph.com/news/vodafone-blockchain-integrate-crypto-wallets-sim-cards","website_source":"Cointelegraph","article_type":"News Article","summary":"The telecom company is reportedly seeking $1.8 billion in loans amid a plan to raise a total of $2.9 billion in debt.","title":"Vodafone looks to integrate crypto wallets with SIM cards","detailed_content":"Vodafone, a United Kingdom-based telecommunications provider, hopes to bring blockchain technology to smartphone users by integrating cryptocurrency wallets with subscriber identity module (SIM) cards. \nThe ambitious move comes amid a company finance plan that reportedly involves Vodafone Idea — a separate entity operating in India that the Vodafone Group has a 45% stake in — taking on nearly $3 billion in debt, including $1.8 billion in loans over the next two years.\nIn a recent interview with Yahoo Finance Future Focus, Vodafone Blockchain Lead David Palmer discussed the company’s plans to integrate blockchain technology into smartphone sim cards:\n“By 2030 we’re expecting more than 20 billion mobile phones to be in operation, many of those being smartphones. […] So we’ve focused on linking the sim card to digital identity, linking the sim card to blockchains, and using the cryptography we have in those sim cards for that integration.”\nPalmer elaborated on the figures he presented, stating that he expected there to be some eight billion smartphones in use by 2030 and predicting a surge in crypto wallets to 5.6 billion in the same time frame — enough to account for nearly 70 percent of all people on Earth.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nDespite the financial wrangling occurring with India-based Vodafone Idea, which recently sold off $2.2 billion worth of shares ahead of a debt-raising plan worth a reported $3 billion, Vodafone Group has had a busy 2024.\nAs Cointelegraph recently reported, the company entered into a 10-year strategic partnership with Microsoft to bring generative artificial intelligence (AI) services to Vodafone’s customers.\nUpon announcing the deal, Microsoft CEO Satya Nadella took the opportunity to hawk the disruptive nature of his company’s AI technologies, declaring that the “new generation of AI will unlock massive new opportunities for every organization and every industry around the world.”\nThis isn’t the first time a company has worked to combine cell phone technology with blockchain hardware. Back in 2019, U.S. startup VaultTel announced its ambitions to create a physical wallet that could be slotted into a smartphone’s SIM slot.\nRelated: Vodafone auctions world’s first SMS 'Merry Christmas' as NFT for charity\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-04","tags":["#Blockchain","#Cryptocurrencies","#Business","#Wallet","#India","#Hardware Wallet","#United Kingdom","#AI","#Mobile Wallet","#Smartphone","#Vodafone","#SIM Swap"],"author":"by Tristan Greene","category":null}