{"id":"7fda25c5-651c-4459-843c-bca438ab746d","article_link":"https://cointelegraph.com/news/tether-chainalysis-partnership-enhances-monitoring","website_source":"Cointelegraph","article_type":"News Article","summary":"The blockchain analytics firm will provide tools to spot sanctioned and illicit activity and provide market information.","title":"Chainalysis will help Tether monitor secondary market for illicit activity","detailed_content":"Tether will have the ability to monitor the secondary market for its stablecoin, thanks to a solution created by blockchain analysis firm Chainalysis. The new capabilities will allow Tether to gain market insights and identify wallets that may be tied to illicit or sanctioned addresses.\nThe new solution will consist of several tools. Tether listed four of them in an announcement on its website. Sanctions Monitoring will provide a list of addresses and transactions that involve sanctioned entities. Illicit Transfer Detector will spot transactions that are potentially associated with activities such as terrorism financing.\nCategorization will classify Tether\nUSDT\n$1.00\nholders by type, such as exchange or darknet market. Largest Wallet Analysis will focus on “significant” USDT holders and their activities. Tether CEO Paolo Ardoino said:\n“Our collaboration with Chainalysis marks a pivotal step in our ongoing commitment to establishing transparency and security within the cryptocurrency industry. […] This collaboration reinforces our proactive approach to safeguarding our ecosystem against illicit activities.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nTether has collaborated with authorities in 43 jurisdictions “to address illicit activities,” the announcement pointed out. Nonetheless, the company has come under fire for the stablecoin’s alleged role in criminal activities and terrorism financing.\nRelated: Tether nets record $4.5B profit in Q1 2024 — majority from Bitcoin and gold\nTether even ran afoul of pro-crypto United States Senator Cynthia Lummis, who sent a letter to Attorney General Merrick Garland demanding an investigation of the role Tether and Binance played in the Hamas attacks on Israel in October. She and cosigner Representative French Hill alleged that Tether was “knowingly facilitating violations of applicable sanctions laws.”\nSource: Tether\nA report from the United Nations Office on Drugs and Crime on organized crime in East and Southeast Asia released in January was heavily critical of the role crypto played in financing crime in the region and pointed to USDT in particular. Tether responded by saying the organization ignores the traceability of USDT.\nTether has also been criticized for its lack of financial transparency. USDT has a market cap of $109.8 billion, far outflanking its nearest competitor USD Coin\nUSDC\n$1.00\n, whose market cap is $33.9 billion.\nMagazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis\nExchange or buy USDTSOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-03","tags":["#Blockchain","#Analysis","#Terrorism","#Tether","#Counter Terrorism Financing","#Whale","#Regulation"],"author":"by Derek Andersen","category":null}