{"id":"814c63ad-d054-4728-a5f8-218adc6c412f","article_link":"https://cointelegraph.com/news/blackrock-no-commercial-relationship-hedera-hbar-token-falls","website_source":"Cointelegraph","article_type":"News Article","summary":"A BlackRock spokesperson confirmed the firm wasn’t directly involved in Archax and Ownera’s decision to tokenize shares of BlackRock’s ICS Treasury Fund on Hedera.","title":"BlackRock has ‘no commercial relationship’ with Hedera, HBAR sinks 32%","detailed_content":"BlackRock has confirmed it has “no commercial relationship” with Hedera and that it did not choose the Hedera Hashgraph to tokenize any BlackRock funds, including shares of its $22 billion money market fund.\nHedera’s\nHBAR\n$0.11\ntoken rallied over 100% on Tuesday following the HBAR Foundation’s announcement on X stating that blockchain firms Archax and Ownera tokenized BlackRock’s ICS U.S. Treasury Fund on Hedera.\nSome misinterpreted the post to suggest BlackRock played an active role in the tokenization effort, but a BlackRock spokesperson has confirmed to Cointelegraph that’s not the case.\n“BlackRock has no commercial relationship with Hedera nor has BlackRock selected Hedera to tokenise any BlackRock funds.”\nAs of the time of writing, HBAR has fallen 32.8% in the past 24 hours to $0.118 since it peaked at $0.176 at 5:00 am UTC on April 24, according to CoinGecko.\n“As we have in the past, BlackRock will communicate directly with the public on the evolution of our digital asset strategy,” the spokesperson added.\nHBAR Foundation’s announcement has amassed over 2.9 million views and 3,200 reposts since it was posted a little over 36 hours ago — though some cryptocurrency influencers misinterpreted the message.\nSource: HBAR Foundation\n“BLACKROCK JUST TOKENIZED ONE OF THEIR MONEY MARKET FUNDS ON HEDERA,” said Mason Versluis to his 189,000 X followers.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nArchax CEO Graham Rodford also clarified later on X that it was his firm’s choice to put shares of BlackRock’s money market fund on Hedera but said BlackRock was “aware” that Archax was tokenizing shares of the fund.\nRodford further explained the nuance during an interview with crypto YouTuber Jesus Martinez.\n“What we saw on Twitter was kind of pretty much close to the truth [...] Archax had clients that wanted to invest in the BlackRock money market fund. When they expressed an interest we opened an account at BlackRock so that we could,” explained Roford. \n\"With most of the investments we make, we want to tokenize them, we told them [BlackRock] we were going to and then just out of the good relationship with them we said 'hey we're putting out a press release, you guys happy to check it?' — so they checked it and gave their views on it,\" he explained. \n“Some kind of went a bit off track, saying ‘hey, BlackRock did this, BlackRock did that, BlackRock were involved’ […] but Archax has been leading the project.”\nCointelegraph reached out to HBAR Foundation on April 24 but didn’t receive a response.\nRelated: Hedera network approves $408M of HBAR for ecosystem growth\nDespite the short-lived price pump, HBAR is still down over 78% from its September 2021 all-time high of $0.57, according to CoinGecko.\nHBAR’s change in price over the last month. Source: CoinGecko\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nUpdate (April 25 at 3:45 am UTC): Added a further explanation from Archax CEO Graham Rodford taken from an interview with Jesus Martinez.\nExchange or buy HBAR\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-25","tags":["#Blockchain","#Business","#Investments","#Adoption","#Tokens","#Hedera"],"author":"by Brayden Lindrea","category":null}