{"id":"815e22ba-39d7-49b5-be89-b0abe9c96e26","article_link":"https://cointelegraph.com/news/on-chain-data-missing-link-web3-advertising","website_source":"Cointelegraph","article_type":"News Article","summary":"Web3 advertising platform Addressable is tapping into AppsFlyer’s mobile analytics to improve marketing for mobile applications.","title":"On-chain data — The missing link in Web3 advertising","detailed_content":"On-chain wallet data promises to be a game-changer for companies looking to target Web3 users, developers and traders — but this hinges on infrastructure connecting wallets to social media profiles.\nCointelegraph spoke to Addressable chief technology officer Asaf Nadler during Paris Blockchain Week, who unpacked details of a new partnership with mobile analytics platform AppsFlyer to improve marketing campaigns for Web3 applications.\nNadler said the company is looking to solve user acquisition challenges in the cryptocurrency ecosystem. Conversations with more than 300 marketers over the past two years have centered around reaching a target audience based on on-chain activity.\nRelated: TON continues to attract Web3 firms as Telegram Ad Platform goes live\n“They’re looking for traders, for developers that deploy smart contracts on blockchains, for NFT collectors, for gamers playing blockchain games,” Nadler explained.\nAddressable’s platform allows advertisers to target specific Web3 wallets from different EVM chains. Source: Addressable\nNadler gave Cointelegraph a first-hand demo of the Addressable platform, showing how users could filter and target wallets from different Ethereum Virtual Machine (EVM chains to build a targeted advertising campaign. The process is similar to adding filters like gender, age and geographic location in conventional advertising platforms. \nAddressable’s data visualization includes a geographical breakdown of Web3 wallets in a global format. Source: Addressable\nConsidering that most Web3 wallets are alphanumeric and anonymous, many advertising platforms cannot target wallet owners. Addressable’s infrastructure combines conventional Web2 information with blockchain data to target a niche but growing sector of the internet:\n“We’re connecting wallet owners to social profiles so companies can run targeted advertisement campaigns on Twitter [now X] and display ads to a group of wallets.”\nThe platform is specifically aimed at serving Web3 companies and clients. Conventional advertising platforms provide customizable targeting, but Nadler said that cryptocurrency-related products and services are typically not relevant to a broad audience on social media platforms like X or Facebook:\n“The thing about crypto is most products aren’t a commodity. My mother wouldn’t understand most crypto products. So a tweet on X just flies by anybody who is not native and doesn’t understand that.”\nAddressable currently supports seven different Ethereum EVM chains, including BNB, Polygon, Arbitrum, Optimism and Avalanche.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“The key is that we’re able to collect the data to build wallet profiles and associate them to real-world data so that they’re targetable,” Nadler said.\nRelated: Telegram channels eligible for 50% ad revenue, but there’s a catch\nAddressable’s integration with AppsFlyer provides more utility for the targeted advertising platform. Clients can tap into data from Web3 mobile platforms and target users of these mobile applications. \nNadler said the integration includes data sharing from their platform so that mobile advertisers can get more utility than just an increase in application downloads:\n“They can optimize for what drives the wheels into their protocol, what drives people that are spending more crypto on their wallets, on their apps, on their games. It’s an industry milestone.”\nAppsFlyer is a specialist mobile marketing tool used by TikTok, Disney, Binance and Crypto.com. It aims to optimize mobile app marketing campaigns with granular attribution data. The partnership is touted to allow Addressable to reach a significant percentage of Web3 mobile applications.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Adoption","#Marketing","#Web3"],"author":"by Gareth Jenkinson","category":null}