{"id":"817bec6e-2010-4929-9bd6-b154229fa794","article_link":"https://cointelegraph.com/news/keeping-up-with-user-demand-and-web3-innovation-phemex-introduces-lending-protocol-and-pulse-season-3-interview-with-stella-chan","website_source":"Cointelegraph","article_type":"News Article","summary":"Crypto exchange executive sheds light on innovations within its Web3 ecosystem, including SocialFi platform and new lending protocol.","title":"Keeping up with user demand and Web3 innovation: Phemex introduces Lending Protocol and Pulse Season 3 — Interview with Stella Chan","detailed_content":"Keeping pace with user needs and technological shifts is essential for platforms looking to secure a competitive edge in the crypto exchange sector. Established in 2019, Phemex distinguishes itself in the crowded market of crypto exchanges by addressing the specific needs of traders with a daily trading volume of approximately $2 billion across more than 300 trading pairs.\nPhemex has been making a splash in the crypto world with its pledge to become a hybrid exchange, embracing decentralization in its core processes. Just earlier this year, the dynamic exchange rolled out Pulse, its SocialFi platform, creating a one-stop hub where traders can seamlessly merge their social interactions and trading activities, all while earning rewards for their engagement.\nIn this interview, Phemex chief operating officer and co-founder of Pulse Stella Chan discusses the exchange’s recent initiatives, including their presence at the Token 2049 event in Dubai, its newly launched lending protocol, Pulse season 3 and the new avenues they are exploring to enrich their user engagement and platform capabilities.\nCointelegraph: Phemex recently attended the Token 2049 event in Dubai. Could you give us a recap of the event and the atmosphere?\nStella Chan: Token 2049 was an outstanding success, and I’m thrilled to report that our Phemex events truly made a splash, drawing attention from attendees worldwide. I am glad that the Cointelegraph team joined us and shared in the excitement as well. Our lineup of activities was in full force, featuring an exclusive night that united the crypto community, a compelling keynote delivered by the Phemex CEO and our interactive booth where participants engaged directly with the Phemex team.\nA standout moment was the reveal of our Phemex Lending Protocol, which allows users to borrow crypto at rock bottom rates without incurring extra fees and offers them the chance to also earn interest by supplying their assets. Lending allows traders to amplify their capital in the crypto space, enabling them to maximize opportunities in the current market cycle. We’ve developed a comprehensive solution for borrowing and lending. As the response at Token 2049 confirmed, it perfectly aligns with traders’ needs and is anchored by an exchange they trust and prefer for their trading activities.\nCT: As a cryptocurrency exchange, how does Phemex stay up-to-date with Web3 innovation and user demand?\nSC: The cryptocurrency domain is racing forward at a pace never seen before, going well beyond its initial conception as a mere digital substitute for physical currencies. This digital ecosystem is not limited to financial transactions; it includes a broad array of applications and services, from entertainment and social interaction to the comprehensive realm of decentralized finance (DeFi).\nPhemex has embraced this age of increased connectivity and user agency by adopting a hybrid model, blending the best of central exchanges (CEXs) and decentralized exchanges (DEXs) into our operations. The rollout of our Web3 ecosystem Phemexia last year stands as a landmark move in this evolution.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThis tactical transformation is geared toward granting users more control over their financial engagements and social interactions, which are increasingly intertwined, all while upholding the security and reliability synonymous with Phemex.\nWe are now introducing our hybrid stack within this ecosystem, fusing the autonomy of an on-chain experience with the trusted performance of centralized execution, beginning with the launch of the Phemex Lending Protocol.\nCT: What are the specific benefits that users will enjoy from Phemex Lending Protocol?\nSC: The Phemex Lending Protocol offers the lowest borrowing rates in the market and is free of any extra fees or additional charges. It also features a competitive and transparent loan-to-value ratio. To kick-start this protocol, we’re allocating $22 million in liquidity for our users’ benefit.\nSource: Phemex\nThey can leverage their holdings to secure loans without selling their assets, taking advantage of some of the market’s most favorable borrowing conditions with annual percentage yields (APYs) for borrowing as low as 3.57% currently, a stark contrast to the double-digit rates found on other platforms. We also ensure that users maintain full control over their funds, with the flexibility to withdraw and reallocate as they see fit.\nFurthermore, users have the option to contribute to our lending pools in return for an attractive APY that serves as a reliable source of passive income. This end-to-end solution allows users to benefit from excellent borrowing rates while simultaneously earning real-time annual percentage rate (APR) by providing liquidity with their assets.\nCT: How does the Phemex Lending Protocol integrate into the broader Phemexia Web3 ecosystem?\nSC: Phemex Lending Protocol is a cornerstone of the hybrid stack within our evolving Web3 ecosystem, marking the debut of our comprehensive suite of services. Our offerings are interconnected, creating a seamless end-to-end ecosystem. For vePT holders, the Phemex Lending Protocol offers an exclusive 30% discount on borrowing rates, underscoring our commitment to rewarding the loyalty of our expanding Web3 community. It’s another step toward integrating DeFi mainstays such as borrowing and lending services into our own highly efficient ecosystem while maintaining trust and transparency.\nCT: Why did you choose to focus on the borrowing and lending aspect of the crypto markets within the Phemexia ecosystem?\nSC: We’ve rolled out our hybrid DeFi stack with the Phemex Lending Protocol recognizing the user appetite for diverse financial products. Users crave the autonomy to manage their assets through DeFi integrations without sacrificing the smooth user experience offered by centralized platforms.\nOur recent upgrades to the Lending Protocol now allow users to supply liquidity and, in turn, earn the potential for significant interest returns. While such functionality is common in the DeFi space, Phemex sets itself apart as a hybrid exchange by integrating the best features of both worlds. Our users enjoy the sovereignty over their assets that DeFi provides, bolstered by additional security protocols designed to reduce the risks related to smart contract vulnerabilities and unpredictable fluctuations in borrowing rates.\nBy prioritizing borrowing and lending, we offer a comprehensive solution to meet the increasing user demand, excelling in what we do best — creating an inclusive financial ecosystem that delivers a frictionless experience for our users.\nCT: You’ve also recently launched Pulse, quickly gaining popularity among users. What exciting features can traders look forward to in Season 3 of Pulse?\nWe are diligently refining Pulse, our SocialFi platform, by incorporating user feedback to enhance its core service.\nThis season, we are boosting the daily prize pool to 10,000 PT and rolling out new features like “cast” and “tip” to encourage and reward high-quality content. Cast refers to the content posted on Pulse, while Tip is an interactive method to reward exceptional casts. The tipping feature allows you to acknowledge and incentivize the content creators whose insights significantly benefit our community. The greater the number of tips your Casts receive and the more you tip high-quality Casts, the more crypto rewards you’ll reap. Pulse is evolving into a space where trading meets with trending topics, and we’re delighted to facilitate this convergence.\nWe’re committed to fostering a vibrant community where quality engagement is acknowledged and rewarded, so I advise all crypto enthusiasts to stay tuned for Pulse updates.\nCT: What future developments can users expect from Phemex?\nSC: Beyond our current lending offerings, we’re excited about the diverse range of products awaiting launch. Topping our agenda is the automated market maker (AMM) protocol, designed to empower users to contribute to our exchange’s liquidity and reap the benefits of passive earnings. We are also laying the groundwork for an on-chain credit scoring mechanism, underpinned by our soulbound token, to revolutionize the way users access decentralized finance. Of course, we are dedicated to continually enhancing Pulse based on the valuable feedback from our community. We have a full schedule ahead at Phemex, and our team is devoted to providing the finest trading experience to all our users.\nLearn more about Phemex\n#Blockchain\n#Cryptocurrency Exchange\n#Lending\n#DeFi\n#Web3\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-25","tags":["#Blockchain","#Cryptocurrency Exchange","#Lending","#DeFi","#Web3"],"author":"by Nihatcan Yanik","category":null}