{"id":"81809894-9948-4c02-b5e5-2b5c282d1b4a","article_link":"https://cointelegraph.com/news/ripple-announces-stablecoin-launch","website_source":"Cointelegraph","article_type":"News Article","summary":"Ripple expects the stablecoin market to surpass $2 trillion by 2028 and aims to compete with Circle’s USDC and Tether USDT.","title":"Ripple to launch US dollar stablecoin, aims to compete with USDT and USDC","detailed_content":"XRP issuer Ripple has announced plans to launch a United States dollar-backed stablecoin and hopes to compete with Circle and Tether for a slice of the market share over the next five years.\nCointelegraph spoke to Ripple chief technology officer David Schwartz ahead of the announcement, which outlines plans for the stablecoin that will initially be issued on the XRP Ledger and the Ethereum blockchain.\n“It’s funny that the question you ask, we don’t have an answer to yet. What’s the ticker going to be, and what we’re going to call it? You’re just going to have to call it the Ripple stablecoin for now,” Schwartz said during a video call.\nRelated: Ripple ‘would certainly welcome’ an XRP ETF: Brad Garlinghouse\nRipple has been toying with the idea of launching a stablecoin for over a year, and Schwartz believes the existing stablecoin ecosystem is not as diverse and robust as it could be. Pinning the stablecoin market’s current value at $150 billion, Schwartz said there’s room for another big player:\n“We think it will be over $2 trillion by 2028, and there’s only two market leaders. We don’t think it’s a winner-take-all-all ecosystem, particularly on the DeFi side.”\nRipple’s stablecoin will be pegged at a 1:1 ratio with the U.S. dollar, and the company plans to back the tokens with U.S. dollar deposits, short-term U.S. government Treasurys and “other cash equivalents.” Schwartz said that Ripple would look to emulate Circle’s focus on compliance and likely aim to compete against the USD Coin\nUSDC\n$1.00\nissuer:\n“Our angle is going to be very ‘compliance-first.’ We’re very transparent about how the assets are backed, so we’re kind of going to be directly competing against USDC.”\n“We’re looking to grab market share. We’re not looking to finesse a couple of extra decimal points by taking risks with other people’s money,” Schwartz added when queried over Ripple’s plans to back the stablecoin with dollar deposits, U.S. Treasurys and cash equivalents.\nCircle’s transparency page outlining a slight surplus in reserve assets backing USDC tokens in circulation. Source: Circle\nThe reserve assets are set to be audited by a third-party accounting firm, and Ripple will publish monthly attestations. Schwartz drew comparisons to the early days of Tether’s\nUSDT\n$1.00\nstablecoin, where critics often sounded the alarm over the potential of the issuer to steal funds and the credibility of its reserve attestations. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“Initially when Tether first launched, a big concern was whether these guys would run off with all the money because they’re very incentivized to do that. Then, after a while, ‘you’re like, wait a minute, these guys have a long-term business,’” Schwartz said.\nThe top 10 stablecoins by market capitalization. Tether’s USDT is valued at $106 billion. Source: CoinMarketCap\nThe Ripple chief technology officer added that the reality of launching a new stablecoin that could attract hundreds of millions, billions, or tens of billions of dollars would lead to these types of concerns. The company is leaning on its credibility, track record in the space and strong balance sheet to squeeze its way into the stablecoin market.\n“I think we have a credible claim to be in the conversation near the top. If at the end of two years, we’re number three, but the market has grown to 10 times what it is today, that’s still pretty good,” Schwartz said.\nTether’s USDT is issued across 15 different blockchains. Ripple will issue its stablecoin on the XRP Ledger and the Ethereum blockchain. Source: Tether\nCointelegraph also queried why Ripple was interested in a stablecoin offering while XRP\nXRP\n$0.51\ncontinues to be positioned as the token for its real-time gross settlement system, currency exchange and remittance network primarily catering to financial institutions.\nSchwartz says that Ripplenet serves non-bank payment companies using XRP for transparent payments. However, there are some markets that these firms cannot get into using XRP or supplement liquidity.\nRelated: XRPL blockchain plugs into cross-chain DeFi\n“Having multiple paths to give customers a better experience means you have more customers. If we only did things with XRP, then where XRP wasn’t available, we would just have to tell a customer no,” Schwartz explained.\nThe introduction of a Ripple stablecoin is also set to complement the ecosystem’s recently launched automated market maker. Schwartz says the stablecoin will provide liquidity and capture volatility and arbitrage opportunities between multiple assets.\nMagazine: Ethereum’s ERC-20 design flaws are a crypto scammer’s best friend\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-04","tags":["#Blockchain","#Ripple","#Adoption","#XRP","#Tether","#Stablecoin","#USD Coin"],"author":"by Gareth Jenkinson","category":null}