{"id":"8195f647-6947-45d5-b0d2-005956e519a2","article_link":"https://cointelegraph.com/news/web3s-1995-moment-this-network-provides-intent-centric-blockchain-infrastructure","website_source":"Cointelegraph","article_type":"Tweet","summary":"This intent execution network secured $15.3 million in funding to simplify blockchain interactions with user-friendly features similar to mainstream applications.","title":"Web3’s 1995 moment: This network provides intent-centric blockchain infrastructure","detailed_content":"dappOS, an intent execution network, aims to provide developers with the infrastructure to integrate intent-centric functionality and simplify Web3 interaction to the level of mainstream applications like TikTok, backed by $15.3 million in Series A funding led by Polychain.\nIn the early days of personal computing, operating systems were primarily navigated through complex command-line interfaces that required users to remember multiple commands for tasks such as file management and network requests. This complexity limited the internet’s reach to tech experts with advanced technical knowledge.\nHowever, the release of Windows 95 revolutionized the landscape by introducing a user-friendly graphical user interface integrated with an internet browser. This significant shift enabled individuals without technical backgrounds to perform complex operations with simple clicks and drags.\nAs a result, the number of internet users surged dramatically from 14% of American adults in 1995 to 46% in five years. Today, the Web3 ecosystem is at a similar turning point, grappling with its own complexities that hinder wider user adoption.\nFrom Windows to intent-centric infrastructure\ndappOS, an intent execution network, aims to be the Windows 95 of Web3. With a recent $15.3 million Series A funding round led by Polychain, valuing the project at $300 million, dappOS aims to provide developers with the infrastructure to integrate intent-centric functionality, thus simplifying the blockchain user experience to a level akin to using an application as intuitive as TikTok. The funding round underscores venture capital firms’ confidence in dappOS’ potential to transform Web3 accessibility.\n🎉Excited to announce dappOS has completed a $15.3M Series A round led by @polychain\n\nNotable investors include @NomadCapital_io, #IDG Vietnam，@FlowTraders, @iobc_capital, @NGC_Ventures, @ambergroup_io, @waterdripfund, @SatoshiLab_HK, @UpHonestCapital, @BingVentures,… pic.twitter.com/n0ovCvaC1q\n— dappOS ｜V2 Live (@dappOS_com) March 28, 2024\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe platform operates through a two-sided marketplace where service providers, who stake collateral, offer intent task execution services. On the other side, developers can leverage these services to fulfill user intents based on current network conditions and available service providers. Democratizing access to blockchain capabilities, dappOS’ structure optimizes the efficiency and cost-effectiveness of operations.\nOne of the standout innovations of dappOS is its Optimistic Minimum Staking mechanism. The system allows tasks to be executed immediately, with verification following completion.\nIf a task fails, the network reaches a consensus on penalizing the responsible service provider to ensure successful task completion or appropriate compensation for the users. This arrangement benefits service providers by requiring only a minimal stake, slightly above the total value of potential uncompleted tasks, and benefits users through enhanced efficiency and reduced costs.\nFurther strengthening the user-centric approach, dappOS has introduced several intent-centric frameworks, like the Unified Account and Intent Assets.\ndappOS’s intent-centric frameworks empower DApps with intent-centric functionality. Source: dappOS\nThe Unified Account seamlessly integrates across various blockchain networks, reminiscent of centralized exchange experiences, where users can effortlessly manage and use their assets without delving into technical complexities.\nIntent Assets, such as the intentUSD, function similarly to stablecoins but with added flexibility and automatic yield generation, addressing the common issues associated with liquidity and stability in the Web3 space. This innovative approach allows stablecoins to automatically transition between different forms in different scenarios. For example, intentUSD can function as Tether\nUSDT\n$1.00\nwhen USDT is required and can transform into USD Coin\nUSDC\n$1.00\nfor USDC transactions.\nSimplifying DApp interactions for mainstream adoption\nMoreover, dappOS significantly refines the DApp interaction process by enabling real-time operations that can be completed with a single signature, eliminating the need for multiple intermediate steps typically associated with blockchain transactions. The improvement simplifies user interactions and meets blockchain technology’s stringent security and decentralization standards.\nThe implications of dappOS’ developments are profound, mirroring the transformative impact of Windows 95. Just as Windows 95 catalyzed the mass adoption of the internet, dappOS aims to do the same for Web3, potentially ushering in a new era of exponential growth and innovation in the blockchain space.\nAs more developers and users engage with the platform, dappOS is poised to become a central hub in the Web3 ecosystem, akin to how Windows 95 became a foundational technology of the internet age. Through its innovative design and strategic implementations, dappOS is simplifying the blockchain experience and setting the stage for a broader, more inclusive Web3 future.\nLearn more about dappOS\n#Blockchain\n#Decentralization\n#Funding\n#Technology\n#Adoption\n#Windows\n#Web3\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-30","tags":["#Blockchain","#Decentralization","#Funding","#Technology","#Adoption","#Windows","#Web3"],"author":"by Nihatcan Yanik","category":null}