{"id":"81ff9952-bc0c-460a-ba83-147b47442114","article_link":"https://cointelegraph.com/news/satoshi-nakamoto-final-email-revisited-after-13-years","website_source":"Cointelegraph","article_type":"News Article","summary":"In the last known communication in 2011, Satoshi Nakamoto disclosed they had moved on to other things, handing over Bitcoin to the community.","title":"‘I’ve moved on to other things’ — Satoshi Nakamoto’s final email revisited after 13 years","detailed_content":"Satoshi Nakamoto, the pseudonymous creator of Bitcoin\nBTC\n$63,026\n, decided to move on to other things 13 years ago, when they sent the last communication to Bitcoin’s first developers on April 23, 2011.\nBitcoin core developer Mike Hearn previously revealed the final instructions as part of an email exchange with Nakamoto about the challenges and technical aspects of implementing Bitcoin functionalities to control spam using BTC as collateral:\n“I do hope your BitcoinJ continues to be developed into an alternative client. It gives Java devs something to work on, and it’s easier with a simpler foundation that doesn’t have to do everything.”\nSatoshi’s final message also adds a sense of passage:\n“I had a few other things on my mind (as always). [...] I’ve moved on to other things. It’s in good hands with Gavin and everyone.”\nHistory of Crypto: Bitcoin — Satoshi Nakamoto’s response to the global financial crisis\nNakamoto’s identity remains one of the tech world’s biggest mysteries since no conclusive evidence has been found, which makes the communication with Bitcoin's first adopters a rich source of information about the early days of the cryptocurrency.\nSource: Mike Hearn\nVarious individuals have been speculated to be the original crypto inventor. One of the most controversial cases involved Craig Wright, an Australian computer scientist who claimed to be Nakamoto in 2016. Wright faced a lawsuit by the Crypto Open Patent Alliance (COPA), with United Kingdom Judge James Mellor ruling that he did not create Bitcoin last March.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nSatoshi first introduced the world to Bitcoin with the publication of the Bitcoin white paper on Oct. 31, 2008, which was circulated among a mailing list of cryptographers. The paper outlined a method for using a peer-to-peer network to create a system of digital transactions without relying on trust or third-party involvement. Satoshi continued to work on Bitcoin software until 2010, when they handed over control to other developers. Since then, Bitcoin has grown to become a $1.3 trillion asset.\nMagazine: Big Questions: Did the NSA create Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-24","tags":["#Bitcoin","#Blockchain","#Satoshi Nakamoto","#White Paper"],"author":"by Ana Paula Pereira","category":null}