{"id":"825898e8-0372-4d25-a320-276f549f81f5","article_link":"https://cointelegraph.com/news/worldcoin-increases-wld-supply-over-next-six-months","website_source":"Cointelegraph","article_type":"News Article","summary":"Worldcoin will be selling up to 1.5 million WLD tokens to select trading firms outside of the United States every week for the next six months.","title":"Worldcoin will increase WLD supply by up to 19% in the next 6 months","detailed_content":"Digital identity project Worldcoin will increase the supply of its WLD token by as much as 19% over the next six months through a swathe of private sales to non-United States institutions. \nIn an April 23 blog post, Worldcoin shared that World Assets — a subsidiary of the Worldcoin Foundation in charge of token issuance — will sell up to 1.5 million WLD, about $8.2 million worth, every week through a series of “private placements to a select group of institutional trading firms” operating outside of the U.S.\nWorldcoin will be increasing the supply of its WLD token over the next six months. Source: Worldcoin\n“World Assets expects to sell between 0.5 million and 1.5 million WLD per week on average,” Worldcoin wrote. “The circulating supply of WLD will thus increase correspondingly.”\nAn increase of up to 1.5 million WLD tokens per week for six months equates to a supply increase of 36 million new tokens hitting the market — currently worth around $197 million, per CoinGecko data.\nWith a current circulating supply of 193 million WLD tokens, the private sales represent an 18.6% increase in the total available supply within the same time frame.\nWorldcoin noted it would negotiate with individual trading firms — especially those engaged in competition with each other — to execute private placements as close to “prevailing [WLD] market prices” as possible, to help minimize potential price impact on the token.\nAt current prices, Worldcoin touts a market capitalization of $1 billion. However, this pales in comparison to its fully diluted value (FDV) of $54.5 billion — its total value if all tokens were circulating.\nWorldcoin is ranked as the 6th largest cryptocurrency by FDV. Source: Coingecko\nRelated: Portuguese data regulator bans Worldcoin operations for 90 days\nLaunched out of beta in July 2023, Worldcoin was founded by OpenAI CEO Sam Altman, current Wolrdcoin CEO Alex Blania, and Max Novendstern who also serves as the CEO of biometrics research firm Mana.\nWorldcoin is a crypto-based digital identity project that markets itself as providing a solution to identity issues brought about by rapid developments in AI as well as ushering in a novel universal basic income model by way of its native WLD token.\nWorldcoin users register a unique identity with the company’s “World App” by scanning their irises at machines referred to by the company as “Orbs.” Once users verify themselves at an Orb, they are then able to op in to claim free WLD tokens — depending on the country they signed up in. \nBuoyed by a wider rally in the price of AI-linked crypto projects, Worldcoin soared 435% from a launch price of $2.17 on July 24 to a peak of $11.74 on March 10.\nWorldcoin grew more than 450% in six months. Source: CoinGecko\nHowever, its price has tumbled more than 53% from its all-time high in the last few weeks and is currently changing hands for $5.49.\nAI Eye: How to get better crypto predictions from ChatGPT, Humane AI pin slammed","creation_date":"2024-04-24","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Venture Capital","#AI","#Worldcoin","#Supply","#Total Supply","#OpenAI"],"author":"by Tom Mitchelhill","category":null}