{"id":"8296f5dd-e76f-4ac4-a302-1f2fd5b39fd0","article_link":"https://cointelegraph.com/news/pepe-hits-all-time-high-memecoins-soar-after-famous-gamestop-stock-trader-returns","website_source":"Cointelegraph","article_type":"News Article","summary":"Memecoins rally, and PEPE hits a new all-time high shortly after GameStop stock trader Keith Gill posts to his Roaring Kitty X account for the first time in 3 years.","title":"Pepe hits all-time high, memecoins soar after famous GameStop stock trader ‘returns’","detailed_content":"Pepe\nPEPE\n$0.000010\nprice topped the $0.000010 level for the first time since March 15. Data from Cointelegraph Markets Pro, and TradingView shows that PEPE rallied 34% over the past 24 hours to set a new record high of $0.00001119 on Binance.\nPEPE/USD daily chart. Source: TradingView\nPEPE’s trading volume has jumped 245% over the last 24 hours to $1.56 billion and its market capitalization has also jumped to $4.31 billion, surpassing that of Ethereum Classic\nETC\n$26.13\nto become the 23rd largest cryptocurrency by market value.\nPEPE’s performance follows the return of “Roaring Kitty” – Keith Gill’s account on the social media platform X – which has been dormant since June 2021.\nOn the night of May 12, the account posted an image of a man holding a controller and moving to sit forward in his chair as if to focus. Users on X and Reddit interpreted it as Gill saying it was a period of “locking in,” a colloquial term for a period of intense focus or concentration.\nSource: TheRoaringKitty\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nGill was at the center of the 2021 meme stock frenzy when shares of GameStop and AMC Entertainment, among others, surged more than 1,000% by the end of the year.\nThe May 13 rebound saw the PEPE price bounce off the ascending trendline, which has been supporting it since mid-April. The latest rally has seen PEPE rise above a critical resistance level, which has underpinned the price since March.\nThis is the area stretching from $0.00000875 to $0.000010, which bulls need to defend in order to secure the uptrend.\nPEPE/USD daily chart. Source: TradingView\nThe relative strength index (RSI) was northbound and displayed an upward trajectory similar to that of the price. The price strength at 70 reinforced the buyers' dominance in the market.\nRelated: Memecoins were ‘most profitable crypto narrative’ in Q1 2024\nOn the other hand, a daily candlestick below the ascending trendline at $0.00000875 will see the price drop toward the $0.0000070 and $0.000080 demand zone embraced by the 20-day and 50-day exponential moving averages.\nAccording to data from DEXTools, Solana-based GameStop memecoin jumped more than 550% on the return of Roaring Kitty, while AMC token jumped 1,200%. Larger-cap memecoins, Dogecoin\nDOGE\n$0.15\nand Shiba Inu\nSHIB\n$0.000023\n, were higher by 5% and 7%, respectively.\nPerformance of top-cap memecoins on return of Roaring Kitty. Source: CoinMarketCap\nStocks related to Gill and other “meme stocks” also rallied. GME share prices climbed as high as 44% in pre-market trading and surged as high as 110% at market open before trading was halted.\nCinema chain AMC Entertainment Holdings was up 12% in pre-market and rose as much as 25% after the Wall Street open, as observed by trading resource The Kobeissi Letter.\nSource: The Kobeissi Letter\nExchange or buy PEPE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.","creation_date":"2024-05-13","tags":["#Blockchain","#Dogecoin","#Cryptocurrencies","#Altcoin","#Markets","#Altcoin Watch","#Solana","#Shiba Inu","#Memecoin","#Pepe"],"author":"by Nancy Lubale","category":null}