{"id":"86083907-0072-4486-8039-68a8922579e6","article_link":"https://cointelegraph.com/news/okx-launches-wif-mew-spot-trading-memecoin","website_source":"Cointelegraph","article_type":"News Article","summary":"OKX users can now deposit Dogwifhat (WIF) and the Cat in a Dog’s World (MEW) memecoins, while the first withdrawals are coming tomorrow.","title":"OKX launches WIF and MEW spot trading amid memecoin craze","detailed_content":"Cryptocurrency exchange OKX is moving to capitalize on the ongoing memecoin craze by listing major rising Solana-based memecoins like the Dogwifhat (WIF) and the Cat in a Dog’s World (MEW).\nOKX has officially started spot trading for WIF and MEW, according to the exchange’s announcement on X. OKX users can now start depositing WIF and MEW tokens on the exchange to start trading the memecoins against the Tether\nUSDT\n$1.00\nstablecoin.\nAccording to the announcement, WIF spot trading will open at 9:00 am UTC on April 15, or one hour after MEW spot trading was launched. The withdrawals for both tokens will open at 10:00 am UTC on April 16, OKX noted.\nWIF and MEW are among fast-growing memecoins, trading millions of dollars each day. Both are based on the Solana blockchain, which has been outperforming rival networks such as Ethereum and Avalanche in terms of network activity and adoption due to the ongoing memecoin frenzy.\nLaunched in November 2023, Dogwifhat (WIF) has emerged as one of the biggest memecoins, making it to the list of the top 50 coins by market capitalization by the first quarter of 2024 at nearly $50 billion.\nAt the time of writing, WIF is the 42nd-largest cryptocurrency by market cap and the third-largest memecoin after Elon Musk’s favorite memecoin, Dogecoin\nDOGE\n$0.15\n, and Shiba Inu\nSHIB\n$0.000023\n, according to data from CoinGecko.\nThe token is trading at $3, up around 13% over the past 24 hours at the time of writing.\nTop five memecoins by market capitalization. Source. CoinGecko\nThe new Cat in a Dog’s World, or MEW, cryptocurrency was launched just a few weeks ago, officially debuting on March 26. The memecoin aims to disrupt the dominance of dog-themed memecoins, including DOGE, SHIB and WIF.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: Trader hits $6M pay day after spending $8K on Ethereum memecoin\nAt the time of writing, MEW is trading at $0.0052, up 80% over the past 24 hours, according to CoinGecko data.\nSource: MEW\nThe newly listed memecoins join a series of memecoins already available on OKX. At the time of writing, the exchange lists roughly 20 memecoins, including the new additions, according to its official website.\nMagazine: 5 dangers to beware when apeing into Solana memecoins\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-15","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Trading","#OKX","#Memecoin"],"author":"by Helen Partz","category":null}