{"id":"866051ea-5717-48c6-bd16-c2c69495543e","article_link":"https://cointelegraph.com/news/web3-gaming-shift-play-to-earn-play-and-earn","website_source":"Cointelegraph","article_type":"News Article","summary":"The industry could see a shift toward player-centric Web3 games this cycle as Web2 founders enter the GameFi space, according to Bitget’s managing director.","title":"Web3 gaming needs to shift from play-to-earn to ‘play-and-earn’ — Bitget","detailed_content":"Web3 games should shift their focus from play-to-earn to “play-and-earn” to attract new mainstream crypto adopters.\nThe issue is that most Web3 games focus solely on the economic elements, disregarding the gameplay, says Gracy Chen, managing director of the trading platform Bitget.\nWeb3 games in 2024 will need to focus on gameplay to attract Web2 gamers, Chen told Cointelegraph in an interview:\n“If you look at Web2 games versus GameFi projects, why should people play the GameFi project? Previously, it was mainly due to play-to-earn, as we’ve seen this with Axie Infinity, but there should be a shift from play-to-earn to play-and-earn.”\nWeb3 games have widely been criticized for their lack of user-centricity and gameplay, as numerous previous games have only been focused on offering lucrative crypto incentives to players.\nHowever, the industry is finally shifting toward more player-centric games this bull cycle, thanks to Web2 game founders joining the crypto gaming space, explained Chen.\nGracy Chen interview with Cointelegraph. Source: Cointelegraph\nWhile Chen is excited about the prospect of more player-centric games, she warned that most current GameFi projects are still low quality, with high valuations. She cautioned investors to only invest in games with finished products and user-centric approaches.\nRelated: Crypto on track to hit 1B users by end of 2025 — Analyst\nWeb3 games continue attracting investment, despite a lack of gameplay\nShowcasing significant interest in GameFi, over 72.5% of large gaming companies are investing in Web3 games. According to a 2023 CoinGecko report, 29 out of the 40 largest gaming companies have ventured into Web3, while only seven (24.1%) of the 29 are developing blockchain games.\nThe 40 largest video game companies investing in Web3 gaming. Source: CoinGecko\nAt the beginning of February, the Pokemon-inspired GameFi project Pixelmon raised an $8 million seed investment round from a series of Web3 games. Over 60% of the project was previously acquired by Singapore-based Web3 venture capital studio LiquidX for a total of $40 million in September 2022.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nDespite the $8 million investment, Pixelmon’s first game, Warriors of Nova Thera, only entered alpha testing in April.\nSource: Pixelmon\nDespite a lack of player-centric projects, Web3 games accounted for over 30% of all the decentralized application activity in the first quarter of 2024, according to an April 11 DappRadar report.\nRelated: Web3 needs player-centric games for mass adoption — Websea exec\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-30","tags":["#Blockchain","#Adoption","#Games","#Blockchain Game","#Web3","#Gaming","#GameFi"],"author":"by Zoltan Vardai","category":null}