{"id":"86fbe92e-4d94-4b90-9421-4c0a6f27bc8f","article_link":"https://cointelegraph.com/news/coinbase-faces-new-lawsuit-over-alleged-investor-deception","website_source":"Cointelegraph","article_type":"News Article","summary":"The lawsuit claims that Solana, Polygon, Near, Decentraland, Algorand, Uniswap, Tezos and Stellar Lumens tokens are securities.","title":"Coinbase faces new lawsuit over alleged investor deception","detailed_content":"Coinbase crypto exchange and its CEO, Brian Armstrong, face a new class-action lawsuit alleging investors were deceived into buying securities and claims the company’s business model is illegal.\nThe lawsuit filed in the United States District Court for the Northern District of California San Francisco Division, representing plaintiffs Gerardo Aceves, Thomas Fan, Edwin Martinez, Tiffany Smoot, Edouard Cordi and Brett Maggard from California and Florida, alleges that Coinbase’s digital asset sales knowingly violated state securities laws since the company’s inception.\nThe lawsuit claims that Solana’s (SOL), Polygon’s (MATIC), Near Protocol’s (NEAR), Decentraland’s (MANA), Algorand’s (ALGO), Uniswap’s (UNI), Tezos’s (XTZ) and Stellar Lumens’ (XLM) tokens are securities.\nClass-action suit screenshot. Source: CourtListener\nThe complainants claim Coinbase admitted it is a “Securities Broker” in its user agreement, making digital asset securities sold by the exchange as investment contracts or other securities. They also claim Coinbase Prime brokerage is a securities broker.\nThe plaintiffs seek full rescission, statutory damages under state law and injunctive relief through a jury trial. This lawsuit resembles another class-action suit alleging consumer harm from Coinbase’s sale of securities.\nCoinbase has argued that secondary crypto asset sales didn’t meet securities transaction criteria and disputed the relevance of securities regulations.\nRelated: Coinbase's Base could make it the NVIDIA of DeFi\nThis new lawsuit is distinct from Coinbase’s highly publicized legal battle with the U.S. Securities and Exchange Commission, which also questions whether tokens sold on Coinbase should be classified as securities. Coinbase has recently filed an interlocutory appeal in response to a judge’s decision allowing the case to proceed.\nIn an April 26 filing in the U.S. District Court for the Southern District of New York, John Deaton, the crypto lawyer currently running an election campaign to unseat Senator Elizabeth Warren, filed an amicus brief in support of a motion for interlocutory appeal on behalf of 4,701 Coinbase customers.\nCoinbase reported a strong rebound in the first quarter of 2024, supported by an uptick in market performance and the launch of spot Bitcoin (BTC) exchange-traded funds. The exchange posted $1.6 billion in total revenue and $1.2 billion in net income for the first quarter, achieving $1 billion in adjusted earnings before interest, taxes, depreciation and amortization.\nMagazine: Deposit risk: What do crypto exchanges really do with your money?","creation_date":"2024-05-05","tags":["#Blockchain","#Coinbase","#Cryptocurrencies","#Law","#SEC","#Cryptocurrency Exchange"],"author":"by Amaka Nwaokocha","category":null}