{"id":"87121f56-1637-4b1c-a900-6f8fa0a9b983","article_link":"https://cointelegraph.com/news/future-of-publishing-ai-blockchain-booksie-sol-nasisi","website_source":"Cointelegraph","article_type":"Tweet","summary":"The CEO of Booksie, Sol Nasisi, spoke with Cointelegraph about a future he envisions where blockchain and AI empower authors and work together to reimagine book ownership.","title":"Blockchain and AI: Redefining authorship in publishing","detailed_content":"Self-publishing has empowered authors worldwide to bypass traditional gatekeepers of the publishing industry and share their work with the world. \nHowever, as the industry looks to keep up with modernization, the self-publishing platform Booksie has embraced blockchain and artificial intelligence (AI).\nIn an interview with Cointelegraph, Booksie founder and CEO Sol Nasisi shared his vision for the future of self-publishing built on the powerful combination of these emerging technologies.\nBlockchain: Transparency and ownership for authors\nThe idea of blockchain in the publishing industry isn’t necessarily a new phenomenon. In 2018, the Alliance of Independent Authors launched Blockchain for Books, an awareness campaign about the potential of blockchain technology in publishing. It resulted in a guidebook called Authors and Blockchain.\nThe core principle of a blockchain network, that of a shared public ledger, can act as a mechanism allowing authors to regain control over their work and access valuable data.\nNasisi explained that as more of the traditional web is closed behind “walled gardens,” blockchain can offer authors an additional pathway to selling their books.\n“The blockchain [creates] a new digital book publishing and purchasing experience complete with real ownership, rare books in limited editions, and opportunities for book collectors and resellers to participate in external markets.”\nBeyond financial benefits, blockchain offers transparency and empowers authors to protect their work.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: OpenAI makes ChatGPT ‘less verbose,’ blurring writer-AI distinction\n“The immutability and transparency creates a way for an author to prove they created the work,” says Nasisi. This is particularly relevant in a world increasingly concerned with AI-generated content.\nAI: Empowering writers, not replacing them\nAccessible AI has become more mainstream over the last year, and it has been integrated into companies’ business operations in almost every industry worldwide. \nHowever, authors have already had their gripes with the technology making alleged illegal use of their work. In July, author Sarah Silverman sued Meta and OpenAI for using copyrighted work to train their AI systems without permission.\nIn September 2023, a similar lawsuit was filed by the Author’s Guild against OpenAI, alleging misuse of copyrighted material in training of its AI models.\nHowever, Nasisi stressed that AI can be used as a tool for authors, not to replace or exploit them or their work. \n“We never want to have an AI that is writing the story for a writer.”\nHe said that they designed Booksie’s AI bot integration to aid writers who provide feedback on fiction and non-fiction works.\nThe disruptive duo of blockchain and AI\nWhen looking at the combined potential of blockchain and AI, Nasisi said the two will “fundamentally change” how the publishing industry functions over the next 10 years.\nHe said he envisions a future where “writers will combine their creativity with AI and blockchain to create entire worlds in multiple mediums and interact with fans in novel ways.”\nThis future could involve authors leveraging AI assistance to write a book, then utilizing blockchain to create a limited-edition version, a video series, a game based on the story’s world and accompanying merchandise — all while maintaining ownership and transparency throughout the process.\nThe impact of this technological convergence extends far beyond publishing. Nasisi highlights other industries ripe for disruption.\n“AI is changing how higher education teaches while blockchain will provide the authenticity of learning via credentials.”\nHe likens the two technologies to yin and yang, feeding off each other and creating a new paradigm.\nBooksie and its partner, Chainletter Labs, are actively working toward this vision. Nasisi concluded, “The publishing industry will never be the same.”\nWith blockchain and AI at the helm, self-publishing is poised to empower authors like never before, creating a future filled with exciting new possibilities for creators and readers alike.\nMagazine: AI didn’t kill the metaverse, it will build it — Alien Worlds, Bittensor vs Eric Wall: AI Eye\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-04-12","tags":["#Blockchain","#AI","#Books"],"author":"by Savannah Fortis","category":null}