{"id":"87f2a403-4f53-4b74-902d-33a0e37a049d","article_link":"https://www.wired.com/story/gadget-lab-podcast-579/","website_source":"Wired","article_type":"News Article","summary":"This week, we look back at 2022’s biggest consumer tech stories. Then, we offer our predictions for what the next 12 months will bring.","title":"Is It 2023 Yet?","detailed_content":"KEEPING ON THEME with the roaring ’20s, this year has been a doozy. Social media sites are aflame, all that hype over the metaverse has fizzled, the cryptocurrency economy has all but collapsed, and you can’t always tell whether a piece of art was created by a person or an eerily human bot. The future is now, and there sure is a lot of it.\nOn this final Gadget Lab episode of the year, we discuss 2022’s biggest stories and guess at what wild tech frontiers might be awaiting us all in 2023.\nShow Notes\nCheck out all WIRED’s coverage of art, artificial intelligence, cryptocurrency, and the metaverse. Read more about Twitter and Elon Musk, if you must. Read Lauren’s story about how no one cares about her NFT. Here’s Steven Levy’s story about how Big Tech layoffs may fuel new industry upstarts.\nRecommendations\nMike recommends finding a local foot race to run. Lauren recommends meditation, particularly guided meditations from Tara Brach, Jack Kornfield, and the 10% Happier podcast.\nFEATURED VIDEO\nFinn Wolfhard & Guillermo del Toro Answer the Web's Most Searched Questions\nLauren Goode is @LaurenGoode. Michael Calore is @snackfight. Bling the main hotline at @GadgetLab. The show is produced by Boone Ashworth (@booneashworth). Our theme music is by Solar Keys.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Gadget Lab podcast and our huge library of narrated articles.\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for Gadget Lab. If you use Android, you can find us in the Google Podcasts app just by tapping here. We’re on Spotify too. And in case you really need it, here's the RSS feed.\nTranscript\nLauren Goode: Mike.\nMichael Calore: Lauren.\nLauren Goode: If you had to sum up all of the tech news of 2022 in one word, what would it be?Michael Calore: In one word?\nLauren Goode: I'll give you a phrase.\nMichael Calore: Elon Musk.\nLauren Goode: Oh, really? It's like a proper noun.\nMichael Calore: Yeah.\nLauren Goode: It's like an improper noun.\nMichael Calore: I mean, he looms large. What about you?\nLauren Goode: I went with a dictionary word, so I chose inauspicious.\nMichael Calore: Inauspicious.\nLauren Goode: Inauspicious.\nMichael Calore: That's dark.\nLauren Goode: Look it up. It is dark. It is, but it's been a weird year.\nMichael Calore: It has been a very strange year. I mean, all years are strange, but I think this year is off the charts.\nLauren Goode: We should talk about it.\nMichael Calore: Let's do it.\n[Gadget Lab intro theme music plays]\nLauren Goode: Hi, everyone. Welcome to Gadget Lab. I'm Lauren Goode. I'm a senior writer at WIRED.\nMichael Calore: I'm Michael Calore. I'm a senior editor at WIRED.\nLauren Goode: This is our last Gadget Lab episode of the year. Now in the past, we would usually publish a rerun episode around this time of year, but we heard that you all actually really like listening to Gadget Lab in December, maybe because you're looking for a little escape from the family or you're traveling and you need some pods for the long ride. So we are here taping this in mid-December and hoping you will find a little joy in this episode. So Mike and I have been doing a lot of reflecting and some debating over the biggest tech news of 2022. As journalists, we're often covering the news, but a big part of the job is also being an avid news consumer, and we've both been totally steeped in all things metaverse, Web3, Zuck, Apple, Twitter, SBF.\nMichael Calore: Elon.\nLauren Goode: Elon Musk. Mike, I'm just going to get straight to it. What do you think was the biggest tech news story of 2022?\nMichael Calore: Well, when we prepared for this episode, we compiled our own lists of the things that we wanted to talk about, and then we shared our lists with each other. I have something that I want to talk about, but I think the thing that you want to talk about is more important. So we should talk about that first, and that's Tweelon.\nLauren Goode: Tweelon.\nMichael Calore: Mr. Tweelon.\nLauren Goode: Yeah. I mean, you pretty much hinted this in the intro to our show that this was going to be a big topic for us today. So this one first started back in April when Elon Musk said he would take on a 9.2 percent stake of Twitter and exercise his influence over the company through its board. Then he quickly said he wouldn't be joining the board, and then a few days later announced his intention to just buy Twitter, just buy it for somewhere around $44 billion. Now, a whole bunch of stuff happened in the following months, where Musk then accused Twitter of having a bigger bot problem than initially disclosed. Twitter investors sued Musk on and on and on. Musk seemed to be trying to find a way out of the deal while the rest of us were trying to figure out what an Elon-owned Twitterverse would look like. Then at the end of October, it actually happened. The deal closed and Tweelon, as we've been calling it here at WIRED, was a real thing, but of course, it's not like the chaos went away—quite the opposite. Musk fired half of Twitter staff. He announced and then held back on plans for a new verification scheme and an increased subscription fee for Twitter Blue. He reinstated some prominent accounts on the platform. He blocked some others. He released a batch of files about content moderation that seemed to amount to a lot of performative transparency. Most recently, he stoked conservative trolls by tweeting something derogatory about people's preferred pronouns. Yeah, and this is, by the way, just in mid-December as I mentioned.Michael Calore: That's the most terrifying thing about this story is the fact that in the six or seven or eight days between now and the time that this episode airs, absolutely anything could happen.\nLauren Goode: Yeah, which is always the case in the news, but it feels amplified this time around.\nMichael Calore: Yeah. Everything's happening very, very quickly at Twitter.\nLauren Goode: It's incredibly chaotic. I mean, on the one hand, people of certain age, like you and I.\nMichael Calore: Or of certain professions.\nLauren Goode: Or of certain professions. We've seen social networks come and go before, and we were just talking about this this week. We were talking about Friendster and MySpace and the early blogging platforms, and maybe this is just the beginning of the end for this one. I mean, we will eventually all find another place together online to share our most mundane or, in some people's cases, insane thoughts. On the other hand, what's happening at Twitter now and what has happened this year is, I think, emblematic of bigger problems around trust and platforms and social discourse and even democracy. I don't think I'm overstating. This entire saga to me signals the end to something that was fundamental to the consumer internet and the earliest days of social media, which was really just about connecting. It feels like that's an afterthought now, and maybe people are still connecting, but the platforms are really about amplifying. They're about amplifying hateful content, outrage, stoking the outrage. They're not exactly the healthiest places to be.\nMichael Calore: Yeah, I agree with you. I think that what's happening is really a reckoning with our relationship with social media. I think so many people rely on Twitter for news and for what is happening now in the world. It really feels like it has that pulse that you can't get anywhere else. You can't get that on Facebook. You can't get that on Instagram. It's a real-time service. Us as journalists probably have a much more dependent or codependent relationship on Twitter than other consumers of Twitter would—or even Twitter power users—just because our jobs are very tied into Twitter. All of the people that are in our profession are on Twitter, and I think that's unique compared to every other profession. So for us to sit there and talk about Twitter and how important it is and how much it means, it feels a little bit like navel-gazing, but also, I do think it's important to note that the fact that Twitter is so big is part of the reason why it is so toxic. The fact that absolutely everybody on there can post whatever they want is part of the reason that it feels like that, that it feels so exhausting to be there some days, right? There's still wonderful things that happen on Twitter. There's still great connections that happen, but where that hate and that dog pile effect happens, that's when it starts to feel nasty, and it's because it's so crowded, because it's such a big open platform. So I agree with you. I think that people are starting to recognize that and go to smaller communities. We talk a lot about Mastodon. We've talked about it on this show. I still don't see some giant exodus over to Mastodon, but those are smaller communities, that the whole idea of the fediverse in general is that it's all of these little fiefdoms, subreddits if you will, smaller communities. I think that when people gather around those smaller communities, they start to see that the conversation is better, right? The conversation is richer. There's less hate just because it's a smaller group. Yeah, I've been on a mailing list, many mailing lists where there's a few hundred subscribers, and there's one, just, asshole who ruins it for everybody, and everybody quits and wants to go somewhere else. So that's always going to happen, but I think the smaller group is probably the future of social media, and that the big platform is a problem, and we're recognizing it as a problem, let alone the fact that there's one person calling the shots there now.Lauren Goode: So it sounds like you're in favor of a more decentralized social media existence in 2023.\nMichael Calore: Yeah, I think it would be wonderful, right? Wouldn't it be great if you could just go to a place to hang out and it was only the people you wanted to hang out with and not all the people talking about all the stuff that you didn't want to pay attention to right now?\nLauren Goode: We're hearing the word decentralized a lot, and in particular around Mastodon because of the way that Mastodon works as a social network, that it's all of these different servers being run and that there's not just one person who's running the entity. I think what I would be looking for is a little more diversified, if not decentralized. Decentralized might not actually catch on with normcore audiences because of its inability to scale and because some of these alternative services are actually still very clunky to use, let's be honest.\nMichael Calore: Oh, they're all super clunky.\nLauren Goode: Yeah, I think what you're describing is if you have a social network for your art space, a social network for your sports space, a social network for your actual close friends and family, a social network that's for work and for more performative posts, things like that, that seems like maybe it's a good thing to try, at least in 2023, because this Twitter story, and we said we were going to get to this—definitely still a part of the conversation in 2023. We're waking up on January 1 and there's going to be something else Elon-related, Tweelon-related.\nMichael Calore: Yeah, for sure.\nLauren Goode: So we should just be ready for that.\nMichael Calore: For sure, especially because we have elections coming up in this country, and everybody's going to be looking at not only Twitter, but all the social networks to see how they're going to protect against misinformation and bad campaigns and outside actors, Russian bots. All of those things are going to continue to be a big issue on social media platforms, and Twitter's not going anywhere. I mean, like we said, absolutely anything can happen, but chances are, Twitter's not going anywhere. It's still going to be around by the time we get to the primary season, right?\nLauren Goode: Oh, yeah. Yes. It's not going anywhere. There was that moment a few weeks ago when we all logged on to Twitter one night and it felt very funeral. Everyone was like, \"If I never told you before I loved you,\" I said it was like the scene of Almost Famous where they thought the plane was going down and they're literally like, \"Oh, I love you,\" and it was like, \"Whoa,\" and then the plane straightens itself out. So yeah, I don't think Twitter is going away necessarily in 2023, but it's probably a good opportunity to explore some other places on the web. OK. I asked this before and now I'm going to come back to it. What do you think was the biggest story of 2022?Michael Calore: I think the biggest story, maybe not the biggest story, but the big one that I want to highlight today is the relationship between art and artificial intelligence.\nLauren Goode: Oh, this is a good one.\nMichael Calore: Right? So this is the year that we saw the release of a lot of tools that have been in the works and we've watched grow up in public, things like Dall-E and Midjourney, Stable Diffusion, tools where you give it a prompt and it gives you a visual interpretation of that prompt, right? AI art, what we've come to know as AI art. They're really interesting to me because they have been dictating this change in our relationship with computers, and they've trained a lot of people to learn a lot about how machine learning works. So these tools are built using datasets that, they basically feed a bunch of data into one of these programs, and it looks at all of it and then says, \"OK. I think I understand how all of these things relate to each other and how language relates to all of those things.\" So you can tell me what you want and I'll be able to give it to you and give it to you in a way that's recognizable to you, right? So it started out being weird. You'd get these really weird pictures when you type in things like “frog price” or “Nicolas Cage as President of the United States.” It was fun and it was interesting, but as the tools became less discernible as bad AI art and started actually looking like real art that we would expect to see an artist do, a human artist do, then that's when the conversation shifted. It really forced us to choose how we want to define art. Is art something that is created by a human being? Or does an image created by a machine count as art?\nLauren Goode: Right, and if we as human beings have influences in our creative lives, we take information in, we process it, and sometimes that directly appears in some form and anything that we put out, whether we're writers or painters or musicians. How is that different from a computer processing that load?\nMichael Calore: Yeah, and I would argue that art is always self-referential. You're talking about subconscious references, right?\nLauren Goode: Yeah, yeah, exactly, not plagiarism or explicit copying, but yeah.\nMichael Calore: If you want to be a singer-songwriter in the English language right now, then chances are Bob Dylan is going to be part of your sound.\nLauren Goode: Sure. Exactly, and you would say that. Someone would say, \"Who has influenced you?\" and you list the names of artists.\nMichael Calore: So that changes when you talk about datasets and you talk about the fact that you're feeding art created by actual humans to this machine, and then you're telling the machine, \"OK. Do something like this.\" There are studies that are coming out now. Researchers have found that in some cases, some of these AI art programs are directly copying pieces of the images that they were trained on. So you show it enough images of a tree, and then you ask it, \"Show me a tree,\" and it will sometimes just go into its memory and grab a tree and show that to you.Lauren Goode: Oh, interesting.\nMichael Calore: So it actually is plagiarizing, even though it doesn't necessarily know the rules around plagiarization. It doesn't know what constitutes plagiarism and what doesn't. So it's still evolving in that sense, but it is forcing that conversation. Artists are really pissed about this. Artists know that their work has been fed into a machine, and now the machine is being asked to produce work that looks like their work that you used to pay them for. Also, I will say that part of the purpose of art is to force these types of conversations, to force people to think critically about the world around them. So I would argue that AI art is art. It's the highest form of art. It's conceptual art. In a sense, you are trying to make people think about, “What is art?” That is what great art does. I know this is sounding really heady, but that's true, right? So you have to look at things, tools like this, particularly tools like Stable Diffusion and Midjourney, as being part of this great experiment where we're all reckoning with how we relate to machines. So that's the way that I'm choosing to look at it. I know that there are probably people who create visual art for a living who are listening to me talk about this and thinking that I'm full of shit—and that's true, I am full of shit—but I will say that I think that the person who sits down at a computer and types in a prompt with the intention of creating an image from one of these systems that forces you to confront the relationship between human-created art and machine-created art is actually an artist. So the person who types that in with that intention is an artist. The person who types something in without that intention just to get a pretty picture, that person's not an artist.\nLauren Goode: So you see it less as a generative threat and more as a tool, and artists use tools. That's what they do. They just use each new technological development to level up and make the thing that they were maybe going to make some version of anyway.\nMichael Calore: Yes.\nLauren Goode: That's really interesting.\nMichael Calore: I think that we can have a debate about this, and this is why I think it's important because next year in 2023, we're going to see tools that are even better. We're going to learn a lot more about how the output that we're seeing in public on the internet is being moderated both by machines and by humans. I'm sure that Open AI, one of the most important and well-known companies in this field, has human moderators who are making sure that pornography doesn't go out on the internet, AI-generated pornography doesn't go out on the internet. So we're going to learn a lot more about how humans are drawing boundaries around these things, but also, we're going to see people using them in even more interesting ways. That's when something like this becomes interesting, when somebody sits down and they type out a prompt and then you look at the picture and the picture you see makes you think about, what was that person thinking, why did they type those words, that's really weird that they typed those words and this came out.Lauren Goode: This toothpaste is out of the tube.\nMichael Calore: Yeah, fully.\nLauren Goode: There's no putting these tools back in.\nMichael Calore: Fully.\nLauren Goode: All right. Let's take a quick break, and when we come back, we're going to dig into more of this year's big tech stories and give some of our predictions.\n[Break]\nLauren Goode: All right. We're back. Mike, we already covered Tweelon Musk and the weird world of generative AI art. What's next on the list for you?\nMichael Calore: The crypto crash?\nLauren Goode: Oh, yeah. I knew this was coming.\nMichael Calore: Yup. Everything that happened in cryptocurrency in 2022, I think we can roll together under that banner, the crypto crash, right? We had the NFT market hit a new high and then tumble. We had the price of cryptocurrencies tumble. We had the fraud investigation at the FTX Exchange. We had—\nLauren Goode: Well, prior to that, the stablecoins collapsed too.\nMichael Calore: The stablecoins collapsed. Oh, yeah, right. I forgot about—\nLauren Goode: Yeah, Terra and Luna, don't forget about those.\nMichael Calore: I mean, I think we have to be careful when we laugh about these things because we are talking about a lot of people losing their livelihoods.\nLauren Goode: Very real money.\nMichael Calore: Yeah, and a lot of people not only losing magical internet money, but losing their home, right? Their dream just crumbled, but what was their dream built on? It was built on this promise. It was built on this brand new technology. It was built on something that all of the greedy people in the world started exerting force on. So watching it come down and watching it really go through its first big crisis felt like a moment to step back and think about what role cryptocurrency is going to hold in our future, right? We talked on our last show when we had Steven Levy on talking about the Ledger Stax wallet. That wallet can hold cryptocurrency, but it can also hold things like your driver's license and your passport and other important documents. So blockchain technology is still really exciting.\nLauren Goode: Is it?\nMichael Calore: Yeah, yeah, for sure, just because it has that secure aspect to it. So it's a way of guaranteeing trust about certain things in your life, digital assets in your life, everything from government documents to concert tickets. It makes all of those things more secure than they were in the world of paper and smartphones and emails. So cryptocurrency though, and NFTs and coins and banking and all of that, I feel like it just got raided.\nLauren Goode: Yeah, because I felt like most of this year I was really trying to get a better grasp on the crypto market and NFTs and some actual real-life use cases for the blockchain. I just don't feel like I got very far. This funny thing happened where I reached out to a company that makes frames for NFTs and asked them what they're making, and they sent me a couple of loaners. So I had these NFTs sitting on my kitchen counter for a few months, and I remember I was going to write about them, and then other deadlines came up and other projects, and I just kept putting it off and putting it off. By the time I finally wrote about them, I think I received them in January, February, and then by the time I wrote about them in the spring, I think the headline of my article was literally, no one cares about my framed NFTs. People would come over and see them and say, \"What's that weird pulsing jellyfish frame on your counter?\" and I'd say, \"That's an NFT.\" Actually, that wasn't the NFT. There was a Steph Curry NFT on my counter, but anyway.Michael Calore: It would kill the conversation when you told them it was an NFT.\nLauren Goode: Well, one of my friend's sons took out his phone and made a point, took a photo of it and said, \"There, now I have your NFT. What's to stop me from selling this as an NFT?\" But that's a whole other story about how we value the original form of art versus reprints of art, getting back to our first segment conversation, actually. Yeah, the crypto market had a rough year. We have seen dips in the crypto market before. The diehards insist that that's OK, that it's going to bounce back, that it's not going anywhere. They still believe in decentralization. They still, as Steven Levy said on our podcast a couple weeks ago, see trust as a pejorative term because they think that the institutions that we have long relied on are not necessarily the most trustworthy, not how you want to back your money. Isn't it better if you bind this system instead? I think we'll still see some innovation around it, but wow, is it a rough year for crypto, and in particular the people who trusted Sam Bankman-Fried.\nMichael Calore: Yeah. Next year, we'll probably continue to see innovation in cryptocurrency companies and in blockchain companies, but I think it will be harder to buy into the hype now that everyone's gone through this rough patch. Let's move on. What is your final big story for 2022?\nLauren Goode: Well, it's not final because there's an endless list. How much time do we have?\nMichael Calore: Exactly.\nLauren Goode: We have to talk about the metaverse.\nMichael Calore: Oh, goodie.\nLauren Goode: Oh, boy, the metaverse, the unfulfilled promises of the metaverse. We can't talk about the metaverse without talking about Meta, which has said it would spend billions of dollars on building out this vision of the metaverse, this 3D virtual reality world that's supposed to represent the next era of computing. Now, the amount that they have said they intend to spend in the actual operating losses differ a little bit. Zuckerberg has said he planned to spend around $10 billion a year on the metaverse, but according to a recent report from The Information, the actual annualized metaverse investment is at nearly $15 billion this year. We, of course, can see the company's operating losses when they report earnings, and we know that for the past three quarters, at least, it has lost more than $3 billion per quarter. So this is an incredibly expensive bet for Meta. It's not just Meta either, right? Some companies don't want to necessarily call it the metaverse or say they're a part of that, but companies like Microsoft and Niantic and Snap are also investing millions or billions in the area of virtual reality and augmented reality. The biggest actual news this year was probably Meta's announcement of the Meta Quest Pro headset, a very expensive futuristic headset that, based on my experience, really offered a futuristic vision of computing. It was pretty cool.Michael Calore: A stereoscopic vision of computing.\nLauren Goode: Yeah, it was ... What are they called? Pancake lenses?\nMichael Calore: Yeah.\nLauren Goode: Yeah, pancake optics. So they've packed this really advanced display technology into what's a smaller frame. You're still wearing the thing on your face. Let's put a pin in that. Then the biggest news next year or maybe the year after would be if Apple announces some headset, maybe something else comes from Google, but I'm going to declare it now. The metaverse just isn't it.\nMichael Calore: I agree with you.\nLauren Goode: Yeah. I have a hard time with it. I know that even here at WIRED, we've written stories about this future world, this mirror world of computing that everything's going to be like ... I don't want to be close-minded and shut myself off to ideas around what the future of computing could look like just because I can't imagine it now, but I don't think that's it. I just think in its current form, it's like a layer of computing. It's not our primary computers, and it is, in the case of headsets, it is asking consumers to attach a computer to one of the most intimate parts of our bodies, one that fundamentally is where most of our senses are housed, and just shut ourselves off from the real world. I—no pun intended—can't really get my head around it.\nMichael Calore: Yeah, seriously, I agree with you completely. The fact that this stuff was developed for games says a lot, because it's great playing VR games if you're into VR games. They're a lot of fun. They are definitely very immersive. You have to take it off after half an hour, 45 minutes, because otherwise you start to get motion sick, but the idea that Meta has been pushing meetings in the metaverse and large-scale events in the metaverse—those just do not feel fun. I would never wake up and say, \"Wow, I can't wait to go put on my headset and go sit in a meeting.\" There are certain things that just don't translate into that weird 3D world. I think the companies that are bullish on it are trying to push everything into that world. Really, it's a place for games. It's a place for hanging out, maybe being creative together with other people for a short period of time, but mostly, you're shooting zombies.\nLauren Goode: Yeah. Recently, a bunch of WIRED folks tried to get together for a metaverse meetup with our headsets. I realized that day I was running from point A to B. I had to be here in the office for something. It was in the middle of the day. We don't have a Wi-Fi connection here in the office that allows outside devices on very easily. We have to authenticate for security reasons. I just said, \"I'm sorry, guys. I can't join this thing.\" Whereas every other device I carry with me allows me to do that now, allows me to have presence and have social presence when I need it, and then log off and see the world with my own two eyes when I need to. This idea of these headsets just doesn't do that. I really don't mean to sound like a Luddite, right? I admit I was a person, even when the iPhone first came out, I thought, \"Oh, I don't really love the touchscreen.\" I use a Blackberry. I want to type with the tactile keys, right? Then eventually, I came around to this new form of input and computing, and stuff like that happens all the time. We're resistant to change, I get it, but I don't know. The metaverse, I am very doubtful.Michael Calore: I mean, I think headsets are going to definitely stick around.\nLauren Goode: But for those specific use cases you talked about.\nMichael Calore: Yeah. We're going to keep seeing innovation in headsets, and soon, headsets are going to get small enough and light enough and wireless and powerful enough that you'll be able to do more things with them, but I still think that that doesn't matter. Like you're saying, the social awkwardness of having to put this thing on your face in order to interact with people is still too much of a hump to get over. I don't know if we're ever going to be able to make that hump small enough so that people will feel comfortable putting on a headset and then going into a social environment and not just killing zombies. So there's still going to be great game hardware. There's going to be all kinds of great games coming out, but yeah, meetings, boardrooms, horizon workrooms, all of that just feels like hot garbage. It really does. It feels like a giant waste of money.\nLauren Goode: Yeah, so back to Zoom for us, I guess.\nMichael Calore: Yeah. Zoom technically is the metaverse, right?\nLauren Goode: Yeah, I guess it is.\nMichael Calore: When you're in a Zoom meeting, you're technically in the metaverse according to the—\nLauren Goode: I mean, if you use one of those 3D filters on your face, you are.\nMichael Calore: No, I mean, even the definition of a version of the internet that has presence and you're in a virtual space with somebody, that's what a Zoom room is, right?\nLauren Goode: Sure. So you've been telling me we've been living in the metaverse actually for about three years now.\nMichael Calore: Totally.\nLauren Goode: All right. I think we have time for one quick rapid-fire round of the future. We're going to make some future predictions. What's your big prediction for 2023?\nMichael Calore: My big prediction for 2023 is that we are going to have a reckoning with garbage.\nLauren Goode: Like the garbage on Twitter?\nMichael Calore: No, not the garbage on Twitter.\nLauren Goode: Darn.\nMichael Calore: I'm talking about the garbage out on your curb. So this has been coming from one direction for a while, and I think it's going to start coming from another direction next year. What I mean is for the past few years, companies like Apple and Samsung have been saying, \"We're going to stop putting chargers in the box. The boxes themselves are going to get smaller. We're going to expend less carbon getting your device to you, and it's going to have less garbage when it arrives,\" but I mean, there's still a ton of garbage in the world—well, many, many tons of garbage in the world, but we do know that we produce an inordinate amount of trash in this country and in other industrialized countries. Most of the plastic that we produce is not recycled. It ends up in the environment, it breaks down. So we're starting to come to terms with the fact that we are producing mountains of this stuff. There are companies that are trying to turn garbage into things that can take the place of fossil fuels. So there are technologies like anaerobic digestion where they basically take garbage and they put a bunch of microbes in it. So they break it down and turn it into things that can replace fossil fuels. There is gasification, which uses garbage to make gas that can be used to generate electricity. There are other technologies that do similar things, basically replacing fossil fuels with these waste-to-energy fuels. So you can understand they have multiple benefits. It gets rid of waste so it doesn't go into landfills. It reduces a country's independence on fossil fuels, and for a country like the United States, it reduces our dependence on fuels that come from other countries like in the Middle East or South America or wherever. So I think the companies that are working in that space are going to have a very big year just because it feels like we're at that moment. I can't say, \"Oh, this is definitely going to happen.\" I just have a hunch that this tipping point has arrived and now is the time that you're going to see a lot of investment in that world in waste-to-energy.Lauren Goode: Well, I look forward to getting lots of editor's notes from you saying, \"This is trash,\" and meaning it literally.\nMichael Calore: \"Turn it into energy.\" What do you think is going to happen next year?\nLauren Goode: All right. So I don't mean to be all doom and gloom on this show because I've been like, \"Ah, the crypto market. Oh, metaverse, boo,\" but I do think that in 2023, we're going to see more belt-tightening across tech. I'm not an economist, but as we are taping this, the Federal Reserve just raised interest rates again by 50 basis points. Some of the more recent consumer price index data has been encouraging, but I don't think we're going to be able to say inflation is over, and a lot of tech companies have been looking at what's happening in the world right now and also reevaluating some of the hiring decisions they made during the pandemic when internet services became our lifelines, and they've been cutting back. I think we're going to continue to see this happen in 2023. It's a little bit scary for the rest of us when tech does this, because if companies like Meta are laying people off or Google is freezing hiring and they're not hurting for cash, then what does it mean for other industries? That doesn't necessarily mean things are totally dire. It could just mean that companies are narrowing their focus right now. They are whittling down all the different projects they're working on and figuring out the specific things that they want to build or invent. As our colleague Steven Levy pointed out in one of his recent newsletters, sometimes it's in a downturn that some of the most interesting new technology can emerge, because we identify problems, and tech sometimes does provide a solution as opposed to having all this tech exist that's in search of a problem. So maybe we'll see some interesting things emerge from this time period, this dip in our collective timeline, but I do think the belt-tightening is going to continue into 2023. That's my prediction, a fairly obvious one, I suppose.\nMichael Calore: Right. The economy isn't going to recover overnight.\nLauren Goode: Yeah, I hate to break it to you.\nMichael Calore: Yeah, but I do think the time of free money is over, especially in Silicon Valley. So yeah, I think you're right.\nLauren Goode: We'll be keeping an eye on where we see the money going. If investors are looking to new areas, that might be interesting.\nMichael Calore: Maybe they want to look into waste-to-energy companies.\nLauren Goode: They might, W2E. You should put your deck together, Mike.\nMichael Calore: Or maybe they want to build a new headset, a VR headset.\nLauren Goode: Well, I don't know.\nMichael Calore: Because we need more of those.\nLauren Goode: Maybe not. All right. This has been really fun. Let's take a break and then we'll come back with our end-of-year recommendations.[Break]\nLauren Goode: Mike, what's your recommendation?\nMichael Calore: A crystal ball through which one can see the future. No. So I thought a little bit about this, and I decided that as ... we're doing year-end recommendations, right?\nLauren Goode: Sure. Maybe not a thing that you really enjoyed this week, but that made a difference in your year.\nMichael Calore: OK. So with that note, I would like to say, find a good, cheap, regularly-run foot race in your town. If you're a runner, if you want to get into running—maybe your New Year's resolution is going to be to get into running—one of the best motivating tools is to run a race. You can look around for races and often, you see the big races, the marathons, and they have a 5K component or the half-marathon, and there's a 10K component. Those are 70, 80 bucks usually to join, and they're quite complicated, and they're big crowded fields. Then there are these smaller races that take place in most big cities around the country and around the world that are run more regularly. Maybe they happen once a month. Maybe there's a monthly 5K that your library puts on or a quarterly 10K or a trail race or something like that that's sponsored by some local nonprofit. Those races are great because they're cheap. They usually cost under $20 to enter and to run, and they're very mellow. So they're very low stress events. They tend to start at more reasonable times. It's like 9 am instead of 7:45 or 7:30 am. So Lauren, you and I are exercise buddies. We do a lot of exercise activities together on the weekends.\nLauren Goode: This is what I like to say—we record a podcast that none of you will ever hear because we don't actually record it.\nMichael Calore: Yeah. So we run together.\nLauren Goode: We run.\nMichael Calore: We go on bike rides, things like that.\nLauren Goode: Yeah. We hash through the news of the day.\nMichael Calore: One thing that we did this year was we did the Lake Merritt race.\nLauren Goode: Super fun.\nMichael Calore: In Oakland, 5K, super fun, 50 people, $10. It was amazing.\nLauren Goode: I won second place.\nMichael Calore: Yes, you did. You won second place.\nLauren Goode: Because there were three women in my age group. Super fun.\nMichael Calore: So that's my recommendation. If you want to get into running or if you are a runner, don't just concentrate on the big races. Try to find some small community run event because it's a great motivating tool knowing that, \"OK. In three weeks, I have to do this again,\" or, \"In six weeks, I have to do this again.\" It keeps you going.\nLauren Goode: It's a nice little training race if you are planning on doing a longer run at some point.Michael Calore: That's right.\nLauren Goode: Great recommendation.\nMichael Calore: Thanks. What's yours?\nLauren Goode: My recommendation is something that I've recommended at some point on this show, and I think it was this year. Get into meditation if you can. I recommend checking out Tara Brach. That's B-R-A-C-H. She puts a lot of free meditation exercises and lectures on her podcast. Apple Podcasts is what I use, but you can find her anywhere. They're free. She accepts donations on her website. She is a really wonderful meditation teacher. She also does some work sometimes with Jack Kornfield, another well-known meditation teacher. I've also been listening to some of his. You can find so many options for meditation. The ones I'm describing are guided in which you hear someone in your ear, in your earpods, guiding you through breathing exercises and mental exercises. You can also just listen to ones that offer ambient noise or nature sounds and you don't hear someone speaking if that's more soothing to you. Even if you happen to be a Peloton subscriber, they have great 10-minute meditation exercises in their app. Some people really dig 10% Happier as an option for meditation or learning more about meditation. I just recommend getting some headspace back if you can, and not to stress about whether you're doing it right. Your mind is going to wander when you're doing it, and that's fine. Just accept it and get yourself back on track if you can.\nMichael Calore: That's a place where I think guided meditation really helps.\nLauren Goode: I agree.\nMichael Calore: Because you ask somebody, \"Well, how do you meditate?\" and they say, \"Well, it's easy. You just sit there and you think about nothing.\"\nLauren Goode: Yeah, but it's not it. That's not how our brains work, especially our Twitter adult brains.\nMichael Calore: Yes. So a guided meditation is going to fill your head with imagery and give you prompts that are structured to cool you down and bring you into that headspace instead of just trying to force it.\nLauren Goode: Yeah. Sometimes they will guide you through a body scan, although it was really funny. One of my friends the other night said, \"If I get told to do a body scan one more time,\" because there's over-reliance on that, I suppose. It really puts you in your body. There are all kinds of ways of just finding a little more presence, giving yourself some headspace, taking a break from the noise, and taking a break from social media. Very important.\nMichael Calore: Yeah. I feel like we should take a break from this podcast.\nLauren Goode: Yeah. We're going to take a little holiday break and we'll be back in the new year with new stuff.\nMichael Calore: That's right. We have CES the first week of January.\nLauren Goode: Oh, boy, CES. So you're going to be podcasting from a hotel room in Las Vegas.Michael Calore: Yes. Our first show of the year will probably be the crew at WIRED who's at CES talking about CES.\nLauren Goode: That's going to be pretty exciting.\nMichael Calore: That's all I know right now.\nLauren Goode: All right. TBD. Well, Mike, thanks so much for being an amazing cohost all year.\nMichael Calore: Thank you for being an amazing cohost all year.\nLauren Goode: I just saw in the script that you wrote, \"I quit.\"\nMichael Calore: I don't quit.\nLauren Goode: Please don't quit. Please, please don't quit.\nMichael Calore: Absolutely not.\nLauren Goode: OK. Good. Whew. All right. My prediction is that Mike sticks around for the entirety of 2023. Thank you, and thanks to all of you for listening. If you have feedback, you can find all of us on Twitter. We're still there. Just check the show notes. Our producer is the excellent Boone Ashworth, whom we're extremely grateful for. We'll be back next week, the first week of January, with that new episode that Mike mentioned. Until then, have a good rest of your year and a happy holiday season.\n[Gadget Lab outro theme music plays]","creation_date":"2022-12-29","tags":["","GADGET LAB PODCAST","PODCASTS","METAVERSE","ARTIFICIAL INTELLIGENCE","TWITTER","TRASH"],"author":"BY WIRED STAFF","category":null}