{"id":"8882fe58-5077-4540-b6fb-73eb48841784","article_link":"https://medium.com/@NirZicherman/can-life-exist-on-the-blockchain-4a4f672a4367","website_source":"Medium","article_type":"Blog Post","summary":"By leveraging Web3 technology, it is now possible for the first time ever to digitally recreate the conditions necessary for the process of…","title":"Can Life Exist on the Blockchain?","detailed_content":"Darwin’s theory of evolution explains how, with a few straightforward conditions and sufficient time, all of the wonderful variety we see in life can emerge. It reveals how the earliest single-celled organisms swimming about in a sea of molecules began to compete—not intentionally but through the process of natural selection. Those that managed to thrive in their environment were more likely to propagate their genes, meaning their offspring would represent a higher percentage of the gene pool and would, in turn, have a higher chance of spreading their own genes through the same cycle.At its core, natural selection can only occur if four fundamental conditions are true: First, an organism must be able to pass on its genes (“heredity”). Second, that reproductive process must over time introduce differences into the gene pool, such as through mutation (“variation”). Third, the environment in which the organisms live must have limited resources necessary for survival (“scarcity”). Fourth, there cannot be any higher authority dictating how it plays out (“no oversight”). The rules of the game are the rules of physics, chemistry, and biology, and nothing but the interactions of organisms without a governing body determine who wins the battle for survival. This fourth condition is not often cited as a prerequisite for natural selection (whereas the other three typically are), but I believe it to be just as important.In the human-made digital world, there are also “organisms”. Just like all other living things, they run on hardware (computers instead of bodies, made of transistors instead of cells) and execute their own software (machine code instead of DNA).And furthermore, there have long been analogies in the digital world to the first two prerequisites of natural selection. Heredity is achieved every time executable code is copied. And variation takes place every time executable code is modified, be it by a human, a computer, or another external force.Yet now, seemingly for the first time, the third and fourth conditions—scarcity and no oversight—exist as well. The advent of blockchain technology permits digital assets to be limited in number and to have their distribution enforced by the ecosystem rather than any single gatekeeper. While most of the focus on Web3 today views it as a technology of interest in its own right, there is a different perspective that is worth exploring: that it is a means to an end, a platform for enabling other phenomena to develop. Just as the scarce resources needed to sustain life are the mechanism that allows lifeforms both to propagate and to compete, it is theoretically possible to use the blockchain in the same way: to allow software both to propagate and to compete.I want to focus for a minute on that fourth requirement of natural selection, the no oversight piece, which we should just call decentralization. Just as the “invisible hand of the market” is simply the emergence arising from many individual self-serving components (i.e. buyers and sellers) interacting, life too is an entirely decentralized phenomenon. There is no authority dictating who survives and thrives. It is the environment. It is the collective emergent outcome of all interaction within that environment.In the Web3 digital world, the environment is called the blockchain. And by satisfying the four requirements for natural selection mentioned above, one could theoretically recreate the type of collective emergent outcome we see in biology.By establishing a core set of rules (enforced through smart contracts, for instance), software can take the form of organisms in this new world (let’s call them Cryptorganisms for the purposes of this discussion) and effectively compete for the scarce resources available on the blockchain. Each instance of software can be, like any living thing, self-serving and seeking to survive and reproduce. And as each genealogy of software develops, it improves not just in isolation but in its desperate attempt to out-compete all of the other software in the environment.(A quick aside: If you’re enjoying this article, please consider subscribing to my free weekly newsletter, Z-Axis, by clicking here!)It’s worth exploring one possible real-world example of this Blockchain Darwinism. This is intended purely as a thought experiment, a starting point.Imagine a newly minted digital asset I’ll call Charliecoin (after Darwin, of course). Like most cryptocurrencies, Charliecoin is limited in supply. While Charliecoin can be traded or transferred, it cannot be bought, sold, or converted to another form.Each day, new Charliecoins are minted, but the quantity of the new supply is entirely unpredictable. One day, 72,000 new coins might be minted. Then for a week, there might be none (a drought of sorts). This would simulate the unpredictable conditions of a hostile habitat where the availability of life-sustaining resources fluctuates erratically.Anyone can create Cryptorganisms, which are non-fungible tokens (NFTs) that have smart contracts conforming to certain rules. These rules represent the biological rules of the system. For instance, they specify how many Charliecoins a Cryptorganism needs to survive so that it doesn’t “die”.On top of that infrastructure, gaming mechanics can be built. Developers can define ways for Cryptorganisms to interact with each other. Perhaps one such “game” permits two Cryptorganisms to battle for a winner-take-all wager of some Charliecoins. Perhaps another permits two Cryptorganisms to “reproduce” and defines the (somewhat random) process by which their offspring NFT gets defined.Two financial incentives could exist for human “players” to participate in the development and growth of the ecosystem. First, a holder of a Charliecoin can earn actual money (whether in the form of cash or other cryptocurrency) for every day they hold it; therefore, there is a driver for growth of one’s Charliecoin stash which, by virtue of getting consumed to sustain “life”, will otherwise eventually be depleted. Second, a developer can earn actual money (again, either cash or cryptocurrency) every time one of their “games” is played between two Cryptorganisms; therefore, there is a driver to continue innovating on top of the platform.Writing about this idea made me think of the phenomenon of robot combat TV shows that emerged in the late 90s, like Robot Wars and Battlebots. What I find interesting about this concept is that it enables a type of “Game of Life” platform to exist that does not actually allow human beings to compete directly. Instead, they must innovate on the abilities of software (in the form of Cryptorganisms) to be their proxies for competition.And what would come out of this endeavor? Perhaps nothing more than an entertaining way to watch two robots engage in semi-autonomous combat. Or, perhaps, by watching this world unfold on the blockchain, it will help us move just a little bit closer towards a broader understanding of how life came to exist and evolve in the real world.P.S. I used the phrase “Game of Life” earlier. This whole concept is, in many ways, inspired by the work of John Conway and his Game of Life. In Conway’s version, there are zero players, and the game evolves organically without human intervention. In this version however, the game only evolves through human intervention.If you enjoyed this article, please consider subscribing to my free weekly newsletter, Z-Axis, by clicking here!","creation_date":"2022-07-25","tags":["Web3","Cryptocurrency","Blockchain","Blockchain Technology","Startup"],"author":"Nir Zicherman","category":null}