{"id":"88dc9e20-b54d-45bc-978b-10bed450ea12","article_link":"https://cointelegraph.com/news/el-salvador-mines-bitcoin-volcanic-energy","website_source":"Cointelegraph","article_type":"News Article","summary":"El Salvador currently holds 5,750 BTC worth $354 million, accumulated over three years.","title":"El Salvador mines 474 Bitcoin using geothermal volcanic energy","detailed_content":"El Salvador has mined a total of 474 Bitcoin worth $29 million using volcanic geothermal energy since 2021.\nThe Bitcoin\nBTC\n$66,129\nwas mined with power from the country’s Tecapa volcano, using 300 mining processors. The country has allocated 1.5 megawatts (MW) to cryptocurrency mining out of the 102 MW produced by the state-owned power plant, according to Reuters.\nIn the face of increasing scrutiny over BTC mining’s reliance on electricity and fossil fuels, El Salvador has emerged as a pioneer in renewable energy mining.\nIn 2021, El Salvador made history by becoming the first country to adopt Bitcoin as a legal tender alongside the United States dollar. Since then, the government has adopted several Bitcoin-focused policies, including establishing a geothermal plant to mine BTC.\nEl Salvador now holds a total of 5,750 BTC worth around $354 million.\nSince 2021, global organizations such as the World Bank and others have heavily criticized the Central American nation for adopting Bitcoin.\nADVERTISEMENT\nMAY 15, 2024\nWeb3 travel app turns regional experiences into mintable NFTs\nTravelers around the world are ready to discover new destinations, and blockchain is here to help connect local attractions to global experiences.\nTraveling to a new region always conjures up delightful experiences and vivid memories. From visiting a historical ruin for the first time to randomly attending a local musician’s performance, the satisfying feeling of embracing the entire essence of what a touristic visit can offer keeps most of the travel industry operational and thriving.\nHowever, as the idea of a regional visit slowly turns into a plan and then into a calendar-filling endeavor, travelers soon realize that it’s way easier to dream about going to Nordic fjords than actually realizing the whole trip through scheduling, booking and transactions.\nDespite the decade-long digitization of the industry, travel systems are still operating at a surprisingly regional scale. Along with travel agencies, regional attractions and vendors like museums or event venues face limited market reach, often hindering them from marketing and selling their offerings to a global audience. Even when they score by selling tickets to a global customer group for a period of time, the lack of better customer insights makes it hard to reproduce the success.\nFor travelers, that translates to unnecessarily complicated booking processes that require ticketing from multiple apps and services. Furthermore, the potential risks associated with first-time visits beg for full traceability and transparency across the travel experience.\nNFT ticketing for the masses\nThe traditional “Web2” travel industry lacks a reliable solution to seamlessly integrate local offerings with global platforms, and blockchain is here to change that. VisitorApp, a blockchain-powered ticketing solution, showcases how Web3 can simplify regional travel for both travelers and industry participants.\nUsing Camino Network, the first blockchain designed for the needs of the travel industry, VisitorApp offers users a one-stop shop for discovering and purchasing local offerings directly from regional vendors. The VisitorApp team has spent four years to forge regional platforms and mobile apps for cities, regions and event organizers.\n  Read more\nThe bear market from 2022 to 2023 intensified scrutiny, with many questioning President Nayib Bukele’s actions. However, Bukele doubled down on his Bitcoin bet by announcing that the country would buy one BTC every day.\nBukele handily won the 2024 El Salvador presidential election with widespread support nationwide.\nRelated: El Salvador’s Bitcoin wallet gets sats, cats and a cypherpunk manifesto\nBitcoin mining and its use of fossil fuels have long been controversial topics in the crypto industry.\nThe Ripple-backed Greenpeace, among others, has advocated for transitioning Bitcoin from proof-of-work to proof-of-stake. New York Governor Kathy Hochul signed a proof-of-work mining moratorium into law on Nov. 22, 2023, making it the first state in America to ban any PoW crypto mining activity for two years.\nAfter purchasing $1.5 billion worth of Bitcoin, Tesla CEO Elon Musk pledged to incorporate it as a payment method for Tesla cars. However, he reversed his decision soon after, citing the negative environmental impact of mining. Musk said he would reconsider this move only when over 50% of Bitcoin mining operates on renewable energy sources.\nSince Musk made his promise, numerous reports have suggested that over 60% of BTC mining relies on renewable energy sources.\nMusk has yet to acknowledge these reports or implement a BTC payment option. Tesla currently faces a lawsuit for repeatedly violating the Clean Air Act by releasing harmful pollutants from its Fremont factory into nearby neighborhoods.\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-15","tags":["#Bitcoin","#Blockchain","#Mining","#Adoption","#Bitcoin Mining","#El Salvador"],"author":"by Prashant Jha","category":null}