{"id":"88de48fe-c3a0-419d-a256-ebcb8b85ea72","article_link":"https://cointelegraph.com/news/new-profitable-memecoins-crypto-vc-founder-dogecoin-politics","website_source":"Cointelegraph","article_type":"News Article","summary":"A new class of memecoins that capitalize on politics, religion and successful consumer brands could end up going more “viral” than animal tokens like Dogecoin, says Andrew Kang.","title":"Crypto VC sees a ‘new class’ of profitable memecoins this cycle","detailed_content":"Memecoins that can capitalize on deeper “culture” this cycle could be far more profitable than standard meme tokens based on animals and simple jokes, according to Mechanism Capital co-founder Andrew Kang. \nIn an April 7 post to X, Kang said a new class of “culture coins” — memecoins centered around cultural values such as politics, brands, religion and lifestyle — have the capacity to be far more “viral” than the popular memecoins of the last cycle such as Dogecoin\nDOGE\n$0.15\nor Shiba Inu\nSHIB\n$0.000023\n. \n“Communities with strong values and identities naturally try to convert others to their beliefs and publicly display what it is they love about their lifestyle. They are inherently viral.”\n“The ideologies of these communities can be purely about politics, religion, consumer goods, sport, way of life or can be a mixture of all,” added Kang.\nSource: Andrew Kang\nKang noted two specific Solana-based memecoins — Jeo Boden (BODEN) and Doland Tremp (TREMP) — as recent examples of culture coins that grew rapidly out of communities harboring “anti-woke, anti-Biden, and right-wing views.”\nBODEN has grown massively since its launch on March 9, posting gains of well over 700,000% since inception. At time time of publication, BODEN boasts a market capitalization of $473 million and stands as the 191st-largest token by total value, per CoinGecko data.\nBoden price action since inception. Source: CoinGecko\nThe Donald Trump parody coin TREMP has also posted significant gains since its launch on Feb. 27 but didn’t gain as much traction as BODEN. It currently touts a market cap of $73 million, per Birdeye data.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOutside of politics, Kang suggested memecoins that draw their likeness from successful consumer brands — specifically naming ZYN and MOUTAI as his firm’s investments — could ride on the coattails of brands in a “circular economy” of gains.\n“Compared to animal coins, coins that represent consumer brands can have the additional advantage of leveraging the associated lifestyle of that brand for added virality,” Kang added.\nRelated: ZachXBT won’t assist after memecoin devs throw tokenholders under the bus\nOverall, Kang suggested that the decision to invest in memecoins wasn’t too far from investing in regular assets that achieve outsized returns.\n“The assets that pump the hardest (stocks, real estate, metals, coins, etc) are simply assets that people can best believe in,” he said.\nHowever, crypto industry pundits remain divided on the impact of memecoins on the sector.\nBitMEX co-founder Arthur Hayes believes memecoins are a “net positive” for their respective blockchain networks. In contrast, others say they’re a dangerous, speculative mess that betrays the founding principles of blockchain technology.\nRegardless of their effect on the ecosystem, memecoins have established themselves as the most profitable sector within crypto for the first quarter of this year.\nAccording to a market report from CoinGecko, the 10 largest memecoins recorded an average gain of 1,312.6% for holders in Q1 2024.\n“The memecoin narrative was 4.6 times more profitable than the next best-performing crypto narrative of tokenized real-world assets (RWA) and 33.3 times more profitable than the layer 2 narratives with the lowest returns in Q1 this year,” said CoinGecko analyst Lim Yu Qian.\nMagazine: 5 dangers to beware when apeing into Solana memecoins\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Politics","#Adoption","#Memecoin"],"author":"by Tom Mitchelhill","category":null}