{"id":"89d3c109-f83e-40b2-9816-5ec1bc2aaf57","article_link":"https://cointelegraph.com/news/welcome-future-blockchain-robots-coffee-crypto-rewards","website_source":"Cointelegraph","article_type":"News Article","summary":"Blockchain-driven robots served coffee with a side of crypto incentives at Token2049 in Dubai in a bid to revolutionize our relationship with automation.","title":"Welcome to the future where on-chain robots serve coffee and crypto rewards","detailed_content":"The future is here and it has arrived in the form of a fully-automated robot serving coffee and sprinkled-topped ice cream all powered by blockchain technology. \nDeployed at Token2049 in Dubai, Peaq, a layer-1 blockchain for DePIN and Machine RWAs (real-world assets), alongside XMAQUINA and ELOOP, launched a live demonstration of tokenizing autonomous value-generating robots.\nThe robo-cafe demo included serving attendees coffee and soft serve while allowing users to earn crypto rewards for each cup sold via XMAQUINA’s machine pool.\nXMAQUINA's automated robo-cafe at Token 2049 Dubai. Source: Peaq\nXMAQUINA leverages Peaq IDs for identity management across its network and taps peaq’s other Modular DePIN Functions as part of its architecture. Users are then able to see all the transactions by looking up the robo-cafe’s Peaq ID via Subscan. \nPeaq’s layer-1 is then used for the smart contracts that power its business logic, along with setting up machine pools.\nThe first pool launched will represent the revenues generated by a tokenized automated robo-cafe set up in a strategic location in Europe. According to XMAQUINA, token holders will get a cut from every cup sold.\nCointelegraph heard from Mauricio Zolliker, the co-founder and CEO of XMAQUINA, who explained why the company is using a DePIN-based coffee-serving robot to demonstrate how Web3 technologies can help humans manage automation.\nRelated: DePINs to decentralize internet access and connectivity in India\nDon’t fear the robot\nA recent McKinsey report found that automation has the potential to wipe out nearly 375 million jobs by 2030. Add artificial intelligence (AI) to the picture and a further 12 million roles will be lost in the ame time frame.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nWhile the prospect of intelligent robots wiping out jobs across major industries on a global scale sounds worrying, XMAQUINA is trying to use robots, along with decentralized technology, to give people more equity in the situation.\nBy tokenizing revenues generated by DePINs of autonomous robots, people can become stakeholders in automation, not its victims it claims.\n“Everybody gets to be a stakeholder, not just the 1%, which is a more sustainable approach to automation than the alternatives.”\nZolliker said in this way anyone can become an entrepreneur. “Just think of it, users can crowdfund a project of any technological complexity,” he said. “This stimulates wider economic growth by incentivizing the creation of new businesses and also creates new jobs in the process.”\nWhat about user data? \nXMAQUINA leverages Peaq's identity management system so users can interact with the technology and the robots. Zolliker explained that Peaq IDs allow the machines to interact with the blockchain and redistribute the rewards in a “secure and trustless manner.”\n“They can also store the usage data, properly anonymized, on-chain — for maintenance purposes,” he said.\nToken 2049 conference goers getting tokenized coffee and ice cream. Source: Peaq\n“As far as the sale transactions are concerned — when the robot sells coffee, in other words — the user data is handled in line with the conventional protocols for credit card payments. All the appropriate protection applies, it’s part and parcel of regular business.”\nAn automated future \nWhen asked whereelse this technology could be well-suited for this DePIN model, Zolliker answered:\n“In essence, it comes down to one simple question: Can the machine create value autonomously? If the answer is yes, it’s most likely a good fit.”\nMore specifically, he said the project is already looking into different sectors of potential use cases. This includes robots for logistics and delivery, agriculture, manufacturing, service and hospitality, construction and even environmental monitoring.\n“People don’t need to fear robots coming for their jobs when they can earn from these robots,” he said.\n“While there’s no stopping automation, the most equitable way of moving forward with it is to let everyone have a stake in it.”\nMagazine: Bitcoin Halving will pump games, Shrapnel’s ‘simple’ secret revealed: Web3 Gamer\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Decentralization","#Adoption","#AI","#Robotics"],"author":"by Savannah Fortis","category":null}