{"id":"8a112daa-266e-47de-b119-9f87c37e02a6","article_link":"https://cointelegraph.com/news/icp-schnorr-bitcoin-defi","website_source":"Cointelegraph","article_type":"News Article","summary":"Internet Computer Protocol smart contracts will soon be able to etch Runes, trade BRC-20 tokens and enable Bitcoin-based DeFi functionality.","title":"ICP’s Schnorr integration ushers in Bitcoin DeFi era","detailed_content":"The Internet Computer Protocol (ICP) plans to use advanced threshold cryptography to unlock decentralized finance capabilities and smart contract functionality on Bitcoin’s base layer.\nSpeaking to Cointelegraph during Paris Blockchain Week, Dfinity senior research scientist Aisling Connolly outlined how ICP’s integration of threshold-Schnorr signatures will enable the protocol’s smart contracts to obtain addresses and authorize transactions directly to the Bitcoin blockchain.\nSchnorr signatures are a specific type of digital signature named after mathematician Claus Schnorr. They work like a secret handshake between two parties, proving that one person has signed off on something without revealing their secret code.\nRelated: Unpacking Schnorr Signatures: Blockstream’s MuSig to Improve Bitcoin Transactions?\nThe implementation will allow ICP smart contracts to sign Schnorr signatures to etch Bitcoin Runes, inscribe Ordinals in a decentralized manner, send, receive and bridge BRC-20 tokens directly on the Bitcoin base layer, sign taproot transactions and re-inscribe Ordinals.\nICP anticipates the full implementation of threshold-Schnorr to be launched midway through 2024. ICP integrates the core implementation of threshold-Schnorr-BIP340, which enables smart contracts to derive addresses and authorize native Bitcoin transactions.\n“Schnorr allows extra functionality, like batching transactions. It also allows for new use cases that are developing on Bitcoin. You see people inscribing Ordinals over the last year, it will help do this without any tweaks and from other chains,” Connolly explains.\nThe researcher added that the ability to inscribe Ordinals or etch Runes following the Bitcoin halving generally requires using Schnorr signatures. Connolly said Schnorr signatures are similar to ECDSA signatures that Bitcoin uses to control its ownership, but the former is “simpler, faster and more secure.” She said:\n“If you have Schnorr as a native thing, then it allows smart contracts to directly write or etch runes on the Bitcoin blockchain. This is pretty special. I don’t know anyone who’s doing this at the moment.”\nThe hope is that combining Schnorr signatures with ICP’s protocol-level integration with the Bitcoin network will open possibilities for decentralized applications (DApps) and services that can leverage the liquidity and security of Bitcoin without relying on centralized bridges. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nConnolly highlighted a handful of working use cases that are already being explored and built by ecosystem developers.\n“One use case is ICP serving as this orchestration layer. Let’s say you have an existing DApp on Ethereum, and you want to leverage Bitcoin. You can have an ICP smart contract that works alongside it to talk and write to Bitcoin,” Connolly explains.\nOthers are building applications from scratch using ICP. Connolly highlighted Taler DAO, an algorithmic Bitcoin-backed stablecoin, as an example of new experiments using the infrastructure.\nRelated: Bitcoin Core Devs Reveal How Schnorr Signatures Can Help Scale Bitcoin\nAnother consideration is how the integration will be received by the wider Bitcoin community. “OG” Bitcoiners are typically skeptical of integrations and solutions that promise to bridge the preeminent cryptocurrency and its underlying blockchain to other chains.\nConnolly said conversations with Bitcoin proponents suggest that there is an open attitude toward infrastructure that broadens the utility of Bitcoin:\n“Some of the work that we’re doing is being picked up by Bitcoiners and in the BitVM Telegram chat, they're discussing the stuff that we're doing and how it can be used.”\nThe researcher believes the Bitcoin community is generally open to exploring and considering using tools like decentralized exchanges on ICP that supports noncustodial wallets. Connolly said this would allow DeFi capabilities like staking Bitcoin without relinquishing control of a user’s private keys.\n“If Bitcoin is the kind of de facto store of value in a digital currency like cryptocurrency, why can it not be the sort of de facto like hyper-secure compute platform as well?”\nICP now has over 300 developers building Bitcoin-enabled DApps in the field of DeFi, NFTs, gaming and social media. ICP introduced Bitcoin integration in 2022. Using chain key cryptography removed the need to use bridges for cross-chain functionality, allowing ICP smart contracts to hold, send and receive Bitcoin.\nMagazine: Big Questions: How can Bitcoin payments stage a comeback?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-16","tags":["#Bitcoin","#Blockchain","#Digital Signatures","#Internet","#Adoption","#Multisignature","#Internet Computer"],"author":"by Gareth Jenkinson","category":null}