{"id":"8a35b867-b3aa-4f36-b6df-261f0dbf4353","article_link":"https://cointelegraph.com/news/blackrock-aware-that-rwas-are-multi-trillion-dollar-opportunity-kinto-co-founder","website_source":"Cointelegraph","article_type":"News Article","summary":"Kinto co-founder Victor Sanchez says real-world asset tokenization could be the future of finance and explains why BlackRock has decided to get in on the action.","title":"BlackRock aware that RWAs are ‘multitrillion-dollar opportunity’ — Kinto co-founder","detailed_content":"The crypto markets’ focus on real-world asset (RWA) tokenization has gained momentum throughout 2024, and multiple entities within the traditional finance (TradFi) industry are also integrating blockchain and asset tokenization into their portfolios. \nCointelegraph Markets spoke with Victor Sanchez and Alan Keegan, the co-founders of the RWA-focused blockchain project Kinto, to explore the market potential of tokenized RWAs. Both shared their views on the factors behind the rapid growth of RWAs and why they believe “big institutions” such as BlackRock are bullish on the asset class.\nCointelegraph: What would you say is the driving factor behind the rapid growth of RWAs this year?\nVictor Sanchez: Interest has always existed due to the obvious advantages: removing middlemen (and their costs), an incredibly liquid and efficient 24/7 market and a transparent ledger. RWAs and TradFi have now found a counterparty safe, secure, composable and usable space in places and processes like the ones we implemented at Kinto.\nTokenized treasury products gre 782% in 2023, worth over $931 million as of Feb. 1. Source: CoinGecko\nCT: Can you share your views on why BlackRock has suddenly become quite bullish on RWAs?\nVS: RWAs are a multitrillion-dollar opportunity, and these big institutions are aware that blockchain technologies can go from 0 to 100 in a single bull market.\nReal-world assets’ total market capitalization. Source: Galaxy Research\nI honestly believe missing that train was simply not an option despite the day-one issues of being welcomed with a Tornado Cash dusting.\nCT: Could you elaborate in a few sentences about what types of liquidity can be unlocked from RWAs and how this increases the bottom line for money managers?\nAlan Keegan: Being able to transfer assets globally, 24/7, with T+0 settlement by itself is a huge benefit blockchains offer once the regulatory hurdles of using them to transfer securities are overcome.\nHowever, the ability to have any arbitrary transaction neutrally and atomically enforced makes a lot of transaction types easier and more cost-efficient. This means overcollateralized borrowing, yield stripping, claiming collateral on bad debt, and even issuing dollar-pegged stablecoins as liquidity against treasury collateral at close to 100% LTV [loan-to-value] can be automatically done with a click of a button or triggered based on conditions.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIt’s difficult to think of any transaction type that won’t be improved by being on-chain once we’ve done the regulatory work to actually use the blockchain as the financial infrastructure layer and unlock its potential.\nCT: In terms of fragmented and stranded liquidity, what are the areas of unlocked capital that RWAs can free up, and how might this process take place?\nVS: RWAs face a unique liquidity and usability problem. The last bull and bear markets proved to institutions that for some transaction types, DeFi infrastructure offers benefits vs. traditional alternatives and operates smoothly even in extreme market conditions — in passive liquidity provision and overcollateralized lending, for example.\nHowever, despite being tokenized, most RWAs today aren’t usable for any of this on-chain. We can only unlock the value the institutions are looking for by doing KYC on the chain level while remaining an open network.\nCT: Is there a difference between DeFi and RWAs?\nVS: There are a few, but the lines are starting to blur, and that is a good thing. Many of the RWAs that are starting to get tokenized today are highly regulated products in the real world with strict counterparty requirements.\n“Historically, RWAs were missing a key aspect of DeFi: composability. We are fixing that.”\nCT: Can you explain how RWAs fix the composability issue that plagues DeFi?\nAs of today, RWAs require their own compliance framework, KYC systems, etc. Essentially, they are controlling who you are, what you own and who you can send it to. If you think about this problem on an L1 or on non-KYC’d L2s, it basically means that even for a very similar use case on different DApps or protocols, you need to go through their process, and they do not “talk to each other.”\nThis is why we believe the right abstraction model is to KYC at the L2 level so everyone is under the same set of rules and capabilities, allowing RWAs to free flow, compose and more.\nHow RWA bridges the gap between TradFi and Defi. Source: Binance Research\nCT: What are the current counterparty challenges with TradFi requirements for managing counterparty risk?\nIn any network, it does not matter if we are talking about an L1 or an L2, you are free to send anything to anyone, 24/7. That is the promise of crypto, and it is great in 99.9% of cases.\nHowever, in a compliance environment where you need to know exactly who sends you what and why, this becomes a true counterparty-compliance nightmare.\n“In our conversations with Trad-Fi, this counterparty issue is one of the most cited reasons for not being on-chain, followed by security and usability.”\nCT: What is Kinto doing to bridge the gap between TradFi and RWAs?\nVS: Kinto is the safety-first L2. In Kinto, every individual or corporation is KYC/KYB [Know Your Business] at the chain level. This information never leaves the KYC provider without user permission (we call this user-owned KYC), and it solves the counterparty requirements. \nOn top of that, by doing this at the chain level, we enable, for the first time, the composability for these RWAs, allowing for products that can only exist on Kinto.\nCT: It seems like RWAs are mainly for institutional investors and fund managers. How and when will retail investors be able to get a slice of the RWA pie?\nVS: Due to the regulation we covered in previous questions, it was easy for these institutions and accredited investors to access these products.\nHowever, as we facilitate counterparty requirements and other security elements (AML, fraud detection, Sybil resistance, etc.) protocols, we will be able to offer products to a much larger audience in Kinto than anywhere else.\nCT: What is your utopian vision of what full RWA mainstreaming looks like in TradFi, and how would that benefit the average investor?\nAK: Here is the dream for the future of Kinto. On Kinto, tokenized traditional ETFs could be provided as liquidity in an AMM like Uniswap or Curve. Your bank could be linked to your wallet, which is also used for payroll on-chain, and automatically approves and issues a mortgage using funds from an on-chain money market and the tokenized deed to your house as collateral.\nCorporate treasuries could be held in on-chain assets, and corporate debt issuance could happen through a DApp. Any modern financial asset can be issued and traded on-chain, and any modern financial service can be provided on-chain.\n“Our mission is not just to provide the first permissionless, decentralized network capable of supporting every traditional financial institution and every decentralized finance protocol. It is to provide the best infrastructure option for hosting the entire future financial system.”\nGet Access to Real-Time\nTrade Alerts Now\nClick Here For Instant Access\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.","creation_date":"2024-04-24","tags":["#Blockchain","#Cryptocurrencies","#Interview","#Decentralization","#Markets","#DeFi"],"author":"by Nancy Lubale","category":null}