{"id":"8a4d186d-7ad2-4ed5-a71f-c99db554ab68","article_link":"https://cointelegraph.com/news/a16z-crypto-recommends-startup-founders-never-publicly-sell-tokens-us","website_source":"Cointelegraph","article_type":"Tweet","summary":"“The SEC argues that nearly every token should be registered under U.S. securities laws,” commented a16z Crypto’s general counsel, Miles Jennings.","title":"a16z Crypto recommends startup founders ‘never publicly sell tokens’ in US","detailed_content":"The crypto arm of venture capital firm Andreessen Horowitz, a16z Crypto, is warning startup founders to stay out of the United States market when conducting token sales. \n“Public sales of equity and tokens outside the U.S. and private sales of equity and tokens can all be done in a compliant manner without being subject to the registration requirements of securities laws,” wrote Miles Jenning, a16z Crypto’s general counsel and head of decentralization. “Public sales in the U.S. are an own-goal, avoid at all costs.”\nJennings explained that initial coin offerings (ICOs) often met all conditions of the U.S. Securities and Exchange Commission’s Howey test for determining whether a financial asset should be classified as a security. A security is defined as “a contract, scheme or transaction in which there is an investment of money in a common enterprise with a reasonable expectation of profits based on the managerial or entrepreneurial efforts of others.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“Nowhere is the application of the Howey test easier than with respect to primary transactions (i.e., token sales to investors by token issuers),” wrote Jennings. “In many ICOs, token issuers made clear representations and promises to investors that they were going to fund their operations with the proceeds from the token sale and deliver a future return to investors.” He further warned: \n“Those cases were securities transactions regardless of whether the instruments being sold were digital assets or shares of stock. Case closed.”\nIf the asset is deemed to be a security, issuers face lengthy paths, disclosures and financial requirements for registration. Strict penalties are often imposed for noncompliance. \nIn a landmark case in July 2023, U.S. District Court Judge Analisa Torres ruled that fintech firm Ripple’s sale of the XRP\nXRP\n$0.52\ntoken on secondary markets, or digital exchanges, within the U.S. did not constitute security offerings. However, Torres also ruled that the firm’s sale of XRP to U.S. institutional investors met the Howey test’s securities classification. Ripple is currently contesting a $2 billion fine imposed by the SEC.\nAs a result of recent step-ups in enforcement, some crypto firms have opted to avoid the U.S. market entirely.\nRelated: SEC pushes decision on Franklin Templeton spot Ether ETF\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Cryptocurrencies","#Andreessen Horowitz","#Business","#Tokens","#ICO"],"author":"by Zhiyuan Sun","category":null}