{"id":"8b5408c9-4d6c-4e70-b4e1-77fad5e69633","article_link":"https://cointelegraph.com/news/jack-dorsey-block-bitcoin-mining-system","website_source":"Cointelegraph","article_type":"News Article","summary":"The Block — then Square — CEO initially suggested the idea of a collaborative approach to decentralize Bitcoin mining in October 2021.","title":"Jack Dorsey’s Block announces development of ‘full Bitcoin mining system’","detailed_content":"Payments firm Block, formerly known as Square, has announced plans to develop a Bitcoin\nBTC\n$63,026\nmining system in response to challenges faced by mining operators.\nIn an April 23 blog post, Block said it had completed development of a three-nanometer chip used for BTC mining, which led to the firm announcing a “full Bitcoin mining system.” Block — then Square — CEO Jack Dorsey suggested a collaborative approach to decentralize Bitcoin mining in October 2021.\n“We’ve spent a significant amount of time talking to a wide variety of bitcoin miners to identify the challenges faced by mining operators,” said Block. “Building on these insights and pursuant to our goal of supporting mining decentralization, we plan to offer both a standalone mining chip as well as a full mining system of our own design.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nSource: Jack Dorsey\nBlock completed a prototype design of a five-nanometre BTC mining chip in May 2023, claiming at the time the centralization of chip development in the hands of a few companies was harmful to the ecosystem. The firm called on the mining community to provide additional feedback for the system, asking for comments on challenges it faced in purchasing miners, maintenance, transparency and software issues. \nRelated: Jack Dorsey wants to decentralize Bitcoin mining with new investment\nIntel announced in 2023 that it planned to end shipping for its Blockscale 1000 Series ASIC (application-specific integrated circuit) mining chips in April as part of cost-cutting measures. Such chips are often used for mining proof-of-work cryptocurrencies, including Bitcoin.\nThe Bitcoin halving on April 19 cut the block reward for miners from 6.25 BTC to 3.125 BTC. The event will likely shake up the market as miners compete for fewer rewards for the same work until the next halving, expected in another four years.\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-24","tags":["#Blockchain","#Mining","#Business","#Bitcoin Mining","#Jack Dorsey"],"author":"by Turner Wright","category":null}