{"id":"8b603cad-3866-49ef-9843-3cafda284e3e","article_link":"https://medium.com/@goranetwork/understanding-verifiable-credentials-on-algorand-with-goplausible-and-gora-cd9b460d8f12","website_source":"Medium","article_type":"Blog Post","summary":"The World Wide Web Consortium (W3C) sets standards for the web, including Decentralized Identifiers (DIDs) and Verifiable Credentials…","title":"Understanding Verifiable Credentials on Algorand with Gora and GoPlausible","detailed_content":"The World Wide Web Consortium (W3C) sets standards for the web, including Decentralized Identifiers (DIDs) and Verifiable Credentials (VCs). These act as verifiable information packages about a subject (holder) with identifiers, attributes, properties, and credentials. Those follow an Issuer-Holder-Verifier model, which may differentiate a little in blockchain deployments since verification in the decentralized world makes use of features like cryptography suites and delegated logic (Smart Contracts).\nVCs are increasingly used in education, E-Governments, healthcare (EHRs), and many more.Why are VCs Important? Because of its broader acceptance; W3C VCs are acceptable by a wide variety of digital services and systems (banking, health, governments, tourism, transportation, etc). The future of identity and credentials is 100% digital and eventually decentralized since blockchains are the most fit-for-purpose solutions addressing identity and credential-specific requirements like provenance, tamperproof-ness, trust establishment, verifiable timestamping, privacy, and more.Verifiable Credentials (VCs) are essentially digital versions of real-world credentials like diplomas, certificates, permits, or licenses. They offer a secure and verifiable way to manage these credentials mostly in an inclusive and decentralized way. Here are some of the key features of Verifiable Credentials:How are VCs Stored?VCs storage is defined by two major factors:Given these two decisive factors, VC storage may be implemented by one of these approaches:Verifiable Credentials provide a secure and private way to manage digital credentials. While the core information is stored securely in your digital wallet, the blockchain serves as a trusted record-keeping system for verifying their authenticity.Verifiable Credentials and NFTs:It’s important to understand the distinction between VCs and NFTs. VCs are not NFTs themselves, the NFTs here are a tool that can be used to represent or link to VCs. This misconception is quite common. NFTs can be part of the VC system but are not mandatory. In the case of GoPlausible VC system distribution and Gora verifiers, NFTs are part of the Verifiable Credentials microsystem which is called #PLAUS within the PLAUSIBLE protocol context. Verifiable Presentations (VP) as well can also be used with NFTs.NFTs are linked to Verifiable Credentials in a well-known structure named Linked Data and are not mandatory in Verifiable Credential scenarios, but since the Web 3.0 community leans toward NFTs as means of non-fungible data blocks and also because NFTs are cool and fun, those are used within the PLAUSIBLE protocol to present Verifiable Credentials. Gora verifiers, although supporting the NFTs for DIDs and VCs, do not necessarily require them to operate (e.g contract based NFTs or even non-NFT VC implementations are as well supported by Gora thanks to cutting-edge multi-chain data layer I/O Gora has created.Verifiable Credentials are not “minted” or “mintable” because those are not tokens. However, it is NFTs within Verifiable Credential systems that are minted and mintable during the VC operations. In many VC operational scenarios without NFTs, no minting occurs at all (smart contract-only micro-credentials for example).Gora’s Role in Verifying VCs and the Partnership with GoPlausible:Gora, in collaboration with GoPlausible, has implemented the tech stack to verify issued VCs in the Algorand blockchain. This verification occurs by checking the validity, authenticity, and assertions of the DIDs, VCs, or VPs separately from the GoPlausible and PLAUSIBLE protocol, using one of these two types of verification approaches:GoPlausible has been collaborating with Gora on several fronts for quite some time now and one of those is the implementation of DID and VC verification by Gora (as of separation of concerns required in ID and Credentials ecosystems) to achieve a 100% separated yet integrated and interoperable service under Gora to verify DIDs and VCs independently.\nThe air-gapped registration, distribution (happens on the GoPlausible side), and verification (happens on the Gora side) guarantee the security, integrity, and authenticity of W3C identifiers and credentials ecosystem on the Algorand blockchain as well as advocating the spirit of collaboration and #togetherness in the Web 3.0 ecosystem.According to Gora’s innovative multi-chain efforts, GoPlausible is confidently planning on harnessing Gora nodes for future expansions to Multi-chain and other Web 3.0 ecosystems because of the proven and reliable technology delivered by Gora.Verifiable Credentials costs:Ownership security and anonymity:While Verifiable Credentials are hard linked to a recipient’s Algorand account, losing control or access to the wallet containing that account (through hacking or other means) doesn’t necessarily mean losing the VC itself.Here’s why:However, losing access to the account does create some problems:In summary, while losing a wallet or account access doesn’t directly erase or change the VC, it limits your ability to demonstrate its ownership (till you regain control using one of the remediation methods mentioned earlier).None of the PLAUSIBLE and Gora protocols are concerned with the security of Algorand accounts as they both just work with Algorand wallets for accounts and signatures and rely on their account security as both are interop protocols only. So in terms of security, seed phrase, account recovery, and other account and private key-related concerns, wallet providers are the sole resource and source of action.These being clearly stated and regarding Verifiable Credentials, the good news is that soon and by the emergence of SSI (self-sovereign Identity) service by GoPlausible and Gora, if the private key (or its seed phrase) gets compromised in any way, then by acknowledging GoPlausible there are ways (using real identity verification through KYC, KYB,…) that will lead to revocation and re-issuance of all credentials to new accounts but the process include fees and presentation of at least one of verified ID documents included under SSI (e.g. there may be an ID card, Driving license, passports,…) with user’s picture and the actual user being in possession of the device requesting this (Camera for face verification will be activated).Blockchains are not just about anonymity and crypto trading in the shadows! One of the main advantages of blockchains is real-world usage scenarios and utilities for which users need to present real identity and credentials (for example, you will not be able to obtain a driver’s license, a diploma, or a passport anonymously). That being said, Verifiable Credentials are designed to preserve privacy to the most possible extent through features like ZK proofs, selective encryption, and selective disclosure, all coming soon to the Algorand DID and VC ecosystem very soon by GoPlausible and Gora collaborations.About GoPlausibleGoPlausible is a decentralized protocol on the Algorand blockchain that provides tools for the issuance, registration, and distribution of W3C-compliant DIDs, Verifiable Credentials, and smart utility NFTs in a permissionless and user-friendly manner. GoPlausible aims to expand transparent Web 3.0 services to Web 2.0 through the innovative development of new features in Identity, Credentials, Authentication, Authorization, and Smart utility NFT domains in accordance and compliance with living web standards.\nFor more info visit: https://goplausible.com/About Gora NetworkGora Network is a next-gen decentralized Oracle platform that provides secure and reliable access to real-world data for blockchain-based applications. By leveraging decentralized consensus mechanisms, post-quantum-resistant cryptography, and cutting-edge security, Gora Network ensures the integrity and reliability of data feeds, authenticity, and delivery, empowering developers to build scalable, secure, and decentralized applications across various industries with different data requirements.\nFor more info visit: https://www.gora.io","creation_date":null,"tags":[],"author":"Gora Network","category":null}