{"id":"8bca25a3-7cb1-4707-81a5-7273fd268d6d","article_link":"https://www.wired.com/story/bitcoin-mining-halving-crypto-winter/","website_source":"Wired","article_type":"News Article","summary":"In the bitter crypto winter, companies are making deep cuts to survive a new challenge.","title":"Bitcoin Miners Are Playing a High-Stakes Game of Chicken","detailed_content":"“IT’S KIND OF a last-man-standing situation,” says Fred Thiel, CEO of US-based Marathon Digital Holdings. His crypto-mining company, among the largest in the world, has found itself—like the rest of the industry—in the path of a perfect storm.\nOver the past year, the sector has been battered by a slump in the price of bitcoin, combined with a spike in the cost of energy and an increase in mining difficulty—a reflection of the amount of computing power directed at the bitcoin network, which dictates the proportion of coins miners are able to win. \nAt the height of the 2021 boom, profit margins in the mining business rose as high as 90 percent, says Thiel. But now, they have “totally collapsed.” If the price of bitcoin does not rally, he says, there will be “a lot more pain,” and firms that are only marginally profitable today will find themselves “very underwater.” \nFEATURED VIDEO\nComputer Scientist Explains One Concept in 5 Levels of Difficulty\nAs they scramble to cut costs, miners are playing a high-stakes game of chicken. In spring 2024, the halving, a mechanism baked into the bitcoin system that periodically cuts the number of coins awarded in half, will slash mining profits. The goal for miners is to ensure they are in a strong enough financial position to survive the fall in profits longer than anyone else; as miners give in and drop from the network, the share of coins won by the rest will increase. \n“Any miners that are struggling now will not be able to survive the halving,” says Jeff Burkey, VP of business development at Foundry, which operates its own mining facilities, a large-scale mining pool, and a marketplace for mining hardware. The dynamic will create a rush among miners to get their houses in order, he explains.\nMiners will look to eke out additional profit margin wherever they can, whether by deploying superior hardware and cooling techniques, developing software to closely monitor the performance of machines, relocating to territories with cheaper power, or renegotiating the terms of their loans.\nOthers, like Geosyn Mining, are aiming at vertical integration—all the way down to the energy powering the facilities. The company, says CEO Caleb Ward, wants to construct its own solar farm to power its machines, thereby eliminating a major cost. “We need to be more thoughtful as an industry about how we protect against risk,” he says. “It’s not all about shooting for the moon.”\nMeanwhile, the miners whose financial predicaments prevent them from fine-tuning their operations are playing a dangerous waiting game, gambling on an increase in the price of bitcoin that may never come.\n“The beauty of halving cycles is that the industry [is forced] to become more efficient—a lot of weaker players will have to exit the business,” says Jeff Lucas, CFO of mining company Bitfarms, which has worked to restructure its finances in the downturn. “The devil is in the details.”\nAlready on the back foot, mining companies are beginning to fold. Compute North, which owned multiple large-scale mining facilities, filed for bankruptcy in September, and Core Scientific, a publicly traded miner, did the same in December. Others are having to maneuver. Argo Blockchain, also a public company, was forced to sell off mining equipment and its state-of-the-art mining center, while Stronghold Digital Mining has negotiated a debt repayment holiday. Neither company responded to interview requests.A combination of “immaturity, poor planning, and greed” has led miners to the brink of collapse, says Phil Harvey, CEO of Sabre56, a crypto-mining consultancy firm that also operates its own facilities. While the market was hot, companies took on large amounts of debt at high interest rates (10-20 percent) to finance expansion, says Harvey, and now the value of the coins they earn is insufficient to cover the costs of repayments.\nHistorically, a steep rise in the price of bitcoin, triggered by a buying frenzy, has been followed by a sharp fall and then a gradual recovery. Although there is no guarantee this pattern will repeat, the process is widely described as the bitcoin cycle. The fatal mistake, says Jaime Leverton, CEO of mining company Hut 8, was to imagine that that 2021 was different—that the industry was in a “supercycle” that was going to “break prior cycles” and extend the hot streak. A lot of people bought into this idea, she explains, and so were caught off-guard when the market tanked.\nIn an effort to strengthen its own position, Hut 8 is in the process of merging with US Bitcoin, another mining firm. The goal, says Leverton, is to minimize risks associated with the volatility of bitcoin by diversifying both revenue streams and the regions in which the business operates.\nWhereas Hut 8 only has facilities in Canada and mines exclusively for itself, US Bitcoin runs mines across the US and hosts mining hardware for third-party customers alongside other auxiliary services. “It’s important to be dynamic,” says Mike Ho, cofounder of US Bitcoin. “There is an optimal strategy, depending on the price of bitcoin. It’s about knowing how to navigate through the cycle at different stages.”\nRecognizing the trajectory of the market, other companies have sought to eliminate outstanding debt as rapidly as possible. In the summer of 2021, Bitfarms had $165 million of debt on its books, at interest rates between 16 and 18 percent. Lucas says it may seem “absurd” to stomach these exorbitant rates, but it “made sense” because the cost of debt was eclipsed by the revenue generated by mining activity—at least until it wasn’t. \n“As revenues came down dramatically with the price of bitcoin, there was still a high debt to pay for,” he says. “And that put a squeeze on a lot of companies.” \nIn June 2022, Bitfarms began to sell down the bitcoin in its treasury to eliminate its debt. Earlier this month, the firm also managed to negotiate down a $21 million debt to bankrupt crypto lender BlockFi that was instead paid off in a single $7.75 million cash payment. The company’s approach to slashing debt, coupled with a focus on maximizing the efficiency of its mining rigs, says Lucas, will put Bitfarms in good stead to weather the remainder of the crypto winter.\nThe scramble among miners to balance the books has attracted the attention of other market participants hoping to increase their market share at a reduced price. Investment firm Galaxy Digital has long been eager to expand its bitcoin-mining operations. Sensing an opportunity, the company swooped in to grab Argo’s flagship Helios mine in December, spending $65 million for a facility reported to have cost at least $1.5 billion to build.\nMergers, acquisitions, and collapses will continue to be a theme, says Alex Mologoko, analyst at blockchain intelligence company Elementus, until “all economically unsustainable mining operations are weeded out.”","creation_date":"2023-02-17","tags":["","BITCOIN","CRYPTOCURRENCY","MARKETS","BLOCKCHAIN"],"author":"BY JOEL KHALILI","category":null}