{"id":"8c93f004-215c-4e15-b9a0-fa93bd311a71","article_link":"https://cointelegraph.com/news/imf-backs-nigeria-crypto-adoption-sec-crackdown","website_source":"Cointelegraph","article_type":"News Article","summary":"The IMF recommendation sets out to remedy the macroeconomic challenges Nigeria faces while attracting global investment.","title":"IMF backs Nigeria crypto adoption amid local SEC crackdown","detailed_content":"The International Monetary Fund (IMF) has recommended that Nigeria license global cryptocurrency exchanges as a part of its economic reformation measures.\nAccording to a recent IMF report, the bid to integrate cryptocurrencies into its financial system aims to secure Nigeria’s position in the African cryptocurrency market. It recommends that “global crypto trading platforms be registered or licensed in Nigeria and subject to the same regulatory requirements applicable to financial intermediaries.”\nIt states: “Authorities should ensure the application of AML/CFT [Anti-Money Laundering and Countering the Financing of Terrorism] controls by crypto trading platforms and other virtual asset service providers through effective AML/CFT risk-based supervision.“\nThe report points out discrepancies in Nigeria’s balance of payments, particularly in net errors and omissions, which reflect unrecorded financial transactions. These discrepancies are attributed to several factors, including the “shift to using crypto assets for cross-border transactions,” often not recorded through traditional banking records.\nPreviously largely positive in 2020, the report portrays preliminary 2023 data that suggests “NEOs continue to be very large negative,” at close to $7.5 billion — 2% of Nigeria’s gross domestic product.\nNigeria’s financial account balance and balance of payments. Source: Central Bank of Nigeria, Haver and IMF\nThe IMF suggests that, through regulation and licensing of cryptocurrency exchanges, Nigeria could attract international investment, support financial market stabilization and potentially improve remittance mechanisms, which is significant due to the Nigerian diaspora.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe IMF endorsement for cryptocurrency adoption comes at a time when Nigeria faces worsening macroeconomic challenges, such as currency instability and inflation. Through the licensing of cryptocurrency exchanges, the IMF aims to utilize cryptocurrencies as a tool for more stable and efficient transactional processes.\nThis would potentially improve Nigeria’s governance over digital financial movement, decrease illegal financial flows and mitigate fraud and money laundering risks associated with cryptocurrency transactions.\nRecent evidence of this regulatory shift can be seen in the regulations posed by Nigeria’s Securities and Exchange Commission, which is set to ban peer-to-peer (P2P) cryptocurrency exchanges using Nigeria’s national currency, the naira.\nNigerian SEC Director General Emomotimi Agama indicated that the ban would aim to protect the naira from manipulation after “perceived impact on the exchange rate of the naira.\"\nHowever, a ban on P2P cryptocurrency payments is a task previously considered close to impossible by industry advocates.\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-10","tags":["#Blockchain","#Cryptocurrencies","#Business","#Nigeria","#SEC","#Bitcoin Regulation","#Adoption"],"author":"by Alek Hidell","category":null}