{"id":"8d06b688-85da-486f-ac74-d33ab2a272ee","article_link":"https://cointelegraph.com/news/cryptojacking-scheme-stole-cloud-services-mine-crypto","website_source":"Cointelegraph","article_type":"Tweet","summary":"Prosecutors claim the “cryptojacking” scheme stole cloud computing resources to mine nearly $1 million worth of crypto.","title":"Cryptojacker conned $3.5M from cloud firms to mine crypto, feds allege","detailed_content":"United States prosecutors have charged a man with wire fraud and money laundering charges after he allegedly defrauded two cloud computing providers to run a “large-scale illegal ‘cryptojacking’ operation” — with the perpetrator facing up to 50 years in prison. \nThe Brooklyn U.S. Attorney’s Office on April 15 claimed Charles O. Parks III, also known as “CP3O,” defrauded the two companies of $3.5 million to mine $970,000 in cryptocurrencies, including Ether\nETH\n$3,030\n, Litecoin\nLTC\n$83.19\nand Monero\nXMR\n$130\nusing the two firm’s resources without paying.\nCryptojacking is when an entity uses resources such as computing power or electricity without permission to mine crypto. Types of malware can inject software to mine crypto that drains a small amount of resources from a network of computers.\nParks was arrested in Nebraska on April 13 and charged with wire fraud, money laundering and engaging in unlawful monetary transactions.\nHe faces a combined maximum sentence of 50 years in prison and is slated to appear before an Omaha federal court on April 16.\nThe indictment alleged Parkes created multiple accounts with a subsidiary of “Company 1,” a “cloud computing and consumer electronic device headquartered in Seattle, Washington,” and “Company 2,” a firm that makes “personal computers and related services headquartered in Redmond, Washington.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nFrom around January to August 2021, Parks allegedly used multiple fake “names, corporate affiliations and email addresses,” including from companies he registered — MultiMillionaire LLC and CP3O LLC — to make accounts at the companies.\nHe then “tricked and defrauded” the services into “approving heightened privileges and benefits, including elevated levels of cloud computing services and deferred billing accommodations,” the indictment alleges.\nParkes deflected when the providers started inquiring about “questionable data usage and mounting unpaid subscription balances,” prosecutors claimed.\nHighlighted excerpt of the indictment against Parkes. Source: U.S. Attorney’s Office\nThe indictment claims Parkes laundered some of his mined crypto through “Cryptocurrency Exchange 1,” which “bills itself as a ‘decentralized company, with no headquarters.’”\nRelated: IRS investigation chief expects uptick in crypto tax evasion this year\nOther funds were allegedly laundered through a payments provider, bank accounts and a New York City-headquartered nonfungible token (NFT) marketplace.\nHe structured the payments in a bid to avoid the $10,000 minimum transaction reporting requirements under federal law, the indictment said. Prosecutors claimed to have found multiple instances of Parkes moving $9,999 and smaller amounts from the crypto exchange to a bank account.\nProsecutors alleged Parks used the proceeds for “extravagant purchases,” including a luxury Mercedes Benz, jewelry and “first-class hotel and travel expenses.”\nBrooklyn U.S. Attorney Breon Peace said in a statement: “This Office will continue to prioritize prosecuting criminal actors who use new, sophisticated technology to engage in the old scheme of fraud and deceit.”\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-16","tags":["#Blockchain","#Cloud Mining","#Court","#Crimes","#Cryptojacking","#Regulation"],"author":"by Jesse Coghlan","category":null}