{"id":"8d24e9b8-d282-4730-b421-0462b825a16b","article_link":"https://cointelegraph.com/news/new-memecoin-traders-hit-record-high","website_source":"Cointelegraph","article_type":"News Article","summary":"The attention given to memecoins may be driven by the massive gains many projects displayed in the first quarter of 2024.","title":"Number of new memecoin traders hits record high — IntoTheBlock","detailed_content":"Memecoins have kick-started a new crypto frenzy, attracting investors new to trading and searching for the next big token that could bring massive gains. \nMarket intelligence platform IntoTheBlock shows that the number of wallet addresses wallet address holding meme-related tokens for under 30 days hit a record high in March.\nSource: IntoTheBlock\nThe analytics platform explained that this indicates a large inflow of new traders buying memecoins in March.\nThe number of traders jumping into the memecoin sector may be attributed to the huge gains displayed by memecoins in the first quarter of 2024.\nOn April 3, coin information tracker CoinGecko dubbed the memecoin sector the “most profitable crypto narrative” during the year’s first quarter.\nMemecoins displayed 1,312.6% returns on average, the highest among the top tokens by market capitalization. Projects like Book of Meme (BOME) and Dogwifhat (WIF) drove the percentages up amid the memecoin frenzy.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nStories highlighting life-changing gains may have also played a role in attracting traders into the sector.\nA trader turned $62 into $2 million in December after buying a Solana memecoin. The crypto user caught wind of a memecoin called Silly Dragon (SILLY), which poked fun at Solana co-founder Anatoly Yakovenko’s Halloween costume.\nMore recently, another trader turned $13,000 into $2 million within one hour after buying a meme-based token.\nOn April 3, a crypto trader saw a 15,700% gain after buying a memecoin called Donotfomoew (MOEW) that was minted on the Base network.\nRelated: Trader gambles $226K on Solana memecoin, hits $1.69M in 5 days\nWhile memecoins have the potential to drive massive gains, not everyone gets too lucky. Some people miss out on gains by selling too early, while others fall prey to scammers using the memecoin presales hype to steal user funds.\nOn March 15, a trader fumbled potential millions after selling BOME tokens before the prices skyrocketed. The trader bought 170 million BOME for $8,000 and sold the tokens for about $131,000.\nAt the time of writing, BOME trades for about $0.01615, meaning the tokens could have been worth $2.7 million in the current market.\nPresale wallet address of a memecoin project called Condom. Source: Solscan\nMeanwhile, a Solana memecoin project called “Condom” pulled out on investors before its launch. The creators of the memecoin abandoned its X page and took almost $1 million worth of Solana\nSOL\n$154\ntokens.\nMagazine: 5 dangers to beware when apeing into Solana memecoins\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-04","tags":["#Blockchain","#Altcoin","#Trading","#Memecoin"],"author":"by Ezra Reguerra","category":null}