{"id":"8e004c40-b0a8-4ee8-9abf-bd055c72095e","article_link":"https://www.wired.com/story/bahamas-ftx-crypto-party/","website_source":"Wired","article_type":"News Article","summary":"The digital currency exchange’s stupendous fallout has put local Web3 companies in the Bahamas on the back foot.","title":"FTX Has Wrecked the Crypto Party in Paradise","detailed_content":"THE BAHAMAS, BEST known for its sun, sand, and crystal waters, is also a paradise for crypto companies. Or at least it was, until crypto exchange FTX made the island of New Providence the setting for a historic crypto collapse in early November. \nBahamas-headquartered FTX declared bankruptcy on November 11, and founder Sam Bankman-Fried retreated into hiding. The exchange’s collapse took with it hundreds of millions of dollars in customer funds. The feeling in crypto circles now, says Nicholas Rees, cofounder of Bahamas-based payments firm Kanoo Pays, is of “complete and utter shock.”\nAs other senior FTX employees fled the country, they were replaced by a throng of reporters and crypto influencers heading in the opposite direction, hoping to locate the disgraced crypto wunderkind.\nFEATURED VIDEO\nWhy Billionaires Are Actually Ruining the Economy\nBankman-Fried was ultimately arrested at his $40 million penthouse by Bahamian police on December 12 under the instruction of US law enforcement. He has since been extradited to the US, and on January 3 pleaded not guilty to eight criminal charges, including wire fraud and conspiracy to commit securities and commodities fraud.\nWhile Bankman-Fried awaits his trial, penciled for October 2023, members of the Bahamas’ crypto scene are left to pick up the pieces, their reputations impacted by proximity.\nBy virtue of its size and standing, says Rees, FTX’s tendrils extended into many corners of Nassau, the capital city—whether through charitable donations, corporate deals, or events that brought custom to the doors of local businesses. The crypto exchange also cohosted an invite-only conference in July last year, boasting a roster of speakers that included Bill Clinton, Tony Blair, and football player Tom Brady.\nThe Kanoo Innovation Hub, a startup accelerator launched by Kanoo Pays, was mere days away from announcing a partnership with FTX when the scandal broke. Rees claims FTX intended to create a way for accelerator participants to tap into the $100 million pool of capital already set aside for local investments. (FTX did not respond to a request for confirmation of the agreement.)Although the survival of the Innovation Hub is not contingent on FTX funding, Rees says the collaboration promised to take the scheme “to another level,” providing a leg up to founders from the Caribbean.\nWorse, Rees explains, the collapse of FTX created an employment vacuum that deprived Bahamians of both their current jobs and potential career opportunities. “The saddest part for us, outside the millions of people that lost money,” he says, “is that some of our countrymen would have received the job of a lifetime, but it was pulled out from under them.”\nAlthough groups of crypto enthusiasts already existed, the Bahamas began to formally establish itself as a crypto hub in late 2020 with the passing of the Digital Assets and Registered Exchanges (DARE) Act.\nAt the time, it was among the only pieces of fully-fledged crypto legislation worldwide, says Caroline Malcolm, head of international public policy at blockchain data firm Chainalysis. It  established a clear set of rules for crypto companies, unavailable in most other jurisdictions, and ensured businesses that engaged in malpractice could be held to account. \nIn the two years since, a collection of startups and large crypto companies have set up shop in the Bahamas, among them FTX and OKX, another large crypto exchange. Separately, Tether, whose dollar-pegged stablecoin is central to the smooth operation of crypto markets, holds its reserves with a Bahamian bank, Deltec Bank & Trust.\nBut already, signs of damage dealt by the FTX collapse to the Bahamas’ status as an emerging crypto capital are beginning to show.\nIn December, SALT, the events company led by former White House communications director Anthony Scaramucci, announced the cancellation of Crypto Bahamas 2023. Another event, D3 Bahamas, run by the Bahamas government and billed as the country’s “flagship Web3 and financial technology festival,” was due to take place this January, but has been postponed. A new date has not yet been set.\nCarlyle Bethel, founder of real estate tokenization startup Akerage, was due to pitch for venture capital funding at D3 and describes the postponement as “disheartening.” His chief concern is that the FTX collapse has “shaken potential investors,” making it more difficult for startups like his to bring onboard the funding they need to scale.\nAs for other global crypto businesses with ties to the Bahamas, the response has been mixed. Tether is unmoved; Paolo Ardoino, CTO, says the FTX situation is in no way a reflection of the Bahamas and that Tether is “strongly considering” opening an office there. OKX, however, declined to answer questions about its commitment to the country.\nNassau is also home to a growing brigade of crypto startups, like oceanfront coworking space Crypto Isle, which aims to bring together isolated groups of entrepreneurs and “create a space for people to learn about crypto,” says cofounder Davinia Bain. \nOther startups work alongside the Caribbean Blockchain Alliance, an NGO that advocates for the adoption of blockchain technology in the region. Stefen Deleveaux, president of the organization, describes the crypto scene in the Bahamas as “small, but active and growing.”Neither Bain nor Deleveaux expressed particular concern about the knock-on effects FTX could have on local crypto businesses. With the exception of a few companies that were anticipating direct funding from FTX’s venture capital division, Bain says “the mood at Crypto Isle hasn’t changed.” Deleveaux points to the “massive potential” of the local grassroots crypto movement, which is “quite ready to move on” from FTX.\nOthers see things slightly differently, though. Although Rees is confident in the quality of Bahamian crypto startups, he says the collapse of FTX is “not good for the industry.”\nSpecifically, he is concerned that people typically fail to distinguish between the actions of a company (or handful of individuals within a company) and the industry and nation in which it operates. As a result, crypto companies in the Bahamas face a tarring—even firms like Kanoo Pays, which deals predominantly in central bank digital currencies (CBDCs), the antithesis of decentralized cryptocurrencies like Bitcoin.\nIn the two months since FTX collapsed, the Bahamas’ willful embrace of crypto has come under the microscope, along with its approach to regulating the industry. And Philip Davis, prime minister of the Bahamas, has had to come out on the defensive.\nNew crypto regulations under the DARE Act had been proposed long before the FTX allegations emerged. A report published in April 2022 by the Bahamian government set out a “vision” for capitalizing further on the “remarkable opportunity” presented by digital assets. But framed by the FTX debacle, it makes for difficult reading.\nThe plan, which included provisions relating to crypto trends like non-fungible tokens (NFTs) and decentralized finance (DeFi), promised to cement the country’s reputation as a “leading digital asset hub,” the report asserted—but also to ensure that “only well-run, trustworthy, and thriving digital asset businesses, which are able to … sustain the good reputation of The Bahamas, are allowed to operate from the country.” Ouch.\nThe Bahamas Securities Commission, which consulted on the report, declined to comment on how the FTX collapse might inform regulatory reform. The office of the prime minister did not return requests for comment.\nBut Malcolm says DARE cannot have enabled the alleged FTX fraud, which is covered off by provisions that require businesses to “maintain adequate controls, safeguard investor assets, [and] maintain adequate financial resources.” She describes the idea as “a massive mischaracterization” that paints an unfair picture of the Bahamas.\nBain also takes issue with the light in which the country has been cast by the media. Although the FTX debacle has dealt a heavy blow to the global cryptocurrency industry, she says the specific impact on the Bahamas has been “overblown”: “This idea that FTX has left a gaping hole in our economy or the fabric of our society—it’s just not true.”\nIf any country is equipped to recover from a reputational setback of this kind, says Rees, it’s his own. To the extent that any nation can have a single worldview, Rees claims the Bahamas’ is one of relentless optimism. “The Bahamas is the Bahamas,” he says. “We were here yesterday, and we’ll be here tomorrow.”","creation_date":"2023-01-11","tags":["","CRYPTOCURRENCY","BITCOIN","FINANCE","SAM BANKMAN-FRIED"],"author":"BY JOEL KHALILI","category":null}