{"id":"8e02d54a-190b-4d63-82d7-d7a2f31f9f1a","article_link":"https://cointelegraph.com/news/binance-wallet-support-bitcoin-atomical-arc-20-assets","website_source":"Cointelegraph","article_type":"Tweet","summary":"The Atomicals protocol provides a transparent, secure record of ownership and history for Bitcoin NFTs.","title":"Binance Wallet announces support for Bitcoin Atomical ARC-20 assets","detailed_content":"Crypto exchange Binance has integrated Bitcoin ARC-20 atomical assets into its native Web3 wallet through its Inscriptions Marketplace. \n“ARC-20 is a token standard that makes it possible to create fungible tokens that can be held and transferred on the Bitcoin blockchain,” Binance wrote on May 2. “To celebrate this new integration, we’re offering zero-fee trading on ARC-20 tokens until June 2, 2024.”\nInvented in January, the Atomicals protocol, mirrored after Ethereum’s ERC-20 standard, allows for the minting, transferring and updating of nonfungible tokens (NFTs) on the Bitcoin blockchain.\n“Even if an Atomical is updated or exchanges hands 10,000 times – that amounts to only about 2.5 MB of data (250 bytes x 10,000),” Atomicals explained. “Any client, wallet, marketplace, game, and service can rapidly verify the Atomical by processing the history according to the very simple rules.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nOutside of NFTs, the current uses for Bitcoin Atomicals include web hosting, file storage, atomic swaps, real-world asset tokenization, decentralized social media and others. Aside from Atomicals, Binance Wallet’s May 2 update also includes support for BEVM, a decentralized Ethereum Virtual Machine-compatible Bitcoin layer 2 based on Taproot that uses Bitcoin\nBTC\n$63,046\nas gas fees to execute smart contracts. \nThe move follows the adoption of ARC-20 assets by other exchanges. \nIn February, crypto exchange Bitget announced the support of Bitcoin Atomicals through its native self-custody wallet. Similarly, crypto exchange OKX has an entire marketplace dedicated to Bitcoin Atomical assets. \nDespite worries about becoming technologically obsolete with the rise of smart contract blockchains such as Ethereum and Solana, Bitcoin is rapidly closing the technological gap with the advent of innovations such as Ordinals, Inscriptions, Runes and Atomicals, all within the past year. \nLast quarter, Orders Exchange completed integration with the Bitcoin Runes protocol to allow the issuance of fungible tokens on the native network and constructed a Bitcoin asset bridge with MicroVisionChain that enables BRC-20 token swaps. \nMeanwhile, omnichain yield-generating protocol SolvBTC has accumulated a total value locked of $700 million from its yield-bearing Bitcoin minted on Arbitrum, Merlin and BNB Smart Chain. The protocol estimates the mechanism can generate annual returns of 5% to 10% on users’ BTC deposits. \nRelated: Kraken exchange rolls out self-custody crypto wallet, following other CEXs\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-03","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Business","#Binance"],"author":"by Zhiyuan Sun","category":null}