{"id":"8e71e456-b1bc-443f-b8ce-f223abe19d3c","article_link":"https://cointelegraph.com/news/franklin-templeton-ceo-etfs-mutual-funds-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"She also warned that generative artificial intelligence was like the “kid that got an ‘F’ in math.”","title":"Franklin Templeton CEO says all ETFs and mutual funds will be on blockchain","detailed_content":"Jenny Johnson, the president and CEO of Franklin Templeton, a financial firm with $1.6 trillion in assets under management, recently reiterated her pro-blockchain stance during an interview with Bloomberg anchor David Westland during the 27th Annual Milken Institute Global Conference in California. \nAmong the hot topics discussed by the two, Johnson had plenty to say on tokenization and generative artificial intelligence.\nTokenization\nWhen asked how Franklin Templeton benefitted from tokenization, Johnson quickly replied, “First of all, I am a huge fan of blockchain and the technology.”\nShe described a situation where the company ran a side-by-side experiment to process account records using both traditional methods and blockchain for a period of six to eight months. As Johnson put it, the results were quite positive. “We were astonished by how much less costly it was to run it on blockchain.”\nJohnson added:\n“It’s a very efficient technology, and we think it’s going to open up a lot of new investment opportunities. And, honestly, eventually, I think ETF and mutual funds are all going to be on blockchain.”\nShe attributed this prediction to the “huge costs” associated with verifying data between disparate systems — a problem that blockchain was intentionally designed to solve. Johnson further pointed out that financial institutions and stakeholders still need to verify data between external parties once data is reconciled in-house.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“In the case of blockchain,” she stated, “there’s only one source of truth.”\nThe monetary and temporal savings can lead to more diversified investment opportunities, according to Johnson. She cited the use case of pop superstar Rhianna, who released a series of 300 nonfungible tokens that afforded their owners a tiny percentage of royalties for one of the artist’s songs via smart contract.\nThis is a reference Johnson has made in the past. As Cointelegraph reported back in October of 2023, the CEO relayed the Rhianna story during an interview with CNBC’s Delivering Alpha, wherein she discussed tokenization as “securitization done on steroids.”\nSource: Franklin Templeton\nGenerative AI\nThe conversation then shifted to generative artificial intelligence. Johnson acknowledged the usefulness of generative AI systems but also warned that it was “kind of like the kid who gets an ‘A’ in English and an ‘F’ in math.”\nThe CEO noted that Franklin Templeton had recently partnered with Microsoft to build an AI-powered sales assistant, later adding that there were investment opportunities in the space. She also lauded the potential for AI-powered translation services to bridge language barriers in finance.\nRelated: Base set for ‘material share’ of SocialFi activity: Franklin Templeton\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-11","tags":["#Blockchain","#Business","#United States","#AI","#Tokens"],"author":"by Tristan Greene","category":null}