{"id":"8ecc6a1e-78c2-4cc9-a4a2-e5f7665f5250","article_link":"https://cointelegraph.com/news/bingx-exchange-iran-sanctions-evasion","website_source":"Cointelegraph","article_type":"News Article","summary":"A Telegram admin for BingX claims that the exchange “has no problem with Iranian users, and it is even possible to authenticate with a national card.”","title":"BingX exchange openly supports Iranian users, defying sanctions","detailed_content":"The BingX crypto exchange is allowing sanctioned Iranian users to evade restrictions.\nThe exchange openly displays an Iranian version of its website, and its officials have made statements in Persian in the exchange’s official Telegram group.\nAccording to a translation of one of the statements, “The Bing X exchange has no problem with Iranian users, and it is even possible to authenticate with a national card.”\nThe exchange also allows Iranian rial to Tether\nUSDT\n$1.00\nswaps in its interface, which are prohibited under United States Treasury Department’s Office of Foreign Assets Control (OFAC) rules.\nStatement by BingX admin. Source: BingX official Telegram channel.\nIn another post within the official BingX Discord, one user asked if \"there are any restrictions for registering from Iran\" regarding the platform's verification. \"It should be fine..\" a BingX representative replied, \"Just follow the instruction on your registration.\"\nBingX's policy on user registration from Iran. Source: BingX Discord\nIran has been under a variety of sanctions since 1979. The U.S. and the United Nations have accused the country of a wide variety of violations of international law, including seizing property belonging to U.S. companies, funding terrorism and enriching uranium to make nuclear weapons. Iran has denied these claims. \nThe sanctions generally prevent Iranian residents from using centralized cryptocurrency exchanges, and these exchanges risk being blocked from U.S. and global markets if they do business with Iranians. \nAccording to OFAC, Foreign Financial Institutions (FFIs) risk “correspondent and payable-through account sanctions and blocking sanctions” if they knowingly conduct or facilitate transactions involving the purchase or sale of Iranian rials.\nHowever, it appears that on the BingX exchange, the Iranian rial — an OFAC-sanctioned currency — is directly swappable for other crypto assets.\nBingX supporting transactions in the Iranian rial. Source: BingX\nBingX facilitates over $974 million in trading volume per day, according to CoinMarketCap data. This makes it one of the top 20 crypto exchanges in the world.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nPer data from its official website, the exchange is a registered financial services company in the Republic of Lithuania, giving it a license to do business in the European Union. It is also licensed in Australia as a digital currency exchange and operates from Singapore. \nLike all global financial institutions, entities in Australia and Lithuania must comply with the U.S. OFAC sanctions and any sanctions imposed on Iran by their home countries or the European Union. \nBingXPersian, where services are offered to Iranian residents, is listed as an official channel of the BingX exchange. Source: BingX\nYet, despite such requirements, the exchange publicly solicits Iran-based users on its social channels and official website. Before November 2021, the exchange was known as Bingbon. \nBingX was founded by Josh Lu in 2018 and claims to serve over 10 million users. The nationality of its current founder is unknown. \nStatement by BingX customer support representative J. Jalali. Source: BingX official Telegram channel\nAccording to another BingX representative, “Iran is in the list of countries with restrictions.” However, “this does not mean a ban on providing services.” In addition, the exchange is also advertising its Iranian rial services and states, “Did you know that you can buy and sell Tether with Rials on Bing X?\"\nBingX touts the buying and selling of sanctioned Iranian rial and toman (1 toman = 10 rial) via peer-to-peer transactions. Source: BingX on Telegram\nResponse from BingX\nOn April 13, post publication, a BingX representative told Cointelegraph that Mirzadeh, the Telegram user featured in the above screenshots \"is not an authorized representative of BingX, and his statements do not mirror the official policies or positions of our company.\" In addition, they claimed that the Rial to USDT swaps shown above are on an unauthorized subpage of the Paycat website. \"We want to clarify that the official BingX website is bingx.com. Bingx.paycat.com is not authorized to represent the positions or views of BingX.\"\nThe BingX representative also claimed that Iranian users are not allowed on the exchange. However, after publication, a BingX customer service representative stated that \"there is no requirement for authentication and Persian language users can use the exchange.\"\nBingX's explanation of rules surrounding Iranian users. Source: BingX on Telegram\nNot a first occurrence \nBingX is not the only licensed cryptocurrency exchange that has been caught circumventing sanctions for Iranian users. \nIn July 2022, Reuters reported that the largest cryptocurrency exchange in the world, Binance, was serving Iranian citizens. At the time, Binance denied the claim, stating that it “strictly” adheres to sanctions requirements. \nIn November 2023, the exchange agreed to a $4.5 billion plea deal with the U.S. Justice Department and the U.S. Treasury, admitting that it failed to maintain an effective policy against money laundering. Its former CEO, Changpeng Zhao, also pled guilty to Bank Secrecy Act violations.\nThe BingX official website onboarding Iranian residents. Source: BingX\nIn May 2023, the crypto exchange Poloniex also paid a $7.6 million settlement to the OFAC for failing to retroactively screen users from Crimea, Cuba, Iran, Sudan, and Syria who had registered before the exchange implemented Know Your Customer controls.\nUpdate April 13 2024 7:20pm UTC: Added a screenshot from BingX Telegram\nUpdate April 13 2024 7:15pm UTC: Added a statement from BingX \nUpdate April 12 2024 9:40pm UTC: Added a screenshot from BingX Discord\nRelated: US Treasury sanctions crypto mixer Sinbad, alleging North Korea ties\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-13","tags":["#Blockchain","#Cryptocurrencies","#Iran","#Regulation"],"author":"by Christopher Roark","category":null}