{"id":"8f31ee7e-dd89-408a-abff-71c4dd3f4767","article_link":"https://www.wired.com/story/opsydia-hide-secret-codes-in-diamonds-space-lasers/","website_source":"Wired","article_type":"News Article","summary":"Looking to solve the problem of ethically sourced gems, Opsydia has developed tech to hide submicron-sized dots in precious stones.","title":"This Laser Can Help Verify the Source of a Diamond","detailed_content":"IF YOU’VE EVER bought an engagement ring, or any other diamond jewelry, you likely know about the “Four Cs”: carat, cut, color, and clarity, which between them determine the quality of a gem. The unofficial fifth C is certification—paperwork from an independent authority validating the qualities and authenticity of a stone. Now, however, a UK startup is aiming to bring yet another C into the mix: code.\nOpsydia, a company spun out in 2017 from research conducted at the University of Oxford, is pioneering the laser inscription of near-invisible identifier codes—what it calls “nano-IDs”—inside diamonds.\nEach nano-ID consists of a series of submicron-size dots that are imprinted a fifth of a millimeter beneath the gem’s surface, the dots forming a numerical code that’s linked to official certification documents or (increasingly) blockchain ledgers.\nFEATURED VIDEO\nNeurologist Answers Nerve Questions From Twitter\nCrucially, such an identifier doesn’t come close to registering as the kind of mark that would impact a stone’s quality. Magnification of at least 200X and specifically designed illumination is needed just to spot these subsurface codes. For comparison, specialists in diamond grading laboratories work with between 40X and 80X magnification; a jeweler’s loupe offers considerably less.\n“Because the dots are under 1 micron in all dimensions, it’s actually incredibly difficult to characterize the kind of physical change that’s there—it’s close to doing nothing at all,” says Lewis Fish, Opsydia’s head of product, pointing to a 5-mm diamond inscribed with a nano-ID. “We sent that for checking to one of the leading grading laboratories, and they knew the code was there—but they couldn’t find it.”\nUsing lasers to inscribe tiny codes and even logos onto diamonds is not in itself new. Usually placed on the stone’s girdle (a narrow band at the outer perimeter, dividing upper and lower sections), these have been on offer from grading labs and other providers since the 1980s. But the codes’ surface positioning is also their weakness: They can be polished off. Also, once set in a piece of jewelry they may be obscured.\nThe proliferation of laser technology, meanwhile, means that bad actors can inscribe either fake codes—for instance, assigning a serial number wrongly designating a higher quality of stone, or indeed labeling a lab-grown diamond as natural—or counterfeit versions of the logos of official laboratories and institutions.\nDynamite With a Laser Beam\nEach Opsydia nano-ID consists of a series of submicron-sized dots imprinted a fifth of a millimeter beneath the gem’s surface.\nPHOTOGRAPH: OPSYDIA\nBy contrast, because Opsydia’s technology—which is packaged up in a piano-size machine supplied to industry players such as jewelry brands, manufacturers, and grading labs at a cost of £400,000 ($524,000)—places the inscription beneath the surface, it is supposedly out of reach of the scammers.The code-writing laser beam itself is focused to extreme precision, using patented technology that Opsydia says is unique worldwide in its capabilities. That means it can overcome the exceptionally high refractive index of diamond: The beam effectively behaves as though the diamond, which would normally send a light wave flying off in myriad directions, isn’t there at all.\nWith laser pulses lasting less than a trillionth of a second, there’s apparently no heat damage. And the near invisibility of the mark means that rather than being hidden in a discreet part of the diamond, it can sit centrally, right under the top of the stone.\n“If you wanted to remove it, you’d have to recut the stone and lose a huge amount of the value,” says Andrew Rimmer, Opsydia’s CEO. That’s because reducing the top of a diamond, even by the shallow amount needed to cut out the nano-ID, would generally require recutting other facets to maintain proportionality.\nAnd while the firm trains its customers’ technicians to use its machines and program in the codes themselves, any logos or other IP can only be uploaded by Opsydia itself. “Software encryption means we control that,” says Rimmer. “We’ve set out right from the beginning to have a secure solution.”\nTransparency and traceability have become especially hot topics in the jewelry industry and the wider luxury sector, as demand for goods that are ethically sourced and verifiable has increased sharply. “Issues at the turn of the century such as blood diamonds and conflict gold created awareness that greater transparency was needed in diamond and gem supply chains,” says Laurent Cartier, head of special initiatives at the Swiss Gemmological Institute and a lecturer at the University of Lausanne.\n“Today the main drivers are regulations from governments, the banking sector, and OECD guidelines, and the growing demands of consumers to know more about where and how the gems in their jewelry were sourced.”\nTo that end, technological solutions that can help analyze, verify, and identify diamonds and gemstones are being increasingly explored. Earlier this year, for instance, the Swiss company Spacecode announced a device it says can chemically analyze the makeup of a particular diamond and identify its place of origin, while others are also investigating the notion that each diamond has a unique chemical and morphological “fingerprint” that can identify it.\nCartier warns against assumptions that technology alone can solve all such issues, “but it is a very important part of the traceability puzzle,” he says. Opsydia’s subsurface tech, he says, “adds an extra layer of security and is a promising approach for high-value diamonds and gemstones.”\nIn particular, Rimmer says Opsydia’s nano-IDs can bring added certainty to the kinds of blockchain platforms that have emerged in recent years to support traceability and authentication in the luxury and jewelry sectors. Examples include the Aura platform developed with Microsoft by LVMH, Cartier, and Prada, and Tracr, launched by the world’s largest diamond producer, De Beers.\nHowever, as Cartier points out, such platforms are only as good as the quality of the data going into them: Knowing the origin of a diamond only tells you so much. “There may be a paper trail and audits that confirm it comes from a specific mine and a particular set of standards were followed,” he says. “Technology can be useful in carrying that information all the way through the supply chain in transparent and verifiable ways.” But a paper trail could be assigned to the wrong gem.That, says Rimmer, is where Opsydia comes in. “Blockchain is a way of storing information securely, but you need to make sure it’s linked to the physical stone or piece of jewelry.” So as well as inscribing a serial number that goes into the blockchain, Opsydia’s machines can take a photograph of the inscription that can also be stored in the ledger. As another safeguard, the company has developed a light-box viewing system to demonstrate the inscription in jewelry showrooms.\nRimmer adds that a single Opsydia machine can process around 100,000 stones a year (each one takes around 10 seconds). He’s targeting both profitability for Opsydia, which closed its third funding round last summer, and the processing of 10 million stones annually across the company’s machines, by 2025.\nShaping Space Lasers\nEach Opsydia machine can process around 100,000 stones a year (each one takes around 10 seconds).\nPHOTOGRAPH: OPSYDIA\nBut it wasn’t out of a wish to solve diamond traceability that Opsydia’s technology was developed. Rather, it emerged as part of wider research into areas including adaptive optics for space telescopes and the precise shaping of laser beams, conducted at Oxford University’s Department for Engineering Science.\nOpsydia was set up in 2017 through Oxford University Innovation, the company that manages IP licensing and spin-offs from the institution’s research work, to commercialize the research team’s technology. The first laser machines were delivered in 2020, with De Beers’ lab diamond arm, Lightbox Jewelery, among the early takers. As well as diamonds, the laser inscriptions can also be applied to any gemstone.\n“When we started, there were a few conversations ongoing around traceability, but now it is the number one conversation in the jewelry industry,” says Rimmer. “So the real pull is coming from the brands who want to be able to tell this story as part of their promise to consumers, because that’s what they’re asking for.”\nThe war in Ukraine and consequent difficulties in stemming the flow of diamonds from Russia, among the world’s largest producers, into Western markets, have served to highlight the complexity and opaqueness of gemstone supply chains globally, and the need for new ways to tackle this.Opsydia’s technology can only be applied at the stage of a stone being polished and cut, though the company is “looking at the feasibility of doing something at the ‘rough’ stage,” says Rimmer, suggesting that raw, uncut diamonds could one day be laser-inscribed at source. That, however, is apparently some way off. “We’re not there yet, but we’re investigating,” he says.\nQuantum Leap\nThe laser tech has potential to create atomic-scale defects in the diamond lattice where two carbon atoms are replaced by a nitrogen atom and an empty space. Such chambers have remarkable quantum properties.\nPHOTOGRAPH: OPSYDIA\nAway from the glittering world of gemstones, Opsydia’s advances in applying precisely controlled lasers to diamond structures are also presenting opportunities in new industrial fields. “We’re able to write electrical circuits inside a diamond wafer,” says Rimmer. This brings into play the emerging world of diamond-based electronic devices, with multiple potential applications—including perhaps the greatest prize: quantum computing.\nIn essence, the laser can be tuned to transform localized parts of a diamond's carbon lattice (the arrangement of atoms in a diamond crystal) into graphitic structures that conduct electricity—micro-scale, 3D electronic circuits. Such devices are used in particle accelerators at CERN, for instance, in high-energy particle detection applications where other materials degrade quickly.\nRimmer says there are other potential uses in electrochemistry, instrumentation, and radiation detection. “The big benefit that diamond has over silicon and other materials is that it’s not damaged by radiation.”\nBut there may be even greater potential in using the laser to create nitrogen-vacancy (NV) centers in the diamond lattice: invisible, atomic-scale defects where two carbon atoms are replaced by a nitrogen atom and an empty space.\nNV centers have remarkable quantum properties, including ultra-sensitive magnetic field detection and the ability to emit and manipulate light at the single photon level. That makes them effective as controllable and measurable quantum systems.\n“An NV center can operate as a qubit, which means that diamond is one of the candidate materials for quantum processing,” says Rimmer. While that’s the end goal, nearer-term applications around ultra-fine magnetic sensing and instrumentation—for magnetic ground surveys, for instance, or GPS communication—are also in play.\nAll of that remains at the university research stage for now. Nevertheless, for Opsydia’s investors, diamond traceability may just be the tip of a very sparkly iceberg.","creation_date":"2023-11-27","tags":["","QUANTUM COMPUTING","LUXURY"],"author":"BY TIM BARBER","category":null}