{"id":"8f497837-d212-47d3-a01f-9715b7d52eff","article_link":"https://cointelegraph.com/news/scammers-toncoin-pyramid-scheme","website_source":"Cointelegraph","article_type":"News Article","summary":"Telegram’s integration of the TON blockchain and its native Toncoin token has become a honeypot for scammers promoting a referral pyramid scheme.","title":"Scammers eye Toncoin as Telegram-TON partnership grabs headlines","detailed_content":"Telegram’s public support for The Open Network (TON) blockchain and its intention to incorporate its native Toncoin token have led to scammers targeting unsuspecting tokenholders to exploit them.\nInformation shared with Cointelegraph from cybersecurity firm Kaspersky outlines a cryptocurrency scam that has been attempting to steal Toncoin (TON) from Telegram users worldwide.\nAccording to experts at Kaspersky, the scam has been operating since at least November 2023 as interest and investments in TON surged. Scammers have been promoting an elaborate referral scheme that ultimately aims to steal TON tokens from users.\nRelated: Telegram commits to TON blockchain, plans to support tokenized emojis and stickers NFTs\nPotential targets receive a link from friends or contacts to participate in an “exclusive earning program.” The scammers then begin prompting victims to join an unofficial Telegram bot purportedly designed to store cryptocurrency and to link their Web3 wallet to the bot’s system.\nAt the same time, the fraudsters instruct users to purchase Toncoin through legitimate channels like the official Telegram bot, peer-to-peer (P2P) markets or cryptocurrency exchanges, which adds an element of credibility and a false sense of security.\nThe signup page for users to purchase boosters that offer varying returns for TON deposits. Source: Kaspersky\nVictims are then coerced into purchasing “boosters” using a separate bot. The scammers claim that users must complete this action to start earning.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThis is the point at which scammers make their money. After purchasing a booster, the user irrevocably loses control of their cryptocurrency.\n“The costs of ‘boosters’ — labeled by the scammers as ‘bike,’ ‘car,’ ‘train,’ ‘plane,’ or ‘rocket’ — vary from 5 to 500 Toncoins,” Kaspersky’s experts explained.\nThe scheme’s booster tier with commissions offering returns typical of a pyramid scheme. Source: Kaspersky\nUsers lose anywhere between $2 and $2,700 through the targeted pyramid scheme. After convincing users to purchase fake boosters, the scammers also tout a referral program that requires victims to create private Telegram groups with friends and contacts.\nRelated: New Telegram mini-apps will be so convenient users won’t know it’s crypto\nThe scammers provide a referral link that comes with its own video instructions for users in both Russian and English. Users are required to have five successful referrals in order to start earning through the fraudulent scheme.\nThe scammers promise earnings from two sources, including a fixed payment of 25 TON for each invited friend and commission based on the booster tariff purchased by your referrals.\n“It turns out to be a classic pyramid scheme, in which each participant is a partner rather than a freeloader. Sadly, nobody profits except the scammers, and all ‘partners’ lose their investments,” Kaspersky’s analysts explained.\nCointelegraph has requested additional information from Kaspersky regarding the number of users who have been affected and the total amount of funds that have been lost. This article will be updated accordingly.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-23","tags":["#Blockchain","#Altcoin","#Telegram","#Cybercrime","#TON","#Scams","#Pyramid Scheme"],"author":"by Gareth Jenkinson","category":null}