{"id":"90bf08a8-1ea9-40b9-beb3-65d53d213610","article_link":"https://cointelegraph.com/news/somnia-metaverse-browser-web3-explore","website_source":"Cointelegraph","article_type":"News Article","summary":"Layer-1 blockchain and metaverse protocol Somnia has launched the Metaverse Browser, aiming to make Web3 exploration and custom content creation more accessible and user-friendly.","title":"The metaverse is coming straight to your web browser: Here’s how","detailed_content":"Over the past few years, the metaverse has been increasingly gaining prominence in the mainstream, with companies like The Sandbox becoming recognizable names even beyond the realm of Web3.\nHowever, after the initial hype died down, onboarding new users remains a challenge for developers in the space who want to keep making digital reality, well, a reality.\nIn a bid to make the metaverse more accessible and user-friendly, the Layer1 blockchain and metaverse protocol Somnia announced that it is bringing the metaverse straight into users’ web browser.\nOn May 15, the protocol launched its Metaverse Browser, which was developed with a simplified and intuitive interface to make it more easy for new users to explore Web3 and create custom content. \nPaul Thomas, the founder of Somnia, said that they hope to set the stage for a more “inclusive and accessible metaverse.”\n“This platform is not only about simplifying technology but also about empowering individuals to explore and create without limits.”\nThomas told Cointelegraph: \n“[Users] don’t need experience with Web3 wallets or even have a Web3 wallet installed to interact with the browser, all of that is abstracted for the user…This we hope will allow anyone to use it and be part of the metaverse and use Web3.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nHe highlighted that the browser also allows users the ability to create and deploy DApps within the Somnia ecosystem.\nThis includes object creation tools, which will utilize artificial intelligence (AI) based generation tools to allow people to create objects easily even without 3D art experience.\nIn the future, Thomas said that they are working on deploying a first-party marketplace to enable users to buy and sell their metaverse objects and avatars creating what we call the metaverse object economy.\n“Developers will have access to a software development kit that enables them to easily create apps for users to interact with the metaverse,” he said. “These apps could be anything from a profile viewer to a marketplace for the metaverse.”\nRelated: This 360 treadmill could make Disney’s metaverse a physical playground\nSomnia even partnered with the Web3 media company Yuga Labs to offer exclusive rewards to holders of select Yuga Labs nonfungible token (NFT) collections.\nThese users will get a bonus on any points earned during the Somnia Point Dream Hunt incentive campaign that rewards users for engaging with metaverse experiences.\nX said that he hopes such partnerships will “drive initial community engagement” and encourage some of the biggest communities in Web3 to try out having the metaverse in their browser. \nYuga Labs is known for being a leader in bridging digital and physical reality, coining the term the “Yugaverse.\" It s the company behind iconic NFT collections such as Bored Ape Yacht Club, Mutant Apes, CryptoPunks and more.\nOn April 26, Yuga Labs announced the start of a restructuring process following the appointment of Greg Solano as CEO two months earlier.\nAlthough the metaverse has been through a slump, the market is still projected to reach a value of $74.4 billion by the end of 2024, according to data from Statista. Its general path indicates that, even with conservative estimates, it is positioned for upward expansion.\nMagazine: Meme coins: Betrayal of crypto’s ideals… or its true purpose?\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Adoption","#Metaverse","#Web3","#NFT"],"author":"by Savannah Fortis","category":null}