{"id":"927618c4-189b-470a-a21c-5278bad010b7","article_link":"https://medium.com/@joshgans/bitcoin-and-renewables-f4d0fa763674","website_source":"Medium","article_type":"Blog Post","summary":"Why pushing Bitcoin towards renewables is unlikely to help anything","title":"The Myth of Renewable Bitcoin","detailed_content":"Bitcoin has a reputation for being environmentally unfriendly. Mostly this is, as I argued previously, because (a) it uses lots of electricity and (b) that people don’t think this is a good use for that electricity. But, recently, the focus has been on the type of electricity. For instance, Elon Musk, who previously embraced Bitcoin as a payment option for Tesla, backed away given the ‘brand confusion’ associated with promoting environmental friendliness when Bitcoin was not.Musk’s view is that it is not the electricity per se but the type of electricity that is at issue. At a conference in 2021, he remarked:In other words, if Bitcoin runs on renewables (solar, wind, geothermal) it will be back in Tesla’s good books. The intention is to make Bitcoin non-carbon polluting. But will such a shift actually do that? Or will it just look like it is doing that? There’s a difference.Let’s begin by looking at some Bitcoin electricity facts. This week Tyler Cowen and Alex Tabarrok released the new chapter of their economics textbook on Cryptoeconomics (it is a great introduction to the whole sector by the way). They provide a brief overview of the “energy problem.”Bitcoin is costly as a payment system. But Bitcoin actually isn’t used that much so the total cost is surprisingly small by comparison to other things. That’s all very well, but if Bitcoin reaches the heights its advocates are hoping for, those costs will rise so this isn’t something to be complacent about.There are, however, two important aspects to Bitcoin’s energy usage that are worth noting. First, it is highly space agnostic. What I mean by that is that the Bitcoin network is global but it does not matter where Bitcoin mining and hence, electricity usage takes place. You only need a half-decent connection to the Internet to run such an operation. Other than that, you can do it anywhere. That means that Bitcoin mining will move and concentrate where on the planet energy costs are cheapest. If Bitcoin was actually a bigger thing, this could have the effect of causing electricity prices around the world to equalise. In terms of its use of renewables, the good news is that the opportunities are worldwide. The bad news is that this will be driven purely by cost considerations.Second, medium and long-term Bitcoin energy usage is highly unpredictable. If you look over the past year, the hash rate (that is, the amount of computational effort devoted to mining bitcoins) has been highly variable but it was distorted when mining facilities in China were shut down.A better view is over the life of bitcoin. Note that the hash rate rises and falls with Bitcoin’s price. The correlation is far from perfect but makes intuitive sense. The reward to mining are bitcoins you might earn so it makes sense that if the value of the prize gets higher, it will pay to devote more assets (computing capacity) to Bitcoin and to run those assets more intensively.The relationship isn’t perfect because (a) the number of bitcoins earned through mining has been ratcheting down over time and (b) the difficulty of the computational contest is ratcheting up over time. Both of these make mining less attractive. In other words, the “work” in proof of work is designed to become harder both over time (naturally) and also the more lucrative to contest seems to be. (For a mathematical treatment, see this paper of mine with June Ma and Rabee Tourky).What this means is that Bitcoin energy usage is as predictable as the bitcoin price (i.e., not very predictable) although the automatic stabilisers built into the computational difficulty adjustment do play a role in smoothing this out.With this background, let’s evaluate the substance of Musk’s proposal — that the use of Bitcoin is tied to the share of renewables going into its production. Will this do anything to promote cleaner Bitcoin?It is hard to imagine how. Bitcoin mining can be conducted by anyone which makes it difficult to coordinate how energy is used and what energy is used. But suppose, contrary to facts, that Bitcoin mining was conducted by a single entity. Then they would have an interest in boosting the price of Bitcoin. Thus, if they thought that Musk and others were likely to adopt it at a sufficiently high rate, they would allocate mining resources to be powered by renewables. So far so good.But this is 1-level thinking. The real issue is what this does for global pollution. If Bitcoin were to dramatically increase its use of renewables — maybe to be totally renewable, this will change electricity usage across all of the uses of electricity. Make sure Bitcoin is solar-powered in, say, Australia, and the price of solar-generated electricity will go up while coal-generated electricity will go down. As demand has merely shifted around, so long as electricity users other than those for Bitcoin do not care about where their electricity comes from, then nothing really will change. The total volume of electricity pollution will be the same. All that will change is that Bitcoin miners can feel better about what they are using. That said, in the long-run, investment will be encouraged for renewables and discouraged for polluting electricity. But those effects take time to happen and Bitcoin itself is still a drop in the bucket there.In order to really work what you would have to do is build a solar facility dedicated to Bitcoin somewhere (adding to total electricity capacity) and use that. But that would only be the first step. After all, if you leave it cut off from other uses, you are actually making pollution worse because you are producing renewable electricity but not using it to compete with polluting electricity which is something we want to happen. If you built it on some remote location — say, out to sea, where the only other thing that can be built is a massive Bitcoin mining rig, then maybe you aren’t creating capacity that can be used for other purposes and that will be something pure. But this is an awful lot of work to get clean proof of work. Moreover, under current Bitcoin rules, this isn’t going to really work unless that whole endeavour is cheaper at the margin than other sources.And why won’t it be cheaper? Because Bitcoin computational demand, over the medium to long run, is highly unpredictable. That means you have to build capacity to handle the peaks and you don’t know what those will be and when. That means a ton of capital tied up in the independent but clean Bitcoin mining enterprise. That makes it very costly to achieve.The “let’s make Bitcoin cleaner” movement does not address any real problem with Bitcoin and does not address in an impactful way the broader issue which is that of polluting electricity generation. We know that what we need there is a proper climate policy and a carbon price and then we can worry less about electricity usage and let the market sort out the cleaner sourcing options.The only other way to address this is to move to something like proof-of-stake. That’s what Ethereum is doing but it doesn't seem like Bitcoin will ever be able to follow suit. The point is that there are more energy-efficient ways of running cryptocurrency networks but Bitcoin is not structured to take advantage of them.The point here is that holding up Bitcoin as something uniquely polluting and worthy of significant policy attention for this reason, is a big, fat distraction from real issues. It is a game unworthy of the so-called rationalists that make up much of the crypto community.","creation_date":"2022-05-23","tags":[],"author":"Joshua Gans","category":null}