{"id":"92e3d83f-95fe-4d92-ac12-8623eb965d84","article_link":"https://www.wired.com/sponsored/story/our-passwordless-future/","website_source":"Wired","article_type":"News Article","summary":"How biometrics, hybrid solutions, and new digital credential technologies are transforming identity verification—and everyday life.","title":"Our Passwordless Future","detailed_content":"IN 2024, THE European Union (EU) is scheduled to unveil a new tool for seamless international travel—the Digital Identity Wallet. The app will store personal data such as passports, driver’s licenses, and banking info for quick verification when crossing the border into any of the EU’s 27 member countries, and for easy access to money while abroad. \nThe platform is a response to growing demand for digital identity verification in Europe. In 2021, the EU’s Digital COVID Certificate allowed citizens to easily share vaccination status via a QR code that could be printed out or displayed on a smartphone. In addition, 14 countries representing roughly 60 percent of the EU’s population already have some kind of digitized national identification. The digital wallet will be the most ambitious rollout yet of a comprehensive digital ID system, combining security, compliance, and privacy safeguards for the EU’s 447 million citizens.\n“We want the EU to become the first global region with a governance framework for trusted digital identities,” stated a member of the European Parliament in February. “The digital wallet will become a reliable, all-in-one identity gateway that puts citizens in full control of their own data and gives them the freedom to decide exactly what information to share, with whom, and when … a new driver of civic engagement and social empowerment and a tool for an inclusive digital Europe.”\nThe digital wallet is the latest, highest-profile example of a worldwide trend: the demise of passwords and the rise of digital identities. In a December 2022 study of 1,450 global consumers by Entrust—a leader in secure identities, payments, and data—just 6 percent stated that passwords are the most secure method of identity verification online, and more than half said they needed to reset their passwords at least once a month because they forgot them.“Nobody likes passwords,” says Greg Wetmore, the vice president of software development at Entrust. “They’re awkward, not very useful, and easy to steal.”\nConsumers want digital verification methods that easily and securely share information that’s relevant for each interaction, leading to growth in platforms and methods that will transform our lives in the years ahead.\n“This technology is in its early phases,” Wetmore says. “But there are really interesting pilot projects leading the charge, and Entrust has found that ultimately the future of identification is hybrid—physical and digital.”\nUnlocking the World\nMost of us already use an alternative to password authentication every day: scanning our thumbs or faces to unlock our smartphones. This is biometric technology, based on a person’s unique biological characteristics, like fingerprints, facial shapes, voices, and retinas, and it’s quickly becoming the default for verifying identity. These methods are more secure and convenient than passwords, and consumers prefer them. According to Entrust’s survey, 74 percent of respondents said that when they’re given the option between biometrics and passwords, they choose biometrics at least half the time.\nIn most places around the world, biometrics are already making air travel easier. The U.S. employs them in its Global Entry program, and in the United Kingdom travelers on Eurostar trains can use their face as both their ticket and e-passport when traveling throughout Europe. Authorities are updating the system so travelers can use biometrics upon entering the UK as well, and the EU is aiming to replace physical passports with digital verification by the end of 2023. “Europe won’t be stamping passports anymore,” says Gord Wilson, the vice president of identity verification at Entrust. “Instead, they’ll capture facial images, scanning and confirming your identity, as opposed to capturing it and going through that whole process.”\nUltimately, our smartphones will become our primary identity verification tool, providing access to various digital credentials, and that means biometrics will likely be the key to unlocking access. In addition, due to their widespread use, smartphones with biometric verification could help provide IDs for the one billion people who currently don’t have a legal identity—opening up ways for citizens to start bank accounts, vote, get access to healthcare and more.\n“That’s a huge gap that needs to close, and I think governments have a role to play,” Wetmore says. “Mobile phones are everywhere in less developed countries and can become a great enabler, bringing more people online.”\nElectronic IDs and Hybrid Solutions Provide the Right Mix\nWith the move to digital tools, it may be surprising to learn that physical IDs will also play an integral part in identity verification going forward. “Entrust believes the blending of physical and digital will be really important,” Wetmore says.\nToday, so-called eIDs—physical identification containing a chip for electronic verification—are on the rise, with more than 164 countries already issuing e-passports. The pandemic helped usher in this change, thanks to demand for contactless solutions, although consumers are still catching up. In Entrust’s survey, 43 percent of respondents said they already had an eID, 36 percent said they didn’t, and 21 percent weren’t sure. This demonstrates that there’s confusion on the issue, since in many countries, including the U.S., passport holders are automatically issued an e-passport. (Only 27 percent of U.S. survey respondents said they had one.) But when eIDs are an option, they’re popular. Seventy percent of respondents said they’d use an electronic ID if one were available. In the future, hybrid solutions—a driver’s license with a scannable RFID chip, for example—will be pervasive.   \n“In the hybrid future, consumers can use a highly secure passport document to enroll for a digital identity and use that online or via their phone,” Wetmore says. “That identity-verification mechanism takes a high-assurance physical identity and turns it into a high-assurance digital identity. It’s a trend we see happening today, and our technology supports it.”\nDecentralized Identity and Ownership Is the Future\nTo unlock seamless identity verification going forward, consumers will need to share more information—an inevitability they accept.\nIn Entrust’s survey, 74 percent of respondents agreed that sharing personal information in exchange for goods, services, or apps was unavoidable. This is why decentralized identity, which uses distributed ledger technologies (blockchain, for example) for verification, is intriguing. In this scenario, consumers could control which information is shared with a third party through a digital identity wallet that confirms or denies a verification request. For example, you could scan your phone to prove that you’re over 21, but that would be the only information shared with the restaurant or liquor store—not your home address, your email address, or even your date of birth, which is something on everyone’s drivers license. It would simply confirm that you’re over 21. \n“The future is decentralized identity,” Wetmore says. “In your mobile wallet, you’ll have a number of verifiable credentials. Then you can choose which one you want to use for what service, which makes it really helpful as well as an easy experience.”\nDecentralized identity eliminates reliance on third parties and helps consumers retain control of their identifiers—an easier and more secure approach to daily verification.\n“In the future of travel, your whole journey will be powered by shared, trusted documents that transfer from government to industry,” Wilson says. “That process will be supported by trusted infrastructure with decentralized identity, and we’ll start seeing that implemented in the next two years.”\nUltimately, consumers will be able to just share the information that truly matters.\n“People will start to have a greater ability to only release the minimum amount of data required for a service or transaction,” Wetmore says. “As digital adoption goes up, friction goes down, and people’s control over their personal information will increase.”\nThis story was produced by WIRED Brand Lab for Entrust.","creation_date":"2023-03-15","tags":[""],"author":null,"category":null}