{"id":"941162d3-4487-4ea6-a775-6eee9fddc1a8","article_link":"https://cointelegraph.com/news/usdt-lifeline-inflation-stricken-nations-tether-ceo","website_source":"Cointelegraph","article_type":"News Article","summary":"Unlike other stablecoin issuers, Tether says it is focused on offering stablecoin services to the world’s unbanked, which amounts to over 300 million people.","title":"USDT aims to offer a lifeline to inflation-stricken nations: Tether CEO","detailed_content":"The main purpose of the world’s largest stablecoin, Tether USD\nUSDT\n$1.00\n, is to help people in inflation-stricken economies protect their purchasing power, according to Tether CEO Paolo Ardoino.\nIn an exclusive interview with Cointelegraph, Ardoino said Tether’s main focus is to help the unbanked population who don’t have access to traditional banking gain access to USDT.\n“[USDT] is a tool that helps people in places that have been forgotten by the banking industry. These 300 million people are of no interest to the banking industry. These are great people, but they cannot be onboarded by the banking industry because they are too poor to be of interest.”\nRampant inflation is forcing people in emerging economies to increasingly look for external financial alternatives, such as the U.S. dollar. This issue is especially pressing in Argentina, where the national currency lost 98% of its value against the dollar, according to Ardoino.\n“What you want to do if you live in Argentina is to buy the U.S. dollar… We think about USDT as the tool that is helping people. So we have to be so focused on making it the safest that it can be. That's why we have T-bills, gold, and Bitcoin. But now our approach is to be 100% in T-bills in the next few quarters.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: Tether USDT stablecoin goes live on TON blockchain\nTether is the world’s largest stablecoin with an over $109 billion market capitalization, compared to Circle’s USDC, with a $33 billion market cap in the second place, according to CoinMarketCap data.\nArdoino attributes Tether’s success to finding the right market fit, which is people who need access to financial services and U.S. dollars. In contrast, other stablecoin issuers are trying to sell their services to the legacy banking industry.  The CEO explained:\n“So our biggest competitors focus on the banking industry as their customers. But the banking industry has already the best, the best access to the dollar. They have credit cards, debit cards, and banking rails. They work in jurisdictions like Europe and the U.S. where people don't need stablecoins.”\nStablecoin usage in Europe and the United States is “approaching zero,” explained Ardoino, adding that serving the world’s unbanked will remain a top priority for the stablecoin issuer:\n“The people that need a stablecoin are the ones that live in emerging markets. And these people need stability. They need to know that whatever happens, they can redeem for $1.”\nTether completed the ‘gold standard’ security audit, the System and Organization Controls 2 (SOC) audit on April 1, This represents the highest level of security compliance that an organization can demonstrate.\nRelated: BlackRock ETF close to overtaking Grayscale, despite second-lowest daily inflows\nExchange or buy USDT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Adoption","#Hyperinflation","#Unbanked","#Inflation","#Tether"],"author":"by Zoltan Vardai","category":null}