{"id":"943e2206-c1eb-4b8e-95d5-e594d9b3e5ed","article_link":"https://cointelegraph.com/news/tokenization-next-phase-real-world-data-integration","website_source":"Cointelegraph","article_type":"News Article","summary":"Chainlink Labs’ director of capital markets said that enhancing tokens with real-world data could unlock better applications than traditional finance.","title":"Tokenization’s next phase requires real-world data integration — Chainlink","detailed_content":"Researchers from the blockchain oracle platform Chainlink believe asset managers have a “sizable” opportunity to jump into tokenization as financial asset infrastructures continue to go digital. \nIn an industry report titled “Beyond Token Issuance,” blockchain oracle platform Chainlink explained where the opportunity lies and how interoperability and real-world data could unlock the value of tokenized assets.\nIndustries and markets that could benefit from tokenization. Source: Chainlink\nThe report laid down the potential benefits of tokenization for asset managers. This includes unlocking dormant capital, giving assets greater availability and creating novel revenue models.\nApart from these, Chainlink said that asset managers could also create unified client portfolios, differentiate their service offerings, and improve their risk management as tokenization allows for more automated risk assessment.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWithin the report, Chainlink also argued that blockchains continued to evolve into an “integral component of the existing financial ecosystem.” In addition, the company highlighted that traditional and blockchain-based assets are already merging into a single financial ecosystem.\nThe researchers believe this resulted from continued digitization, as blockchains offered superior infrastructure for asset storage and transactions.\nRelated: New crypto users shouldn’t ‘rush into DeFi’ — Security firms\nRyan Lovell, director of capital markets at Chainlink Labs, told Cointelegraph that tokenization has been in a research and development phase for several years.\nLovell explained that institutions were bringing simple account balances on-chain and were trying to figure out the potential impact of tokenization for their businesses only at a basic level. Lovell said:\n“This was kind of like building a concept car without an engine or interior — just a basic shell of what the future will hold.”\nHowever, the executive believes that the next phase for tokenization will be more about building foundational infrastructure. This is necessary to make tokenized assets composable and programmable across traditional systems and private and public chains.\nMeanwhile, the Chainlink executive believes that enhancing tokens with real-world data and letting them become interoperable across blockchains and traditional systems could unlock powerful applications.\nLovell said these use cases would feature more transparency, lower costs and more streamlined administrative processes than traditional finance infrastructure.\n“We’re actively working on several exciting initiatives at the moment to enable institutions to go beyond mere token issuance, manage tokenized assets throughout their entire lifecycle, and transact across the cross-chain economy,” Lovell added.\nMagazine: ChainLinkGod was in High School when he started the account! X Hall of Flame\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Tokens","#Chainlink","#Data"],"author":"by Ezra Reguerra","category":null}