{"id":"9446d9f8-755e-4087-bae0-1caaeb40ecf1","article_link":"https://cointelegraph.com/news/stablecoin-competition-regulatory-engagement","website_source":"Cointelegraph","article_type":"News Article","summary":"Tether CEO Paolo Ardoino says adding new players to the stablecoin landscape is crucial to increasing legitimacy in the eyes of regulators.","title":"Stablecoin competition crucial for regulatory engagement — Tether CEO","detailed_content":"Ripple’s move to launch its own stablecoin could add further legitimacy to the stablecoin landscape, according to Tether CEO Paolo Ardoino.\nSpeaking exclusively to Cointelegraph during Paris Blockchain Week, Ardoino said the stablecoin ecosystem needs healthy competition between big players to further legitimize the utility of fiat-backed tokens in the eyes of regulators.\n“First of all, competition is great. I always believed that Tether cannot be alone. The stablecoin ecosystem is an industry because there are many players,” Ardoino said.\nStablecoins have become an increasingly important cog in the wider cryptocurrency space. With a total market capitalization of over $130 billion in April 2024, stablecoins provide a wide range of utilities, from centralized exchange to decentralized finance (DeFi) protocols.\nThe top 10 stablecoins by market capitalization. Source: CoinMarketCap\nArdoino said that having multiple credible players with viable and thriving businesses offering stablecoins reflects the growing importance of the sector:\n“Being multiplayer helps in discussions with the regulators. If you are all alone and you have one single product, regulators will never take you seriously. If you have a group of great companies, then you are more effective.”\nArdoino also believes that Ripple’s intent to launch a stablecoin later in 2024 is indicative of the amount of room for more players to offer legitimate fiat-backed tokens.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: Tether’s USDT stablecoin hits historic $100B market cap\n“I believe that there is space for everyone. Considering that the United States is printing around $1 trillion every 100 days, the space could probably be 30 times bigger than it is,” Tether’s CEO said.\nTether’s market dominance\nTether\nUSDT\n$1.00\nis the leading stablecoin by market capitalization, valued at $108 billion on April 17. USD Coin\nUSDC\n$1.00\ntrails USDT as the second biggest stablecoin by market cap at $32 billion.\nTether’s latest attestation of circling USDT tokens across 15 different blockchain protocols. Source: Tether\nArdoino believes that the growing adoption of stablecoins like USDT and USDC is a direct result of rampant inflation and devaluing national currencies around the world.\n“Think about Argentina, Turkey, Venezuela, Vietnam or Brazil. All these countries are looking for an alternative to the national currency. The inflation in these countries and nations has been going through the roof,” Ardoino said.\nHe added that more than 2 billion people remain unbanked, living off less than $300 a month. This leaves a large number of people without bank accounts and unable to transact in conventional economies.\nRelated: Tether boosts Bitcoin reserves with latest acquisition\nThe growing accessibility of digital wallets means that people are becoming increasingly able to save in digital forms of money like USDT or USDC. As Ardoino said, the simplicity of these offerings reflects a bleak reality of the global economic landscape:\n“USDT’s digital dollar is nothing fancy. It simply moves on a blockchain. The sad reality is that the success of stablecoins is also directly proportional to the macroeconomic issues happening in this world.”\nArdoino maintains that circulating USDT is overcollateralized by 106%. Tether also intends to move toward 100% reserves in U.S. Treasury bills. It currently holds an estimated $90 billion of Treasury bonds. \nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExchange or buy USDTSOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-17","tags":["#Blockchain","#Paris","#Adoption","#Tether","#Stablecoin","#USD Coin","#Regulation"],"author":"by Gareth Jenkinson","category":null}