{"id":"950c8a22-22f7-4eaf-bce9-31e612b74fc0","article_link":"https://cointelegraph.com/news/ethereum-dencun-upgrade-ether-supply-shift","website_source":"Cointelegraph","article_type":"News Article","summary":"This marks the first period of Ethereum becoming inflationary in the past year and a half since the Merge took place.","title":"Ether turns inflationary for the first time since Merge","detailed_content":"The Ether\nETH\n$3,028\nsupply has ceased to be deflationary following Ethereum’s highly anticipated Dencun upgrade that went live two months ago.\nTotal Ether supply increased to 120.1 million on May 7, from 120 million on March 12, before the Dencun upgrade was rolled out on mainnet, according to CryptoQuant data.\nWhile this is a small increase, it marks the first period when Ether supply turned inflationary since September 2022, when the much-anticipated Merge transitioned Ethereum to its current proof-of-stake consensus model.\nEthereum: Total Supply and Fees Burned. Source: CryptoQuant\nEther temporarily losing its deflationary status is not critical for the Ethereum network since its main benefits are more related to decentralized applications (DApps), according the founder and CEO of Cryptoquant. In a May 9 X post, Ki Young Ju wrote:\n“Post-Dencun upgrade, $ETH lost deflationary status with reduced fees, departing from “ultrasound money.” Ethereum’s strength lies in DApps; it’s wiser not to compare it to Bitcoin’s sound money narrative.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nEthereum Total Transactions and Fees Burned. Source: Ki Young Ju\nEther supply first turned deflationary after the Merge on Sept. 15, 2022, when a mechanism that permanently burned transaction fees on the network was introduced resulting in a decreasing Ether supply.\nOver 419,713 Ether tokens were burned, or permanently removed from circulation, since the Merge, according to ultrasound.money.\nSource: ultrasound.money\nRelated: Dencun is a big step towards mass adoption: Metis CEO\nThe death of “ultra sound” money?\nThe Dencun upgrade has ended Ether’s inflationary streak by making median transaction fees as much as four times cheaper than before, with the same level of network activity.\nWhile this is a significant step for the Ethereum network and its users, it could spell the end of Ether’s status as ultra-sound money, according to a May 8 report by CryptoQuant.\n“The Dencun upgrade has made ETH inflationary again, potentially killing the narrative of “Ultra sound” money as a structurally lower amount of transaction fees burned on Ethereum have had the corresponding effect of not decreasing the total supply of ETH to keep it deflationary.”\nDue to lower transaction fees, the amount of Ether being burned has declined to its lowest levels since the Merge, while supply growth has risen to its highest level since the upgrade.\nRelated: VanEck subsidiary’s memecoin index up 137% year-to-date\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Blockchain","#Ethereum","#Ethereum Price","#Dencun Upgrade"],"author":"by Zoltan Vardai","category":null}