{"id":"95463d6c-7f21-4ac3-86c7-e9efa48ff0a3","article_link":"https://medium.com/@larissanetwork23/unlocking-the-future-of-larissa-blockchain-with-lrsnode-and-lrsn-tokens-dfe53db7cc06","website_source":"Medium","article_type":"Blog Post","summary":"What is LRSNode?","title":"Unlocking the Future of Larissa Blockchain with LRSNode and LRSN Tokens","detailed_content":"LRSNode is a Larissa Blockchain Node equipped with a rewards system, designed to incentivize participation in securing and developing the Larissa network. It offers rewards in the form of LRSN tokens, fostering engagement and support for the growth of the Larissa ecosystem.The LRSNODE DAO aims to be a self-sustaining, decentralised organisation. The DAO will generate income from multiple streams, including profits made from LRSNode Licence Key sales, one-time membership fees in the form of NFTs, and income from the Larissa ASIC mining farm. The DAO’s outgoings will be allocated towards development, membership monthly profits, and Larissa project funding. Members of the LRSNODE DAO will have voting rights and access to unique benefits, such as a monthly share of profits paid in LRS and access to LRSN staking. The LRSNODE DAO will constantly evolve to add new funding streams and opportunities for its members. Our vision is to help secure the future of the Larissa network by providing a reliable and decentralised platform for miners to earn LRS and LRSN tokens while supporting the LRSNODE DAO’s mission to fund and develop projects on the LRS blockchain.I- MINING POOL:\nWe will have a community-driven mining pool (pool.larissa.network) with a high emphasis on decentralisation that incentivizes miners to join by providing reliable and profitable mining opportunities. Our mining pool will use the latest technologies and algorithms to ensure the highest possible mining efficiency and returns for our miners. And the 1% of Fees of Larissa Pool will go to the LRSNode DAOII- LRSNode ASIC MINING FARM:\nLRSNode will also have its own ASIC mining farm that it will develop and grow. The mining farm will feed its hash-power to the Larissa official mining pool and its profits to the LRSNODE DAOIII- Larissa Store Profit:\nWhenever user buys a LRSNode Licence Key by swapping LRS to LRSN, 100% of LRSN will go to LRSNode DAOIII- NFT Mint Profit:\nLRSNode DAO membership: To become a member of the LRSNode DAO, members must first mint a unique NFT membership number. The membership fee starts with 500 LRS. The funds generated from the minting process are sent to the LRSNODE DAO.The membership NFTs are broken-down into the following categories: Level 1 — Firefly NFT, Level 2 — Pug NFT, Level 3 — Tiger NFT.Mint Increase per 100 Units\na. First 100 NFTs — 500 LRS\nb. Second 100 NFTs — 650 LRS\nc. Third 100 NFTs — 800 LRS And so onInitial Supply of NFTs is 5000\na) Firefly NFT — 3000\nb) Pug NFT — 1500\nc) Tiger NFT — 500Profit distribution of LRSNode DAOI- Node Operator Rewards:\nOperators of the node that supply LRSNODE with validate Licence Key will be rewarded with LRSN relative to the uptime of the node. Please check the Reward Slab for reward details.II- Mining Rewards:\nBy joining our pool, miners can mine LRS coin and earn LRSN tokens as reward while supporting the development of the LRS network. Miners will be rewarded LRSN equivalent to 0.01% of LRS mined on Larissa Official mining pool.III- Members Wallet:\nLRSNode DAO membership: To gain access to the LRSNode DAO, members must acquire a unique NFT membership after paying a fee of 500 LRS. Membership perks encompass whitelist access, participation in future airdrops, voting rights on DAO proposals, access to exclusive Discord channels, LRSN staking opportunities, and a 23% share of monthly DAO profits.\nThe monthly share of the members wallet is divided by the membership tiers:a. Level 1 — Firefly NFT = 5% + 3 LRSN\nb. Level 2 — Pug NFT = 8% + 5 LRSN\nc. Level 3 — Tiger NFT = 10% + 8 LRSNVI- Project Funding wallet:\nThe Project Funding wallet serves as a crucial resource to support Larissa’s ongoing development initiatives and upcoming projects within the Larissa blockchain ecosystem. It plays a pivotal role in financing various expenses associated with project development and ensuring the continuous evolution of Larissa’s product offerings. With 20% allocation from the LRSNode DAO wallet, the Project Funding wallet aims to foster innovation, drive growth, and facilitate the realization of Larissa’s vision for decentralized solutions. Through strategic utilization of these funds, Larissa endeavors to remain at the forefront of blockchain technology, delivering impactful solutions that empower its community and advance the broader adoption of decentralized technologies.V- Development Wallet:\nThe Development Wallet plays a crucial role in advancing Larissa’s mining infrastructure and bolstering its presence within the crypto mining sector. With 35% allocation from the LRSNode DAO wallet, this fund is primarily dedicated to the acquisition of ASIC miners, which will be deployed to mine LRS on Larissa’s official mining pool. The mined LRS tokens, along with a portion of the mining rewards, will be directed back into the LRSNode DAO wallet, ensuring a continuous cycle of investment and growth. Additionally, the Development Wallet covers essential operational expenses such as electricity, farm rent, and other mining-related costs, ensuring seamless operations and sustainable growth of Larissa’s mining ecosystem.VI- Top Exchanges Listing:\nThe Top Exchanges Listing initiative within the LRSNode DAO allocates 22% of the wallet’s resources to facilitate listings on prominent exchanges and provide liquidity for decentralized exchanges (DEX). Currently, our focus is on key exchanges such as DEX platforms Uniswap and Pancakeswap, requiring 2.5 ETH and 16 BNB, respectively, for listing the LRS/ETH and LRS/BNB pairs. For centralized exchanges (CEX), we aim for listings on platforms like MEXC, XT.com, Kucoin, OKX, and Bybit, primarily targeting LRS/USDT pairs. Once successfully listed on these exchanges, the allocated funds will be replenished back into the LRSNode DAO wallet, ensuring sustained growth and liquidity provision for Larissa’s ecosystem.The LRSN token serves as the native ERC20 token within the Larissa blockchain ecosystem, primarily designed to sustain the LRSNODE platform. Its primary function lies in rewarding node operators based on their node’s uptime, incentivizing participation in the network. Additionally, LRSNODE members can stake their LRSN tokens to earn supplementary rewards. Looking ahead, LRSN is poised to play a pivotal role in various Larissa ecosystem applications, including the Larissa gaming portal and SILO decentralized storage system. With a total supply of 100 million LRSN tokens, the tokenomics are structured to ensure equitable distribution and sustainable growth. Key allocations include 50% for LRSNODE DAO (Node Rewards), 30% for the mining contract, 10% for the team and advisors (with a lock-up period), and smaller portions for marketing, community development, airdrops, and staking rewards, ensuring a balanced and robust ecosystem.LRSN Tokenomics: Total supply: 100 million LRSN tokensToken distribution:\n• LRSNODE DAO (Node Rewards): 50% (Will be locked in LRSNode DAO Contract) — NodeRewardHolder\n• Mining contract: 30% (Will be locked on Mining Contract)- MiningRewardHolder\n• Team and advisors: 10% (will be locked for first 6 months, after 6 months 10% will be released every month)- TeamTokenLocker\n• Marketing and community development: 5% — LRSN Marketing\n• Airdrops: 2% — AirdropFundHolder\n• LRSN staking rewards: 3% — StakingFundHolderLRSNode presents the plug-and-play LRSNode device, a catalyst for enhancing Larissa network decentralization. Equipped with LRSNode’s proprietary software, this device incentivizes node operators through monthly LRSN rewards correlated with node uptime. Key features include optimal specifications for seamless performance, effortless setup, compact design, secure connectivity, and the opportunity to contribute to Larissa’s growth while earning LRSN rewards.The LRSNode Launcher software, pre-installed on the plug-and-play node, facilitates swift setup and operation, boasting user-friendly features tailored for node management and additional rewards. It will be accessible on Windows and Android platforms.The reward system within LRSNode is meticulously structured to mitigate the risk of inflation concerning LRSN Tokens and alleviate potential sell pressures. Rewards per block are equally distributed among active nodes, thereby ensuring a fair and balanced distribution mechanism. For instance, if there are 10 active LRSNode participants, they would fall under a specific reward slab, such as slab 1. Consequently, each node would receive a proportional share of the rewards, with 0.002 LRS allocated per block equally among the participating nodes. This approach not only fosters a sense of equity among node operators but also contributes to the overall stability and sustainability of the LRSN ecosystem.To check the LRSNode Reward Slab visit — https://docs.larissa.network/lrsnode/lrsnode-reward-slab","creation_date":"2024-03-15","tags":["Blockchain","Ethash","Pow","Smart Contract Blockchain","Lrs"],"author":"Larissa Network","category":null}