{"id":"96fd526f-460b-4bef-b378-8172776a942c","article_link":"https://cointelegraph.com/news/hong-kong-bitcoin-ether-etfs-attract-200m-day1","website_source":"Cointelegraph","article_type":"News Article","summary":"The amount of assets under management remains muted compared to the billions of dollars attracted by U.S. spot Bitcoin ETFs in January.","title":"Hong Kong Bitcoin, Ether ETFs attract over $200M on day 1","detailed_content":"Hong Kong spot Bitcoin and Ether exchange-traded funds (ETFs) have attracted more than $200 million in total assets on their April 30 debut.\nAccording to data provided by Arkham Intelligence, the Bosera HashKey spot Bitcoin and Ether ETFs have accumulated 964 Bitcoin\nBTC\n$63,041\nand 4,290 Ether\nETH\n$3,032\n, respectively, totaling $71.94 million in assets under management. Meanwhile, Eric Balchunas, senior ETF analyst at Bloomberg, revealed that spot Bitcoin and Ether ETFs created by ChinaAMC have amassed $123.61 million in combined assets. \nBosera’s crypto ETF assets under management. Source: Arkham Intelligence\nAt the time of publication, the Hong Kong Stock Exchange has not updated the asset management data for the spot Bitcoin and Ether ETFs of Harvest Global, the third ETF issuer. However, the combined turnover for these two ETFs has reached $23 million.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe value of the assets solicited pales in comparison to their United States counterparts, where spot Bitcoin ETFs attracted nearly $4 billion in assets under management during their first week of debut and $4.5 billion in volume on Jan. 12 alone, the first day of trading on Wall Street. \n“We tried to warn everyone to lower expectations re[garding] HK,” commented Balchunas. \"That said, if you localize numbers, this was BIG: e.g., ChinaAMC bitcoin ETF took in $123m on Day One, which already ranks it 6th of 82 ETFs launched in past 3yrs in HK and Top 20% overall,” he added. \nMeanwhile, HashKey wrote that “importantly, non-Hong Kong nationals can also subscribe for or purchase units in the ETFs if they meet local regulatory requirements, such as passing customer due diligence.” In addition, Hong Kong crypto ETFs allow investors to subscribe for ETF units directly using BTC and ETH, and vice versa, which is not available for their U.S. counterparts. \nAccording to an April 28 survey conducted by Hong Kong-regulated crypto exchange OSL, 76.9% of crypto-knowledgeable respondents in the city plan to invest in the novel spot Bitcoin and Ether ETFs. “This positive investor sentiment powerfully points to the growing acceptance and importance of digital assets in the region’s economy, and Hong Kong is once again marking its place as the digital asset hub,” commented OSL’s executive director and head of regulatory affairs, Gary Tiu. \nDespite the enthusiasm, Hong Kong’s crypto ETFs remain accessible only to the city’s estimated 6.4 million adult residents. Mainland Chinese investors, whose numbers are north of 1 billion, are currently barred from accessing the novel ETFs unless they possess a Hong Kong residence permit. \nRelated: Hong Kong officials recommend city’s crypto industry self-regulate\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-01","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Hong Kong","#Ethereum"],"author":"by Zhiyuan Sun","category":null}