{"id":"9755d272-c25e-467f-bee0-254018c372f6","article_link":"https://cointelegraph.com/news/blockdaemon-uae-abu-dhabi-expansion","website_source":"Cointelegraph","article_type":"News Article","summary":"Blockdaemon gets the go-ahead for further expansion in the UAE with a new office in Abu Dhabi to boost web3 growth and push for institutional-grade adoption.","title":"Blockdaemon gets greenlight for UAE expansion in Abu Dhabi","detailed_content":"Blockchain infrastructure firm Blockdaemon revealed that it will be expanding its presence in the United Arab Emirates with a new office and entity in Abu Dhabi. \nThe company revealed that its expansion plans were greenlit under the local Registration Authority of Abu Dhabi Global Market (ADGM) in an announcement shared with Cointelegraph on May. 13.\nPart of the expansion plans are to operate and provide Web3 infrastructure solutions locally in the UAE. This will also entail making its node and validator infrastructure solutions available in the region, along with its self-hosted MPC wallet technology.\nAmor Sexton, the chief operating officer of Blockdaemon, said the move is a “significant stride” for the company blistering its presence in the UAE region.\nSexton told Cointelegraph that he sees the expansion as a \"strategic alignment\" with the region's dynamic growth. \nIt demonstrates our commitment to actively engage in and advance the Web3 revolution throughout the UAE and the broader MENA region.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe chief of market development at ADGM, Arvind Ramamurthy, echoed the sentiment, saying they are trying to create an environment” conducive to the growth and success” of Web3 companies:\n“The decision of a prominent institutional-grade blockchain infrastructure company to expand in this region with ADGM underscores the progressive regulatory environment offered by our international financial center.\"\nRamamurthy said they are anticipating what opportunities such approvals can “unlock” within the region. Blockdaemon focuses on developing institutional-grade infrastructure for blockchain protocols, crypto native and traditional financial institutions. \nCointelegraph reached out to Blockaemon for additional information on its expansion.\nRelated: EU crypto regulations undermined by lack of enforcement, say observers\nThis move follows Blockaemon’s gradual efforts to expand its presence in particular regions. In February 2022 it expanded into the Asia-Pacific region, and a month later in March made its first move into the EMEA region.\nIn September 2021, Blockdaemon secured the status of “unicorn” with a $155 million raise, which increased its total valuation to around $1.255 billion at the time.\nAt the recent TOKEN 2049 event in April in Dubai, Blockdaemon’s senior manager of growth strategy Barnaby Hodgkins told Cointelegraph that institutional adoption in the blockchain and crypto industries is at its highest point currently.\nThough there is still room for growth, saying that although it may be at its highest it still doesn’t mean that there is “loads.”\nOn May 5, Blockdaemon became one of eight companies to commit to using the Stacks software - which is one of the leading Bitcoin layer-2 networks with smart contract functionality.\nMagazine: SEC, Ripple case nears conclusion, Grayscale withdraws ETF filing, and more: Hodler’s Digest, May 5-11\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-13","tags":["#Blockchain","#UAE","#Business","#Web3"],"author":"by Savannah Fortis","category":null}