{"id":"981265c2-8ac2-46d7-b9af-a611aadfc627","article_link":"https://cointelegraph.com/news/woo-x-exchange-first-tokenized-t-bills","website_source":"Cointelegraph","article_type":"News Article","summary":"The real-world assets sector continues generating interest as the second most profitable crypto narrative in the first quarter of 2024.","title":"Woo X exchange launches world’s first tokenized T-bills for retail","detailed_content":"Woo X cryptocurrency exchange has launched tokenized United States Treasury Bills (T-Bills), claiming to be the first protocol to offer tokenized T-Bills for retail investors.\nWoo X launched its real-world–asset (RWA) tokenization vaults, RWA Earn Vaults, enabling users to earn yield by holding Circle’s USD Coin\nUSDC\n$1.00\n, according to an April 22 X post:\n“With the RWA Earn Vaults, all @WOO_X users can now earn stable, predictable yield on their USDC holdings backed by U.S. Treasury Bills without having to jump through any extra hoops.”\nBacked solely by U.S. T-bills, RWA Earn Vaults offer between 4.5% and 4.7% annual percentage rate (APR) to USDC holders. According to the announcement:\n“User subscriptions accumulate real yields, fully backed by U.S. Treasury Bills, with current APRs for 7-day and 28-day terms at ~4.5% and ~4.75% respectively.”\nRelated: Hashing It Out: Are RWAs the future of crypto?\nThe yield-earning product was launched in partnership with OpenTrade, a London-headquartered tokenization platform backed by Circle.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nCircle is the issuer of the world’s second-largest stablecoin, USDC, which has a $34 billion market cap, behind Tether’s\nUSDT\n$1.00\nwith an over $109 billion market capitalization, according to CoinMarketCap data.\nRelated: USDT aims to offer a lifeline to inflation-stricken nations: Tether CEO\nRWAs were the second most profitable crypto narrative in Q1 2024\nRWAs were the second most profitable narrative in the crypto space during the first quarter of 2024, according to a recent report by CoinGecko.  CoinGecko analyst Lim Yu Qian said:\n“The memecoin narrative was 4.6 times more profitable than the next best-performing crypto narrative of tokenized real-world assets (RWA) and 33.3 times more profitable than the layer 2 narratives with the lowest returns in Q1 this year.”\nShowcasing the growing institutional interest in the RWA sector, the world’s largest asset manager, BlackRock, launched a USD Institutional Digital Liquidity Fund on March 20, tickered “BUIDL,” worth over $298 million at the time of writing, according to Etherscan.\nOver $1 billion worth of U.S. Treasurys have been tokenized through 17 tokenization products by March 28, which rose to $1.15 billion by April 22, according to Dune data.\nTokenized government securities. Source: Dune\nFranklin Templeton’s Franklin OnChain U.S. Government Money Fund (FOBXX) remains the largest treasury tokenization fund, worth over $390 million at the time of writing, according to Dune.\nHow tokenization will transform traditional finance | Interview with FTX US president Brett Harrison. Source: Cointelegraph\nRelated: EigenLayer on the brink of potential yield crisis\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-22","tags":["#Blockchain","#Circle","#Ethereum","#Cryptocurrency Exchange","#DeFi"],"author":"by Zoltan Vardai","category":null}