{"id":"98af4e06-eb4a-4854-86a6-1fafc3201eb7","article_link":"https://cointelegraph.com/news/tik-tok-parent-company-explores-on-chain-web3-gaming-ai","website_source":"Cointelegraph","article_type":"News Article","summary":"BytePlus is partnering with Mysten Labs to integrate SocialFi projects and data warehousing technology into the Sui blockchain ecosystem.","title":"TikTok parent company explores on-chain possibilities for Web3 gaming","detailed_content":"BytePlus — the enterprise technology arm of ByteDance, TikTok’s parent company — has announced a move into Web3 through a strategic partnership with Mysten Labs, the developers behind the Sui layer-1 blockchain. \nIn a statement on April 17, BytePlus explained how it plans to use its existing knowledge and experience in data warehousing to empower the Sui ecosystem, with a particular focus on Web3 gaming and SocialFi projects.\nThe partnership will see BytePlus integrate its cutting-edge solutions, including ByteHouse — a cloud-native data warehouse — with Sui’s full-node data.\nAccording to the announcement, a BytePlus integration could potentially boost Sui’s analytics capabilities by enabling infinite scalability and real-time data processing.\nMysten Labs will benefit from the high-performance, low-maintenance nature of ByteHouse, which could ultimately accelerate data delivery for users on the Sui network.\nEvan Cheng, the co-founder and CEO of Mysten Labs, said the partnership could “revolutionize” data analytics in the Web3 sphere.\n\"Integrating cutting-edge content recommendation and generation solutions into Sui signifies a leap toward enhancing user experience within Web3 game platforms and SocialFi projects.”\nLi Long, the general manager MEA of BytePlusAs, told Cointelegraph that the move comes after observing trends of the rise of new social and gaming platforms built on blockchain and web3. He said their aim is to \"elevate the web3 social experience, build close knit communities and more immersive engagements.\" \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: Can blockchain revolutionize digital securities management for stock exchanges?\nThis is not the first instance of ByteDance exploring Web3 technology. In 2019, it was reported that the company launched a joint venture with a state-owned Chinese media group to develop business arms directed at blockchain and AI.\nIn June 2020, ByteDance sought out a virtual banking license in Singapore in an effort to enter the digital finance scene.\nSui, on the other hand, is a newer layer-1 network introduced by Mysten Labs in March 2022. However, development in the ecosystem has greatly accelerated over the last few months with new partnerships.\nIn February, the Sui Foundation partnered with a university in the United Arab Emirates to launch a blockchain academy. A month later, it was revealed that the Greek stock exchange, ATHEX, would deploy its new fundraising mechanism via the Sui blockchain ecosystem.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Adoption","#Web3","#Gaming"],"author":"by Savannah Fortis","category":null}