{"id":"98f9a5a1-2b68-4874-9354-381940e31ad9","article_link":"https://medium.com/@gilescrouch/the-internet-is-still-wide-open-46726a9692d0","website_source":"Medium","article_type":"Blog Post","summary":"The internet is far more open and creative than is often portrayed. It’s overflowing in fact and that’s wonderful. Here’s why.","title":"The Internet Is Still Wide Open","detailed_content":"N\nearly 2 million years ago, we figured out how to turn a boring old lump of rock into a tool. Quite an astonishing feat of brain power. As a result, rather than tearing off meat with our hands we could slice up some very nice t-bone steaks. We somehow also knew cooked meat was not just tastier, but better for us.We also figured out that the more of our kind we shared this information with, the better our chances for survival. Our distant ancestors knew there was safety in numbers. So we evolved methods of communication; language, cave drawings. Arriving to where we are today with the single biggest, most complex communication technology we’ve ever built; the internet.Some will say that the original idea of the internet, to be a free, wide open space for ideas and innovations has gone the way of the DoDo bird. Extinct. Not really.What has changed is the evolution of the internet. It was largely open and wild, the domain of the hippies who grew tired of communes and a lack of proper showers and came back closer to the urban core of San Francisco and started playing with computers.All the communications technologies we create evolve. Just like us.Even thousands of years ago, we created moving images on cave walls. Using some form of dyes and flickering flames. Think YouTube and TikTok is cool? Yep, they are. But neither would be here today without our ancestors, thousands of years ago, who used pigments and torch flames to create the first TikTok or YouTube videos of what we see today.When the printing press arrived on the scene around 500 years ago, it was a similar wild west. Creative entrepreneurs set up simple presses in their own shops. An entire ecosystem grew up around printing presses for ink, press manufacturing, tools, typefaces. The same happened with the internet; laptops, tablets, smartphones and of course, software.Humans are inherently social and innovative animals. We invented communications technologies because it made it easier to share ideas, to find common ground in our varied realities. The better our communications tools, the more organised we became, the more we could evolve as a species and evolve our technologies.As each communication technology evolved, so did our societies and how we managed communication/information. For many years, radio stations were a disorganized mish-mash, especially in the United States. Regulations came along fairly quickly and societal norms were imposed. Radio stations formed networks and became in effect, walled gardens.The same happened with the printing press and television networks. Telephone networks became huge and conglomerates formed, leading in some places, to monopolies. Hence the break-up of AT&T in America.Today we talk how the internet has become a place of walled gardens with Tech Giants thundering over the digital landscape keeping any trespassers at bay. Fortunately, that’s mostly a fairy tale. Yes, there are walled gardens and the giants will, at times, let you play in someone elses sandbox. For a fee. Usually your personal data.But the internet is still a very creative place. It is more wild west than not. If we think of the internet in terms of a map comparable to the real world, we might say that the Tech Giants have built glittering cities in parts of the world. WeChat is like Beijing. Facebook and Google are San Francisco and New York. Snap is Toronto. Between these shimmering cities remain untamed, vast open spaces.These wild spaces are where ideas are constantly sparking into life, like sprites in a forest. Sometimes they are created in rigid spaces in the cities of the giants. More often, they are born on the edges, in the wilds. In decentralized spaces, the fediverse. By humans of all walks of life, from all cultures and societies.Some call parts of these wild spaces the Dark Web, where bandits lurk, like the bandits of old that preyed on traveling caravans along trade routes. Yes, there are nefarious denizens of the Dark Web. But there are lots of good people in those haunts. Creating, ideating. Imagining new futures.There are many open spaces where code and ideas get generated. Blockchain, the concept of decentralisation and crypto that leverages blockchain and other technologies.These are far more than just technologies. They are arguments, debates and social statements to begin with. They are created by people who imagine a different world, a new or more innovative way of doing things.There are far more interesting, exciting and innovative ideas being generated because of the internet than there are nefarious, nasty things. If one steps back from tech industry news, explores online communities not just on sites like Reddit, but fediverse sites like Mastodon and others, they are like percolating coffee pots of ideas.Some of those ideas will evolve and spill over into society and become new businesses and services. Cultures will explore them and decide if they want them and if they do, how they want to adapt them to make them work.But to claim that the internet has become completely corporatized is to miss the conversations taking place, the bubbling of ideas and the ones turning into something new and meaningful.","creation_date":"2023-07-31","tags":[],"author":"Giles Crouch | Digital Anthropologist","category":null}