{"id":"9b37f85e-1d39-434d-9bdf-a54ad8f485ae","article_link":"https://cointelegraph.com/news/shiba-inu-memecoin-raises-12-million-institutional-investors","website_source":"Cointelegraph","article_type":"News Article","summary":"The funds will be used to build Shiba’s novel privacy layer, Treat.","title":"Shiba Inu memecoin raises $12M from institutional investors","detailed_content":"Canine memecoin project Shiba Inu\nSHIB\n$0.000023\nhas raised $12 million from a private token sale of its not-yet-released TREAT utility and governance token.\nAccording to the April 22 announcement, investors include Comma 3 Ventures, Big Brain Holdings, Cypher Capital, Shima Capital, Hercules Ventures, Animoca Brands, Morningstar Ventures, Woodstock Fund, DWF Ventures, Polygon Ventures, Stake Capital, Illuminati Digital Capital, Primal Capital, Mechanism Capital, DWF Ventures and Spirit Dao. All investors participating in the private token sale were outside the United States.\nThe participation of venture capital firms and their partners will help the Shiba Inu project expand its network and “increase what Shiba Inu can truly be capable of for our community,” commented Shytoshi Kusama, the anonymous core developer of Shiba Inu. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nKusama has maintained a low profile this year, with user reports of his sightings in New York, Japan and the Maldives. However, Kusama claims that he is on vacation to enjoy himself “just like everyone else.” That said, the core developer resurfaced on Telegram on April 21. \"I have put my heart in soul to build this, and you are a worthless fudder who is not deserving of the breath God gave you,” wrote Kusama in response to a user’s critique. \nShiba Inu staff explained that “TREAT is the final unreleased token by the popular meme brand that will unlock Shiba Inu’s newly announced blockchain featuring Fully Homomorphic Encryption (FHE).” Two months prior, Shiba Inu partnered with Zama.ai to deploy the FHE technology, which forms the basis of the protocol’s novel privacy layer, Tre. \nThe fund will be used by Shiba Inu’s Panamian entity, Shiba Inu Mint S.A., to build the Treat platform. The project noted that possible applications of the technology include encrypted lending platforms, tokenized asset exchanges and encrypted machine learning models. \nShiba Inu has been a top-performing memecoin, with a gain of 164% over the past year. Last December, the protocol introduced .shib domains for its tokenholders. Meanwhile, Shibarium, its layer-2 scaling solution, has surpassed over 1 million users since its inception. \nRelated: Shibarium denies bridge issues, calls it FUD\nExchange or buy SHIB\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-22","tags":["#Blockchain","#Cryptocurrencies","#Venture Capital","#Adoption","#DeFi","#Shiba Inu","#Memecoin"],"author":"by Zhiyuan Sun","category":null}