{"id":"9bc01061-1926-4772-961b-a413739d9ff3","article_link":"https://cointelegraph.com/news/avalanche-home-loan-tokenization-protocol-raises-10-million","website_source":"Cointelegraph","article_type":"Tweet","summary":"“Homeowners effectively sell a portion of their home’s equity at today’s price and repay at tomorrow’s,” wrote Homium staff.","title":"Avalanche home loan tokenization protocol raises $10M in Series A","detailed_content":"Homium, a home equity line of credit (HELOC) tokenization protocol built on Avalanche, has raised $10 million in a Series A funding round led by Sorenson Impact Group and Blizzard.\n“Through shared appreciation home equity loans, Homium introduces a way for homeowners to borrow against their home equity without increasing their monthly debt burden,” wrote Avalanche in an April 15 announcement. \nBy using Homium, homeowners pledge a portion of their home’s future appreciation as collateral for loan equity in maintenance and repairs, debt consolidation or inheritance. At the same time, investors receive a tokenized asset tracking the price appreciation of a pool of shared homes on the protocol.\nThe Homium tokenization overview. Source: Homium\n“Homium is building a valuable new asset class for institutional investors, providing a new source of uncorrelated, inflation-protected return in their core portfolios,” said CEO Tommy Mercein in a statement. The first such home tokenization loans are currently available in the United States state of Colorado.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe tokenized assets are backed by second mortgage loans made to owner-occupied single-family homes. Investors of the HELOC tokens are secured to the title like any other mortgage. Homium pledges that every home is “appraised by a third party, hybrid valuation service” with nationwide loan originators. \nWhile the HELOC tokens are built on distributed ledger technology, they are not cryptocurrencies. Instead, the tokens are debt securities compliant with the United States Securities and Exchange Commission’s (SEC) Rule 144A regarding private placement to institutional investors. Regarding its technology, Homium explained:\n“Patented technology gives Homium investors a real time window into every loan in each pool including its origination value and current marked-to-market estimated value. Because Homium loans are underwritten to a uniform standard that secures a % of the underlying home equity, this allows instant securitization of the note from inception. Investors receive pooled exposure to home price appreciation by state.\"\nSince July 2023, Avalanche has pledged $50 million in investments for on-chain tokenization protocols, with a major focus on those specializing in real estate and digital collectibles. Meanwhile, financial services giant Citi recently described the tokenization market as the next “killer use case” in crypto.\nRelated: Avalanche and Chainlink collaborate on Australasian on-chain asset settlement\nExchange or buy AVAX\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-16","tags":["#Blockchain","#Cryptocurrencies","#Funding","#Venture Capital","#DeFi","#Avalanche"],"author":"by Zhiyuan Sun","category":null}