{"id":"9c4b5795-7454-40f4-b6a9-1696a12d42c2","article_link":"https://cointelegraph.com/news/indian-enforcement-directorate-seizes-enuggets-scam","website_source":"Cointelegraph","article_type":"News Article","summary":"The law enforcement agency managed to track the funds linked to the E-Nugget scam app to different crypto exchanges and, with their help, seized over $10.5 million in crypto assets.","title":"Indian enforcement agency collaborates with Binance to bust scam app","detailed_content":"The Enforcement Directorate (ED) — an Indian law enforcement agency — seized 90 crores ($10.5 million) from an online scam app called E-Nuggets with the help of crypto exchanges such as Binance, ZebPay and WazirX.\nAccording to a report published by the Hindu, the online gaming app E-Nugget had cryptocurrencies worth $10 million stored in 70 different crypto wallet accounts spread across the three crypto exchanges.\nThe ED contacted these exchanges to block the wallet addresses and transfer the crypto assets to the agency’s wallet.\nSource: Enforcement Directorate \nIn its report, the ED alleged that the E-Nugget app purportedly offered customers large returns on investment while disguising itself as a gaming platform.\nThe app presented a lucrative investment opportunity with several alluring real-money games that offered large commissions and were designed for users to wager on. However, as soon as money was invested, the app went dark, leaving investors stuck and unable to get their money back.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: Australia’s top exchange may approve spot Bitcoin ETFs this year: Report\nThe agency has attached and seized properties valued at over 163 crores ($19.5 million), including cash, cryptocurrency, account balances and office space.\nThe scam app first came under the radar in 2022 when some of the funds from the company were invested in digital assets. The ED investigation found 2,500 dummy bank accounts 19 crores ($2.2 million) worth of cash was found.\nThe suspected scheme mastermind, Aamir Khan, was arrested along with his accomplice Romen Agarwal and is currently in custody.\nSince the money was being transferred using digital assets, the law enforcement agencies managed to trace it and subsequently freeze and seize it.\nAlthough critics often try to point toward the use of cryptocurrency for money laundering, the nature of the blockchain makes it very difficult to launder the funds once identified. In numerous instances, crypto exchanges have traced and frozen funds linked to criminal activities.\nThe most prominent example of transparency and why it is difficult to launder funds using digital assets dates back to the 2016 Bitfinex hack.\nHackers managed to steal 119,756 Bitcoin\nBTC\n$63,046\nfrom the crypto exchange. However, the perpetrators behind the exploit were eventually caught and arrested in 2022 while trying to launder the funds.\nCointelegraph reached out to Binance and ZebPay for comments but had not received a response by the time of publication.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-02","tags":["#Blockchain","#India","#Binance","#Regulation"],"author":"by Prashant Jha","category":null}