{"id":"9dc18deb-1bda-496f-8e6b-b3fddc7727e5","article_link":"https://cointelegraph.com/news/upbit-suspends-crypto-transactions-1-million-won","website_source":"Cointelegraph","article_type":"Tweet","summary":"The suspension of Ten&Ten’s Travel Rule Solution service led to Upbit halting deposits and withdrawals exceeding the equivalent of $721.","title":"Upbit suspends crypto transactions exceeding 1 million won","detailed_content":"Upbit — one of South Korea’s largest crypto exchanges — will suspend deposits and withdrawals of digital assets of more than 1 million Korean won ($721).\nThe move comes in response to changes to the virtual asset service provider (VASP) Ten&Ten, one of the local facilitators of deposits and withdrawals.\nIn an April 17 announcement, Upbit said the suspension of use and termination of Ten&Ten’s Travel Rule Solution service is the reason behind its decision to halt deposits and withdrawals.\nThe Ten&Ten exchange services stopped transaction support on April 15, and the last date to withdraw crypto assets is April 22 at 10:00 am Korea Standard Time.\nTen&Ten helped the crypto exchange offer crypto deposits and withdrawals of over 1 million won. Other VASPs that allow deposits and withdrawals over 1 million won include Bblock, Gopax, FlatExchange, Aprobit, Prabang, Borabit, BTX, Flybit, Foblegate, Bithumb, Coinone, Korbit, Coredocs, GDAC, Hanbitco, Qbit, Korea Digital Asset Trust and Oasis Exchange.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nIn a report released on April 10, the European Union named Upbit second in market share after Binance, with approximately 528.57 billion in trading volume.\nIn the first quarter of 2024, the South Korean won surpassed the United States dollar in crypto trading volume. According to Kaiko data, transactions in Korean won on centralized exchanges totaled over $456 billion, slightly exceeding the U.S. dollar's cumulative volume of around $455 billion.\nRelated: South Korean police catch $4.1M crypto scam duo\nCurrently, South Korean financial authorities plan to release new guidelines imposing tighter regulations for token listings on centralized crypto exchanges by the end of April or, at the latest, early May.\nAuthorities will also prohibit listing digital assets with hacking incidents on domestic exchanges unless the root cause is thoroughly determined.\nThe 24-hour trading volume at Upbit fell to $3.8 billion at the start of April after reaching a high earlier in March. On March 5, Upbit recorded a daily trading volume of almost $15 billion, the exchange’s highest trading volume of 2024 so far.\nThe crypto exchange’s surge in daily trading volume may be attributed to Bitcoin reaching a new all-time high of $69,200 on the same day.\nHong Kong’s financial regulator has reportedly approved three spot Bitcoin\nBTC\n$62,974\nexchange-traded funds, which are expected to list on the Hong Kong Stock Exchange in approximately two weeks.\nMagazine: ETH price nears 3-year lows vs. Bitcoin — Will an Ethereum ETF stem the tide?\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Cryptocurrencies","#Business","#South Korea","#Cryptocurrency Exchange","#Upbit"],"author":"by Amaka Nwaokocha","category":null}