{"id":"9dd6086d-ab29-42d8-a124-5a00a69addbc","article_link":"https://cointelegraph.com/news/nigeria-faith-crypto-friendly-regulator","website_source":"Cointelegraph","article_type":"Tweet","summary":"Nigeria’s president appointed the new SEC Chair to regulate the capital market, bolster investor confidence, and advance economic development.","title":"Nigeria puts faith in new crypto-friendly regulator","detailed_content":"Nigeria’s blockchain stakeholders have expressed hope and confidence in the newly appointed Director-General of the Securities and Exchange Commission (SEC). The new SEC Chair’s pro-crypto background is seen as an added advantage for the local crypto industry. \nNigerian President Bola Ahmed Tinubu has appointed Emomotimi Agama, the former managing director of the Nigerian Capital Market Institute (NCMI), as the new chair of the SEC.\nThis appointment aims to regulate the capital market, enhance investor confidence, and promote economic development.\nIn interviews with Cointelegraph, local crypto stakeholders shared their opinions about the new appointment.\nNathaniel Luz, CEO of Flincap — an over-the-counter crypto exchange — expressed his excitement about the appointment, saying that the Director-General’s favorable views on crypto will likely bring positive changes to the crypto sector.\nLuz said that the community is looking forward to the new chair working together with startups to streamline their licensing process for operating crypto platforms in Nigeria.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nWith the government issuing licenses for crypto organizations this year, Luz believes assisting numerous crypto startups in obtaining these licenses will ensure compliance and operational stability for exchanges in the country.\nRelated: Nigeria’s central bank forced to deny claims of crypto account freeze\nSimilarly, Lucky Uwakwe, chair of the Blockchain Industry Coordinating Committee of Nigeria (BICCoN) and founder of SaBi Exchange, described the appointment as a “wise decision,” considering the new Director-General’s wealth of experience in blockchain and the capital market.\nAccording to Luz, the new leader needs to clearly state that cryptocurrency is not prohibited in Nigeria. Given recent developments and uncertainties surrounding cryptocurrency regulations in the country, stakeholders are seeking a clear declaration from the leadership to confirm the legality of crypto activities. Luz said:\n“We expect that his administration will separate the baby from the bath water and show that the crypto industry has several exciting benefits for the country. We need to prove to the whole world that we are open for crypto business despite the issues that some exchanges might have experienced in the country.”\nIn February, the Nigerian government used the country’s telecommunication providers to prevent local crypto users from accessing the websites of various crypto exchanges, such as Binance, OctaFX and others.\nAuthorities then accused Binance of illegally moving $26 billion out of the country and invited the firm to send representatives to discuss the issue.\nTwo Binance staff were subsequently detained and charged with five counts related to money laundering after meeting with Nigerian officials.\nOne of them, Nadeem Anjarwalla, escaped custody and was tracked down in Kenya, where he faces extradition.\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-25","tags":["#Blockchain","#Cryptocurrencies","#Government","#Nigeria","#SEC"],"author":"by Amaka Nwaokocha","category":null}