{"id":"9e8b5d28-8fe9-4675-a32f-ec9767e6a545","article_link":"https://cointelegraph.com/news/crypto-game-notcoin-30-million-users-founder-interview","website_source":"Cointelegraph","article_type":"News Article","summary":"Notcoin co-creator Sasha Plotvinov said the goal was to bridge the gap between Telegram users and crypto.","title":"Here’s how crypto game Notcoin onboarded over 30M users — founder","detailed_content":"The viral clicker game Notcoin “just solved the issue” of bringing Telegram users into crypto, according to Sasha Plotvinov, founder of Open Builders, the team behind the game. \nIn January, the crypto game broke records by having 20 million sign-ups within 26 days of its release. Compared to another popular blockchain-based game called Axie Infinity, which had 2.78 million monthly active users at its peak in 2022, Notcoin showed that it’s possible to onboard millions of users into crypto through gaming.\nReporter Ezra Reguerra with Notcoin’s Sasha Plotvinov at the Token2049 event. Source: Cointelegraph\nIn a Cointelegraph interview at the Token2049 event, Plotvinov shared the story behind the game, which hit about 30 million users in March. The executive said the original goal was to just introduce crypto to users of the Telegram messaging app. He explained:\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“It just solved the issue. Or maybe, the task that we all had on how to bring users from Telegram to crypto. So basically, that was the original goal.”\nThe executive explained that his team spent years looking at Telegram’s massive user base and the TON blockchain, which had “almost zero action but had really good technology.”\nAfter going through the process, the team decided to go with the approach of simplifying the start of the onboarding process. Plotvinov explained:\n“At some point you just, you know, come to the idea. All right. So we just need to remove all the roadblocks for the beginning. Then, we need to give something to users so they have the motivation to go for all this Web3.”\nThe Notcoin co-creator said it became a very “social thing,” with interactions, competitions, leaderboards and squads. “It’s very, very important for such a game. And within Telegram, it’s really easy to basically onboard users, invite users,” he added.\nRelated: New Telegram mini-apps will be so convenient users won’t know it’s crypto\nPlotvinov said this was how the game became a social phenomenon, explaining that 53,000 communities competed with each other in an attempt to climb to the highest league.\nThe executive also explained that the team did not have a marketing budget. Everything happened “organically,” he explained, adding:\n“94% of Notcoiners came from referrals. People invited other people. We call them friends. You have friends, you just invite them and you play together, and you can see how they’re progressing.”\nPlotvinov also explained that the Notcoin project moved on from the common approach where projects attempted to convince users that it had value. “We just decided, all right, so why not reverse it and think more like ‘we’re not trying to convince you, it’s probably nothing,’ you know?”\nMagazine: Web3 Gamer: Gods Unchained app drops crypto, Kings of Fighters Arena review\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-20","tags":["#Blockchain","#Altcoin","#Telegram","#Games","#Gaming"],"author":"by Ezra Reguerra","category":null}