{"id":"9ebbf47d-2522-48de-9d5f-74cc0771c783","article_link":"https://medium.com/meld-gold/gp12-meld-gold-x-algorand-targeted-defi-rewards-tdr-distribution-plan-5fa14463b9d6","website_source":"Medium","article_type":"Blog Post","summary":"Plan Summary What is the program goal? 1. Increase liquidity. 2. Retain current liquidity. 3. Maintain Utility.","title":"GP12 Meld Gold x Algorand Targeted DeFi Rewards (TDR) Distribution Plan","detailed_content":"Plan Summary\nWhat is the program goal?\n1. Increase liquidity.\n2. Retain current liquidity.\n3. Maintain Utility.As Meld Gold falls under the bridge category (bridging RWAs in this case), all rewards must be distributed via trading platforms: Pact, C3, Tinyman, Humble, and AlgoRai. We are working with all four protocols on co-incentive plans and other ways to co-market to increase the program’s effectiveness.\nWe also work with platforms such as Algomint, Folks Finance, AlgoRai, Pact.fi, Tinyman & Compx on co-incentivising specific trading pairs and other collaborating strategies.Allocation*\nAmount: 145,238 ALGO.What will be incentivised & where (in $ALGO)?\nFolks Finance Lending Pools (~72%)\nPact:\n15.68% — $fUSDC <> $fGOLD$\n15.49% — $fUSDC <> $fSILVER$\n6.89%— $fALGO <> $fGOLD$\n6.89% — $fALGO <> $fSILVER$\nTinyman:\n13.76% — $fALGO <> $fGOLD$\n13.76% — $fALGO <> $fSILVER$Standard Pools (~21%)\nPact:\n6.89%— $xUSD <> $GOLD$\n6.89% — $xUSD <> $SILVER\n3.44% — $goUSD <> $GOLD$\n3.44% — $goUSD <> $SILVER$AlgoRai:\n6.89% — $GOLD$Rewards will be distributed via: Wallet Address*All numbers are approximated and will be updated, and figures are finalized and accounting for community feedback received.What is Meld Gold?\nMeld Gold sets the standard for the digitisation of Real World Assets, launching an ‘industry gold token’ empowered by a marketplace of physically decentralised gold suppliers, global brands, and a network of specialist partners. Utilising the Algorand Blockchain Gold can be traded 24 hours a day, in seconds for a fraction of a cent.","creation_date":null,"tags":["Algorand","Algorand Foundation","Defi","Rwa","Blockchain"],"author":"Michael Cotton","category":null}