{"id":"9f4f21d5-6ecc-4003-8360-9cf2bc52e3c5","article_link":"https://medium.com/aptoslabs/meet-aptos-labs-new-global-advisors-david-lawee-google-and-pam-drucker-mann-conde-nast-500d48d82260","website_source":"Medium","article_type":"Blog Post","summary":"Google’s David Lawee and Condé Nast’s Pam Drucker Mann join Stanford’s Dan Boneh as Aptos Labs advisors.","title":"Introducing Aptos Labs’ powerhouse global advisors: Google’s David Lawee and Condé Nast’s Pam…","detailed_content":"Google’s David Lawee and Condé Nast’s Pam Drucker Mann join Stanford’s Dan Boneh as Aptos Labs advisors.tl;drThe Aptos Labs team (and expertise) is global and growing. Notably, a powerhouse trio of world-class advisors — Google’s David Lawee, Condé Nast’s Pam Drucker Mann, and Stanford’s Dan Boneh — have joined Aptos Labs on its journey to onboard the world to a performant, decentralized, secure and accessible Web3.Lawee, Drucker Mann and Boneh each have different areas of expertise that will help move the needle on major focus areas for Aptos Labs:In the spirit of Web3, each advisor will draw on lessons from their diverse experiences, expertise, and areas of focus to advise Aptos Labs and the broader Aptos ecosystem.“Aptos Labs is at the forefront of Web3 innovation by thinking on a scale beyond what’s currently being done in Web3 and making big ideas a reality,” said Drucker Mann. “I am a huge fan of digital fashion, art, and experiences and all the new ways that we can bring culture to people. I love that Aptos Labs is not only redefining the Web3 user experience but also building a community — creating and connecting a worldwide network of like-minded individuals across various industries.“Aptos Labs is clearly on a mission to support expanded access to financial empowerment, digital experiences, and social connectivity on a global scale,” said Lawee. “I’m looking forward to working closely with this thoughtful, tech-forward team to bring Web3 to the masses.”Aptos Labs thrives on engineering and building, fully embracing the transformative power of decentralization and blockchain to unlock new possibilities,” said CEO and Co-Founder Mo Shaikh. “Bringing David, Pam, and Dan aboard amps up our game, gives us a cutting-edge advantage as we craft the future of the global internet on Aptos.In 2023, Aptos Labs announced Dr. Boneh joined as advisor. Appointed to the National Academy of Engineering, and named Head of the Applied Cryptography Group and Co-Director of the Center for Blockchain Research at Stanford, Boneh is one of Web3’s most accomplished academics. Undoubtedly, his expertise will be invaluable to the future of Aptos Labs, and the industry as a whole.The future of Web3 is happening right now on the Aptos blockchain. This new class of advisors is already jumping in to advise on Aptos Labs projects. Stay tuned for more on what the team will accomplish together. And, as always, Let’s Move!","creation_date":null,"tags":["Aptos","Blockchain","Crypto","Technology","Web3"],"author":"Aptos Labs","category":null}