{"id":"9f6f62aa-4151-4fca-ae89-981f6102df34","article_link":"https://cointelegraph.com/news/marketvector-memecoin-index-surges-2024","website_source":"Cointelegraph","article_type":"News Article","summary":"This represents a 15x increase compared to the S&P 500’s year-to-date returns.","title":"VanEck subsidiary’s memecoin index up 137% year-to-date","detailed_content":"The MarketVector Meme Coin Index surged over 137% since the beginning of 2024 as the top memecoins continue to rise.\nMarketVector’s memecoin index has outperformed the S&P 500 index by over 15x in 2024. In contrast, the S&P only saw a 9.3% price appreciation year-to-date (YTD), according to TradingView data.\nThe memecoin index is up over 137% year-to-date and 186% over the past year, trading at $76.60 as of 8:52 am UTC.\nMarketVector Meme Coin Index, year-to-date. Source: MarketVector\nMarketVector, a subsidiary of the United States asset management giant VanEck, launched its memecoin index on Oct. 31, 2021. It includes the six largest memecoins: Dogecoin\nDOGE\n$0.15\nat a 30.7% allocation, Shiba Inu\nSHIB\n$0.000023\nat a 28.3% allocation, 14.5% Pepe\nPEPE\n$0.000009\n, 12.5% Dogwifhat (WIF), 7.14% Floki Inu (FLOKI) and 6.7% Bonk (BONK) tokens.\nThe “high risk, high return strategy” makes memecoins attractive for investors with a speculative nature and will likely keep the top coins relevant, according to Anndy Lian, intergovernmental blockchain expert and author of NFT: From Zero to Hero. Lian told Cointelegraph:\n“This creates a viral effect that can lead to rapid price increases. Many investors are attracted to the potential for quick, high returns. Memecoins are known for their volatility, which can result in substantial gains for traders who time their investments right.”\nLooking at the memecoin fund’s individual components, Pepe was the biggest gainer, rising 482% YTD, followed by Floki, up 372%, and Shiba Inu, up 112%, taking third place. Bonk was the worst performer, up over 59% YTD, but still beating the returns of the S&P 500 by over sixfold.\nTop six memecoins, YTD, Source: TradingView\nMemecoins often deliver exponential returns, even compared to some of the top cryptocurrencies. Compared to the memecoin index’s 137% appreciation, the top altcoins, excluding the 10 largest cryptocurrencies, saw their market caps only rise 24% YTD.\nAltcoin market cap excluding top 10. Source: TradingView\nTop altcoins experience weekly sell-off\nDespite the profitable yearly returns, the six largest memecoins saw a sell-off this week, raising concerns of a potential end to the memecoin season. Over the past five days, Dogwifhat fell over 15% as the biggest loser, while Pepe fell over 5% — the smallest decline among the top memecoins.\nTop memecoins, five-day chart. Source: TradingView\nSince memecoins hold no underlying utility, it’s difficult for traders and technical analysts to predict their price action, which is mainly driven by social media hype cycles for each memecoin.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nTrading volume is often used to gauge sentiment around memecoins. Weekly memecoin trading volume has been declining since early March across all blockchains, as reported by Cointelegraph.\nRelated: Trader loses 7-figure sum due to 0L Network hard fork\nExchange or buy DOGE\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Blockchain","#Dogecoin","#Cryptocurrencies","#Altcoin","#Ethereum","#DeFi","#Memecoin","#Pepe","#Floki Inu"],"author":"by Zoltan Vardai","category":null}