{"id":"9fa52411-ad21-4864-a06f-c1c0bd5e7c64","article_link":"https://medium.com/@Mande_Network/mand-token-distribution-draft-9f147be3fdb0","website_source":"Medium","article_type":"Blog Post","summary":"Game theoretical design to reward “credibility” of people on the network.","title":"MAND token distribution — (Draft).","detailed_content":"Game theoretical design to reward “credibility” of people on the network.The launch of Mande Network will begin the next epoch in on-chain credibility by keeping “people” and “trust” at the center of web3.To humanise web3 through enabling human centred DApps on Mande Network, we need to build a network of trusted users who shall become part of the network. Almost every element on Mande Network depends on a trusted set of users participating in the “DApps” on the network.Therefore, Mande Networks tokenomics— rewards users proportional to the Credibility score “CRED” they acquire which is calculated based on the “stakes” they can garner from other networks users. On Mande network “CRED” represents “Trustworthy-ness” of a user.Together vote casting users help choose the most credible users in “Proof-of-Credibility”. $MAND is rewarded to the users based on trustworthiness.$MAND Token Utility :The $MAND token, with its three-fold utility, functions within its ecosystem in the following ways:1.Staking on Governors: $MAND tokens allow holders to participate in governance decisions of the Mande RollApp(L2) by staking on governors. Governors vote on your behalf on proposals, suggest changes, or influence the strategic direction of the project. Staking on governors will lead to staking rewards akin to DPoS(Delegated Proof of Stake) chains.2. Network Gas Fees: $MAND tokens are used to pay for transaction fees within the network.3. Credibility Stacking: Users use $MAND tokens as ‘stake’ to vote on the the credibility of other users. Using credibility staking a user can increase the reputation score(CRED)of another user within the ecosystem by staking his $MAND.Mande Network RollApp(L2) will have a genesis supply of 20 Million $MAND. Allocated as per the table below.The token supply will be following an inflationary schedule to facilitate rewards for Governance staking, Credibility(CRED) staking, Ecosystem grants and Team pool.Starting with 54%, the inflation follows a halving schedule every 2 years. With an initial supply of 20 million $MAND tokens the ecosystem will reach an asymptotic maximum supply of 100 million $MAND tokens over the period of 20 years.Newly released tokens will be distributed as follows :-For every block 30% of the tokens released will form a pool to reward users proportional to their CRED on the network.Rewards will be distributed to the users by a DApp managed by the Mande foundation at https://app.mande.network/For every block 30% of the tokens released will be distributed to MAND stakers who stake on governers of the Mande RollApp. Staking on governors will lead to staking rewards akin to staking on validators on L1 chains such as Dymension.For every block 20% of the tokens released will go towards forming the ecosystem grants pool which will be given out as grants to development teams that build DApps on Mande Network. All grants will be voted via governance proposals.20% of released tokens per block are towards the core team building and managing Mande network. The team also runs the RollApp sequencer node.Most importantly, in order to maintain strong decentralisation, in a situation where the initial development team is no longer the primary development team for the network, the chain can choose to reclaim any unreleased tokens from the development team and redirect them to the community pool or towards a new set of development teams via a governance proposal.This token model is created to bootstrap the Mande Network with well-aligned incentives for key stakeholders and contributors. However, Mande Network is first and foremost project to implement Proof-of-Credibility.It will become clearer over time how the token model needs to evolve to best support the needs of the project. The Mande Labs development team already has features in development that are expected to have an impact on the optimal token model design.Thus, the token model is intended to be adapted and updated by the community over time. Such adjustments to the model can be proposed and voted on through on-chain governance.$MAND holders should feel empowered to change the token model of the chain as necessary to support their vision for the platform.","creation_date":"2022-11-04","tags":["Tokenomics","Mande","Blockchain","Cosmos","Dymension"],"author":"Mande Network","category":null}