{"id":"a1e27571-6678-457f-ab01-fdd8ddf5fd37","article_link":"https://www.wired.com/story/faruk-ozer-turkey-crypto-fraud/","website_source":"Wired","article_type":"News Article","summary":null,"title":"He Emptied an Entire Crypto Exchange Onto a Thumb Drive. Then He Disappeared","detailed_content":"FARUK FATIH ÖZER stood in front of a passport control officer at Istanbul Airport, a line of impatient travelers queuing behind him. He pulled his face mask below his chin for the security camera. Surely he was nervous. The 27-year-old had unruly black hair, a boy-band face, and a patchy beard. Normally he overcompensated for his callow features by dressing in a pressed three-piece suit. But this spring day he wore black trainers and a navy-blue sweater hastily pulled over a white polo shirt, as if he had dressed in a dash. A small backpack was slung over his right shoulder. He looked like someone who could have been going on a last-minute day trip—or someone planning to never come back. At 5:57 pm on April 20, 2021, the guard stamped his Turkish passport and Özer shuffled through the crowd to Gate C, a flash drive containing a rumored $2 billion in crypto stashed in his belongings.\nAfter Özer’s plane reached Tirana, Albania, at 9:24 that night, he checked into the Mondial, a popular 4-star business hotel in the capital’s commercial district. A couple of days later, he looked at his social media accounts. A mob was very angry with him: Customers couldn’t access their money on the exchange Thodex, where he was founder and CEO, and people were accusing him of absconding with their funds.\nÖzer posted a public letter to his company’s website and his social accounts. “I feel compelled to make this statement in order to respond urgently to these allegations,” he wrote. The accusations weren’t true, he said. Thodex—which had nearly half a million investors and $500 million in daily trade volume—was investigating what Özer claimed was a suspected cyberattack that caused “an abnormal fluctuation in the company account.” Assets would be frozen for five days while Thodex resolved the issue. This was terribly bad timing for the big business deal he said he was en route to make: selling the company, or so he had told some employees and his brother and sister before he left. All would be made right. “There will be no victims,” he promised. “I personally declare that I will return to Turkey within a few days and ensure that the facts are revealed in cooperation with judicial authorities and that I will do my best to prevent users from suffering.” Of course, there was this possibility too: He was in the midst of pulling off the biggest heist in Turkey’s history.\nPHOTOGRAPH: GETTY IMAGESBefore dawn the day after Özer posted the letter, police squads fanned out across Istanbul and public prosecutors opened an investigation. Law enforcement arrested 62 people, including Thodex employees at all levels of the company—and Özer’s older brother and sister, Güven and Serap. Interpol issued a red notice, a request for law enforcement worldwide to find and “provisionally arrest” Özer pending his extradition to Turkey. Search teams deployed across Albania, Montenegro, Kosovo, and North Macedonia. There were reported sightings of the dark-haired young man across Tirana, rumors that he had gone to a poultry farm, that an executive from the Albanian football league was sheltering him. Soon, the Albanian police arrested people accused of aiding and abetting him. But no one seemed to know exactly where Özer was.\nBackgammon cafés, where old men have been drinking tea and talking politics for centuries, buzzed with crypto gossip.\nÖzer had vanished at a particularly precarious time in crypto’s annals: In the weeks leading up to his disappearance, so-called rug pulls—when a cryptocurrency exchange or altcoin developer absconds with investors’ funds—had crypto investors around the globe flabbergasted. The CEO of Mirror Trading International, a crypto trading company based in South Africa, defrauded users of more than $1 billion, then skipped town; TurtleDex, an anonymous decentralized finance storage project on Binance, reportedly vanished with $2.4 million; another decentralized finance project, Meerkat, reportedly fleeced investors out of $31 million (of which they paid back 95 percent). Blockchain analysis firm Chainalysis ranked rug pulls as the primary scam of 2021, accounting for 37 percent of all cryptocurrency scam revenue that year, up from 1 percent the year before.\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nThodex was at the top of that roster, and nearly every major outlet from Bloomberg to Newsweek published headlines like “Turkish Crypto Exchange Goes Bust as Founder Flees Country” and “Turkish Cryptocurrency Founder Faruk Fatih Özer Seen Fleeing Country With Suspected $2 Billion From Investors.” CoinGeek called it “the biggest scam in the digital asset industry in 2021.” The New York Times’ headline read, “Possible Cryptocurrency Fraud Is Another Blow to Turkey’s Financial Stability.” In Turkey, the country I now call home, people were reeling: For years, crypto had been built up—largely by Özer but by others too—as a way out of economic volatility. Now it seemed like just another way to lose your life savings. But something felt off to me, like the whole story wasn’t being told.\nILLUSTRATION: PRINCESS HIDIRFaruk was born in February 1994, the youngest of three. He was inseparable from his brother, Güven, and sister, Serap. They grew up camping, playing video games, and cooking together. Friends always pointed out their shared sense of humor. His parents ran a print and copy shop in the city of Kocaeli, down the street from their house. They were observant Muslims who gave their children meaningful names: “trust” (Güven), “mirage” (Serap), and “the one who distinguishes between right and wrong” (Faruk).\nKocaeli is an industrial port town about 100 kilometers east of Istanbul surrounded by a checkerboard of tobacco and sugar beet fields, petrochemical plants, and paper mills. Roman emperors once lived there, and their crumbling fortress walls still wind through the landscape. After the Ottoman Empire collapsed, Kocaeli became a manufacturing boomtown, and its residents muscled the newly minted Republic of Turkey into the Industrial Revolution.\nWhen Özer was born, Turkey’s economy was in a tailspin. A fragile financial system, irresponsible borrowing, and political corruption had triggered a brief period of triple-digit inflation. The lira’s volatility threatened the savings of its entire population. So many people moved their domestic assets to foreign-currency deposits that, by the end of the year, an astonishing 50 percent of bank deposits in Turkey were in a foreign currency. The year before, that figure was just 1 percent.\nThat same month Özer was born, a charismatic orator with a sympathetic gaze and push-broom mustache began campaigning through Istanbul’s streets in a paisley kipper tie. Recep Tayyip Erdoğan railed against the secular elite who had led the country to near economic collapse. A devout Muslim, he walked the streets of his home neighborhood, Kasımpaşa, a hardscrabble district where he grew up selling simit, or sesame bread, promising reform. In an upset election, he coasted into the role of mayor of Istanbul.\nAround the same time, two Turkish business moguls launched Turkcell, the nation’s first mobile communication system. (This was a year and a half before the same technology was released in the US.) By 2003, Erdoğan was elected prime minister, kicking off a decade of unprecedented growth that foreign observers called Turkey’s “Silent Revolution.” In a turn away from his predecessors, he governed through the lens of a businessman, inaugurating a massive building boom across the country and ultimately wrangling Turkey’s rampant inflation. His pro-business rhetoric boosted the middle class and set Turkey on a path to European Union membership.\nÖzer also caught the spirit of entrepreneurship at an early age. As a teenager in the mid-aughts, he worked after-school shifts at his parents’ print shop. “Ever since I was a child, I wanted to do my own business, no matter what sector it was,” he said. At the end of his second year in high school, he decided that further study would not lead him to that dream, so he dropped out.\nBy 2013, Turkey’s gross domestic product had nearly tripled, the lira hovered just above the dollar, and the country was negotiating entry into the EU. BtcTurk, Turkey’s first crypto exchange (and reportedly the world’s fourth), was preparing to launch. Then, in May of that year, a group of activists gathered at Gezi Park in Istanbul to protest plans to redevelop it into a shopping mall with Ottoman-era architecture. They bridled not only at the loss of green space but also at the glorification of Turkey’s Islamist past in a society that called itself secular. Police brutally cracked down on the protesters, sparking a nationwide movement. Within weeks, more than 3 million people had taken part in the demonstrations, their frustration now encompassing the growing authoritarianism of Erdoğan’s government. Thousands were injured, and at least five died. Özer had just turned 19. In the following years, Erdoğan tossed a record number of journalists in jail and censored the internet, and foreign investors recoiled.Around that time, Ismail H. Polat, an expert in engineering, information tech, and new media, was the first person to cover crypto on his YouTube channel. Now a lecturer at Istanbul’s Kadir Has University, the way he tells it, crypto was about trying to be financially free. In those early days, he says, “it was not the coin, but the spirit.” (After all, bitcoin was worth only $77 at the time.) For young people who felt that Erdoğan had pulled the rug out from under them, whether they knew it explicitly or not, crypto was a new way to protest.\nAt the same time, Özer’s generation was watching as tech startups were taking off around the world. Facebook had bought Instagram for $1 billion, and that spurred entrepreneurs to begin churning out apps. A lot of them were gaming-focused; Candy Crush brought in $1.5 billion in revenue in 2013. The Özers took note.\nBy then, Turkcell had become one of the world’s largest companies. Turkey’s mobile infrastructure and smartphone adoption rate became one of the fastest growing in the world. Polat credits this as the foundation for what came next: The dream began to shift from mere employment to entrepreneurship. Güven cofounded a company called Inline Yazılım; Faruk started one called Inline Teknoloji a few years later and another called Game Bridge after that. The brothers figured out how to crank out chintzy apps—cut-and-paste washboard abs for Instagram photos (pre-vanity-filters era) and addictive gambling games. “I started to sell almost every product that I thought could make a profit on the internet,” he told me. “This is how I took my first step into business life.”\nBY 2017, 14 years into Erdoğan’s rule, Turkey’s economy had come full circle. Erdoğan’s unorthodox economic policies—repeatedly cutting interest rates—were supposed to raise investment and make Turkey less dependent on foreign powers. Instead they led the country into an economic crisis; the value of the lira hit the skids, and after a failed coup attempt in 2016 people figured it would only get worse. Just as they had 23 years earlier, citizens began searching for places to shelter their money. Voilà, 2017 was also the first year bitcoin’s value shot sky high, from $9,000 to $20,000. Global trade volume also skyrocketed from $99 million to $16 billion.\nBeing early investors in tech wasn’t something that had historically been available to the average person in Turkey. The instant millionaires and billionaires and unicorns pretty much lived elsewhere. Now, Faruk Özer saw a possibility. People in Turkey could shelter their money in what was clearly going to be the next big tech boom. But the biggest opportunity wasn’t in trading coins—it was in running a cryptocurrency exchange. Exchanges collect people’s money and, for a commission, invest it; that gives people who don’t have the time or skills to invest directly into the blockchain a pathway to crypto. Users who go through an exchange don’t even have their own digital wallets; their money is stored until they withdraw it. (Hence the industry warning: “Not your wallet, not your coins.”)","creation_date":"2024-04-02","tags":["","LONGREADS","CRYPTOCURRENCY","FRAUD","CRIME"],"author":"BY JENNA SCATENA","category":null}