{"id":"a228a6b8-4111-486f-9cf8-a70e83c12bf4","article_link":"https://cointelegraph.com/news/mastercard-blockchain-payments-startup-program","website_source":"Cointelegraph","article_type":"News Article","summary":"The program has added five startups and will trial various payment technologies ranging from blockchain to Web3.","title":"Mastercard launches ‘next generation’ of blockchain payments startup program","detailed_content":"Fintech giant Mastercard announced on May 15 that five new startups have joined its Start Path Blockchain and Digital Assets program. \nThe Start Path Blockchain and Digital Assets program is a fintech accelerator program that focuses on “exploring future use cases to scale new solutions with startups around the world.”\nJoining the program are crypto payment and card issuer Kulipa, blockchain software firm Parafin, decentralized physical infrastructure network (DePin) firm peaq, data platform Triangle and blockchain developer Venly.\nIn a press release, Mastercard highlighted that this leg of the program would focus on use cases and trials to attack specific issues:\n“Each currency format – from regulated money to bank deposits, to stablecoins and CBDCs – serves a specific purpose, and Mastercard is connecting with industry experts and fintechs to explore differentiated use cases that can help to solve real-world problems.”\nSource: Venly\nPer a press release from Mastercard, it only considers “high-potential blockchain, digital assets and Web3 startups” for the program. Those firms selected “receive the opportunity for collaboration, bespoke training and access to Mastercard’s customers and channels” during a four-month program.\nLaunched in 2014, Start Path has purportedly supported more than 400 startups in 54 countries. Through programs such as this, Mastercard has steadily risen to the forefront of the fintech and blockchain payments forum.\nAs Cointelegraph reported on May 14, Mastercard Lab partnered with Israeli fintech firm Kima to develop a “DeFi credit card.” While not made explicit, the big idea seems to be marrying decentralized finance protocols with the ability to apply for a line of credit.\nOn May 8, Mastercard announced the formation of an alliance with U.S. banking giants, including Citigroup, Visa and JP Morgan, to test distributed ledger technology for banking settlements using tokenization.\nIn April, Mastercard and 1inch unveiled a debit card with cryptocurrency-to-fiat bridge functionality, allowing cryptocurrency users to make cash withdrawals and point-of-sale payments at locations where debit cards are accepted.\nRelated: Vanguard names Bitcoin-friendly former BlackRock exec as new CEO","creation_date":"2024-05-15","tags":["#Blockchain","#Cryptocurrencies","#Business","#Mastercard","#DeFi","#Web3"],"author":"by Tristan Greene","category":null}