{"id":"a3bf4bd0-e387-4306-8714-03c21cf9be03","article_link":"https://cointelegraph.com/explained/what-is-liquid-staking-and-how-does-it-work","website_source":"Cointelegraph","article_type":"News Article","summary":"Liquid staking reduces the minimum threshold required to earn block rewards and simultaneously enables the tokenized representation of staked assets.","title":"What is liquid staking, and how does it work?","detailed_content":"Liquid staking, explained\nLiquid staking allows stakers to keep the liquidity of their staked tokens by using a stand-in token that they can use to earn additional yield through DeFi protocols.\nBefore diving into liquid staking, let’s understand staking and the problems associated with it. Staking refers to the process of locking up a cryptocurrency in a blockchain network to sustain it, and it enables the stakers to earn a profit. However, staked assets typically become illiquid during the staking period, as they can’t be exchanged or transferred.\nLiquid staking enables cryptocurrency holders to take part in staking without giving up control over their holdings. This has transformed the way users approach staking. Projects such as Lido introduced liquid staking, offering a tokenized representation of staked assets in the form of tokens and derivatives. \nIt allows users to reap the advantages of staking while also retaining the flexibility to trade, trading these tokens in decentralized finance (DeFi) applications or transferring them to other users.\nIs there a difference between delegated staking and liquid staking?\nNetwork users in delegated proof-of-take (DPoS) cast votes to select the delegate of their preference. The purpose of liquid staking, however, is to let stakers circumvent the mechanism of minimum staking threshold and locked tokens.\nThough DPoS borrows its basic concepts from proof-of-stake, its execution is different. In DPoS, network users are empowered to elect delegates, called “witnesses” or “block producers” for block validation. The number of delegates participating in the consensus process is limited and can be adjusted through voting. Network users in DPoS can pool their tokens into a staking pool and use their combined voting power to vote for the preferred delegate.\nLiquid staking, on the other hand, is designed to bring down the threshold for investing and provide a way for stakers to circumvent the mechanism of locked tokens. Blockchains often have minimum requirements for staking. Ethereum, for instance, requires anyone who wants to set up a validator node to stake 32 Ether (ETH) minimum. It also requires specific computer hardware, software, time and expertise, which again requires plenty of investment.\nWhat is staking-as-a-service?\nStaking-as-a-service is a platform that serves as a mediator, connecting a blockchain’s consensus mechanism with cryptocurrency holders who want to contribute to the functioning of the network. \nStaking-as-a-service is a platform or service that enables users to delegate their crypto assets to a third party, who then participates in staking on the users’ behalf, usually in exchange for a fee or a share of the rewards. JP Morgan notes that by 2025, the staking services sector will expand to a whopping $40 billion. Crypto staking services will play a large role in this emerging economy, and liquid staking will be an integral part of it.\nStaking-as-a-service platforms can be categorized as custodial and noncustodial based on their level of decentralization, which plays a major role in safeguarding stakeholders’ best interests and maintaining transparency. To facilitate decentralized governance, key decisions are made by a decentralized autonomous organization (DAO). \nCustodial staking-as-a-service involves extensive management of the staking process. Staking services offered by crypto exchanges are custodial. Rewards first go to the staking provider before being distributed among stakers.\nIn the noncustodial staking-as-a-service model, a validator charges a commission to anyone who wants to participate in staking. In PoS networks that support native delegation, the staker’s share of rewards is directly sent to them, with no involvement from the validator. \nHow liquid staking functions\nLiquid staking is designed to eliminate the threshold of staking and enable holders to make profits with liquid tokens.\nStaking pools allow users to consolidate several small stakes into a large one using a smart contract, which gives corresponding liquid tokens (representing their share of the pool) to each staker.\nThe mechanism eliminates the threshold of becoming a staker. Liquid staking takes it a step further and enables stakers to make double earnings. On the one hand, they earn from the staked tokens, and on the other hand, they make profits with liquid tokens by carrying out financial activities such as trading, lending or any other activity without impacting their original staked position.\nUsing Lido as a case study will help us understand better how liquid staking functions. Lido is a liquid staking solution for PoS currencies, which supports several PoS blockchains, including Ethereum, Solana, Kusama, Polkadot and Polygon. Lido provides an innovative solution to the hurdles presented by traditional PoS staking by effectively lowering barriers to entry and the costs associated with locking up one’s assets in a single protocol.\nLido is a smart contract-based staking pool. Users who deposit their assets with the platform are staked on the Lido blockchain via the protocol. Lido allows ETH holders to stake fractions of the minimum threshold (32 ETH) to earn block rewards. Upon depositing funds into Lido’s staking pool smart contract, users receive Lido Staked ETH (stETH), an ERC-20 compatible token, which is minted upon deposit and burned upon withdrawal.\nThe protocol distributes the staked ETH to validators (node operators) within the Lido network, and subsequently, it is deposited to the Ethereum Beacon Chain for validation. These funds are then safeguarded in a smart contract, which is inaccessible to validators. The ETH deposited via the Lido staking protocol is segregated into sets of 32 ETH among active node operators on the network.\nThese operators utilize a public validation key to validate transactions involving users’ staked assets. This mechanism allows users’ staked assets to be distributed across multiple validators, mitigating risks linked to single points of failure and single validator staking. \nStakers who deposit Solana’s (SOL) token, Polygon (MATIC), Polkadot (DOT) and Kusama KSM with a set of smart contracts in Lido receive stSOL, stMATIC, stDOT and stKSM, respectively. The stTokens can be used for DeFi yield earning, providing liquidity, trading on decentralized exchanges (DEX) and many other use cases.\nAre there any risks associated with liquid staking platforms?\nLike any product or service in the crypto space, technical threats and market volatility need to be taken into account when dealing with liquid staking.\nTechnical threats\nPoS blockchains are still relatively new, and there is always the possibility of protocol bugs or vulnerabilities leading to asset loss or exploitation. Reliance on validators for staking also introduces counterparty risks.\nMarket risks\nLiquid staking unlocks the staked assets, enabling stakers to earn rewards from DeFi applications. However, this also opens up the risk of losing on two fronts in a market downturn.\nKeeping a liquid staking platform open-sourced and regularly audited helps protect against threats to an extent. Having a bounty program for the platform also helps minimize bugs. \nConducting comprehensive due diligence is crucial to combat the risks associated with market volatility. This involves researching historical market data, evaluating the financial health of potential investments, understanding the regulatory landscape and developing a diversified investment strategy.","creation_date":"2024-04-27","tags":[],"author":"by Dilip Kumar Patairya","category":null}