{"id":"a5c15310-b2c4-497c-b71a-83c64630d01c","article_link":"https://cointelegraph.com/news/solana-fees-to-surpass-ethereum-trader-loses-over-1m-due-to-hard-fork-finance-redefined","website_source":"Cointelegraph","article_type":"News Article","summary":"Is Solana living up to its so-called “Ethereum-killer” status? And one trader was left over $1 million poorer due to a hard fork.","title":"Solana fees to surpass Ethereum, trader loses over $1M due to hard fork: Finance Redefined","detailed_content":"Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\nThis past week in DeFi saw Solana continue its momentum, and it could flip Ethereum in terms of transaction fees within the next week. The United Kingdom’s Financial Conduct Authority (FCA) is working to include the best parts of traditional finance (TradFi) and DeFi-related regulations to ensure a comprehensive crypto framework.\nA trader lost over a million dollars worth of crypto assets due to the 0L Network hard fork.\nThe top 100 DeFi tokens by market cap had a mixed week, with several tokens registering double-digit growth while others traded in the red on the weekly charts.\nSolana could flip Ethereum in transaction fees within a week: Report\nThe Solana network could be on track to overtake the Ethereum network in transaction fees in a potentially significant development for Solana’s status as the so-called “Ethereum killer.” Moreover, Solana’s total economic value of $2.8 million was near that of Ethereum’s total economic value of $3.1 million on May 7.\nAccording to Dan Smith, senior research analyst at Blockworks, Solana could flip Ethereum’s transaction fees as soon as this week. However, Solana’s daily transaction fees are still far from those of Ethereum. Ethereum generated over $2.75 million worth of fees in the 24 hours up to May 8, compared to Solana’s $1.49 million, according to DefiLlama data.\nContinue reading\nFCA crypto regulators will take the best from TradFi and DeFi, says exec\nWhen it comes to regulating cryptocurrencies like Bitcoin\nBTC\n$62,406\n, financial authorities in the U.K. aim to take the best of TradFi and DeFi, according to an executive at the FCA.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe cryptocurrency community and regulators have long considered the best approach to regulating the crypto market, raising concerns about over-regulating or under-regulating it. According to FCA director of payments and digital assets Matthew Long, the right way to regulate the industry is to combine different approaches and see which works best.\nContinue reading\nTrader loses seven-figure sum due to 0L Network hard fork\nAn unfortunate trader allegedly lost over $1 million of cryptocurrency due to the 0L Network hard fork. Pseudonymous trader NN lost the amount due to a hard fork that the community did not approve.\nThe pseudonymous trader said they purchased 147 million Libra tokens in February 2023, worth approximately $1.47 million at the time, before he joined the protocol to assist with marketing efforts. Libra’s value has fallen over 58% since May 3 to trade above $0.001 as of 12:35 pm UTC, according to CoinGecko data.\nContinue reading\nFirst Bitcoin-backed synthetic dollar to launch with 25% yield\nHermetica has launched the first-ever Bitcoin-backed synthetic United States dollar with yield-generating capabilities in the latest development for Bitcoin-native DeFi.\nSlated for release in June, the new synthetic dollar, USDh, will offer users yields of up to 25%, according to Hermetica’s announcement shared with Cointelegraph. The new synthetic dollar will enable Bitcoiners to hold and earn yield on their U.S. dollars without the need to trust the banking system or gain exposure to non-Bitcoin-related products, according to Jakob Schillinger, founder and CEO of Hermetica Labs.\nContinue reading\nDeFi market overview\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most trading in the red on the weekly charts. The total value locked in DeFi protocols rose above $90 billion.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-10","tags":["#Blockchain","#DeFi","#Solana","#Ethereum Price","#Regulation"],"author":"by Prashant Jha","category":null}