{"id":"a5c35031-c2bc-4d8a-bcd9-c69a3f1e42a7","article_link":"https://cointelegraph.com/news/crypto-retail-interest-low-compared-last-bull-run","website_source":"Cointelegraph","article_type":"News Article","summary":"LunarCrush CEO Joe Vezzani believes that despite the upcoming Bitcoin halving, there might not be a significant shift in retail engagement.","title":"Retail interest in crypto ‘quite low’ compared to last bull run — LunarCrush CEO","detailed_content":"While Bitcoin and other digital asset prices are increasing, retail investors are not yet “believing the hype,” according to Joe Vezzani, the CEO of social media analysis platform LunarCrush. \nVezzani said that compared to the last major bull run, social interactions and overall retail interest are “still quite low.” In the last six months, posts mentioning Bitcoin\nBTC\n$62,997\n showed bursts of activity in January and March.\nPosts created mentioning the keywords “Bitcoin” or “BTC” in the last six months. Source: LunarCrush \nThe January mentions may be due to the hype surrounding the spot Bitcoin exchange-traded funds (ETFs). On Jan. 10, the United States Securities and Exchange Commission (SEC) approved spot Bitcoin ETF applications from asset managers.\nThere was also a surge of posts in March as Bitcoin reached a new all-time high. However, the number of posts remained steady despite the Bitcoin rally to $73,737 on March 14.\nPosts created mentioning “Ethereum” or “ETH” in the last six months. Source: LunarCrush\nSocial mentions of the keywords Ethereum or\nETH\n$3,030\nremained somewhat steady in the last six months. However, the data shows that these keywords have seen a downward trend since the beginning of March.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nMeanwhile, Solana’s\nSOL\n$154\ntoken shows several bursts in the last six months, likely driven by the memecoin frenzy on the network. Despite this, social media posts mentioning Solana or SOL declined at the beginning of April.\nPosts created mentioning “Solana” or “SOL” in the last six months. Source: LunarCrush\nVezzani said that if factoring out spam and bots from the interactions, the crypto space could be experiencing a decline in social media activity. He explained:\n“In terms of the number of creators and influencers posting daily, we have witnessed growth. However, the notable change we are not observing is in the level of engagement with those creators.”\nEven with upcoming major events like the Bitcoin halving, the executive does not believe there would be a substantial shift in retail engagement. Vezzani argued that the halving “is typically perceived as more of an insider event.”\n“Bitcoin is already challenging for newcomers to grasp, and when we introduce concepts like halving, we risk alienating the public and diminishing their interest in that discourse,” he added.\nRelated: Number of new memecoin traders hits record high — IntoTheBlock\nWhen asked why it’s important to look at the social engagement data, Vezzani said that crypto markets continue to be fragmented, with new coins and exchanges emerging. Because of this, the executive believes that looking at social engagement gives traders an edge. He said:\n“Traders who leverage social media data acquire a significant edge over the rest of the market by having access to an additional critical metric that drives market movements at their disposal.”\nThe executive also argued that information on social media could shield traders from downside risks or identify promising coins that could maintain their social media presence over time.\nMagazine: Bitcoin hits new highs, SEC delays options decision, and stablecoin bill looms: Hodler’s Digest\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-10","tags":["#Blockchain","#Halving","#Bitcoin Halving","#Social Media","#Data"],"author":"by Ezra Reguerra","category":null}