{"id":"a5d00a8c-1357-47b3-aa69-dac9daea30be","article_link":"https://cointelegraph.com/news/miners-reap-bitcoin-runes-fees","website_source":"Cointelegraph","article_type":"News Article","summary":"Bitcoin miners are reaping the benefits of Runes after the halving, with skyrocketing transaction fees lessening the impact of reduced block rewards.","title":"Bitcoin Runes fees surpass 1,200 BTC as miners reap rewards post-halving","detailed_content":"Bitcoin miners have enjoyed a reprieve from the anticipated supply shock of reduced block rewards as the implementation of Runes sends transaction fees sky-high.\nTwo of the biggest mining firms operating in the United States highlighted the positive influence of Runes from both a financial and functional perspective in correspondence with Cointelegraph.\nGreg Beard, CEO of Stronghold Digital Mining, said that the first week following the halving led to an anticipated decline in mining revenue from the reduction in Bitcoin\nBTC\n$63,041\nmining rewards. However, Beard said that Runes have been a welcome reprieve from the declining BTC rewards.\n“This decrease was unexpectedly offset by a significant increase in transaction fees. Simply put, what we lost in rewards, we made up for in transaction fees.”\nMarathon’s chief growth officer, Adam Swick, echoed these sentiments as he highlighted spiking fees following the halving, fueled by the launch of Runes and broader network activity.\n“This has certainly helped to lessen the impact of halving, or perhaps delay the impact depending on how long the fees persist,” Swick said.\nAccording to Swick, the most immediate impact post-halving has been heightened transaction fees, which have almost offset the halving.\nHe added that Marathon had meticulously planned around the potential volatility of the BTC price and global hash rate, and the firm’s day-to-day operations have not been affected as a result.\nRunes have contributed 1,200 BTC in fees to miners\nRune transactions have added over 1,200 BTC worth of transaction fees to miners since the Bitcoin halving took effect, according to Swick.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRunes — a new token standard on Bitcoin that allows users to create more efficient fungible tokens on the preeminent cryptocurrency’s blockchain — have led to mixed reactions from the Bitcoin community.\nRelated: What are Bitcoin Runes, and how do they differ from BRC-20 tokens?\nBitcoin maximalists have argued that the advent of BRC-20 tokens, made possible by the creation of Inscriptions and Runes by Casey Rodarmor, has taken away from the network’s primary purpose.\nDune dashboard data shows that fees for minting Runes have surpassed 1,200 BTC. Source: Cryptokoryo Research\nAccording to both Beard and Swick, mining firms are taking a more positive outlook given the impact of Runes just two weeks after the halving.\nBeard suggested that there is a speculative element regarding the impact of Runes and blockchain inscriptions and increased transaction fees. Describing the latest Bitcoin halving as the equivalent of “Crypto’s Super Bowl,” Beard added that increased interest in BTC has also played a part in increased fees.\nStronghold’s CEO believes it is important to consider where these fees will eventually normalize. Beard said that as more functionalities are built on Bitcoin, future trends may lean toward higher transaction fees. He added:\n“From a miner’s perspective, it’s too early to depend on these potential increases without witnessing firsthand the tangible benefits and broader adoption of these technologies.”\nGood for miners, good for Bitcoin?\nSwick believes that the Bitcoin ecosystem is benefitting from innovations like Ordinals and Runes and that miners, in particular, have received a timely boost as competition for dwindling block rewards continues.\n“Anything that increases usage and adoption of the Bitcoin blockchain is good for miners, and good for the Bitcoin ecosystem as a whole.”\nBeard said that miners definitely view functionalities like Runes as a positive development as competition for Bitcoin rewards increases along with the hash rate.\nStronghold’s CEO added that the addition of new functionality to the world’s largest decentralized network not only diversifies Bitcoin use but also supports its growth by attracting more users, which ultimately could lead to higher transaction fees.\nJag Kooner, head of derivatives at Bitfinex, told Cointelegraph that miners typically view innovations like Runes positively if they enhance the blockchain’s functionality and attract more transactions. This inevitably leads to increased fees per block and greater overall mining profitability.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-29","tags":["#Bitcoin","#Blockchain","#Bitcoin Price","#Bitcoin Mining","#Halving","#Bitcoin Halving","#Bitcoin Ordinals","#Runes Protocol"],"author":"by Gareth Jenkinson","category":null}