{"id":"a7762365-7b68-47ee-863c-8763798b7712","article_link":"https://cointelegraph.com/news/ftx-alameda-wallets-transfer-8-3m","website_source":"Cointelegraph","article_type":"Tweet","summary":"The transfer occurred a day before FTX debtors were set to release a new restructuring plan for the exchange.","title":"FTX addresses transferred $8.3M one day before amended proposal deadline","detailed_content":"Two wallets associated with the now-bankrupt FTX exchange and sister trading firm Alameda Research transferred a total of $8.3 million worth of cryptocurrency.\nThe FTX-associated address transferred 860 Tether Gold (XAUT) worth over $2 million to algorithmic trading firm Wintermute, while an Alameda-related wallet transferred a total of 2,027 Ether\nETH\n$3,033\nworth over $6.3 million, to two unknown addresses, according to a May 6 X post by PeckShield.\nFTX and Alameda Wallet transfer. Source: PeckShield\nWhile the reason behind the transactions is unknown, they come a day ahead of FTX debtors’ deadline to file an amended version of the “Plan and Disclosure Statement,” slated for May 7.\nThe amended plan could offer FTX creditors more insights into how they will be compensated for their lost funds. The final deadline for objections is set for June 5.\nThe collapse of FTX and its over 130 subsidiaries is known as one of the crypto industry’s most notorious black swan events, which led to users losing at least $8.9 billion worth of funds. The collapse gave rise to one of the industry’s longest crypto winters when the Bitcoin\nBTC\n$63,046\nprice bottomed out at $16,000.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: History of Crypto: The future of crypto exchanges, regulatory battles, and governance\nWhen will FTX creditors be repaid?\nWhile FTX’s amended plan could shed more light on how customers will be made whole, some creditors are expecting negative news.\nPopular FTX creditor Sunil, who is part of the largest group of over 1,500 FTX creditors — the FTX Customer Ad-Hoc Committee — has cautioned users to reject the upcoming plan, which will likely benefit the debtors. Sunil wrote in a May 5 X post:\n“S&C [Sullivan & Cromwell] likely include clauses to absolve their liability for crimes. S&C puppet John Ray secures a position for himself. Property rights not recognized [for creditors].”\nThe warning comes nearly three months after top FTX creditors sued bankruptcy firm Sullivan & Cromwell (S&C). The creditors alleged that S&C took an active part in the “FTX Group’s multibillion-dollar fraud,” claiming the firm benefited financially from FTX’s fraud, a court filing on Feb. 16:\n“S&C knew of FTX US and FTX Trading Ltd.’s omissions, untruthful and fraudulent conduct, and misappropriation of Class Members’ funds. Despite this knowledge, S&C stood to gain financially from the FTX Group’s misconduct and so agreed, at least impliedly, to assist that unlawful conduct for its own gain.”\nTo date, FTX creditors have sold over $490 million worth of claims through 507 transactions, according to data from crypto debt broker Claims Market.\nFTX Claims sold. Source: Claims Market\nThe legal proceedings could potentially extend for several years before reaching a conclusion, mirroring the protracted case of the Mt. Gox cryptocurrency exchange, which experienced a notorious hacking incident in 2014. The users of the hacked exchange are still awaiting compensation.\nRelated: ‘Mr. 100’ buys the Bitcoin dip for the first time since halving — Is the BTC bottom in?\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-06","tags":["#Blockchain","#Cryptocurrencies","#Business","#Cryptocurrency Exchange","#FTX"],"author":"by Zoltan Vardai","category":null}