{"id":"a779cdab-7e4b-469a-9a9e-4195f08f85fe","article_link":"https://cointelegraph.com/news/btc-e-founder-pleads-guilty-in-9-billion-laundering-conspiracy","website_source":"Cointelegraph","article_type":"News Article","summary":"The platform was utilized to launder funds acquired from various criminal activities, including computer hacking, ransomware attacks and drug trafficking.","title":"BTC-e founder pleads guilty in $9B money laundering conspiracy","detailed_content":"Alexander Vinnik, the co-founder of the crypto exchange BTC-e, has pleaded guilty to money laundering conspiracy. This follows a broader investigation revealing extensive illegal activities on the exchange from 2011 to 2017.\nIn a May 3 press release, the United States Department of Justice (DOJ) stated that during Vinnik’s leadership, BTC-e processed more than $9 billion in transactions and had a user base exceeding one million globally, with many users in the United States.\nThe DOJ highlighted that the platform was utilized to launder funds acquired from various criminal activities, including computer hacking, ransomware attacks and drug trafficking.\nSource: United States Department of Justice Criminal Division\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAccording to the DOJ, an investigation revealed that BTC-e operated without essential legal compliance measures, including registration with the Financial Crimes Enforcement Network (FinCEN) and Anti-Money Laundering (AML) or Know Your Customer (KYC) protocols.\nThese deficiencies made BTC-e popular among individuals seeking to conceal money transactions from law enforcement. Additionally, Vinnik was discovered to have established numerous shell companies and financial accounts globally, enabling the illicit transfer of funds through BTC-e, resulting in criminal losses totaling at least $121 million.\nVinnik has been embroiled in legal battles over the past five years for his alleged role as the mastermind behind BTC-e. The cryptocurrency exchange is said to have profited from various illicit activities that used the platform to launder some $4 billion worth of Bitcoin\nBTC\n$63,046\n.\nRelated: FBI busts $43M crypto and Las Vegas hospitality Ponzi scheme\nVinnik was arrested on money laundering charges in Greece in 2017 and was extradited to France in 2020. In France, Vinnik was cleared of ransomware allegations but was convicted of money laundering charges and sentenced to five years in prison.\nVinnik’s lawyers launched an unsuccessful appeal, claiming that Vinnik was just an exchange employee and had no involvement in illicit activities at BTC-e. After serving two years in a French prison, he was extradited to the U.S. on Aug. 5, 2022.\nVinnik, who is a Russian citizen, had earlier tried to secure a prisoner swap deal for him to be considered as part of a prisoner trade deal between Russia and the United States.\nU.S. authorities have brought similar criminal charges against crypto exchanges and executives. On March 28, former FTX CEO Sam Bankman-Fried was sentenced to 25 years for seven felony charges.\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-04","tags":["#Blockchain","#Law","#Government","#United States","#Cryptocurrency Exchange","#Regulation"],"author":"by Amaka Nwaokocha","category":null}