{"id":"a8cf2c0f-8d2f-4f71-ba94-aa3bc9a4fbb7","article_link":"https://www.wired.com/story/gadget-lab-podcast-607/","website_source":"Wired","article_type":"News Article","summary":"This week on Gadget Lab, we discuss the local-first computing movement and its push to reduce our reliance on the corporate-owned, cloud-based software tools we use every day.","title":"A New Wave of Peer-to-Peer Apps Heralds a Farm-to-Table Internet","detailed_content":"CLOUD COMPUTING HAS streamlined our hyper-mobile digital lives. We upload files, images, and globs of data to the cloud. Once all of our stuff is stored there, we can access it from anywhere and edit things collaboratively with our friends and coworkers. It’s convenient and appealing—but only if you don’t mind that all your personal data is stored on servers run by giant companies like Google and Amazon. The local-first computing movement is advocating for a different kind of communal framework, one that’s more private, more secure, and powered by peer-to-peer software that runs just on the machines where the files are being shared. No giant server farms in faraway lands, no faceless corporations using your data to generate ad revenue. Just the good old internet, by the people and for the people.\nThis week on Gadget Lab, WIRED staff writer Greg Barber joins us to talk about the local-first computing movement and how its adherents hope to upend our reliance on cloud services using peer-to-peer communication.\nShow Notes\nRead Greg’s story about local-first computing.\nRecommendations\nGreg recommends the Ragnar Kjartansson: The Visitors installation at the San Francisco Museum of Modern Art. Lauren recommends the Barbie movie if you somehow haven’t seen it already. Mike recommends the latest episode of The War on Cars podcast with Bob Sorokanich.\nFEATURED VIDEO\n Greg Barber can be found on Twitter @gregoryjbarber. Lauren Goode is @LaurenGoode. Michael Calore is @snackfight. Bling the main hotline at @GadgetLab. The show is produced by Boone Ashworth (@booneashworth). Our theme music is by Solar Keys.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Gadget Lab podcast and our huge library of narrated articles.\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for Gadget Lab. If you use Android, you can find us in the Google Podcasts app just by tapping here. We’re on Spotify too. And in case you really need it, here's the RSS feed.\nTranscript\nNote: This is an automated transcript, which may contain errors.\nMichael Calore: Lauren.\nLauren Goode: Mike.Michael Calore: Lauren, can you imagine doing your job without some type of cloud-based software?\nLauren Goode: Yes, I could. I would go live in a cottage in a fairy forest and use my quill and ink to just write tortured things on paper that no one will ever read.\nMichael Calore: Right, well, I mean, you couldn't do this job without—\nLauren Goode: No, I could not do this job working for WIRED Magazine without accessing the cloud, yeah, and I can't imagine going back to even trading floppies, or whatever we were doing back then.\nMichael Calore: Yes, that and FTP, that is what we were doing.\nLauren Goode: Oh my gosh, and peer-to-peer.\nMichael Calore: Peer-to-peer.\nLauren Goode: We'd share music on Napster, Mike.\nMichael Calore: All right, well, what if I told you that there are apps available right now that let multiple people all edit a document at the same time. and that they're doing this without the cloud?\nLauren Goode: Without the cloud?\nMichael Calore: Without the cloud.\nLauren Goode: Say more.\nMichael Calore: Well, computers are magic, I don't know if you've heard, but we're going to learn all about it today.\nLauren Goode: I can't wait.\n[Gadget Lab intro theme music plays]\nMichael Calore: Hi everyone, welcome to Gadget Lab. I am Michael Calore, I'm a senior editor at WIRED.\nLauren Goode: And I'm Lauren Goode, I'm a senior writer at WIRED.\nMichael Calore: We're also joined today by WIRED staff writer Greg Barber.\nGreg Barber: Hi, good to be here.\nMichael Calore: Hi, Greg.\nLauren Goode: Great to have you on the show, Greg, and here in studio.\nGreg Barber: I know, it's beautiful. You guys have had some upgrades since I was last here.\nLauren Goode: Yeah, thanks to Boone, our excellent producer.\nMichael Calore: Well, yes, welcome back. You're no longer in a Zoom window, you're now actually in a chair.\nGreg Barber: Yes, yes, big upgrade.\nMichael Calore: Today we are talking about local-first computing. The term is probably new to you, but the concepts behind it might make sense to you. Local-first computing describes a type of software that lets you collaborate on files with people on other computers. I'm here at the office and I'm typing into a document; you're across town at a coffee shop, and you have the same document open on your computer, and you see all of my changes appear on your screen in real time. Sounds just like Google Docs, right?\nLauren Goode: Mm-hmm.\nMichael Calore: And every other web-based collaboration tool. The approach of local-first computing is conceptually similar, but the way it works behind the scenes is quite different. Now Greg, you have written a feature for WIRED that is appearing online this week. People can read it on WIRED.com, and it's about the local-first computing movement. So you know all about this because you've been researching it and interviewing many of the people behind it, so we're hoping you can start the show by explaining to us how local-first computing is different from cloud-based computing that people are familiar with, like good old Google Docs and Slack, and things like that.Greg Barber: Yeah, yeah. So as you said, conceptually it's actually going to be pretty similar for the average user of this kind of software. You're working on a text document, or you're working on some kind of image file, and similar to Google Docs or Photoshop, you're making edits, you're making changes, and you might be doing that with other people. But in this case the idea is that you can do a lot of work offline without any internet connection to another person, and you can make a whole bunch of changes. And then when you come back this magical little alchemy happens where all the changes resolve from you and whoever else is editing the document into a result that makes sense. And again, that doesn't sound all that different from Google Docs, I think in part because we're pretty used to just having an internet connection at all times. You might occasionally get that little dialog that comes up on Google Docs if you do go offline that says, OK, this is the tab where you can make the changes, and then everything else is suspended. But basically it's depending on having a copy of that file stored in a server somewhere. It's one of Google's servers probably in some data center in the desert of Oregon, and the changes are all being made there. Whereas in this case. the changes are being made on every copy of the file that is distributed among the people who are editing it. And like you said, Mike, that involves some pretty tricky math and computing that was actually developed a long time ago but didn't really get much use and is now seeing a resurgence.\nLauren Goode: Is this technology or this protocol using the big cloud services still, like Google Cloud or Amazon Web Services?\nGreg Barber: A little different from that. So actually you are, in this case, peer-to-peer. So basically the file is only existing on your computer and the computer of the other people who have access to that file, who might be collaborating on it. And then rather than keeping some sort of master copy on a Google server, instead when you all are making changes and you sync up and you have an internet connection, then the changes are happening on everyone's computer. So it's almost like, I compare it in the piece to quantum entanglement, atoms that need to always be in the exact same state even if they're halfway across the universe from each other, the changes will always resolve on each computer into the exact same result. And hopefully it's an intuitive result, and that's where it gets a little bit tricky.\nMichael Calore: So what you're talking about is decentralization.\nGreg Barber: Exactly.\nMichael Calore: Which is a word that pops up a lot in computing these days. How does local first computing fit into the discussion around decentralization?\nGreg Barber: Yeah, yeah. I mean, there's a really long history to this, of course. This goes back to basically the origins of the internet, where from the start there was this open protocol, the internet. It's pretty great, heard of it?Michael Calore: Heard of it.\nGreg Barber: Everyone can participate, everyone can build things on top of it, build different technologies. And the magic of it is that unlike prior technologies, like our telephone lines, which are owned by telephone companies who regulate the use of those wires, anybody could participate, and people were really excited about this. But from the beginning there were people who thought, actually, maybe some companies should get involved and they should play a role in managing how internet traffic is moving. So this is all to say, there's a really long history to basically fighting for the decentralization of the internet. And this became particularly true as people started building applications on top of the internet, people starting basically allowing the internet to do things for us, like we could have applications to check your email or talk to other people.\nLauren Goode: Mm-hmm, you describe it beautifully in the piece where you say, a lot of the tech companies have built these gorgeous gardens, and so enticed us to go into the gardens, and then they started building the walls around them.\nGreg Barber: Yeah, exactly, exactly. And that's particularly true in the early 2000s with the beginning of the cloud computing revolution. It starts off with Salesforce, basically white-labeling servers to people; they could put their own branding on them and interact with their customers that way. And then you've got Flickr, you've got Gmail, you've got all sorts of different applications that are based on this model of having really great software that does a lot of useful things, but then it's rooted in needing to interact with a company's servers. So as that's happening, I think the voices that have been calling for internet decentralization have been getting louder, because this does tie into a business model that, as you said, Lauren, pulls people into these walled gardens, keeps them there, and keeps their data stuck on certain servers. Some people are pushing back on that. So there are movements like the decentralized web movement, Tim Berners-Lee is a big force in that. There's the crypto-related stuff, the Web3, which is a word that I've not used much recently. So you could think of this kind of programming, this local first, in that tradition. And in fact, its technical roots really reach back to that tradition as well, for people who are a part of earlier movements.\nMichael Calore: Yeah.\nLauren Goode: So this more recent movement towards local-first computing you discovered through discussions on Hacker News, you ended up chasing down some of the folks who are involved in this. Tell us about them, and what was their motivation for starting this movement, or restarting this movement?\nGreg Barber: This has been a recurring viral subject on Hacker News, which is this website that, as I'm sure, many listeners are familiar with, where a lot of engineers go and post interesting things, and they get upvoted and more people read them. And so local-first has been a big force there, Whenever something new comes out, it seems to just shoot right to the top of the page. So I actually came across this, oh gosh, I think four years ago now, it was before the pandemic. And there was what I came to think of as a manifesto posted by a group of researchers, primarily based at this private lab called Ink & Switch, led by a software engineer named Peter van Hardenberg, who was a former engineer at Heroku, which was this startup that became quite large based actually in spinning up cloud servers for people, very much at the heart of the cloud computing revolution. It was eventually purchased by Salesforce and they did some time there. And then they're working with another computer scientist named Martin Kleppmann, who is originally from Germany. He had taken a tour as well through the startups and some of the big companies, like LinkedIn, but he came out really interested in exploring these old ideas in peer-to-peer software, and among them was a concept called CRDT, or conflict-free replicating data type.Lauren Goode: Conflict-free replicating data type.\nGreg Barber: Yeah, yeah, and when you break it down, that garbled jumble of words makes some intuitive sense. Basically it refers to a type of data structure, so ways of moving around data and organizing it in a computer program, that can be merged together in ways that are conflict-free. So that's going back to where you have many different computers and they all have a copy of the file, and they need to figure out a way to take your changes, Lauren, and my changes, and your changes, Mike, and make them all resolve into the same thing, so you want it to be conflict-free.\nMichael Calore: Without conflicts.\nGreg Barber: And you also want it to be replicated: The three of us all have this file. So that was developed primarily by a French computer scientist named Mark Shapiro. He was working in the mid-2000s, at the very height of this cloud computing revolution. He was interested primarily in collaboration software. And at the time there wasn't really great internet connectivity, so this was a pretty big problem generally in computing. He was himself a peer-to-peer advocate, but it wasn't something that the cloud had really figured out either. He had a funny moment where he was working on this, and it felt like a very niche subject. He was toiling away, and he was working on CRDTs and this way of merging things offline, and he was like, nobody's going to be interested in this. And then a couple weeks later he says, boom, Google Docs.\nLauren Goode: Oh, interesting.\nMichael Calore: But Google was not using CRDT?\nGreg Barber: No, no, they're still relying on Google servers. So you can go offline, you can do your thing. There's some limited capabilities for multiple people being offline, but you're going back to a Google server when you want to merge those changes, whereas in this case there's no server between the three of us.\nMichael Calore: But he probably saw that as a clear indication that the world is ready for this.\nGreg Barber: Exactly, yeah. Collaboration software is here. Google's doing it, everybody, it's 2006 or 2007, people love Google and are very excited with every new Google product that's coming out.\nMichael Calore: Let us not forget about Zoho and Zoho Office also at the same time.\nGreg Barber: Oh, I'm not familiar.\nMichael Calore: Oh, they do the same thing, they make an office suite collaborative.\nGreg Barber: Got it. So yeah, basically he develops this, and people aren't all that interested. The cloud computing people are like, eh, that's not particularly useful for our purposes, because we want our servers anyway. And then it's forgotten for a while, but then Martin picks it up. He'd been through the startup grind, and he's now working as a research scholar at the University of Cambridge. It's in the mid-2010s, and he starts looking at this algorithm and thinks it's really interesting. How do you actually do these kind of complicated merges? But he realizes as well that it's not particularly useful to engineers like himself; it's just too inefficient. It's not integrated in any way with all the different tools that have grown up around cloud computing. So he sets about trying to implement it himself.  He wants to code out this algorithm in a way that people can actually use and start building apps.Michael Calore: All right, well let's take a break, and we'll come right back with some more.\n[Break]\nMichael Calore: Greg, something you note in your story is that all of these applications that are out there now that are being demoed, they're all pretty young. They don't have a lot of the features that we would expect from mature cloud-based apps, especially the ones that they're competing with. So there's an artisanal feel to a lot of them. It must be hard to live your life the way that you are currently living it using these apps with all of their limitations, and I feel like doing so probably requires a level of patience and dedication that most people don't have.\nGreg Barber: Yeah, definitely. And this is a problem that's been dogging peer-to-peer software as long as it's been around. Mark Shapiro, the researcher who came up with CRDTs, I asked him at one point, what does your life look like online as a peer-to-peer hardliner, as he puts it? And he's like, “Well, basically I avoid the internet.”\nLauren Goode: He avoids the internet as we know it, because everything he does is peer-to-peer?\nGreg Barber: So basically there aren't alternatives available to him. He would like to be out with his friends using a bunch of peer-to-peer software, but everyone else got tired of it, and he would basically be alone if he were trying to communicate peer-to-peer with people online. Nothing really took off, and I think it's right, as you say, Mike, that it typically does involve trade-offs. It involves more user difficulty, and you lose features. I mean, the cloud is just super, super useful. , Of course there are these business models that favor the cloud, but at the core of it, cloud computing is just a very useful technology.\nMichael Calore: Yeah, it's 20 years old and has hundreds of billions of dollars thrown behind it.\nGreg Barber: Exactly, yeah, yeah. It's at the root of almost all software that we're using on a daily basis now. So that's part of it, that the technology is just very new and it's hard to build apps still on top of this. But then they really hope that, down the line, because there's this solid theoretical foundation for how to make these apps efficient and keep the servers out of the equation, that actually you can build interesting software that maybe goes beyond some of the capabilities of the kinds of applications we use every day. One example:  Kleppmann has recently been working on a prototype of an app that's for rich text editing. So it's basically Google Docs. But his idea for it is that it would be closer to something like Git, the software that computer programmers use to share their code. In that case there's this idea of pushing and pulling changes and—\nMichael Calore: Checking things in, checking things out.Greg Barber: Yeah, yeah, and there's version controls; you can see the various versions that people are trying to add to the common code base. And as a computer programmer, he finds that very useful. He thinks that if you can see all these different versions and you can spend a lot of time offline doing your own thing, and then you bring it back, that that's actually a richer program than Google Docs, which is just relying on us tinkering with the same copy, essentially.\nLauren Goode: I have a couple of questions that might be annoyingly pragmatic. So the first is that a major part of having a robust optimized cloud experience is having lots of engineers who are constantly working on maintaining and approving the infrastructure, and big tech companies tend to have the resources to hire those engineers. So in Kleppmann's vision, who are the people who are ultimately maintaining these peer-to-peer local-first computing services? And my second question is, all right, so how is this new version of the cloud going to be monetized? Because we know that's coming.\nGreg Barber: Yeah, yep. Yeah, so to answer—\nLauren Goode: Senator, we sell ads.\nGreg Barber: Yes. So to answer your first question, I think they're really hoping that they can peel people away from the existing dominant cloud computing world. And it was interesting speaking with these folks during and after the big boom in cryptocurrency; there was this moment … So I should say they're not big fans of cryptocurrency themselves, despite there being some overlap in terms of the terminology around decentralization, and things like that.\nLauren Goode: Oh, interesting. Why is that?\nGreg Barber: I think two aspects: One is that just technologically it's actually in some ways the opposite. Because while local-first is meant to be offline, cryptocurrency relies on a blockchain, so you're always tethered to the technology.\nLauren Goode: Mm-hmm, and it's very energy-intensive.\nGreg Barber: Mm-hmm, yeah, and controlled in this monopolistic way by whoever has the most cryptocurrency in the network, or the most computing power. And we'll get back to the money, but I think that they find crypto in general to be money-motivated. It's not necessarily for the improvement of software, it's more about, OK, how can you monetize the cryptocurrency that's flowing around the network? The apps are kind of secondary. But it did offer this interesting lesson for the local-first folks in terms of, how do you peel away those engineers from the cloud computing firms? And I think it showed that people are really interested in these principles of decentralization and data ownership and the kinds of things that are enabled if you're not worrying about cloud computing anymore. So that was heartening, and it also showed the way of, OK, how do you generate a little bit of hype around this? And I think even, something I talked about in the piece is that even the phrase local-first software is itself sort of a marketing term, it's a way of projecting values. And the viral hacker news post, this is all part of building some kind of movement where this is interesting, it's technically interesting, but it's also philosophically interesting and something that you want to join.Michael Calore: It's antiestablishment, it's altruistic.\nLauren Goode: It's farm to table.\nMichael Calore: It's farm to table, it's more pure.\nGreg Barber: Yeah. But then I think that speaks to your second question, which is that those things can often conflict with making money, and that we still have this dominant paradigm of, you go to a venture capital firm, you get a bunch of money, and then they want their money back times whatever magnitude—\nMichael Calore: How dare they.\nGreg Barber: … in a few years. And one could say, “How dare they,” in terms of the scale, the scale of the monetization that's required. So that is a tension for them, and it's honestly one that, if I'm being totally honest with you guys, I didn't feel was fully answered in the reporting. I think part of that can be excused because it is early, and Kleppmann and Peter van Hardenberg, they're still in a position where they're working on implementing CRDTs, and they're getting voluntary contributions from companies that are interested in local-first, and things like that, but they're not seeking venture capital funding themselves. But at the same time, I think they recognize that somebody's going to have to do it. And there is this question of, OK, are the technical underpinnings of this enough to prevent people from reaching immediately for these traditional business models? Can you let the technology lead in terms of, it's pointing to this future where you don't hoard people's data, will people rely on that technology to make in what their opinion would be the right choices around monetization? That's it too, I think that their main argument is that they're going to make really good software, it's going to be more useful than Google Docs, it's going to recruit users and stand for itself. And I think that's the big open question: Do people go for the old conveniences, or do they get inspired to pick up something new that might be truly more interesting and more useful than what came before it?\nMichael Calore: I do love the vision of the better internet. I mean, we're not talking about going back to banging rocks together and rubbing sticks together to start fires, we're talking about using these great technologies to just build something that is better and maybe more private and more secure and more friendly to our human existence.\nGreg Barber: Yeah, yeah.\nMichael Calore: These giant libraries where everything about us is stored and used against us.\nGreg Barber: Yeah, yeah, and that's definitely true. And something that I haven't mentioned is it does enable certain things that the cloud doesn't, for example, end-to-end encryption, where if you're not relying on a server between you and me, then it's substantially easier in some ways to avoid prying eyes on our data. Again, the general public … in some ways end-to-end encryption, it should be a general use case, but it can be a little bit niche too. I don't know if it reels people in in the way that you might hope.Michael Calore: This is why everybody's flocking to Signal.\nGreg Barber: Exactly, yeah.\nMichael Calore: Sorry, not to throw shade at Signal, but yeah, end-to-end …\nLauren Goode: No, we're all on Signal. If anyone has any tips, get in touch with us.\nMichael Calore: Please. But end-to-end decryption is not a really big selling point for the general populace, it's a selling point for nerds like us.\nGreg Barber: Yeah, yeah. And perhaps in a suite of other additional great things that can come out of this, it's another selling point.\nMichael Calore: All right, Greg, this has been fascinating. Thanks for coming on the show and talking all about your new feature about local-first computing that everybody can read on WIRED this week.\nGreg Barber: Yeah, thanks for having me.\nLauren Goode: And in studio too, it's a local-first Greg Barber.\nMichael Calore: It really is, this has been a fully peer-to-peer discussion.\nLauren Goode: But stick around for recommendations.\nMichael Calore: We'll be right back.\n[Break]\nMichael Calore: All right, welcome back. Here's the last section of our show, where we all go around the table and we offer our recommendations for things that listeners might be interested in enjoying. Greg, what is your recommendation?\nGreg Barber: I'd like to recommend in exhibit at the San Francisco Museum of Modern Art right now that's called The Visitors. It's by an Icelandic artist, musician, whose name I'm going to butcher, I'm very sorry, but it's Ragnar Kjartansson. I had it pulled up on my laptop. So I went last weekend, and it's basically, you go into a room and there's a whole bunch of screens around you, and each screen is a portal into a different room in a giant house in upstate New York where Ragnar, I'm going to go with his first name, he traveled with his friends and fellow musicians, and they basically recorded a enormous jam session between all of them. But they're each in their own room, they each have a single mic, a single camera. And just this amazing thing unfolds where you just watch this individual process of music making that's somehow happening through the walls and through the floors of this house, and—\nMichael Calore: Could they hear each other? Did they have monitoring?\nGreg Barber: Yeah, they can hear each other. But it's an hour long, I stayed for the full hour. I was very lucky to arrive when it started. I can't help but see some local-first allegories in it, which honestly only occurred to me just now. Yeah, I would really recommend it. It's also often in New York; it's shared between New York MoMA and SFMOMA and trades between the two.\nMichael Calore: So if you happen to live in the culturally inferior museum town of New York, then you can still see this thing that we lucky ones here in San Francisco get to see.Greg Barber: Yeah, it'll come back to you eventually.\nLauren Goode: Always throwing shade at New York City.\nMichael Calore: Well, that was sarcastic.\nLauren Goode: Oh, OK.\nMichael Calore: Because it seems like there's a museum on every corner in New York.\nLauren Goode: Yes.\nMichael Calore: Or so I'm told, I've never been. That's a good one, it's a good recommendation. Thank you.\nLauren Goode: Have you ever heard of something called The Met?\nMichael Calore: The Met.\nLauren Goode: Yeah, if you work for Condé Nast you have to know what The Met is.\nMichael Calore: Is that like meta?\nLauren Goode: No, oh my goodness.\nMichael Calore: Like Facebook?\nLauren Goode: Let's move on please.\nMichael Calore: Lauren, what's your recommendation?\nLauren Goode: My recommendation, I wish it was more clever or unique, like Greg's recommendation, or even local. It's not. I have finally completed my Barbenheimer quest. I went to go see Barbie, I did not see it back to back with Oppenheimer. We saw Oppenheimer together, Mike, a few weeks ago, I saw Barbie last week. And if you have not had the chance to see it yet and you're on the fence about it, I recommend it for the experience. I'm going to say something that if stripped out of context would sound like a dig, I fell asleep during Barbie, but I have good reason for that. One, I was tired, so that's always a good reason to take a nap. Two, I went with a friend who wanted to go to the 10:50 showing. This is Kara Swisher, by the way. She's often known as the most feared technology journalist out there, and you should just fear her in general. She's a person who wants to go to movies at 10:50 at night, and then we'll still go home afterwards and call the cable company and yell at them and rearrange her furniture, while she's probably, I don't know, yelling at Bob Iger too. So she wanted to go to a 10:50 showing, we compromised, I said, \"No, I cannot stay up that late,\" we compromised, we went to an 8:50 showing. Still I was very tired, and the chairs were very comfortable. I saw probably two thirds of Barbie, so I feel like I got the gist, and I woke up just in time for the ending, so I saw how it concluded. I really enjoyed it, the parts that I was awake for.\nMichael Calore: You were Kentertained?\nLauren Goode: I was Kentertained, and I'm glad I gave Greta Gerwig my money. I think it's an incredible feat that she made this film, I found parts of it to be really humorous and touching. I thought that Ken's discovery of the patriarchy was honestly one of the funniest darkly funny parts of the film. I also really loved Kate McKinnon's character, and Margot Robbie, as we all know, is a star. And yeah, I just think it touched on some really important themes around feminism and the patriarchy, and put it all in a Pepto-Bismol pink wrapper that made it go down really easy.Michael Calore: Nice.\nLauren Goode: Yeah, that's my recommendation, go see Barbie. Or at least, if you're not going to go see in the theaters, then see it on demand.\nMichael Calore: And take a nap.\nLauren Goode: And take a nap.\nMichael Calore: If you're tired.\nLauren Goode: If you're tired from fighting the patriarchy, you're going to need a nap. OK, Mike, what's your recommendation?\nMichael Calore: I'm going to recommend a podcast, a particular episode of a podcast that I've recommended in whole before a few years ago. It's called The War on Cars, and it's a podcast about safe streets advocacy. They talk about cycling, they talk about pedestrian issues, they talk about the difficulty that we have, particularly in North America, of breaking the car dominant culture, and the problem that so many people live far away from places that they need a car to get to, and we have not solved that for them. So the podcast in general is very good. This new episode is an interview with Bob Sorokanich, who was the editor-in-chief of Jalopnik, and before that was a high up editor, like a masthead level editor at a very large car magazine that is well known. And Bob and the hosts of this show are basically in opposition on many things car, but they manage to have a really, really interesting conversation about why we are where we are with cars. Why SUVs have dominated the market, why cars just keep getting bigger, what's the problem with EVs? Why can't we adopt EVs fast enough? Where does all the marketing money go? Why do people spend so much marketing money to sell cars to people who don't necessarily need them? It's really fascinating. It's an hour, I think it's a Patreon episode that they liked so much that they released into their feed during their current vacation that they're on, they're on summer vacation right now. So I would recommend, if you have any interest in automotive journalism or in the car industry and how it works and behind the scenes stuff, you got to check it out, it's really great.\nLauren Goode: Sounds fascinating.\nMichael Calore: Yeah, yeah.\nLauren Goode: Also, the way you said that they don't always agree on car made me think about Ken, because Ken beaches, that's what he does.\nMichael Calore: Oh, he beaches.\nLauren Goode: They use the word beach as a verb in Barbie.\nMichael Calore: I love that.\nLauren Goode: So it just made me think, they car on the podcast, that's how they do it.\nMichael Calore: I love that.\nLauren Goode: Yeah, it's pretty good. Can we just take a moment, by the way, to read aloud a little note from a loyal fan?\nMichael Calore: Oh, sure.\nLauren Goode: So at the end of last week's show we mentioned that someone had written an and said something unkind, but also grammatically incorrect, which we had to flag, as journalism and English majors. So following last week's episode we got a lovely note from someone on Apple Podcasts named Yilish. Yilish, we don't know who you are, but we appreciate this. They said it was a great show, been listening to the show for about two years, thank you for your loyal listenership. \"Just listened to the future of Hollywood episode and I felt compelled to leave a review saying that all of the journalism majors and non-journalism majors at WIRED are people who do know things about tech!\" We appreciate you, we love hearing your thoughts, all of you, so please leave us a review.Michael Calore: That's great.\nLauren Goode: Yeah.\nMichael Calore: And I feel like this is a great episode to read it on, because what other podcasts this week are you going to hear a mention of CRDTs and End-to-End encryption?\nLauren Goode: Yeah, I mean, we love this stuff. We're skeptical, sometimes, but we love it, that's why we do what we do here at WIRED.\nMichael Calore: Oh, Greg, thanks so much for being here this week.\nGreg Barber: Yeah, thanks for having me.\nLauren Goode: So great to have you here, Greg.\nMichael Calore: And thanks to all of you for listening. If you have feedback, you can find all of us on the social medias, just check the show notes. Our producer is Boone Ashworth, we will be back next week, and until then, goodbye.\n[Gadget Lab outro theme music plays]\nLauren Goode: Goodbye. Oh, I don't really like my recommendation, that's why I'm kind of like-\nMichael Calore: I think it's a great recommendation.\nLauren Goode: All right, it's yeah, I'll just-\nMichael Calore: I want to hear what you have to say about Barbie.\nLauren Goode: OK.\nMichael Calore: I'm ... Kenterested?\nLauren Goode: That made me laugh.\n[Everyone laughs]","creation_date":"2023-08-03","tags":["","GADGET LAB PODCAST","PODCASTS","SOFTWARE","INTERNET","OPEN SOURCE"],"author":"BY MICHAEL CALORE","category":null}