{"id":"a8fd044f-fe9d-4ee1-95de-0dc90b67450a","article_link":"https://cointelegraph.com/news/kraken-exchange-self-custody-crypto-wallet-following-other-cexs","website_source":"Cointelegraph","article_type":"News Article","summary":"Kraken Wallet will initially support coins, tokens, NFTs and DeFi assets on eight blockchains.","title":"Kraken exchange rolls out self-custody crypto wallet, following other CEXs","detailed_content":"Crypto exchange Kraken has rolled out its self-custody wallet for digital assets, following the likes of Binance, OKX, Coinbase, Bitget and Bybit.\n\"Whether you’re a Kraken client or not, you can use multichain Kraken Wallet as your bridge to the decentralized financial system,” the exchange wrote. Currently, Kraken Wallet supports assets on eight blockchains, including Bitcoin, Ethereum, Solana, Optimism, Base, Arbitrum, Polygon and Dogecoin. \nThe Kraken Wallet app on iOS.\nKraken claims that the app “collects the absolute minimum amount of data required to function as a wallet” and that \"not even internal app performance analytics are collected.” The company also stated:\n“User activity is proxied through Kraken’s own infrastructure, shielding your IP address and preventing your identity and location information from potential external exposure.\"\nFor security, the wallet features mobile biometrics and user password protection, while its code has been audited by Trail of Bits. The app’s code is also open-source and available on GitHub.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nFunctionwise, Kraken Wallet supports decentralized finance tokens, nonfungible tokens, interaction with decentralized applications through Wallet Connect, and “24/7/365” customer support.\n\"Kraken Wallet is how we invest in the your keys, your crypto ecosystem which is vital for the existence of permissionless financial access,\" said Eric Kuhn, product director for Kraken Wallet, in a statement.\nExchanges have increasingly turned to the self-custody wallet sector amid a worldwide regulatory tightening on their activities.\nOn April 11, Kraken announced that it is winding down support for the Monero\nXMR\n$130\nprivacy coin for its customers based in Ireland and Belgium. Last October, the exchange suspended support for several stablecoins, such as Tether\nUSDT\n$1.00\nand Dai\nDAI\n$1.00\n, for its Canadian users. \nIn many jurisdictions, self-custody wallets are not subjected to the same rules that apply to money transmitters, such as exchanges, as they do not natively process fiat money transactions.\nOn March 19, the European Parliament scrapped a 1,000 euro ($1,080) limit on cryptocurrency payments from self-hosted crypto wallets as part of new Anti-Money Laundering laws.\nSimilarly, on March 28, U.S. District Judge Katherine Failla ruled that Coinbase Wallet was “not a broker” and, therefore, not subject to brokerage rules set forth by the Securities and Exchange Commission. \nRelated: US investigates Trust Wallet iOS app for vulnerability\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Kraken","#Cryptocurrencies","#Adoption","#DeFi"],"author":"by Zhiyuan Sun","category":null}