{"id":"a944669d-2853-43ab-8682-07ac571821cf","article_link":"https://cointelegraph.com/news/fantom-memecoins-wants-safer-tokens-launches-developer-fund","website_source":"Cointelegraph","article_type":"Tweet","summary":"Fantom Foundation CEO Michael Kong hopes the blockchain can “replicate the success” of its peers by getting in on the memecoin hype.","title":"Fantom bets on ‘safer memecoins’ with launch of $6.5M dev fund","detailed_content":"Layer-1 blockchain Fantom is pushing the idea of “safer memecoins” by setting aside $6.5 million worth of its native FTM\nFTM\n$0.74\ntoken to reward developers as it tries to get a slice of the nearly $50-billion sector.\nFantom Foundation CEO Michael Kong told Cointelegraph he wants to create “an environment where people can launch what we call ‘safer memecoins’” and introduce technical and non-technical measures to ensure projects aren’t “just an outright rug or scam.”\nSolana and Coinbase’s Ethereum layer-2 Base have seen the bulk of the recent memecoin trading craze, with trading volumes on Solana even surpassing Ethereum’s at the peak of the rush in March.\nHowever, Cointelegraph’s Magazine found as many as one in six memecoins on Base were scams and at least 12 sizeable meme-based projects on Solana — which raised a combined $26.7 million — were quickly abandoned by their creators.\nIn a bid to attract memecoin traders to Fantom, Kong announced during the April 30 MemeGlobal event in Sydney that the Fantom Foundation was setting up a 10-million-Fantom\nFTM\n$0.74\nprize pool — worth $6.5 million — for memecoin teams.\n“The memecoin phenomenon that exists right now is a method for us to acquire a lot of customers because we’ve seen that it was successful with other chains, and we want to replicate that success,” Kong said.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“For us as a chain, our interest is to grow the chain as much as possible, and that comes down to customer acquisition,” Kong added.\n“In the end, it’s about what the customer wants. If the customer wants DeFi, give them DeFi. NFTs? Give them NFTs, and when it comes to memecoins, give them memecoins — or at least an environment that allows people to develop memecoins in a safe manner.”\nKong described a successful memecoin as one with a “democratic launch where you release a lot of tokens to give to the community” that aren’t “heavily concentrated in a few whales or a few bags.”\nMichael Kong speaking on a panel at MemeGlobal Sydney. Source: Jesse Coghlan/Cointelegraph\nThe foundation’s co-founder, Andre Cronje, proposed measures for safe memecoins earlier in April, including memecoin devs issuing their token with the Fanton Foundation as a co-controller of the token’s startup liquidity.\nRelated: Crypto VC sees a ‘new class’ of profitable memecoins this cycle\nCronje also proposed the token supply split — 5% to the team and 10% for marketing locked in a multisig wallet needing at least one foundation member as a co-signer.\nThe remaining 85% would be placed in an FTM-paired liquidity pool (LP), with the foundation pitching in 100,000 FTM — worth around $65,000 at current prices.\n“Should the FTM in the LP token reach at least 2,000,000 FTM, the original provided 100,000 FTM (5%) will be removed to cover the initial cost and the rest of the LP will be burned,” Cronje wrote.\nFantom is the 38th largest blockchain network with a total value locked (TVL) of $108.3 million, according to DefiLlama. For comparison, Solana and Base are the fourth and sixth largest by TVL, respectively.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Altcoin","#Funding","#Fantom","#Memecoin"],"author":"by Jesse Coghlan","category":null}