{"id":"a9938796-e532-4abe-8c5b-8f2ad10991eb","article_link":"https://www.wired.com/story/cryptocurrency-sbf-ftx-microfinance/","website_source":"Wired","article_type":"News Article","summary":"Before there was SBF, there was another “ethical crusader” who learned the same hard truths about the technology of trust.","title":"The Case That Foreshadowed the Lessons of the FTX Collapse","detailed_content":"FOR THE PAST three seemingly glorious years, the 30-year-old boy wonder Sam Bankman-Fried, or SBF, crowned the “King of Crypto,” bore an uncanny resemblance to the legendary character Robin Hood. Using his quant and coding skills instead of a bow-and-arrow, he built, at breakneck speed, a $32 billion empire: the cryptocurrency exchange FTX, and the trading firm Alameda Research. But it was all supposedly for the cause of giving to the poor (via the fashionable new movement, effective altruism)—with former Alameda co-CEO Caroline Ellison acting as his Maid Marian and a stunning roster of A-listers (from top Democrats to star sportspersons) his Merry Men. Yet, since being escorted out of his Caribbean home in handcuffs on December 12, he has appeared a distinctly less cheerful outlaw. \nSo how did our self-proclaimed modern-day Robin Hood, who agreed to extradition to the US earlier this week, come to end up in chains? \nThe answer is foreshadowed by another “ethical crusader” who, a little over a decade ago, experimented with his own philanthropic fantasy on the other side of the globe: Vikram Akula and his microfinance initiative. Microfinance refers to institutions that provide financial services, especially small (“micro”) loans, to people not normally able to access credit from conventional banks—typically poor women, often in rural areas. The concept of microfinance, and the first microfinance institution, the Grameen Bank, had been established in the 1970s by economist Muhammad Yunus in Bangladesh and had gradually grown to boast millions of borrowers in the country and all over the world—winning Yunus and his not-for-profit bank the Nobel Peace Prize in 2006 for contributions to global poverty eradication. \nFEATURED VIDEO\nMemory Champion Answers Questions From Twitter\nAkula, raised in the US, wanted to import the business acumen he’d acquired as a management consultant at McKinsey—his equivalent of Robin Hood’s archery—to the microfinance model in his ancestral homeland, India: specifically, by speeding the process up to bring the logic of fast-scaling consumer brands, like Coca-Cola or McDonald’s, into play. He established his own company, SKS Microfinance, in 1997 to do so. Fueled by the idea that the more rapidly Akula’s company expanded, the more good it could do, SKS quickly became one of the fastest growing institutions in the sector’s history, and Akula the bold new global face of microfinance—making, for instance, the Time magazine list of the 100 Most Influential People of 2006. By 2010, an SKS IPO, as apparent proof of the pudding of profit-with-a-purpose, was 14-times oversubscribed. \nSUBSCRIBE\nSubscribe to WIRED and stay smart with more of your favorite Ideas writers.\nThe similarities between FTX and SKS go beyond the rebel-with-a-cause personal trajectories of their founders. Like Robin Hood and his followers’ noble cat-and-mouse game with the tyrannical Sheriff, both men operated on the fringes of the law in the liminal extralegal space between legal and not, with SBF working in the unregulated crypto industry and Akula in the mostly unregulated South Asian microfinance sector. (In 2010, Akula, too, had an arrest warrant issued against him, although with “sheriffs” in India being what they are, he was never arrested.) And both were motivated, notionally—much as “man of the people” Robin Hood—by the democratizing zeal of giving power to the people. \nIndeed, the original models of crypto and microfinance had much in common. Crypto is a decentralized digital currency (including, for instance, Bitcoin, Ethereum, Tether, Binance Coin, and Dogecoin) traded on crypto exchanges (like Coinbase, Kraken, Gemini, and, until recently, FTX, as well as some brokerage platforms like Robinhood, Webull, and eToro). Unlike conventional “fiat currencies” issued by governments, crypto isn’t backed by any physical assets: Its value is conjured entirely by common consent. Because transactions (“blocks”) are verified and recorded (in a continuous link, or “chain”) in code known as a blockchain—the equivalent of a checkbook distributed across an infinity of computers across the world—it is considered open, diffuse, and consensus-driven: the ultimate peoples’ ledger, or an opportunity for millions of ordinary people to co-author their own collective financial story.\nThe microfinance model, on the other hand, is notable for providing loans without either contracts or collateral, but instead through “group lending” or organizing borrowers into supportive peer groups, usually of five—significantly widening the radius of finance by allowing virtually anyone (even those without legal or financial assets) to access credit, making it the quintessential people’s bank. Despite the absence of the usual punitive mechanisms, and, again, lending backed by physical assets (collateral), microfinance institutions remarkably achieve and maintain extremely high repayment rates—regularly over 95 percent, reportedly—by means of consensus or common consent among borrowers. At the heart of both are peer-to-peer relationships and dynamics that replace finance’s traditional hierarchies, akin to Robin Hood’s commitment to redistribution as financial justice. Cryptocurrency and microfinance—cousin experiments in decentralized and inclusive finance, respectively—challenge top-down institutions like banks and governments by not only drawing ordinary people into its remit but also, in theory, placing them at the wheel (the community “verifies” transactions in the crypto model and monitors lending via “peer-monitoring” in microfinance). Despite their many detractors, they succeeded in defying conventional wisdom to become multibillion-dollar industries, receiving the blessings and backing of some of the world’s most highly respected investors. Each, in turn, was anointed by reference venture capital firm Sequoia Capital, established by “godfather” of Silicon Valley Don Valentine.\nAnd in both instances, actors once deemed its “golden boys” almost single-handedly destabilized the prospects of the entire sector, demonstrating their frailty. The hubris of both FTX and SKS in developing highly streamlined versions of their products was that they were working with a universal scaling formula—a mechanical substitute for trust—allowing for infinitely rapid growth. Indeed, Satoshi Nakamoto, in outlining the proposal for the first cryptocurrency, Bitcoin—speculated to be in part a response to the excesses of the 2008 financial crisis—explicitly described the technology as being “based on cryptographic proof instead of trust.” Similarly, Akula set out to develop what he referred to as the “Starbucks version” of microfinance. FTX derived its confidence from the halo-effect of blockchain code being deemed incorruptible while SKS operated on the assumption that the signature high repayment rates of microfinance were based on a cold, economic cost-benefit analysis on the part of borrowers. \nThey were wrong.\nAs the Nobel Prize–winning economist and high priestess of informality Elinor Ostrom established, the peer-to-peer mechanisms at the core of both models can be highly resilient. But their success lies in their communitarian calculus (relationships of trust and reciprocity between participants and the institution), which makes participants feel invested. Social identity was a key part of what made both crypto and microfinance work. Women in India—like their 15 or so million compatriots in Bangladesh—paid their loans back largely because that’s what it meant to belong. One in five Americans report having traded cryptocurrency, with 33 percent of those in crypto circles citing “wanting to be a part of a community” as at least a minor reason for investing. The secret ingredient that congeals any institution—but especially an informal one, like Robin Hood and his band—is solidarity within the group and faith in the morality of its mission: in these cases, correctives to the injustices of mainstream finance. SBF and Akula understood IT and business, but not the technology of trust. \nIn the early 2000s, Joseph Stiglitz (another Nobel Prize–winning economist) and I detected the incipient “irrational exuberance” in the microfinance sector and predicted that the bubble was likely to burst on the basis that SKS was undermining the very thing that had made microfinance tick—trust—by “mass manufacturing” it at a pace and profit margin that crowded out the moral incentives of borrowers. In November 2010, anticipating events 12 years later at FTX, this played out: Soon after its explosive burst of growth, SKS faced a wave of defections in the form of mass defaults—an unhappy first in the industry’s history. Regulators, who had struggled to keep up with the novel developments of the sector, scrambled to take action, introducing draconian legislation. And so Akula’s experiment ended up in the “sheriff’s” shackles after all. The lasting legacy of the Indian microfinance crisis, barely reported in the international media, was 10 million women being designated defaulters and denied access to credit in the future, potentially for the rest of their lives. Those handed the tab for Akula’s great gamble were the very people in whose name he acted: the common person. Meanwhile, this November, a tweet by the CEO of Binance, Changpeng Zhao, prompted a run on FTT, the FTX token, ultimately exposing the rot at the core of the organization and revealing an $8-billion-dollar hole in its balance sheet, potentially leaving 1 million of its customers—ordinary people—once again holding the bill. \nSKS changed microfinance irrevocably, shattering the fragile equilibrium of goodwill that long sustained it. FTX, for better or for worse, promises to do the same for the crypto industry. In light of corporate restructuring expert and Enron veteran John Jay Ray III’s testimony before the US House of Representatives on Bankman-Fried’s Bernie Madoff–style “old-fashioned embezzlement,” SBF is starting to look less like a heroic outlaw and more like a garden-variety bandit. But from the FTX scandal—which is likely to join the ranks of “one of the biggest frauds in American financial history”—to the SKS debacle, one of the biggest mass defaults in history, the lesson is clear: The key thing about a people’s institution is that you have to retain the trust of the people. Otherwise, one goes from being Robin Hood to, at best, the prince of thieves.","creation_date":"2022-12-21","tags":["","CRYPTO","CRYPTOCURRENCY","FINANCE","MONEY","PSYCHOLOGY","SAM BANKMAN-FRIED"],"author":"BY ANTARA HALDAR","category":null}