{"id":"aa0508c3-a105-49a5-a1f9-97a878703af3","article_link":"https://medium.com/@efeng/why-are-there-so-many-web3-startups-43a150379d52","website_source":"Medium","article_type":"Blog Post","summary":"This week, Pitchbook published their latest Emerging Tech Indicator (ETI) report which tracks early stage investment activity amongst the…","title":"Why are there so many Web3 startups?","detailed_content":"This week, Pitchbook published their latest Emerging Tech Indicator (ETI) report which tracks early stage investment activity amongst the world’s most successful venture capital firms to “gauge which areas of tech are grabbing VCs’ attention”. In Q3, the sector that received the largest amount of VC dollars according to the ETI report was Web3 with nearly $900 million. That’s more than fintech, biotech, security, ecommerce, gaming, and dozens of other mainstream industries.And Q3 wasn’t the first time that Web3 topped the ETI report. In fact, Web3 has led the ETI rankings for 5 consecutive quarters now. Over the past 12 months, there has been over $6.5 billion of ETI capital invested into Web3, which is more than double that of the next highest category of fintech at $2.7 billion.Even with all the ongoing challenges across cryptocurrency, which has seen its combined market capitalization decline by 2/3 since last November, investment interest in the sector remains stronger than other industries. Why? Because entrepreneurs still want to start Web3 companies.Building a good Web3 startup is hard. Explaining what makes a startup Web3 in the first place is even harder. Here are a few attempts. Leading Web3 investor A16Z describes Web3 as “the internet owned by the builders and users, orchestrated with tokens”. Ethereum co-founder Gavin Wood, who coined the term Web3, describes it as “an alternative vision of the web, where the services that we use are purely algorithmic things hosted by everybody”. Web3 has also been called “the hyperfinancialization of all human existence” and where “every product is simultaneously an investment opportunity”. Pretty confusing right?Here’s a simpler definition: a Web3 startup interacts with data stored on a blockchain. That’s it. Read from Ethereum via an RPC provider? You’re a Web3 company. Send a transaction on the Solana network? Web3. Implement a Connect Wallet button on your website? Same. Blockchains, the public shared ledgers of information, are the data building blocks of Web3, and if you use any of this data in your product, then you’re part of Web3 too.Now why is this interesting to entrepreneurs? Because we haven’t had free access to data in a long time.All consumer products need data. If you’re building a restaurant discovery website, you need reviews. If you’re building a shopping app, you need a product catalog. If you’re building a photo or music or video sharing service, you need (obviously) photos or music or videos. Sure you can get users to create that data for you — after all, users authoring data is the core tenet of Web2. But it takes a lot of users to create a useful amount of data, and until then the product experience for those few initial users will be incomplete or simply bad, which is then an impediment to acquiring more users. So you’re stuck in not a vicious cycle, but a stagnant cycle.For entrepreneurs from a decade plus ago, data used to be readily available online. You could crawl it (ex. Airbnb crawling apartment listings from Craigslist), or subscribe to it via RSS feeds that publishers were widely distributing. Platforms like Facebook and Google were also generous with their data providing robust API access (remember all the social games that used Facebook’s Graph API?). There was once even an entire category of products called mashups predicated around this idea of shared data that was composable.Unfortunately for entrepreneurs today, data is no longer easily accessible. RSS has been largely abandoned, most sites prohibit crawling and will sue to prevent it, and platform APIs from Facebook and others have either been shut down entirely or severely limited. More than ever, the web is a collection of walled data gardens controlled by a handful of gatekeepers and for good reason: the data and the infrastructure running that data is incredibly valuable. Gartner last year reported that 80% of the global cloud infrastructure market is controlled by just 5 companies: Amazon, Microsoft, Alibaba, Google, and Huawei. It’s no coincidence that these are 5 of the most valuable technology companies in the world.The “haves” (companies with data) generally no longer want to share with the “have nots” (startups), which is why Web3 has become so attractive to entrepreneurs: you get to build with data in Web3. With blockchains, data is freely available to everyone. There are no gatekeepers to blockchain data because ownership is decentralized across tens of thousands of individuals or entities running their own shared copies of the data. You can spin up your own Ethereum node in a matter of minutes and download the entire blockchain onto about 1TB of storage. That would fit on many laptops so there’s not a lot of expensive infrastructure you need either.Because of blockchain ledgers, data access in Web3 is equal. Every startup has access to the same tokens, wallet addresses, transaction history, etc. and can build as complete a customer experience as any other company. We’re all “haves” in Web3, but is what we have useful? In other words, Web3 startups can now build new products that are filled from day one with all of this public blockchain data. But does this public blockchain data help make products that customers actually want to use?There has been one dominant customer value proposition for all Web3 startups this year. One powerful use case that all of their Web3 products — from games to art to fitness tracking — have been helping customers with: making money. During the last crypto bull market, every Web3 product became a speculative asset, and making money became the only scenario Web3 companies had to think about. When your product promises to generate positive returns for customers, it doesn’t have to promise much else.Take for example NFTs, which rocketed in popularity this year with millions of people owning them. In the bull market, NFT startups focused all their energy on helping those million users make money because the primary use case for NFTs was financial speculation. In their pursuit of driving up the price, most NFT product innovation centered around building reward systems for holding onto NFTs (i.e. staking) as well as creating walled gardens around NFT ownership (i.e. token gated content). But those features came at the expense of investments into arguably more interesting product explorations like being able to do things with NFTs and have them interact with other projects.Remember, NFTs are stored on blockchains where the data is freely accessible by anyone. Therefore, Web3 entrepreneurs should be building all sorts of novel, interoperable experiences with NFTs, just like Web2 entrepreneurs did with mashups. But because everyone was so obsessed with just the floor price, NFT projects built entire products designed to keep people from doing anything with their NFTs or having them interact with any other project. The pursuit of financial speculation above all else took data that was inherently open and made it closed.But now we’re in a downmarket where returns are negative. Web3 products can no longer rely on just the use case of making people money, and have to provide other value to earn the time and patronage of customers. We’re going to see a lot of entrepreneurial time and energy shift from innovating on financial speculation to pursuing new ideas for what you can do with data stored on shared ledgers besides making money. Will customers find these new scenarios valuable? Will products filled with public blockchain data be useful?Who knows for sure. But because entrepreneurs still want to build Web3 startups and investors want to fund these companies, we’re about to find out.","creation_date":"2022-12-04","tags":[],"author":"Eric Feng","category":null}