{"id":"aa5902a3-9358-4809-b070-642969218328","article_link":"https://cointelegraph.com/news/pi-network-10-million-kyc-users-token-still-not-tradeable","website_source":"Cointelegraph","article_type":"Tweet","summary":"The centralized app reached 10 million verified accounts, but critics contend it doesn’t benefit users.","title":"Pi Network reaches 10M KYC’d users, but token is still not tradeable","detailed_content":"The Pi Network app now has more than 10 million users who have verified their identities by completing the Know Your Customer (KYC) process, according to an April 16 announcement.\nThe Pi team has promised that it will launch a mainnet and that its tokens will become tradeable if a series of milestones are reached, including after 15 million users pass KYC. With 10 million accounts already verified, the KYC goal will be reached when another five million users complete verification.\nDespite this achievement, business analytics platform AIMultiple has claimed that Pi may bring “no value to users” since it “can not yet exchange their Pi coins with fiat currency on exchanges.” Pi Network was launched in 2019 as a centralized app. Users produce Pi tokens by pushing a button from within the app each day, and Pi cannot presently be transferred to other users through a wallet.\nPi Network official website. Source: Pi Network\nAccording to the announcement, 10 million users, called “Pioneers,” have completed identity verification through the app’s native identity verification solution, Pi KYC. This solution provides “a unique and proprietary approach that combines machine automation and crowdsourced, hyperlocal human verification to accomplish secure, accurate and efficient KYC,” the announcement claimed.\nNicolas Kokkalis, co-founder and head of technology for Pi, stated that the achievement “proves that the industry doesn’t need to depend on fiat services to succeed.” He also claimed that the new KYC system will “allow other Web3 services involving ownerships of assets to achieve their identity verification needs through Pi.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nIn December 2023, the team announced plans to launch an “Open Network” or mainnet in 2024 if certain conditions are met. These conditions include that 100 Pi apps must have been developed in addition to the 15 million users passing KYC. In addition, the team must have completed all “technology, product, business and legal” work needed to launch the network, and there must not be an “unfavorable external environment” that would hinder the network’s success. The team has not yet announced a specific date for mainnet launch.\nAIMultiple analyst Cem Dilmegani claimed that Pi Network will probably not benefit users, stating, “[w]e don’t expect anyone except the founders to benefit from PI Network in a significant way.” That’s because it “works like a direct selling or affiliate marketing system, promising future rewards to users for bringing in new users.” Dilmegani claimed that the affiliate marketing system is used to drive traffic to the app, which is, in turn, used to sell advertising for the benefit of the app’s developer. “Founders are already benefitting from the app,” Dilmegani stated, as they “launched optional video ads at launch to monetize the active user base.”\nDilmegani acknowledged that the Pi team could eventually launch a blockchain mainnet. However, he argued that this was unlikely because it would cause the token to rapidly fall in value as users sold into the market. “Then, the coin would not be valuable enough for people to keep on logging in to click,” which would potentially eliminate the value of the app to advertisers.\nCointelegraph reached out to the Pi team for comment. In response, a representative acknowledged that Pi had taken an “unconventional and novel” approach to blockchain development, such as providing “an intermediate Enclosed Network period of mainnet” instead of launching an open network immediately. This novel approach was taken to “enable utilities building on the platform and KYC processing of millions of our community members, to help the community further build a robust network for the benefit of the whole community before we launch the Open Network.”\nThe representative claimed that Pi has accomplished multiple goals since its launch, including the creation of “Pi mining mobile app, Pi Browser mobile app as the interface of the Web3 ecosystem, Node application, Testnet and Mainnet blockchains, Wallet, developer platform, a novel KYC solution” and more. The representative argued that not launching an open network right away was worth it, stating, “We believe anything worthwhile takes time and patience, and such components are essential for a healthy launch of the Open Network.” \nAccording to a March 3, 2021 report from Vietnamese media outlet vnExpress, Pi Network is the 22nd most downloaded iOS app in Vietnam. In May 2021, a Vietnamese news outlet reported that Pi had inadvertently leaked images of users’ identity cards to a hacker. However, a Pi Network spokesperson stated that the app handled KYC through a third-party and did not store this data on its servers, nor was there any evidence of a data leak.\nRelated: Vietnam government warns about crypto trading risks as Pi gains in popularity.\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-18","tags":["#Blockchain","#Ponzi Scheme","#Business","#Technology","#Digital Currency","#Tokens"],"author":"by Christopher Roark","category":null}