{"id":"ac14d554-916f-41f3-a576-5b655019390a","article_link":"https://cointelegraph.com/news/binance-executive-tracked-to-kenya-extradition-underway","website_source":"Cointelegraph","article_type":"News Article","summary":"The Nigerian government is collaborating with Interpol and Kenyan police to bring Arjarwalla back to Nigeria to face charges leveled against him.","title":"Binance executive tracked to Kenya, extradition underway","detailed_content":"The Nigerian Government has traced Binance executive Nadeem Arjarwalla to Kenya following his escape from custody and is currently taking steps to extradite him back to Nigeria. \nAccording to a report from local media outlet Punch, sources from within the office of the Nigerian presidency disclosed that Arjarwalla went into hiding once he arrived in Kenya.\nThe Nigerian government is collaborating with Interpol and Kenyan police to bring Arjarwalla back to Nigeria to face charges leveled against him.\nAnjarwalla arrived in Nigeria in February following claims that the exchange manipulated the country’s fiat currency, the Nigerian naira. Arjarwalla was detained alongside another Binance executive after a meeting with the Nigerian government.\nThe county’s Economic and Financial Crime Commission (EFCC) heads up the investigation and slammed the exchange and its two executives with five counts bordering on money laundering. However, Anjarwalla reportedly escaped custody on March 22 and was able to board a flight out of the Nigerian capital, Abuja.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAnjarwalla reportedly flew out of Abuja on a Middle East airline. However, it is unclear how he managed to board the international flight, as his United Kingdom passport, with which he entered Nigeria, remains in the custody of the Nigerian authorities.\nRelated: Nigeria’s government is blaming Binance for its own mismanagement\nAccording to an immigration official, the Binance executive fled Nigeria on a Kenyan passport, and authorities are now trying to determine how Anjarwalla acquired the passport, as he had no other travel documents while in custody.\nWhile Arjarwalla remains out of the country, the other Binance executive, Tigran Gambaryan, pleaded not guilty to the charges, with his wife and others calling for his release after several weeks in detention. Gambaryan’s wife has launched a petition to bring him back to the United States, which had 3,373 signatures at the time of publication. However, Gambaryan’s case has been adjourned until April 19.\nOn March 5, Binance announced that it intended to cease all naira transactions, effectively exiting the market. Binance also mentioned that Binance’s peer-to-peer platform delisted all naira trading pairs in late February.\nOn Feb. 27, the governor of the Central Bank of Nigeria argued that crypto exchanges in Nigeria were suspected of handling illicit transactions, also pointing to “suspicious flows” of funds at Binance.\nMagazine: SBF gets 25 years in prison, Fidelity eyes ETH staking, and Coinbase’s court loss: Hodler’s Digest, March 24-30\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-14","tags":["#Blockchain","#Law","#Nigeria","#Cryptocurrency Exchange","#Binance","#Regulation"],"author":"by Amaka Nwaokocha","category":null}