{"id":"acdcc45c-49b7-4bd1-a927-c0878301551f","article_link":"https://cointelegraph.com/news/bitcoin-halving-how-impact-btc-mining-costs","website_source":"Cointelegraph","article_type":"News Article","summary":"For miners to remain profitable and continue their mining operations, the BTC price must rise above $80,000 post-halving.","title":"Bitcoin needs to hold above $80,000 to keep mining profitable post-halving","detailed_content":"According to data from CryptoQuant CEO Ki Young Ju, the current cost of mining using Antminer S19 XPs will rise from $40,000 to $80,000 after the Bitcoin halving in mid-April. \nThe Bitcoin halving is a milestone event occurring every 210,000 blocks or roughly every four years. The halving event cuts the block reward earned by miners by half.\nApart from indirectly impacting the price of Bitcoin\nBTC\n$62,992\n, the halving event significantly impacts miner behavior, as mining costs double to earn the same amount of BTC.\nSource: Ki Young Ju\nAfter the May 2020 halving, the price for miners to continue mining profitably rose above $30,000, but the price of BTC also pumped to a new all-time high of $69,000 during the same cycle.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe average Bitcoin mining cost as of April 6 is $49,902, and the BTC price is above $70,000 at the time of writing. After the halving on April 20, average mining costs will rise above $80,000, and for miners to continue operating profitably, the BTC price must trade higher than that price.\nAverage Bitcoin mining cost. Source: MacroMicro\nHistorically, BTC prices have seen a multifold jump in price after the halving. Following the 2012 halving, the price of Bitcoin increased by around 9,000% to $1,162.\nAfter the 2016 halving, the price of Bitcoin increased by about 4,200% to $19,800, and after the 2020 halving, the price of Bitcoin increased by almost 683% to $69,000.\nRelated: Bitcoin halving will have to battle with ‘weak time of year’ — Coinbase\nThus, miners have remained profitable despite fears of going out of business after each halving. Halving events also make several mining machines obsolete, as they can’t compete with the high hashing power demand.\nAfter each halving, there comes a period when the BTC price remains below the miner’s profitable price. This period is marred by uncertainty and an increased selling of mining rigs, coupled with many small and lone miners often going out of business.\nHowever, as demand increases due to the declining market supply, the price picks up and often rises higher than the average mining costs for miners.\nMagazine: Creating ‘good’ AGI that won’t kill us all — Crypto’s Artificial Superintelligence Alliance\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-08","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Mining","#Business","#Bitcoin Mining","#Halving","#Bitcoin Halving"],"author":"by Prashant Jha","category":null}