{"id":"ae111bce-46bb-4f0a-b7af-22b455e4d03a","article_link":"https://cointelegraph.com/news/may-crypto-vesting-sui-pyth-network-unlock-tokens","website_source":"Cointelegraph","article_type":"News Article","summary":"Sui, Pyth Network, Avalanche, Arbitrum and Aptos are set to release vested crypto tokens in May, according to data tracker Token Unlocks.","title":"Vested crypto tokens worth over $3B to be unlocked in May","detailed_content":"Vested crypto assets worth over $3.1 billion will be released in May, with projects like Sui and Pyth Network unlocking over $1 billion in tokens each. \nCrypto vesting is done to promote continued dedication to a crypto project. Vested crypto tokens are locked to prohibit early investors or team members from hastily dumping their tokens and leaving the project.\nAmong the projects releasing vested crypto assets, layer-1 blockchain platform Sui will release the largest amount. The project is expected to unlock almost one billion tokens for its Series A and Series B investors, early contributors, the Mysten Labs treasury and its community reserve on May 31.\nThe tokens are worth around $1.15 billion at the time of writing.\nAllocation and schedule of Sui’s token distribution. Source: Token Unlocks\nMeanwhile, market data platform Pyth Network will release the second-largest amount in May. On May 20, the crypto project will unlock over two billion tokens for protocol development, ecosystem growth, publisher rewards and its private sale investors.\nWith Pyth Network’s (PYTH) token hovering at about $0.51 a piece, the tokens to be released are worth roughly $1.1 billion.\nRelated: Safe token drops 42% after enabling transfers\nApart from the two, projects like Avalanche (AVAX), Aptos (APT), Arbitrum (ARB), Starknet (STRK), Optimism (OP) and Immutable (IMX) will release a combined over $700 million in tokens.\nOn May 12, Aptos will release 11.3 million APT tokens worth $101 million to its foundation, community, core contributors and investors. On May 22, Avalanche will unlock 9.5 million AVAX, worth around $321 million, for its strategic partners, foundation, team and airdrop.\nLayer-2 blockchain network Arbitrum will release another $95 million in ARB tokens on May 16. The tokens are allocated to the project’s team and investors. On March 16, Arbitrum released $2.3 billion in tokens to its team and investors.\nIn addition, Starknet will unlock $84 million in tokens for its investors and early contributors on May 15, while Immutable will unlock $56 million in crypto tokens for ecosystem and project development on May 17.\nLayer-2 scaling solution Optimism will also unlock 24.1 million OP tokens on May 29. The tokens are worth about $70 million at current market prices. In May 2023, Optimism also released $587 million in OP tokens for its early contributors and investors.\nMagazine: Woman accused of $6B scam, China loophole for Hong Kong Bitcoin ETFs: Asia Express\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-03","tags":["#Blockchain","#Altcoin","#Tokens"],"author":"by Ezra Reguerra","category":null}