{"id":"af1f9a17-a8eb-410e-ab3f-ab849db2a98f","article_link":"https://www.wired.com/story/ces-2023-what-to-expect/","website_source":"Wired","article_type":"News Article","summary":"Technology's biggest trade show must go on, in spite of rough economic headwinds. These are the trends and innovations to keep an eye out for.","title":"Here’s What You Can Expect at CES 2023","detailed_content":"AFTER GOING REMOTE at the start of the Covid-19 pandemic, CES returned to Las Vegas in 2022 for a hybrid experience. Many companies opted to continue virtually attending the annual consumer trade show. Even though CES 2023 is not expected to recapture the entire grandeur of years past, the Consumer Technology Association (CTA) that hosts the event anticipates around 100,000 attendees.\nCES 2023 runs from January 5 to 8, and it still offers an option for remote attendance. In spite of an economy that’s worrisome for most CEOs and last year’s major flops (remember NFTs?), innovative hardware announcements will continue to make a splash on the showroom floor. From cohesive developments in the smart home category to peculiar designs for electric vehicles, here’s what you can expect at CES 2023.\nMore CES Coverage\nCES Liveblog\n9 Neat Things We've Seen So Far\n9 More Cool Things from CES 2023\nGadget Lab Podcast: CES 2023\nWIRED's Best of CES 2023\nInteroperability That Matters\nWhat if every aspect of your smart home actually worked together, even if the products were made by different companies? Matter, a new protocol from the Connectivity Standards Alliance, enables seamless interoperability between smart home devices from Apple, Amazon, Google, Samsung, and other manufacturers. Previous fragmentation held back the overall smart home experience, especially for consumers who wanted to mix and match gadgets. “The great promise of the smart home, literally since its inception, is that all the connected gadgets would work seamlessly together,” WIRED senior editor Michael Calore tells me. “That hasn’t been the case at all, so Matter feels like the next big step toward that promised interoperability.”\nFEATURED VIDEO\nChess Pro Answers Questions From Twitter\nLaunched last year in November, almost 300 products are already Matter-certified, with more announcements expected at CES 2023. “Matter makes smart home devices easier to buy for consumers as they can now choose the products that best fit their needs, regardless of what ecosystem, smartphone, app, or voice assistant they have,” writes Tobin Richardson, president and CEO of the Connectivity Standards Alliance, over email. Lights, locks, and thermostats are a few of the categories currently supported. The company is working to extend compatibility for additional smart home devices like cameras, appliances, and smoke detectors.\nIts unique approach to smart home security uses blockchain technology. Richardson writes, “Matter also raises the bar for security, using blockchain to validate and store credentials on the home network, encrypting messages (commands) between devices, enabling local control (no cloud), and including a pathway to easy security updates.” Safety experts point out cloud control as a major weakness when it comes to securing the data collected by your smart home.\nThe Metaverse Sobers Up\nAt last year’s CES, plans for a utopian metaverse where consumers would live, work, and play like never before were a primary focus. While not completely scrapped, the unquestioned excitement for the concept has dissipated due to billions of dollars lost, slow consumer adoption, and turbulent macroeconomic factors.\nAlthough the tenor of discussions is subdued, you can expect hardware innovations to continue for virtual, augmented, and mixed reality devices. WIRED reviews editor Julian Chokkattu anticipates a potential breakthrough moment for smart glasses as they become less cumbersome: “That's been one of the biggest barriers to the category, and I think we can expect some companies to showcase some strides in making components smaller and lighter, so that AR glasses don’t have to be thick, ugly, and heavy.”\nMighty Morphin’ Electric Vehicles \nDuring CES 2023, you can bank on seeing plenty of electric vehicles that don’t match the aesthetics of a typical car. “Since EVs don’t have gas tanks or traditional drivetrains, and since their battery packs can be shaped flat, the interior flooring doesn’t have all the bumps or humps that we’ve been dealing with for decades,” writes Calore. “That frees up the designers to think about the interior in new ways, from seating configurations to entertainment systems.” Although the more outlandish ideas will not be available anytime soon at your local dealer, the concept cars provide a small peek into what might be on the road five or 10 years in the future.\nA Saturation of Sustainability\nWhether it’s smartphone cases created from recycled materials or TV remotes that don’t need batteries, companies will continue to rethink their manufacturing process to placate a growing consumer demand for sustainable goods. “I’m seeing more and more companies highlight how a product is made and whether it uses recycled or sustainable materials, which seems to be the trajectory where everyone is heading,” writes Chokkattu.\nSustainability trends may even impact your at-home spa nights! Decadent bubble baths are out. Decadent (albeit short) showers are in. “My one weird observation is that when the pandemic started, everyone was really talking about baths, like Kohler’s ultra-luxurious Stillness Bath. Now, people are more concerned about sustainability and water usage, which means that I’m seeing a lot of ultra-luxurious, uh, showers,” shares WIRED senior associate reviews editor Adrienne So. “I’m going to go ahead and say that luxury showering is going to be a trend in 2023. Installing a low-flow showerhead that heats the air around it is good. Just don’t stay in the shower for 40 minutes.”\nGadgetry Galore\nOf course, CES this year will include a flurry of new product announcements, from a wireless TV that uses vacuum suction to stick on the wall to gaming laptops that are just a wee bit bigger. Chokkattu anticipates further developments for smartphone cameras, with improved data collection for applications like skin condition detection. \nSo still expects companies to launch health tracking devices specifically made for “fertile, pregnant, or immediately postpartum people,” despite the overturning of Roe v. Wade. She also foresees an impending proliferation of satellite messengers that are affordable and easy to use for anyone who wants to stay safe when they’re off the grid.\nMichael Calore, Julian Chokkattu, and Adrienne So contributed to this report.","creation_date":"2023-01-03","tags":["","CES","CONSUMER TECH","SMART HOME","METAVERSE","ELECTRIC VEHICLES","SUSTAINABILITY"],"author":"BY REECE ROGERS","category":null}