{"id":"af8658dd-2c52-480e-bc9e-eaa0bcaa161c","article_link":"https://medium.com/babylonchain-io/babylon-testnet-bbn-test-3-sunset-announcement-8a45e0017d1f","website_source":"Medium","article_type":"Blog Post","summary":"The Babylon team will sunset the current Bitcoin staking testnet at 12pm UTC, 16/05/2024 to clear the ground for the next testnet. Please…","title":"Babylon Testnet (bbn-test-3) Sunset Announcement","detailed_content":"The Babylon team will sunset the current Bitcoin staking testnet at 12pm UTC, 16/05/2024 to clear the ground for the next testnet. Please consider unbonding and withdrawing your Signet BTC for the next testnet.Launched on 28/02/2024, the current Bitcoin staking testnet (bbn-test-3) is the world’s first trustless and self-custodial Bitcoin staking system. Within 48 hours of launching, it attracted over 100K pioneer stakers. During its operation, the team has collected a lot of constructive feedback and suggestions from the community. The team has also identified several areas for improvements. All of them are invaluable to the development of the next testnet. We highly appreciate the participation and contributions from the community.Since this testnet has fulfilled its purpose, to clear the ground for the next one, we have decided to sunset it in two weeks. All operations will be fully functional until then, including staking, unbonding, and withdrawal of the Signet BTC.The next testnet will still use Bitcoin Signet, the most reliable Bitcoin test network. So, if you are interested in trying out the next testnet, you could consider unbonding and withdrawing your Signet BTC from the current testnet (Babylon — Staking Dashboard). We will also host a BTC Signet faucet on Discord. More details about the next testnet will be released later.Finally, we would like to emphasize that Signet BTC is only a simulated BTC for testing that can be used only for the Bitcoin Signet test network. It does not carry any monetary value, and it is not redeemable or tradable.Happy Bitcoin (un)staking!","creation_date":"2024-05-03","tags":["Bitcoin","Security","Technology","Staking","Blockchain"],"author":"Editor @ Babylon","category":null}