{"id":"b056f8e0-2f90-4862-839a-80a01bfe7272","article_link":"https://cointelegraph.com/news/ankr-bitcoin-liquid-staking-tokens-artificial-intelligence-ai-blockchain-talus","website_source":"Cointelegraph","article_type":"News Article","summary":"The Bitcoin LSTs can be used to power the Talus blockchain's virtual artificial intelligence assistants.","title":"Ankr expands Bitcoin liquid staking tokens to AI blockchain Talus","detailed_content":"Decentralized blockchain infrastructure provider Ankr will introduce Bitcoin\nBTC\n$63,046\nliquid staking tokens to AI-focused blockchain Talus starting May 1. \n“Bitcoin is not only the oldest blockchain but also continues to have the highest liquidity,” Ankr wrote. “Unfortunately, this liquidity has traditionally been trapped within the Bitcoin L1. With the aid of Ankr’s liquid staking service, Bitcoin can be staked through various Bitcoin restaking protocols. This enables users on the Bitcoin network to earn additional staking rewards while providing other ecosystems access to Bitcoin liquidity.”\nTo engage in Bitcoin decentralized finance (DeFi), users first delegate their BTC to an operator in a restaking protocol, which is then used as collateral for Ankr to create BTC liquid staking tokens (LSTs). In the case of Talus, the Bitcoin LSTs can be used to power the blockchain’s smart agents or AI assistants and their applications, such as “booking travel, making purchases online, and managing portfolios.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nSmart agents on Talus are also capable of bundling multilayer atomic swaps and executing them in one single transaction to provide security exploits such as flash loan attacks. “Ankr’s BTC liquid staking unlocks a massive amount of liquidity to ensure that smart agents on Talus can execute simultaneous DeFi transactions like atomic swaps seamlessly,” Talus commented. \nThe move comes after Ankr revealed its first Bitcoin liquid staking product in early March in conjunction with the Babylon protocol. The project allows users to “earn yields from their idle bitcoins in a secure way” by pledging their Bitcoin as collateral to mint LSTs that can be used to validate transactions on proof-of-stake blockchains. \nYields earned from the staked LSTs are then funneled back to users’ locked Bitcoin. Currently, the Babylon protocol is in its testnet phase, with a mainnet launch scheduled for later this year. \nDespite an ongoing market correction, the Bitcoin DeFi ecosystem has been thriving over the past year with the invention of new protocols such as Ordinals, Inscriptions, Atomicals and Runes.\nOne such project, omnichain yield-generating protocol SolvBTC, has accumulated a total value locked of $700 million from its yield-bearing Bitcoin minted on Arbitrum, Merlin and BNB Smart Chain. In a statement to Cointelegraph, SolvBTC claimed that the protocol recently surpassed 10,000 BTC staked and attracted “over 92,000 participants” shortly after its launch earlier this month. \nRelated: Bitcoin ecosystem reinvigorated by memecoins, new protocols\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-02","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#DeFi"],"author":"by Zhiyuan Sun","category":null}