{"id":"b266c71f-c6a5-4829-9c7f-f114c319e1c6","article_link":"https://cointelegraph.com/news/binance-ends-support-bitcoin-ordinals","website_source":"Cointelegraph","article_type":"News Article","summary":"Binance NFT marketplace will cease supporting trades and deposits of Bitcoin Ordinals on April 18.","title":"Binance ends support for Bitcoin Ordinals","detailed_content":"Binance is winding down support for Bitcoin\nBTC\n$62,992\nnonfungible tokens (NFTs) just a few months after introducing it to its marketplace. \nIn a blog post on April 4, Binance announced efforts “to streamline product offerings” on the Binance NFT marketplace. As part of these efforts, the exchange’s marketplace is ceasing support for trades and deposits of Bitcoin Ordinals on April 18.\n“Users are advised to withdraw their Bitcoin NFTs from the Binance NFT Marketplace via the Bitcoin network before 2024-05-18 00:00 (UTC).”\nIn addition, the Binance NFT marketplace will cease to offer airdrops, benefits, and utilities related to Bitcoin NFTs after April 10, 2024.\nBitcoin Ordinals, also known as Bitcoin NFTs, allow for the inscription of digital content like art, text, or video directly onto the Bitcoin blockchain. Data embedding has been part of the Bitcoin protocol for some time, but its popularity increased with the advent of Ordinals in late 2022. This protocol, created by Casey Rodarmor, allows unique digital arts to be directly embedded into Bitcoin transactions, similar to Ethereum’s nonfungible tokens (NFTs).\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nBinance specifically noted that users of Runestone NFT who meet the conditions for the airdrop are advised to withdraw their tokens by April 10.\n“Users are advised to withdraw these NFTs by 2024-04-10 10:00 (UTC), to ensure they still have the opportunity to receive any associated tokens, utilities, and benefits after 2024-04-10,” reads the blog post.\nThe decision came as a surprise to the community. Binance added support to Bitcoin NFTs just a year ago, in May 2023, extending its ecosystem to the Bitcoin network and promising more opportunities to collectors.\nThe high volume of NFT transactions has clogged the Bitcoin network several times since its inception, increasing fees and slowing processing times as more transactions are validated on-chain.\nAccording to data from Dune Analytics, the network has over 64 million inscriptions to date, and generated over $423 million in transaction fees.\nInscriptions on the Bitcoin network overtime. Source: Dune Analytics.\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-05","tags":["#Bitcoin","#Blockchain","#Marketplace","#Binance","#NFT"],"author":"by Ana Paula Pereira","category":null}