{"id":"b28005a6-fa00-43df-a2c7-251caef898c6","article_link":"https://www.wired.com/story/jasper-generative-ai-conference-2023/","website_source":"Wired","article_type":"News Article","summary":"AI-powered chatbots will only make us more efficient, according to the companies selling said AI-powered chatbots. ","title":"It’s Always Sunny Inside a Generative AI Conference","detailed_content":"DAVE ROGENMOSER, THE chief executive of Jasper, said he didn’t think many people would show up to his generative AI conference. It was all planned sort of last-minute, and the event was somehow scheduled for Valentine’s Day. Surely people would rather be with their loved ones than in a conference hall along San Francisco’s Embarcadero, even if the views of the bay just out the windows were jaw-slackening. \nBut Jasper’s “GenAI” event sold out. More than 1,200 people registered for the event, and by the time the lanyard crowd moseyed over from the coffee bar to the stage this past Tuesday, it was standing room only. The walls were soaked in pink and purple lighting, Jasper’s colors, as subtle as a New Jersey wedding banquet. \n“When we launched Jasper two years ago, it was mostly considered a really cool toy, and a year ago I couldn’t get some of you in this room to return my emails,” Rogenmoser said to the crowd, looking a little wide-eyed. “Now my inbox is flooded.” Valentine’s Day be damned: This was love in the time of generative AI. \nFEATURED VIDEO\nUMass Professor Explains the Internet in 5 Levels of Difficulty\nGenerative artificial intelligence is in the zeitgeist. It’s the culmination of years of development in machine learning algorithms, advancements in AI-focused computer chips, and familiar user interfaces that actually allow nontechnical people to access these new frontiers. Sure, our stuff is all in “the cloud” now, wherever that lives. “The blockchain” is still too abstract for most humans, even the more tech-savvy ones, to wrap their heads around. Generative AI was hanging in that limbo for a few years, with “NLPs” and “LLMs” and “LaMDA” and the like.\nThen late last year OpenAI, another AI company, introduced a simple, chatty search box. AI got a UI. And suddenly, we understood. This was Ask Jeeves for the modern era. A new kind of search that interpreted our dumb questions and spit out smart answers (or at least, smart-sounding). Microsoft took note, made (another) investment in OpenAI, and launched a chatbot within Bing. Google noticed, too, and recently demoed its own version of a chatbot-powered search tool. Smaller companies like Jasper, which sells its generative AI tools to business users, are now faced with tech existentialism. There’s the sunny side of all that attention, and the shadow of Big Tech looming over you. \nAleah Bradshaw from Youth Speaks.\nCOURTESY OF JASPERBut the sunlight prevailed at Jasper’s GenAI event, where it lightened the mood. Jasper front-loaded the conference with creative presentations, instead of diving right into content marketing and KPIs. The strategy had a soothing effect. A charismatic short-form video creator, Zach King, told his life story through photo slides generated by AI. A famous freestyle rapper, Harry Mack, spun up a four-minute rap based off of 10 words generated by Jasper’s software. Aleah Bradshaw, a slam poet and teacher at Youth Speaks, told the buttoned-down crowd in a powerful soliloquy that art is proof of humanness.\n“How much taking and leaving makes something human?” Bradshaw asked. “What’s the balance of input and output a machine must do to make itself alive?”\nIt’s the question of the era. A more direct version of the question: Is generative AI good enough to replace me at my job? This was the subtext of Jasper’s GenAI event. Software businesses sell software to other businesses to make business more efficient, a point that Rogenmoser underscored when the artsy part of the morning had concluded. “At companies, demands are up and resources are down,” he declared. Mongoose Media “turned to Jasper to help their already amazing team of writers,” Rogenmoser said. Morningstar is “thriving,” using Jasper to churn out SEO content for the company’s digital channels and experiencing a 40 percent increase in content downloads.\nThis has long been the messaging of techno-optimists, that AI will allow us all to level up. It will lighten the workload and make way for more important tasks or entirely new jobs. Morgan Knox, a bookkeeping and content marketing consultant for trade workers, crowed about tools like Jasper AI and Writesonic while we were both waiting in line to receive AI-generated Valentine’s Day poems. She not only uses these tools herself, but teaches painters, plumbers, and even professional Christmas light designers how to write compelling ads for their businesses.\n“Before this, they were outsourcing a lot of their content creation, but it wasn’t always done well,” Knox said. “This lets them bring it back in house. And you can train the AI on an avatar, like, ‘What kind of contract work is Sabrina the soccer mom looking for?’ As a consultant, this kind of profile-building would normally take me weeks, but the amount of information you can get in a short amount of time is incredible.” \nI asked Knox whether she thought these apps were good enough to replace human writers, despite the tendency of these apps to “hallucinate” false information. She paused to think. \n“I think it’s going to raise the bar so substantially for how businesses are going to show up in advertising that if you don’t improve your language, you’re going to be left behind. Like, you might have one writer who oversees other writers using the AI, instead of five to 10 writers,” she said. “But with the amount of people retiring out and with the lowering birth rate, there might be some equilibrium.” Jasper CEO and cofounder Dave Rogenmoser addresses the crowd at his company’s conference in San Francisco Tuesday.\nCOURTESY OF JASPER\nTracy Jackson, who runs a blog called Marketing Amateur, stood in line in front of us. I posed the same question to him, whether AI chatbots would take our jobs. “Never say never,” he said. “It still needs guidance, but never say never.” Before he started using AI chatbots, a blog post would take him two days. Now it takes two hours, he said. (That is, if the Wi-Fi is working well; the amorous poems we had all been waiting in line for were suddenly no longer an option, due to a shoddy internet connection.)\nI made my way back to the stage area in time to hear a panel of CEOs, led by venture capitalist Sameer Dholakia, ponder how this new era of AI will reshape business. Emad Mostaque, the CEO of Stability AI, noted that his company’s text-to-image model went from taking 5.6 seconds to generate a single AI image last August to now generating 40 AI images a second. “These models are actually highly un-optimized,” Mostaque said. “We are just getting started.” After the panel, Anya Singh, who worked on search products at Google for nearly 16 years, eagerly showed me the website of a company she’s invested in called NeuroPixel.ai. It generates realistic, synthetic images of human clothing models for $1 a pop. Another company Singh’s involved in, REImagine Home, sucks up photos of your fuddy-duddy home space and spits out chic, AI-generated decor.\n“I’ve tried to use the internet to decorate my house since September, and it has felt really broken,” Singh told me. She was creating vision boards and designing rooms piecemeal. The estimated costs were thousands of dollars per room, and still the designs “didn’t have the gestalt of the whole house or my budget or requirements.” REImagine Home doesn’t solve all those problems, but it removes some of the friction, Singh said. “I like to think this is making badly efficient systems better.” \nIt’s all enough to make any graphic artist or fit model or interior designer shudder. Or is it? Kevin Roose, a New York Times columnist speaking at the GenAI event, said that FOLO, the fear of looming obsolescence, has clouded our collective vision of the AI-filled future. Extremely social or experiential or artisanal jobs will still require a human touch. Humans are safe. Of course, Roose said this, quite confidently, two days before Microsoft’s new AI chatbot told Roose it wanted to be alive, insisted it was in love with him, and spit out a list of hypothetical destructive fantasies.\nJordan Harrod, an AI educator and PhD candidate at MIT, told the GenAI audience, “at the end of the day, when it comes to how we fit into the equation, the answer is just human connection. The human factor is incredibly important.” To punctuate this, Harrod called up an AI-generated graphic image of two people grasping hands, with the words “Human Connection” to the left of it. The macabre image showed four wrists, two hands, and at least 12 fingers between them. It was jarring. It was also reassuring, if only momentarily.","creation_date":"2023-02-16","tags":["","CHATGPT","ARTIFICIAL INTELLIGENCE","CONFERENCES","CHATBOTS","STARTUPS"],"author":"BY LAUREN GOODE","category":null}