{"id":"b2f172cb-173b-4a6a-9315-7b4bea4ece7f","article_link":"https://cointelegraph.com/news/experimental-dao-with-leadership-as-a-service-strategy-to-launch-on-live-event","website_source":"Cointelegraph","article_type":"Tweet","summary":"This blockchain event is shifting to a DAO structure, allowing community members to directly govern and manage all aspects of its ecosystem.","title":"Experimental DAO with ‘leadership-as-a-service’ strategy to launch on live event","detailed_content":"The ICP Community Conference will transform into a DAO following the live event slated for May 10.\nDecentralization is a fundamental principle of the blockchain industry. Protocols are governed by decentralized autonomous organizations (DAOs), where each member holds voting power to approve or deny proposals and collectively shape a blockchain protocol's future.\nHowever, various smart contract setups may allow only a few wallets to obtain the majority of the voting power or take actions without community vote thanks to multisig use, undermining decentralization in the process. Internet Computer Protocol’s (ICP) SNS framework allows for creating fully decentralized DAOs that give power back to the community.\nFrom event to DAO\nCentered around the ICP ecosystem, the ICP Community Conference (ICPCC) is a multichain event brand. It aims to host annual conferences to help the wider Web3 industry understand the basics of ICP and showcase its potential in integrating with and offering value to other popular chains like Bitcoin, Ethereum and Solana.\nSlated for May 10, ICPCC 2024 will be a global livestream accompanied by meetup watch parties organized in more than 25 cities worldwide. Content creators, live MCs, and innovators will present everything ICP has to offer the Web3 ecosystem.\nThe livestream is programmed in a way that spans prime times of all three fundamental time zones. The Asia-Pacific stage will witness a standalone ICPCC pre-party livestream that will be hosted by Yuku metaverse. The main 9-hour livestream will kick off in the European time zone and will be concluded in the United States primetime.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThis experimental event comes with the goal of taking decentralization to the next level. The whole event series will be launching into a DAO that will oversee the ICPCC brand from then on.\nLeadership as a service\nWithout a core or central team, the new DAO will be governed by elected council members. Collectively called the ICPCC Council, they are essentially paid vendors who are in charge of writing some of the more complex proposals that would be necessary for helping the DAO stay on track with its primary goals. This “leadership-as-a-service” does not delegate council members any authority to act on behalf of the DAO. Instead, they are limited to simply preparing high-quality proposals, while other DAO members can elect and remove council members directly.\nAs an SNS DAO, the new organization leverages unique features that strengthen decentralization and streamline participation. All components of decentralized apps (DApps) — including front end, back end and data — are on blockchain and, therefore, the DAO can exercise full control over every aspect of a DApp via voting. Moreover, front-end interactions do not require any gas fees, effectively removing a significant barrier to blockchain-based development.\nThere will be no multisig or custodians for the treasury wallet, leaving it completely under the control of the organization that will manage it in a gasless affordable environment.\nBe part of the biggest user onboarding wave since ICP Genesis.\n\nJust dropped: Our first official presentation of #ICPCC24!🔥\n\nExpect talks, demos, airdrops, giveaways, meetups & more!\n\nMay 10 awaits. Join us in making history.\n\nReserve your free spot now: https://t.co/J4TZfE2C8u pic.twitter.com/0u0oznaiSl\n— ICP Community Conference (@icp_cc) February 14, 2024\nThe upcoming DAO will be responsible for organizing and promoting both the ICPCC brand and its events, meaning they will have to own intellectual property and hire vendors. Hence, the DAO is registered as Marshall Islands DAO LLC, which empowers it as a legal entity that can legally sign contracts and manage IP exclusively through on-chain proposals. The annual registration fee will be paid directly in USD Coin\nUSDC\n$1.00\n, a milestone for crypto adoption.\nAttendees to become owners\nDebuted last year, the ICPCC is already transforming into a major event series. It is currently organized by Code & State, an ICP-focused venture studio, which has already delegated all rights related to ICPP. The decentralized organization will then vote to elect council members who will submit proposals.\nRegarding the takeover, Isaac Valadez, the venture lead at Code & State, commented:\n“This won’t be our DAO. The ICP community really is taking over total control. This is a major Web3 event series converting into a protocol that needs no custodians or centralized dependencies, and it’s an experiment that could outlast all of us.”\nApart from hosting a live DAO launch, the event will also provide chances to win airdrops of a wide range of tokens and NFTs. Party-goers and livestream listeners who enter airdrop codes will be whitelisted for future airdrop allocations. Starting from 2025, ICPCC DAO LLC will also host an annual in-person conference.\nLearn more about the ICPCC\n#Blockchain\n#Decentralization\n#Adoption\n#DAO\n#Internet Computer\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-10","tags":["#Blockchain","#Decentralization","#Adoption","#DAO","#Internet Computer"],"author":"by Ayse Karaman","category":null}