{"id":"b3a137b5-6d35-4ebd-85e8-6caf24bc56a5","article_link":"https://cointelegraph.com/news/tether-freeze-usdt-venezuela-oil-sanctions","website_source":"Cointelegraph","article_type":"News Article","summary":"USDT-issuer Tether says it will block payments made to OFAC-sanctioned entities after sources claim Venezuela’s state-run oil company is using USDT to facilitate oil exports.","title":"Tether vows to freeze assets after Venezuela looks to crypto to bypass oil sanctions","detailed_content":"USDT-issuer Tether says it will freeze addresses linked to sanctioned entities following a report that Venezuela’s state-run oil company was using the stablecoin to bypass sanctions.\nA spokesperson from Tether told Cointelegraph that the company remains committed to stopping payments linked to Office of Foreign Assets Control (OFAC) sanctioned entities:\n\"Tether respects the OFAC SDN list and is committed to working to ensure sanction addresses are frozen promptly.\"\nThis comes after an exclusive report from Reuters claimed that Venezuela’s state-run oil company, PDVSA, has been using cryptocurrencies to facilitate its crude oil and fuel exports. The country is facing new oil sanctions reimposed by the United States.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAccording to the report, the U.S. Treasury Department requires PDVSA customers and providers to wind down transactions by May 31 due to Venezuela’s failure to implement electoral reforms.\nRelated: Tether’s USDT stablecoin goes live on TON blockchain\nThe report, which cited anonymous sources, says the reimposed sanctions will make it harder for Venezuela to increase its oil product and export because companies will require U.S. authorizations to do business with the South American nation.\nThe sources claim that PDVSA has been moving its oil sales to Tether\nUSDT\n$1.00\nas a mitigating move to avoid funds being frozen in foreign bank accounts as new sanctions take effect.\nReports in 2023 linked cryptocurrency payments to a corruption scandal at PDVSA involving the discovery of $21 billion of unaccounted receivables for oil exports.\nRelated: Stablecoin competition crucial for regulatory engagement — Tether CEO\nReuters’ sources also claim that PDVSA has reworked its spot oil deals in 2024 to a contract model that requires prepayment for exported cargo in USDT. The report also suggests that the Venezuelan state-run oil firm requires new customers looking to conduct oil transactions to hold cryptocurrency in a digital wallet.\nIt’s understood that companies that looked to resume business with PDVSA following a six-month licensing approval from the U.S. in October 2023 had to resort to intermediaries to carry out the cryptocurrency payment requirements.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-23","tags":["#Blockchain","#Venezuela","#United States","#Tether","#Sanctions","#Oil and Gas","#Regulation"],"author":"by Gareth Jenkinson","category":null}