{"id":"b408c72a-5e34-418e-8bcc-2072ca4b8424","article_link":"https://cointelegraph.com/news/base-asset-tokenization-protocol-compromised","website_source":"Cointelegraph","article_type":"News Article","summary":"“Please remove your LP asap, we are very sorry for what happen,” wrote a Grand Base admin.","title":"Base asset tokenization protocol loses $1.7M due to private key leak","detailed_content":"Real-world asset tokenization protocol Grand Base (GB), which operates on Coinbase’s native layer-2 blockchain, has suffered $1.7 million in losses after a private key compromise.\n“On April 15 at 03:01:27 AM +UTC, an exploit happened on our contracts,” wrote an admin in the protocol’s Telegram chat. “For this specific reason, we urge all our community members to stay away from this contract as it is not safe anymore.”\nAccording to blockchain analytics firm PeckShield, the private key leak resulted in the theft of $1.7 million in tokens from its liquidity pools, which have since been swapped on-chain for Ether\nETH\n$3,030\nand sent to an external address. Simultaneously, the protocol’s native token lost 99% of its value in the past 24 hours due to the incident. \nThe Grand Base Telegram admin reiterated that “this token contract is NOT safe anymore and you should NOT swap or interact with it, stay safe. We will update you asap on the next step.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIn a follow-up analysis by blockchain analytics firm CertiK, it appears that the hacker gained control of Grand Base deployer contracts and subsequently minted an excess number of GB tokens without authorization before withdrawing them.\nA subsequent post from Grand Base staff claims that developers have “tracked all the wallets of the hacker” and are awaiting the next move. “We are in talks with CEXs [centralized exchanges] to freeze any funds that he might move,” Grand Base staff added.\nGrand Base’s description of the attack. Source: Telegram\nUsers were not impressed with the news of the Monday hack.\n“I’m very sorry for everyone involved here,” one user wrote in Grand Base’s Telegram chat. “Please, don’t lose more money here. Abandon this and don’t deposit a single dollar more into this thing, whatever happens.”\n“There are hidden loopholes in this contract,” another user alleged. “The total balance does not show any changes, and it belongs to hidden loopholes. Do you know if it was intentional by dev or not?” they added. Before the minting attack, Grand Base had a maximum GB token cap of 50 million.\nThe Grand Base tokenization protocol was launched less than five months ago. It allowed users to deposit collateral to mint real-world assets in the form of ERC-20 tokens and provided liquidity for the tokenized assets to earn rewards. \nRelated: This platform aims to make seamless RWA tokenization possible\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-15","tags":["#Blockchain","#Cryptocurrencies","#Hackers","#Base","#Hacks","#DeFi"],"author":"by Zhiyuan Sun","category":null}