{"id":"b45be0bd-277a-4f3d-b65c-995225ad7d8c","article_link":"https://cointelegraph.com/news/degen-chain-block-production-issue-for-two-days","website_source":"Cointelegraph","article_type":"News Article","summary":"Degen Chain says it’s working to resolve an issue that has seen its network stop producing blocks for more than two days.","title":"Layer-3 network Degen Chain hasn’t produced a block in 53 hours","detailed_content":"Ethereum layer 3 blockchain Degen Chain has failed to validate a transaction or produce a new block in over 53 hours rendering the network and its applications completely unusable. \nDegen Chain stalled at 8:15 pm UTC on May 12 — the last time the network produced a new block, according to its block explorer.\nIt is one of a few layer 3 blockchains that settle transactions on a layer-2 network. It uses the Ethereum layer 2 chain Base for settlement and the AnyTrust protocol for data availability functions.\nDegen Chain hasn’t produced a new block in over 50 hours. Source: Degen Chain\nIn a May 14 X post, the official Degen Chain account said it was working to resolve the downtime alongside its development partner — rollup infrastructure platform Conduit.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nConduit said the downtime could be traced back to an issue stemming from a “custom config change” that saw Degen Chain and gaming network Apex stop block production.\nSource: Degen Chain\nIt added nodes for Degen Chain are resynchronizing from its genesis block, the first block on the network.\n“We’re working with both teams and Offchain Labs to restore service and minimize impact to users,” Conduit wrote on X.\nDegen Chain said current estimates see the network resuming functionality sometime after the “resync” is conducted, currently slated for 1:00 pm UTC on May 15 (6:00 am PST on May 15).\nDegen Chain — originally developed for its native memecoin Degen (DEGEN) — also hosts a range of decentralized applications including DegenSwap, Mint Club and bridging service Relay bridge, all currently inoperable during the blockchain’s downtime.\nThe network’s native DEGEN token has fallen 24% from its seven-day top of $0.02 on May 13 to $0.015, per CoinGecko data.\nDEGEN’s seven-day chart shows a price drop since Degen Chain’s block stall. Source: CoinGecko\nLayer 3 blockchains have been a contentious topic in the crypto industry. Polygon CEO Marc Boiron last month argued that Layer 3's \"exist only to take value away from Ethereum and onto the [layer 2s] on which the L3s are built.”\nLayer 3 proponents, such as Arbitrum Foundation researcher Patrick McCorry, say they “seem like a no-brainer” as layer 2 networks acting as the settlement layer, making transactions cheaper.\nMagazine: Meme coins: Betrayal of crypto’s ideals… or its true purpose?\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-15","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Ethereum","#Memecoin"],"author":"by Tom Mitchelhill","category":null}