{"id":"b5152a34-2013-4100-80a9-5a0fe49fa125","article_link":"https://cointelegraph.com/news/solana-cypher-developer-gambling-scandal","website_source":"Cointelegraph","article_type":"News Article","summary":"The insider’s exploit went unnoticed for months, despite over 36 individual transactions.","title":"Solana-based Cypher developer confesses to gambling away $300K of user funds","detailed_content":"Pseudonymous Cypher Protocol developer Hoak has confessed to stealing nearly $300,000 worth of user funds and gambling them away.\nThe core developer of the Solana-based cross-margin decentralized exchange (DEX) admitted his wrongdoing in a public statement shared in a May 14 X post:\n“To address the elephant in the room, the allegations are true, I took the funds and gambled them away. I didn’t run away with it, nor did anyone else.”\nHoak’s confession follows a post on May 13 by the pseudonymous core contributor Cobra revealing the absence of funds.\nThe post went unnoticed until an unknown Discord group member shed light on experiencing fund withdrawal issues. According to Cobra:\n“Hoak has stolen funds from the cypher redemption contract. This happened over months via 36 withdraws… Deployer wallet (ETR8…) withdraws funds from Cypher’s redemption contract. Then conducts swaps and sends SOL, USDC, and USDT to an intermediary wallet (7sKM…). This intermediary wallet then sends funds to Binance.”\nA total of $317,000 in Solana’s (SOL), Tether (USDT) and USD Coin (USDC) was sent by the address associated with Hoak to the Binance exchange, according to on-chain data compiled by Cobra.\nSummary of stolen funds. Source: Cobra\nAt its peak, Hoak’s wallet held a total of $68,365 worth of digital assets on Dec. 7, 2023, before the funds were sent to Binance. The wallet held over $56,000 worth of digital assets on April 22 before over 99% of the assets were transferred in the next two days, CoinStats data shows.\nWallet “7sKM” related to Hoak. Source: CoinStats\nThe insider’s actions dealt Cypher Protocol another significant blow, which has been trying to stage a comeback. In August 2023, the DEX was hacked, resulting in the loss of over $1 million worth of digital assets.\nADVERTISEMENT\nMAY 15, 2024\nWeb3 travel app turns regional experiences into mintable NFTs\nTravelers around the world are ready to discover new destinations, and blockchain is here to help connect local attractions to global experiences.\nTraveling to a new region always conjures up delightful experiences and vivid memories. From visiting a historical ruin for the first time to randomly attending a local musician’s performance, the satisfying feeling of embracing the entire essence of what a touristic visit can offer keeps most of the travel industry operational and thriving.\nHowever, as the idea of a regional visit slowly turns into a plan and then into a calendar-filling endeavor, travelers soon realize that it’s way easier to dream about going to Nordic fjords than actually realizing the whole trip through scheduling, booking and transactions.\nDespite the decade-long digitization of the industry, travel systems are still operating at a surprisingly regional scale. Along with travel agencies, regional attractions and vendors like museums or event venues face limited market reach, often hindering them from marketing and selling their offerings to a global audience. Even when they score by selling tickets to a global customer group for a period of time, the lack of better customer insights makes it hard to reproduce the success.\nFor travelers, that translates to unnecessarily complicated booking processes that require ticketing from multiple apps and services. Furthermore, the potential risks associated with first-time visits beg for full traceability and transparency across the travel experience.\nNFT ticketing for the masses\nThe traditional “Web2” travel industry lacks a reliable solution to seamlessly integrate local offerings with global platforms, and blockchain is here to change that. VisitorApp, a blockchain-powered ticketing solution, showcases how Web3 can simplify regional travel for both travelers and industry participants.\nUsing Camino Network, the first blockchain designed for the needs of the travel industry, VisitorApp offers users a one-stop shop for discovering and purchasing local offerings directly from regional vendors. The VisitorApp team has spent four years to forge regional platforms and mobile apps for cities, regions and event organizers.\n  Read more\nRelated: Regulators are cracking down on financial privacy, but ZK-proofs can help\nIs gambling addiction a growing issue in the crypto space?\nWhile Hoak said that he expects no understanding for his actions, he blamed his rampant gambling addiction for the thefts:\n“I am also in no way, shape, or form attempting to victimise myself, but this is the culmination of what snowballed into a crippling gambling addiction and probably multiple other psychological factors that went by unchecked for too long.”\nCryptocurrency skeptics have often criticized the industry for being driven by casino-like behavior. United States Securities and Exchange Commission Chair Gary Gensler has famously compared the crypto ecosystem to “casinos in the Wild West,” with stablecoins functioning as the “poker chips.”\nAccording to a 2023 YouGov survey of over 4,200 adults in the United Kingdom, people gambling at “harmful levels” were nearly five times more likely to own cryptocurrencies than the general population, making them more likely to be negatively impacted by crypto trading.\nCrypto Survey 2023. Source: GamCare/YouGov\nRelated: GameStop tops Bitcoin's yearly gains in one day — Will GME spark an altcoin rally?\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Scams","#Decentralized Exchange","#DeFi"],"author":"by Zoltan Vardai","category":null}