{"id":"b66885bc-d7af-4ab8-907d-cbbbf069c598","article_link":"https://cointelegraph.com/news/synethix-kain-warwick-targets-mid-may-infinex-dex-launch","website_source":"Cointelegraph","article_type":"News Article","summary":"The Infinex protocol — dubbed the “UX Layer” of DeFi — is targeting a May 13 launch, pending a final vote from Infinex’s governing council.","title":"Synethix founder Kain Warwick targets mid-May launch for Infinex","detailed_content":"Synethix founder Kain Warwick has given a date for when the \"on-chain gateway\" Infinex is set to go live after several delays from its expected Q4 2022 launch. \nInfinex is targeting an official launch on May 13, Warwick said on May 2 at the ETH Global conference in Sydney, Australia.\nWarwick said May 13 would mark the launch of the Infinex Account, which is described by the Infinex team as a “collection of cross-chain smart contracts that can be controlled, secured and recovered” by way of Web2 authentication such as an email address login. \nSource: Infinex\nWarwick said that Infinex — which began as a decentralized front-end to access Synthetix liquidity and trading features — had evolved to become a more broad-scale platform aimed at reducing the barriers that prevented people from onboarding into decentralized finance (DeFi). \n“There’s no denying that within DeFi or just on-chain generally that there’s a lot more stuff to do. From a product perspective, or feature perspective, we have more features on-chain than you could really replicate in a centralized exchange.”\nDespite the greater diversity of applications on-chain, Warwick noted that crypto users were still utilizing centralized exchanges (CEXs) for crypto-related financial activity by a “significant margin.”\nHe explained that despite the flaws of CEXs being surfaced by events such as the collapse of the now-defunct crypto exchange FTX, crypto investors still didn’t make the leap into DeFi and instead opted to move to competitor exchanges, such as Binance and Coinbase.\nKain Warwick speaking at Pragma Sydney\nFor Warwick, the barriers preventing users from onboarding into DeFi couldn’t be traced back solely to products nor did it fall back to promises of increased safety. Instead, these onboarding issues were primarily rooted in issues with user experience.\nHe explained that Infinex would function as the “UX layer,” offering a more centralized exchange-like interface for users to engage with decentralized applications on a range of blockchain networks, including Ethereum, Base, Optimism, Polygon, Arbitrum and Solana.\n“It’s a really hard thing to do well, but I think we are at least getting pretty close on the Infinex side.”\nWarwick added that Infinex would utilize social passkeys to enable users to log in via Web2 applications — such as a Google account — and reduce the “friction” that typically accompanies a standard Web3 user experience.\n“The core component is you will have an account that you will own — it’s self-custodial — but you will be able to effectively login to that account via Web2,” Warwick said.\n“The starting point of [Infinex] you can have an account, and then you can deposit into that account to earn governance points,” said Warwick. He added there would be a points-farming game that would run for the month following the launch.\nOn March 13, Infinex suffered a security breach, which saw Warwick quickly take over as head of the project’s working group.\nSource: Infinex\nSpeaking to Cointelegraph, Warwick said the security vulnerability was “part of the reason” Infinex’s launch — initially targeted for Q4 2023 — was delayed.\nThe security vulnerability was a social engineering attack that saw hackers gain access to a password vault, Warwick said. From there, they were then able to get into the protocol’s DNS store and modify Infinex’s DNS.\nRelated: Synthetix DEX launch to join efforts reducing the ‘serious friction’ in DeFi\n“There were no funds at risk because we weren’t live — but just from learning a lesson sort of thing — even prior to being live, that just shouldn’t be able to happen,” he said.\n“I came in and I brought a couple of other people in and we burned all of the systems to the ground and rebuilt everything from scratch. It’s now one of the most secure environments I’ve ever worked in.”\nWarwick shared that the May 13 launch date is the proposed launch date that has been provided to Infinex’s governing DAO — the Infinex Council — which still needs to vote on-chain to approve the launch.\nHe said he was confident the council would approve — but the decision starts and ends with the council.\nFollowing Infinex’s launch, Warwick hopes to see it crack $50 million in total value locked and attract 10,000 genuine users within the first 30 days.\n“We have 200,000 people on the waitlist but a lot of those are sybils, airdrop farmers and bots. We do think there’s a solid 10,000 [genuine] users on that list,” he said.\n“If we have 5,000 to 10,000 people and 50 million of TVL — I feel like we’ve done something right.”\nWarwick added that if the current market cycle were to remain bullish, he expects to see “hundreds of thousands” of users join Infinex within a year of its launch.\nMagazine: Memecoins: Betrayal of crypto’s ideals… or its true purpose?\nAdditional reporting by Felix Ng.\nUpdate (9:12 am UTC): This article has been updated to include further details of the Infinex platform. \nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-02","tags":["#Blockchain","#Business","#DAO","#Derivatives","#Decentralized Exchange","#DeFi","#Synthetix"],"author":"by Tom Mitchelhill","category":null}