{"id":"b797e07e-16ba-4421-9c8d-e28ad602cd7a","article_link":"https://medium.com/api3/api3-launches-next-generation-oracle-stack-on-merlin-chain-e3ed78fc8a2a","website_source":"Medium","article_type":"Blog Post","summary":"Developers on Merlin can now utilize dAPIs and OEV Network to power their applications.","title":"API3 Launches Next-Generation Oracle Stack on Merlin Chain","detailed_content":"We are excited to announce that API3’s Oracle Stack is available on Merlin Chain, giving developers access to decentralized data feeds (dAPIs) and the soon to be launched OEV Network to recapture protocol MEV due to oracle updates. Developers on Merlin Chain can now access decentralized data feeds powered by first-party oracle nodes, which are operated directly by the data providers.With the launch of OEV Network later this month, protocols using API3’s decentralized data feeds on Merlin Chain will have a vertically integrated solution for recapturing MEV. Rather than protocols leaking value to searchers and block builders, the proceeds from oracle update auctions are programmatically returned to the dApp where the value originated, leading to better execution for users and better protocol performance for dApps.Merlin Chain is a Bitcoin Layer 2 network that leverages the power of zk-technology to enhance the capabilities and functionalities of Bitcoin. Merlin Chain integrates a decentralized oracle network, data availability, and onchain BTC fraud proof modules to provide a secure and efficient network that simplifies Bitcoin adoption and fuels growth. With a core mission to “Make Bitcoin Fun Again,” Merlin Chain aims to expand the innovation from Bitcoin’s Layer 1 to its Layer 2 by supporting native assets, protocols, and products. The network utilizes zero-knowledge proofs, which are submitted to Bitcoin for verification, and enables challengers to present fraud proofs to leverage Bitcoin’s consensus mechanism for dispute resolution. This ensures the security and economic efficiency of the network, promoting a high growth ecosystem for users.The infrastructure of Merlin Chain is built on Polygon’s ZK-technology and is supplemented by Celestia’s decentralized oracle network for enhanced data availability. It also incorporates Lumoz’s decentralized computing power for zk-proof computations. Merlin Chain not only inherits the robust security of Bitcoin but also introduces significant scalability through batch processing at the Layer 2 level. As an EVM compatible L2, it supports the majority of existing smart contracts and developer tools, ensuring seamless interoperability across different platforms. Additionally, the use of zk-proofs, combined with zkSNARKs, minimizes space consumption on Layer 1, which significantly reduces transaction costs while achieving high performance through rapid network finality and scalable recursive STARK solutions.Developers looking to utilize dAPIs on Merlin Chain can visit the API3 Market. The API3 Market provides an easy way to browse, access, and manage a wide variety of data feeds, including crypto, forex, equities, and commodities. With the launch of OEV Network, developers will simply be able to read any data feed, enable OEV Network, and start earning.API3’s first-party oracle architecture maintains data onchain directly from the data providers. This decentralized and verifiable design eliminates rent-seeking middlemen and offers a more secure and efficient method for bringing data onchain.One of the key benefits of dAPIs is the ease of use for dApps and chains requiring oracle services. Rather than having to manage their own infrastructure, dApps can simply read data that is natively maintained on Merlin Chain. This solution makes it easy for dApps to quickly and easily migrate to Merlin Chain from other EVM-compatible chains, allowing for the rapid adoption and scaling of DeFi ecosystems.API3’s first-party oracle architecture leverages data directly from the source. The oracle nodes are operated by the data providers themselves, bringing cryptographically signed data onto the blockchain. This allows dAPIs to be verified down to the API parameters and aligns with core principles of the blockchain ethos of transparency and onchain verification.Protocols like Aave, Compound, and various DEXes all rely on data maintained directly on the consumer chain. API3 addresses this need by maintaining data on the native-chain in a verifiable and decentralized way. With the introduction of dAPIs on Merlin Chain, developers gain direct access to a wide assortment of real-world data, including crypto, forex, equities, and commodities straight from the source.DeFi protocols that rely on oracles leak a lot of MEV. For protocols like lending dApps, this amounts to millions of dollars a year.OEV Network creates an efficient market where oracle service providers and searchers come together to combat the negative impact of MEV through specialized order-flow auctions. With OEV Network, searchers don’t need to wait for the price to update onchain, they can trigger the price update when it is most valuable. As an application-specific solution, it captures all the MEV created at the protocol level due to oracle updates and gives it back to the dApp that generated the value.OEV Network gives every lending and borrowing protocol on Merlin Chain a built-in MEV solution by improving upon critical inefficiencies in the current oracle design space. By leveraging the security of a zk-rollup to create an efficient market for oracle updates, it not only improves the health of lending and borrowing dApps but also allows them to capture a multi-million dollar opportunity.API3’s oracle stack is easy to implement and offers a flexible, scalable solution for developers building on Merlin Chain. For those new to dAPIs, a developer Getting Started with dAPIs Video is available to guide you through the API3 Market.For more information about dAPIs or OEV Network, visit our website, follow us on Twitter, or explore the technical documentation.","creation_date":null,"tags":["Web3","Blockchain","Api3 Ecosystem","Oracle","Data"],"author":"API3","category":null}