{"id":"b8242cb1-c851-4f89-96be-2f2d0ae3a74f","article_link":"https://cointelegraph.com/news/uniswap-ceo-weighs-in-on-ethical-token-distribution","website_source":"Cointelegraph","article_type":"News Article","summary":"Hayden Adams strongly disapproved of low float tokens, considering them malicious and his biggest pet peeve.","title":"Uniswap CEO weighs in on ethical token distribution","detailed_content":"Hayden Adams, Uniswap’s founder and CEO, has outlined his take on ethical considerations for effective token distribution amid concerns about the transparency and fairness of token distribution on EigenLayer.\nIn an X post, Adams emphasized that he was discussing tokens, not points. He then criticized the practice of hyping up and creating ambiguity during token distribution to inflate engagement metrics.\nAdams cautioned against public speculation about future developments.\nSource:  Hayden Adams\nUsers who felt left out of the recently announced EigenLayer airdrop lashed out at the restaking protocol’s Monday announcement, highlighting its nontransferable token structure, aggressive geo-restrictions and an apparently short snapshot period.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe Uniswap executive strongly disapproved of low float tokens, considering them malicious and his biggest pet peeve. He believes that projects can effectively distribute tokens without relying on exchanges or market makers. He said the ideal approach is to distribute tokens openly, enabling genuine price discovery on decentralized exchanges.\nAdams also criticized the practice of creating an excessively high token supply to exploit people’s unit bias, stating that such an approach is unnecessary. Additionally, Adams advised token distributors against being too conservative, encouraging them to make a substantial portion of their tokens available for distribution.\nRelated: SEC targets Uniswap Labs, raising concerns over open-source code liability\nAdams cautioned against inadequate token distribution and emphasized the importance of not revealing token prices during or before distribution. He said any attempt to do so, whether through influencers or marketing firms, would raise suspicions about the project.\nAccording to Adams, this approach suggests that the issuer is prioritizing quick wealth over building real value. Token issuers and distributors are encouraged to maintain a straightforward distribution process, resonating with concerns raised due to recent industry rug pulls.\nFinally, the Uniswap executive urged token issuers to be thoughtful and transparent about their projects. He emphasized the importance of releasing a token they can be proud of and stand behind to avoid ridicule within the crypto community.\nEigenLayer, an Ethereum restaking protocol, distributed an additional 28 million EIGEN tokens to over 280,000 wallets following its initial airdrop, prompted by user concerns over the program’s restrictions.\nMagazine: The real risks to Ethena’s stablecoin model (are not the ones you think)\nExchange or buy UNI\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-05","tags":["#Blockchain","#Cryptocurrencies","#Technology","#Tokens","#Web3"],"author":"by Amaka Nwaokocha","category":null}