{"id":"b855533b-1520-4775-b8f5-8e1a1aae13cd","article_link":"https://medium.com/neo-smart-economy/introducing-melkbot-to-neos-discord-server-0b4c3d0ae27b","website_source":"Medium","article_type":"Blog Post","summary":"Today, we’re excited to announce that we’ve officially incorporated MelkBot into Neo’s Discord community. With this learn-to-earn style…","title":"Introducing MelkBot to Neo’s Discord Server","detailed_content":"Today, we’re excited to announce that we’ve officially incorporated MelkBot into Neo’s Discord community. With this learn-to-earn style Discord bot, we aim to help both new and seasoned users learn the basics of the Neo blockchain.MelkBot, standing for “Meaningful Experiences for Learning and Knowledge,” is an interactive Discord bot designed for Web3 education. It was created by MELKDAO, a team based in Brazil that has also created educational trails for Polygon and Solana. Its learn-to-earn model aims to incentivize users to learn Web3 technologies in a fun and interactive manner.In June 2023, MELKDAO applied for a grant on GrantShares to build a Neo track into its program and was awarded 6,670 GAS, with four GrantShares members voting in favor of the proposal.The following January, a tutorial for learning to use the Neo blockchain on MelkBot was delivered, and now it’s officially available on the Neo Discord server.To celebrate this integration, we have prepared an interactive community activity, offering users the chance to win a share of 50 GAS tokens by completing missions via MelkBot. To participate, join Neo’s Discord server ➡️ https://discord.gg/neosmarteconomy ⬅️ and find out the details. We hope you enjoy using MelkBot and good luck in the campaign!Founded in 2014, Neo is an open-source, community-driven blockchain platform designed to welcome developers into the Smart Economy. By enabling developers to digitize and automate the management of assets through smart contracts, Neo is built to realize the optimized digital world of the future. As the most developer-friendly blockchain, Neo meets developers where they are by integrating seamlessly with the world’s most widely used languages and tools and providing the most feature-complete blockchain platform for building full-stack decentralized applications. With native support for powerful infrastructure including decentralized storage, oracles, and domain name service, Neo is the ideal foundation for developers to build the next generation Internet.Official Website | Twitter | Discord | Telegram | Facebook | Reddit | YouTube","creation_date":null,"tags":["Blockchain","Community"],"author":"Neo","category":null}