{"id":"b9015c23-8604-4c51-885a-452a876c216d","article_link":"https://cointelegraph.com/news/ethereum-liquid-staking-protocol-puffer-finance-raises-18-million-series-a","website_source":"Cointelegraph","article_type":"News Article","summary":"The project's TVL surpassed $1 billion within one month of its testnet launch.","title":"Ethereum liquid staking protocol Puffer Finance raises $18M in Series A","detailed_content":"Puffer Finance, a liquid staking project built on Ethereum restaking protocol Eigenlayer, has secured $18 million in a Series A funding round to launch its mainnet.\nAccording to the April 16 announcement, the round was led by Brevan Howard Digital and Electric Capital, with key investments from Coinbase Ventures, Kraken Ventures, Lemniscap, Franklin Templeton, Avon Ventures (a VC fund affiliated with Fidelity Investments' parent firm), Mechanism, Lightspeed Faction, Consensys, Animoca, GSR and other angel investors.\nAccording to data from DefiLlama, shortly after its early test phase in February, Puffer Finance surpassed a total value locked (TVL) of $1.2 billion. To date, the protocol has raised a total of $23.5 million in venture capital funding.\nPuffer Finance’s TVL since launch. Source: DefiLlama\n“Following this round, Puffer secured a strategic investment from Binance Labs, enhancing its position within the Liquid Restaking ecosystem,” Puffer Finance said in its announcement, alluding to “technological advancements” in tandem with its mainnet launch.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nPuffer Finance’s technology allows Ethereum validators to reduce their capital to just 1 Ether\nETH\n$3,030\n, down from the 32 ETH required for individual stakers. In addition, users who stake Ether via Puffer receive Puffer liquid restaking tokens (nLRTs), which can then be used to farm yields in other decentralized finance protocols simultaneously with their Ethereum staking rewards.\nThe process, known as liquid staking, has been long practiced by other blockchains, such as Cosmos, and has only recently moved to Ethereum after the Merge upgrade that shifted the network to proof-of-stake. “We aim to significantly reduce the barriers for home validators to participate, while delivering the most advanced liquid restaking protocol,” Amir Forouzani, core contributor at Puffer Labs, said in a press statement. \nOn March 6, Cointelegraph reported that EigenLayer shot passed decentralized finance lending protocol Aave in TVL, with $10.4 billion worth of crypto committed to the protocol after temporarily removing a cap on how much users could stake.\nDune Analytics data shows EigenLayer has over 107,900 unique depositors, with DefiLlama stats showing that 74% of staked tokens are Wrapped Ether (wETH) and Lido Staked Eth (stETH). Liquid staking protocols are currently the largest DeFi protocol category with nearly $55 billion in locked value across about 160 protocols — buoyed mainly by Lido, the largest protocol by locked value at $35 billion.\nRelated: Restaking protocol EigenLayer partially launches on Ethereum mainnet\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-16","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Business","#Funding","#Venture Capital","#Adoption","#Staking"],"author":"by Zhiyuan Sun","category":null}