{"id":"b9364e05-8780-40cc-85a3-866d03330240","article_link":"https://cointelegraph.com/news/charles-hoskinson-highlights-major-upgrades-cardano-amid-recent-criticism","website_source":"Cointelegraph","article_type":"News Article","summary":"The Cardano founder is fighting FUD again following a BitBoy video claiming ADA is dead.","title":"Charles Hoskinson points to 2 major upgrades amid Cardano ‘dunking’","detailed_content":"Cardano founder Charles Hoskinson has his eye on two major upgrades — at least one of which is slated for this year — for the Cardano network amid a recent flood of criticism over its native token and ecosystem.\n“We are holding all the cards as an ecosystem,” Hoskinson said in an April 7 post on X in response to recent pessimism about the blockchain.\n“We have the best path for scalability, governance, and innovation. We also have the best community,” he added in response to “all the dunking on Cardano.”\nHoskinson’s optimism was fueled mainly by the upcoming Chang hard fork, seen as one of the network’s biggest hard forks since the 2022 Vasil upgrade and slated for the second quarter of this year.\nCardano governance roles. Source: Essential Cardano\nChang is the first hard fork of the Voltaire era of Cardano’s roadmap, which will introduce the concept of community-run governance to the blockchain by enabling on-chain community consensus and allowing Cardano’s ADA\nADA\n$0.46\nholders to use their tokens to vote on proposals.\nIt’s seen as enabling the network to become fully decentralized by introducing community governance.\n“Chang is coming soon as measured by progress on SanchoNet.”\nThroughout the rest of this year, the transition will introduce Delegate Representatives (DReps), involve a Cardano Constitution Convention event, and a Cardano community vote to ratify the first draft of the Cardano Constitution.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“Ouroboros Leios is the biggest step forward toward solving the blockchain trilemma ever,” Hoskinson added.\nOuroboros Leios is a new version of the proof-of-stake consensus model designed to increase throughput, scalability and transaction speed on Cardano while maintaining the current level of decentralization.\nHoskinson’s comments came in response to an April 7 video from Ben Armstrong — aka BitBoy — who was contemplating whether Cardano was “dead.”\nHe compared Cardano to Solana, Sui and Toncoin, which were “blowing up” and “killing it” in terms of users, activity and price action, whereas the numbers for Cardano were “not fantastic.”\nSource: Charles Hoskinson\nHoskinson argued that the crypto industry has a problem with short-term narratives.\n“The problem with our industry is that we let short-term narratives and carnival barkers dominate the conversation. AI has the same issue.”\nRelated: Cardano refutes rumors it abandoned its scaling project Hydra\n“Most hate for Cardano is emotional,” commented zenGate Global founder and CEO Daniel Friedman on X on April 8. “My decision to build on Cardano and Ergo was a business and architecture decision. Not an emotional tantrum,” he added.\nCrypto Capital Venture founder and Cardano advocate Dan Gambardello suggested that the FUD was because ADA’s price was not back above $1.\n“Even Cardano people who say they don’t care about price, care about price. If price was up, you wouldn’t see these comments.”\nADA prices have been lackluster this year and have actually dipped slightly since the beginning of 2024.\nThe coin was trading down 10% over the past seven days at $0.584 at the time of writing. It is also down 81% from its September 2021 all-time high of $3.09, according to CoinGecko.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExchange or buy ADA\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-08","tags":["#Blockchain","#Altcoin","#Hard Fork","#Charles Hoskinson","#Cardano"],"author":"by Martin Young","category":null}