{"id":"b957647b-6331-4a8b-a020-7d9b7b0f8b38","article_link":"https://cointelegraph.com/news/trader-loses-68-million-address-poisoning-scam","website_source":"Cointelegraph","article_type":"News Article","summary":"The attack caused the unknown trader to lose over 97% of their crypto holdings.","title":"Trader loses $68M in address poisoning scam","detailed_content":"An unknown trader lost $68 million worth of Wrapped Bitcoin (WBTC) in a single transaction in an address-poisoning scam.\nThe $68 million theft was first revealed by on-chain security firm Cyvers in a May 3 X post:\n“Are we mistaken, or has someone truly lost $68 million worth of $WBTC? Our system has detected another address falling victim to address poisoning, losing 1,155 $WBTC.”\nAddress poisoning attack. Source: Cyvers Alerts\nThe victim, wallet “0x1E,” has lost over 97% of its total assets, worth over $67.8 million, according to CoinStats.\nWallet “0x1E.” Source: CoinStats\nAddress poisoning, also known as address spoofing, aims to capitalize on traders’ carelessness and haste when making transactions. It involves tricking victims into sending their digital assets to fraudulent addresses belonging to scammers.\nRelated: ZKasino scam suspect arrested, $12.2M seized by Dutch authorities\nScams fall to $25 million historic low in April\nScams continue plaguing the mainstream trust in the crypto industry. In April, investors lost at least $33 million of digital assets in the fraud case surrounding the ZKasino gambling platform. Dutch authorities arrested a suspect related to the ZKasino scam on April 29.\nDespite the ZKasino incident, April only saw $25.7 million worth of cryptocurrency lost to scams and hacks. This marks the lowest historical figure since 2021 when on-chain intelligence firm CertiK started tracking the data.\nAccording to the report, losses from hacks, exploits and scams were down 141% over the previous month. The decline is mostly due to the lack of private key compromises. April only saw three private key leaks, whereas March saw over 11 attacks via private key compromises.\nSource: CertiK\nHowever, CertiK’s figures don’t include the $33 million ZKasino scam. Although the report considers the project to be in the middle of a “controversy,” it has not yet labeled it a scam.\nOn April 22, ZKasino transferred all 10,515 Ether (ETH) deposited by investors into the Lido staking protocol, intensifying investor concerns. CertiK’s report said the firm would update its figures if ZKasino was confirmed to be a malicious actor.\nRelated: Lazarus Group laundered over $200M in hacked crypto since 2020\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-03","tags":["#Blockchain","#Cryptocurrencies","#Bitcoin Scams","#Scams"],"author":"by Zoltan Vardai","category":null}