{"id":"baa8fda2-c651-415a-8b26-6b07f960f4b3","article_link":"https://medium.com/@nr_26346/going-back-to-the-roots-a-crypto-2022-sum-up-and-thoughts-for-the-future-6113e6bfa572","website_source":"Medium","article_type":"Blog Post","summary":"In 1981, Odyssey released “Going back to my roots”. I’m literally sitting here and listening to it, while trying to figure out how to sum…","title":"Going back to the roots. A Crypto 2022 sum up and thoughts for the future","detailed_content":"In 1981, Odyssey released “Going back to my roots”. I’m literally sitting here and listening to it, while trying to figure out how to sum up a year that has shaken the crypto industry. Every time the industry is shaken, it gives us the opportunity to reiterate why we chose to come here in the first place, what we believe in, and the purpose of what we are trying to accomplish as an industry. Personally, I believe crypto and blockchain is the exchange of value, just like the internet became the exchange of information, and I believe their journey share many similarities. Bitcoin was created out of the 2008 financial crisis as a response to the broken Fiat experiment, which has been running for 51 years now. Bitcoin was created with the belief that the financial system should be better. However, 2022 showed us the ugly truth of when centralized entities are mismanaged and why Satoshi Nakamoto, the creator of the Bitcoin Network, was smarter than we thought (and we thought he was pretty damn smart in the first place). The industry suffers as a result of becoming the very thing it was created as a response to. It’s time to slam on the brakes, evaluate, and go back to the roots.The year of withdrawal halts — 3AC, Celcius, Voyager and FTX2022 will be remembered as the year of “withdrawal halts”. It all started in May with the crash of Terra LUNA, an algorithmic stablecoin, that turned out to be poorly designed and ultimately led to a $60 billion wipe-out of the industry. The contagion quickly spread as a wild fire, ultimately bringing down financial corporations like 3AC, Celsius and Voyager as the biggest entities to suffer from the crash. As a result, the market naturally started to decline in value, removing around $1 trillion of its market-cap in a month. Despite the turmoil, it seemed like we were fine for a couple of months. The market stabilized and sentiments were strong. Remember, these scenarios happen in tech, in finance and even in any industry over time. It’s a part of the maturing process. After all, a revolution of this size takes decades to emphasize. Just look at the impact of the internet that is celebrating its 50th year anniversary next year with the introduction of the TCP/IP. However, on Nov 9, all hell broke loose because the “safe, regulated way to buy and sell Bitcoin and other digital assets” declared themselves insolvent, and not just by a bit, but to a degree that makes Enron look like a puppy. Funds at FTX were not safe! At first, it seemed confusing that a spot exchange could be “insolvent”? How can a spot exchange that takes in user deposits and lets those users trade and have fun buying shitcoins, and when done, let those users withdraw what’s left - how can that lead to insolvency? It’s not like FTX took users’ funds and operated like some sort of a fractional reserve bank in which they could use funds to leverage the shit off the roof.Except, that’s exactly what they did. Or should I say he. SBF. Sam Bankmann-Fried. FTX took billions of dollars in customer deposits and gave it to its sister company, Alameda Research (the trading company of SBF’s former empire). Alameda then went broke on speculative bets with money they didn’t own, couldn’t pay back the money, and it all fell apart after Binance announced it was selling its pot of FTT tokens due to discrepancies between CZ (CEO, Binance) and SBF. The tweet sparked a massive sell-off in FTT tokens, which, oh by the way, constituted a large portion of the entire FTX balance sheet. Yup, you read it correctly; FTX was largely backed by its own token which it had leveraged to a degree never seen before. If it sounds familiar, this is exactly what happened to Celcius earlier this year, loaning/leveraging user deposits for speculative bets without disclosing it to their customers. It’s bad and it’s fraudulent and it resonates the main problem that currently shakes the industry to unprecedented scales. However, let me be very clear! 3AC, Celcius, Voyager and FTX all share the same common issue, which is they were all large centralized entities, ruled by bad actors, in which greed and negligence led to their downfall. None of this can be attributed to either Bitcoin nor the blockchain technology itself as a revolutionary innovation. This was systemic risk, build around the technology that failed or, as the new CEO of FTX, John Ray, puts it, “This is really old-fashioned embezzlement. This is just taking money from customers and using it for your own purpose, not sophisticated at all” — Wall Street Journal 13/12–22”.Last time I checked, miners on the Bitcoin network were still adding blocks to the chain, and validators on Ethereum were still actively running transactions as nothing happened. Now, as the end of 2022 is approaching, it’s time to leave false narratives as a thing of the past. The collapse of these heavily centralized entities is not an indictment on crypto. Actually, it’s quite the opposite; “It’s a concrete demonstration of the need for more, better decentralized, trust-free technology” — Gavin Wood, 25/11–22, Twitter.Centralization failure led to the downfall of all these companies. Blockchain, with its ability to enable decentralization, is the solution, not the problem.Regulation is coming!Never ever have I been this professionally angry with a person as I am with SBF. FTX and SBF had become some sort of white knight for the industry, being the responsible and compliant guy in the room. SBF had ties to the congress of the U.S., given the opportunity to speak with congress and various regulatory bodies such as the SEC and CFTC on future crypto regulation. In other words, he was the man that could move the needle in DC. Now, SBF faces up to115 years in prison if convicted of all charges against him. I’m angry because his greed and negligence has set back the industry, adding fuel to the fire and ultimately made it harder for other honest entrepreneurs and well-managed companies in the space.Obviously, regulators are pissed! They were fooled by a guy in a t-shirt and flip-flops and they are now showing up to the party with a sledge hammer and a message burned into the head of the hammer pointing to the industry. It feels like we did this to ourselves. We gave the regulators a chance to come hard at us. But let’s be clear about something. These examples wouldn’t necessarily have been solved with regulation. These things happen in traditional finance as well, which is heavy regulated. Just look back at the financial crisis in 2008. The only difference here is that in crypto, capitalism rules without any backstop funded by taxpayers to rescue what’s dying. The sad thing in the cases of Terra Luna, FTX etc. is that a lot of people lost their savings, and for them, I feel sorry and hope they get back on their feet.In my view, regulators are far from innocent in what we see in the crypto industry and especially the FTX case. It feels like we, as an industry, are the bad actors, but what about the U.S. government? In the case of the federal reserve, it has doubled its balance sheet during the Covid-19 crisis via quantitative easing, from $4 to $8 trillion. This is what both FTX and Terra Luna tried to do. To print their own private currencies, to prop up their asset-books and valuations, however, they were not sovereign. They could not force anyone to use their currencies under the threat of violence. The state on the other hand can, and the bill always ends up in the hands of the people, either through taxes or inflation. I’m not saying that SBF shouldn’t end up in jail, because I think it is pretty clear from the evidence that he committed fraud. I’m just saying that maybe they learned from the best, and one should be careful about pointing fingers. After all, debt is a game of confidence and at some point that confidence is gone, also in the state.My hope for regulators is that they come together and try to make this right once and for all, and not to ban and over-regulate the space because some criminals took advantage of this new technology. It is about time we get some clarity and just to be clear, I believe regulation is absolutely necessary for the industry if we ever hope to accomplish more than just being some speculative assets you can invest in.As favorable the U.S. government was for the internet in its beginning, as adverse have they been when it comes to regulation for the blockchain space. See this table below on how the Internet vs. Blockchain industry compare in terms of %market-cap and their origin.It is very clear that entrepreneurs in the blockchain space haven’t seen the U.S. as a favorable place to conduct their business like they did in the Internet era and as such, 95% of the market-cap is located outside of the U.S. Crypto regulation in the U.S. has been and still is hard to navigate and so far, regulators haven’t been able to provide any workable framework for how these services can be offered. The SEC, CFTC and other regulatory bodies can’t even agree on what should be determined securities or commodities besides that it is commonly thought that Bitcoin is not a security. Hence, entrepreneurs and builders in the space are afraid to conduct business for fear of litigation. They don’t want to break the rules, but right now they have no clue about what the rules are.What does the future look like for this industry?I have been active in the industry since early 2017 which by now makes me somewhat experienced, even though I wasn’t early to come in. I have seen several bull and bear cycles, and the good thing about these cycles is that there are always learning experiences to be made and to use for the future. So far I have only discussed all the bad things we experienced in 2022, but what about all the positive things we saw? Was it really that bad of a year? Absolutely not! In fact, despite all the negative things that always tend to draw all the medias attention, I’m more bullish and positive in regards to this industry than ever before. Personally, I believe that the biggest event in 2022 was the successful merge on Ethereum with the beacon-chain, removing the Proof of Work consensus mechanism and shifting towards a Proof of Stake consensus instead. This was done on September 15th and went through without any bumps and transactions still running simultaneously. Just to put this in to scope, it’s like changing the engine of an airplane, WHILE IT IS IN THE AIR! Amazing! Ethereum is soon to be a deflationary, yield generating (through staking) and primary base layer for Web3 assets. For anyone interested, I’d suggest you read more about the Ethereum roadmap.I also have to mention Bitcoin as a positive light to a dark year. As I wrote in my intro, Satoshi Nakamoto was smarter than we thought. Despite what the term cryptocurrencies has come to mean and be affiliated with, such as ponzi schemes and joke coins, Bitcoin is not a token issued by any company nor a scheme to create fake value underwriting bad debt. It differs from the rest and should be treated as such. Bitcoin is a scarce, peer-to-peer, censorship resistant digital currency, designed to keep your money safe through any political or economical storm.. Of course, Bitcoin is still volatile in the short term, but historically and in the long term, it’s the best performing asset ever in human history. The question then becomes, are you patient enough to see this play out? Despite the turmoil the industry has been through, it’s still trading around $17.000, which is quite impressive.Remember what I said about learning experiences from various cycles? I think 2022 gave us many very important learnings, however, two aspects really comes to my mind; DeFi and self-custody.It’s actually quite hard to separate the two things, because DeFi can only exist through self-custody and it’s a key metric of using DeFi services. However, the reason why I want to highlight self-custody, is because self-custody does not have to be affiliated with DeFi. It can really just stand alone and be an important reminder of “not your keys, not your coins”. In the case of FTX, Celcius and other bankrupt entities, $billions of user funds were lost as a result of customers not being in control of their assets, but instead relied on those entities to safeguard their assets. Instead, user funds could have been self-custodialized and $millions if not $billions could have been safe. Onwards, I think we will see this narrative change and users will become more familiar and safe with self-custody solutions, as the UI experience in wallet providers and DeFi services improves over time. Also, let’s not forget that crypto’s initial promise was to provide people with the choice of being their own bank. I acknowledge that this is not something that will apply to everyone, and for those of us who were privileged enough to be born in a system, where we were granted access to a bank account before we could walk, we will be the last to adopt the narrative of self-custody. However, let’s not forget that approximately 1.4 billion people still remain unbanked, and for those, crypto and hereby self-custody solutions impose life changing opportunities.What about DeFi then? For those of you who are new to this industry, DeFi is short for Decentralized Finance. DeFi really became a thing back in the summer of 2020 and has grown larger ever since, and despite all the hype and projects that have emerged in DeFi, such as the BAYC NFT’s or several “FOMO” yield generating products with unrealistic %APY’s, the idea behind DeFi and blockchain are the answer to many classic centralization risks we saw this year. Why is that? Because DeFi removes the risk of subjective, interest-conflicted and biased human decisions and replaces it with solid, transparent and immutable code. In DeFi, people do not have to trust their counter-party like users did with FTX, when they thought their money was safe. Instead, the rules of engaging with each other are coded into the smart contract. In that way, both parties have transparency and due to the immutable nature, no party can twist or change the “truth” of the engagement. The code just executes what both parties signed up to.2022 gave us some real world examples of how DeFi can be used to de-risk the old centralized systems. Both Celcius and BlockFI, which was another lender that went bankrupt, was conducting business with counterparties that invested some of their funds in DeFi protocols. What happened next is the true promise of DeFi; both Celcius and BlockFI were forced by smart-contracts to fulfill their DeFi loans, otherwise their collateral would have been liquidated. This made Celcius prioritize to pay back their DeFi loans up to $400 million due to the nature of the over-collateralization of 150% for taking the loan on several DeFi protocols such as Maker and Compound. If they wouldn’t have paid back their loans, the collateral would have been used to pay back the lenders in the DeFi protocol, making sure no one would have lost their money, except Celcius who didn’t live up to its obligations agreed upon in the smart-contract. In DeFi, a deal is a deal and there is no going back. In the case of the centralized FTX, unfortunately customers are very unlikely to recover their money after being victims of bad human decision-making.Now, as I mentioned earlier, more sufficient regulation could, maybe to some degree, have avoided some of the bankruptcies this year. Centralized exchanges (CEX) will continue to play a significant role in the space, and I do believe we need both alliances, CEX and DEX, in the industry. After all, we still need FIAT on/off ramps to onboard more customers and custodians for those who are not comfortable with holding their own assets, yet. I think Coinbase, Kraken and Bitcoin Suisse to mention a few, are all very good options and can work great. However, DeFi imposes huge opportunities for the industry to hold itself to higher standards by becoming more self-regulated. In the case of FTX, if the exchange would have been made up by smart contract protocols like we see in DeFi, all activity on the exchange would have been fully transparent, verifiable and auditable by its users and hereby also regulators (hint, hint).I sincerely believe that DeFi is the future of finance even though it still has some growing pains it needs to mature from as with any new technology. It is clear that DeFi impose huge opportunities to solve the risk and limitations we’ve seen throughout this year and with centralized finance of old. It provides transparency, verifiability, auditability and self-custody as a response against poor human decisions, because; “When finance is based on the subjective behaviors of men, it will be prone to the failures of men” — Erik Voorhees, Money and State, 2022.Final thoughtsHistorically, the market bottoms every time Bitcoin and blockchain is dead and the world goes under. I think we are very much in the middle of that narrative at the moment. The truth is, the world is not going under, and Bitcoin or the technology itself isn’t going anywhere. The flood of bankruptcies we saw in 2022, especially with the implosion of FTX, is certainly a setback for the industry on the short-term. However, on the positive note, we get rid of bad actors and hopefully this will accelerate the timeline of crypto-related regulation that we have been waiting for, which makes it essential for builders and entrepreneurs in the space to scale their businesses. Furthermore, DeFi has come out as the big winner from all these series of events, as it shows the unmatched opportunities that lie within the use of it. To be honest, DeFi is the ultimate solution to the problem of trust in financial markets. My prediction is that we will see more innovation and groundbreaking services within DeFi than in any other industry on the planet over the next 5 to 10 years. I know for a fact, that my eyes will be laser-focused on the development of this industry. Oh, and then I haven’t even mentioned zero-knowledge proofs. Well, that’s for another article on its own!Now, it’s hard to come with any predictions as to where this industry is headed in the short term. We still live in an environment with too many uncertainties such as a 40 year high inflation as a result of FED hiking interest rates, increasing energy prices mainly due to the ongoing Russian-Ukrainian war and just a general hangover from irresponsible Covid-19 policy decisions. These are all indications as to why the crypto winter could last longer this time. However, I still believe that we are in a very different place this time from previous crypto winter cycles. First of all, institutional adoption remains high. We see many take a long-term perspective and realize the opportunity of this industry as such, while also accepting the natural cycles that follows. Looking forward, I believe the evolution of the industry of digital assets will be focused a lot around tokenization, DeFi and Web3 applications. Bitcoin will remain strong, as its core principles haven’t changed, while Ethereum has strengthened their position as the leader of L1’s in a competitive area with many competing for the same users and capital. With its succesful merge and strong community, I believe in a reinforcing Ethereum narrative in 2023 and onwards.As a final note, I’d like to reiterate my initial statement regarding the evolution of the internet era and how it shares many similarities with crypto. Remember what happened in the dot-com era in the 1990's? It was a stock market bubble as a result of massive growth in the use and adoption of internet. The bust resulted in a flood of bankruptcies and transformations across the entire industry. However, I think it is safe to say that the technology “internet” survived. Rest is history!Thank you 2022, may we never see you again.Happy new year. 2023 is warmly welcomed.Sincerely,Nikolaj Rosenthal","creation_date":"2022-12-27","tags":["Blockchain","Cryptocurrency","Defi","Web3","Crypto"],"author":"Nikolaj Rosenthal","category":null}