{"id":"bb39df9d-315b-4821-ac12-5dad94950c8e","article_link":"https://cointelegraph.com/news/former-disney-boss-launches-web3-game-studio-marvel-star-wars-nft","website_source":"Cointelegraph","article_type":"Tweet","summary":"The team’s first game, PlanetQuest, has reportedly onboarded over 200,000 NFT holders.","title":"Former Disney boss launches Web3 game publisher with Marvel, Star Wars talent","detailed_content":"A team of Hollywood and gaming luminaries has joined forces to launch a AAA Web3 games publisher in the United Arab Emirates. \nDubbed Galactic Entertainment Publishing, the recently launched venture represents the first arm of parent company Galactic Group.\nThe firm’s inaugural endeavor, PlanetQuest, has been in active development since 2022. Loren Roosendaal, CEO of Galactic Entertainment and founder of PlanetQuest, told Cointelegraph that despite the game not having launched yet, it’s installed a massive user base:\n“PlanetQuest passport holders account for over 300,000 connected wallets, over 200,000 of which hold one or more PlanetQuest NFTs.”\nAAA franchise experience\nThe team behind PlanetQuest is comprised of former employees from Disney, Warner Bros., Activision-Blizzard and Epic. Their previous individual credits include a bevy of franchises, from films such as The Batman, Avengers and Blade Runner to AAA games such as Fortnite, Call of Duty, and Star Wars: Jedi Survivor.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe firm’s chief creative officer, Jon McCoy — who has worked on AAA Hollywood blockbusters throughout his career — said those experiences couldn’t compare with his work with Galactic Group:\n“Naturally no first attempt at something new is perfect, but it’s been amazing getting to create a sci-fi universe with the fans in a way that’s never been attempted before. I’ve gotten to fulfill a lot of my childhood dreams, working on Star Wars, Blade Runner and Marvel movies to name a few, but there’s little that compares to being able to interact and build with the fans from day one.”\nPlanetQuest\nThe company’s first title, PlanetQuest, has been described as existing in a “Star Wars-like” world full of assets that players can own and trade. Everything from ships to entire planets can be copped as digital assets that, ostensibly, players can keep for their own game use or sell/trade to other players for native currency.\nGalactic currently has plans to launch tie-in media for PlanetQuest, including novels, comic books and another game to be revealed later, according to a report from VentureBeat.\nRelated: Disney launches NFT platform with Dapper Labs\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-04-19","tags":["#Blockchain","#Games","#Metaverse","#Web3","#NFT","#Gaming"],"author":"by Tristan Greene","category":null}