{"id":"bba838d5-ce6f-4c6a-9336-5f03fb780e83","article_link":"https://cointelegraph.com/news/solana-developers-tackling-network-congestion","website_source":"Cointelegraph","article_type":"News Article","summary":"Solana Foundation strategy lead Austin Federa unpacks the reasons for Solana’s recent network congestion issues.","title":"How Solana developers are tackling network congestion challenges","detailed_content":"The Solana Foundation has pinned recent network congestion issues on a combination of high demand for Solana block space and a failure to implement patches related to its networking stack in a timely manner.\nSolana Foundation strategy lead Austin Federa spoke exclusively to Cointelegraph during Paris Blockchain Week about efforts to address recent issues with user transaction congestion. \n“The goal of the Solana project is to build the world’s fastest network that is open, permissionless and decentralized, and that is a tall order. There’s a team of engineers across different core contributor groups working on building the Solana network, and sometimes, they don’t quite get it right,” Federa explained.\nSolana Foundation strategy lead Austin Federa (left) with Gareth Jenkinson (right) at Paris Blockchain Week.\nAccording to the foundation’s strategy lead, Solana’s consensus layer continues to operate as designed, but there is agreement that the network is not living up to expectations from a user experience perspective.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“It’s running at about 700 transactions per second now, which is still pretty commendable, even in the sort of degraded state the network is in now. But a lot of work still needs to be done on the Solana core protocol,” Federa said.\nNetwork developers have been planning fixes to “bottleneck” issues in a specific component of its networking stack implementation.\nHowever, the roadmap for implementing upgrades and expected demand on the Solana network “did not line up,” said Federa, adding:\n“The charitable view of this is a failure of success. There’s massive demand for the Solana block space, and there’s a huge demand for the network. It’s processing more transactions than Ethereum’s layer 1 and layer 2s combined.”\nFedera conceded that a less charitable reading of the situation suggests a failure to plan and implement network upgrades. He added that ecosystem developers may have been able to anticipate the sort of demand spikes based on the network’s past usage.\nRelated: Solana devs target April 15 for failed TX fix — It’s ‘not a design flaw’\nAs previously reported, Solana developers aimed to implement a fix for an “implementation bug” that recently caused the transaction failure rate on Solana to skyrocket. Federa said engineers had “not been sleeping much” as they readied patches and tested features before they hit mainnet:\n“It has been an ecosystem effort to identify the problem, potential solutions, and short-term and long-term improvements to the network.”\nSome protocols should have a beta label\nSolana has copped criticism for network outages over the past two years, with the blockchain going down for short periods of time. However, the layer 1 is not the only protocol that has grappled with downtimes, with Ethereum layer-2s Base, Arbitrum and Starknet having experienced issues in recent months.\nFedera said that emerging blockchain networks are still in a growth phase, drawing comparisons to the early days of Amazon Web Services and the outages it experienced. Nevertheless, the blockchain industry is being closely scrutinized, and Federa said expectations are not unfounded:\n“I think it’s appropriate to be upset about downtimes and outages. The goal is 100% uptime, and that should be the goal for the whole industry. If that comes at the expense of no scale, that’s not necessarily the best trade-off.”\nFedera also highlighted various layer-2 protocols’ downtime and outages as an indicator that the industry is still developing and growing. This is part of the reason why Solana still operates under a beta label.\n“The beta tag is honest. The network today does not represent the final form of what developers hope it will be in the future, and there might be other networks that probably should also append a ‘beta’ tag to them,” Federa said.\nSolana released v1.17.31 for general use by mainnet validators on April 15. The release contains enhancements that are anticipated to alleviate ongoing congestion on the network.\nMagazine: 1 in 6 new Base memecoins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-15","tags":["#Blockchain","#Paris","#Adoption","#Solana"],"author":"by Gareth Jenkinson","category":null}