{"id":"bc923a40-86f3-4fca-b137-758f27f79f8c","article_link":"https://medium.com/azuroprotocol/chiliz-partners-with-azuro-to-drive-adoption-of-onchain-sport-prediction-markets-afe3c7571ac6","website_source":"Medium","article_type":"Blog Post","summary":"Azuro is joining forces with Chiliz, the leading blockchain in sports, to promote the growth of onchain sport prediction markets.","title":"Azuro and Chiliz Partner Up to Drive Adoption of Onchain Sport Prediction Markets","detailed_content":"Azuro is joining forces with Chiliz, the leading blockchain in sports and entertainment, to promote the growth of onchain sport prediction markets. This partnership is aimed at enabling millions of sports fans worldwide to engage with their favorite teams and athletes through fair and transparent prediction applications.Chiliz is well-known for its blockchain solutions that revolutionize fan engagement in sports, including fan tokens and interactive engagement platforms via its flagship venture, Socios.com. The platform supports over 80 sport-related fan tokens and has amassed more than 2 million users. Chiliz facilitates team-specific fan tokens for top football clubs such as FC Barcelona, Inter Milan, Juventus, Paris Saint-Germain, Manchester City, among others.The Chiliz network utilizes a Proof of Staked Authority (PoSA) consensus algorithm, enabling smart contract developers, validators, stakers, and other stakeholders to actively engage with the chain. It is specifically designed to support sports and entertainment applications, focusing on brand IP and project use-case integrity.For Chiliz, this partnership with Azuro is a strategic move to tap into the fast-growing onchain prediction markets, leveraging Azuro’s established infrastructure across EVM-compatible chains. Azuro, already the leading protocol on Gnosis and the highest revenue-generating protocol on Polygon, offers a robust infrastructure already trusted by more than 25 applications with transaction volumes surpassing $320 million.The Azuro protocol allows applications to launch with no upfront investments and operational costs, ensuring all attention is directed to user acquisition and monetization. As part of the collaboration, Chiliz will be integrated into the Azuro Protocol, enhancing its reach within sports-focused prediction applications. Developers using Azuro can now link their applications to the Chiliz Chain and facilitate transactions using the CHZ token.“Integrating with Azuro marks a pivotal move for Chiliz Chain to capitalize on the rapidly expanding onchain prediction market,” said Alexandre Dreyfus, CEO of Chiliz and Socios.com. “Leveraging Azuro’s advanced infrastructure, we’re empowering developers to innovate within the sports and gaming sectors.”Looking ahead, Azuro and Chiliz will be soon launching a co-sponsored grants program aimed at incentivizing app developers to build on their combined infrastructure. These initiatives, including bounties for the first apps, are designed to fuel further adoption of onchain prediction markets, and aligned with Azuro’s vision for setting new transparency and fairness standards.Azuro is the onchain predictions layer. It consists of modular tooling, oracle and liquidity solutions for EVM chains to host powerful prediction and gaming apps.With its unique infrastructure layer approach, Azuro makes onchain predictions and gaming portable and composable. It allows anyone to engage and monetize users by building apps, integrations, and products quickly, permissionlessly and with zero upfront or running costs.Disclaimer: This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. References to any digital assets, projects and platforms do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services. This content may not under any circumstances be relied upon when making a decision to purchase any digital asset referenced herein.","creation_date":null,"tags":["Blockchain","Crypto","Chiliz","Partnerships"],"author":"Azuro","category":null}