{"id":"bd3d95ec-e4ee-4bb4-b61b-3f2c145ff777","article_link":"https://cointelegraph.com/news/bitcoin-crypto-miners-fear-cherish-btc-halving-profitability","website_source":"Cointelegraph","article_type":"News Article","summary":"While Bitcoin halvings can put a huge dent in crypto mining profitability, miners say they wouldn’t have it any other way.","title":"Bitcoin miners may ‘fear’ the halving, but they cherish it too","detailed_content":"For over a decade, the quadrennial Bitcoin\nBTC\n$62,997\nhalving event has delighted early Bitcoin hodlers while striking fear into inefficient crypto miners. \nAnd while some may even be secretly hoping for an end to the profitability slashing (which has even bankrupted companies in the past), most miners agree — it’s what makes Bitcoin special, and it’s not going anywhere.\n“We as miners embrace halvings and cherish them — but of course, we fear them a bit too,” said Kristian Csepcsar, chief of propaganda at the Bitcoin mining infrastructure firm Braiins.\nThere have been concerns that the Bitcoin halving event, set for April 20, could lead to some Bitcoin miners going under — particularly if the price of Bitcoin fails to exceed the cost of mining.\n“Miners are true Bitcoiners at heart,” said Csepcsar. “So even though halvings put extreme pressure on the mining industry as a whole we all understand why halvings are an integral part of the Bitcoin design.”\nSource: Braiins\nSome Bitcoin mining firms like Hut 8 said they look at the halving as an opportunity to double down on growth and strengthen competitiveness, according to CEO Asher Genoot.\n“We have prepared for the halving with a comprehensive restructuring of the business and focus on being a low-cost operator,” Genoot told Cointelegraph.\nHe added that Hut 8 mines “only when it is profitable” using its proprietary software and maintains a strong balance sheet with more than 9,100 BTC that enables it to maintain stability while investing in growth.\nHashlabs Mining co-founder Jaran Mellerud believes that Bitcoin miners would probably love the idea of scrapping the halving. However, the Bitcoin network is not controlled by miners, but by node operators, he stressed, adding:\n“Bitcoin was not made for the miners, but for the hodlers.”\nWould it be possible to scrap halving?\nLike any change to Bitcoin, it is theoretically possible to do away with the halving if you have a hard fork.\nHowever, most think it would be “next to impossible” to reach the consensus required to make the change, while others, such as argues that the resulting product, by design, won’t be Bitcoin anymore.\n“It would break one of the key features that every Bitcoiner loves about Bitcoin: it will have less supply inflation than gold, and continue that deflationary trend,” Bitcoin ESG researcher Daniel Batten told Cointelegraph.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“One of the main reasons investors are attracted to Bitcoin is its limited supply of 21 million coins, and this is also what makes Bitcoin unique,” added Hashlabs Mining' Mellerud.\nHe suggested that the Bitcoin market cap would likely be much smaller if there were no halvings and limited supply, and miners would not benefit from the higher block subsidy.\nBitcoin inflation rate versus time. Source: BitcoinBlockHalf\nCsepcsar from Braiins argues that removing the halving from Bitcoin’s code is virtually impossible.\n“Change of this magnitude to the core architecture of bitcoin is next to impossible today,” Csepcsar said, adding:\n“Putting everybody into consensus and changing such a core principle of bitcoin is impossible in any short time frame such as a few years. What will be the case in 10 years and more is another matter and nobody has an answer to that.”\nSome miners may support the idea of eliminating halvings but full nodes may not, and nodes have significant control over the Bitcoin network, according to New Layer Capital’s general partner Nicholas Safford.\n“If a group of miners wanted to implement such a proposal, they would need to hard fork the Bitcoin network, after which point, the new cryptocurrency would cease to be Bitcoin,” he stated.\nMiners fear the halving, but they don’t hate it\nBitcoin halvings have been historically associated with bullish sentiment as BTC prices surged to new all-time highs after halvings. However, there’s also a fear that the halving would raise the operational costs of mining Bitcoin, hurting profitability.\nOn the halving date, for a miner whose cost of mining 1 BTC was $35,000 per BTC, the cost would suddenly increase overnight to $70,000 per BTC, New Layer Capital’s Safford explained.\nMiner revenue after halvings. Source: Visual Capitalist\n“This miner is no longer profitable as the market value of 1 BTC — currently around $65,000 — is no longer enough to cover the cost to mine 1 BTC,” he said, adding:\nRelated: Bitcoin needs to hold above $80,000 to keep mining profitable post-halving\n“Halving inevitably leads to several unsustainably high-cost miners — due to high electricity rate, less efficient ASICs, high overheads and so on — dropping off the network.”\nSo, Bitcoin halvings are probably here to stay\nIndustry executives and advocates are confident that halvings are eventually beneficial and are here to stay.\n“Halvings are the economic catalysts that ensure a smooth curve toward the 21 million Bitcoin supply cap and the need for continuously improving energy efficiency,” Bitfarms’ chief mining officer Ben Gagnon told Cointelegraph.\nThe total global mining activity in USD terms has grown exponentially each halving epoch despite the block reward halving every four years, Gagnon noted.\nCryptocurrency mining market size, 2022 to 2032. Source: Precedence Statistics\nGagnon also pointed out that there are many coins that don’t have halving events and opted for linear growth of coin supply. “They have not done well against Bitcoin,” the exec stated.\n“The whole point of the Bitcoin Network is that the code is law, and it will not be changed,” said SunnySide Digital founder and CEO Taras Kulyk.\n“What will happen in more than 10 years, really nobody can tell. But I would still not bet on any dramatic changes like changing the 21 million cap or removing halvings altogether,” Csepcsar told Cointelegraph. He added:\n“Bitcoin either has to survive these harsh situations or is not the antifragile freedom tool that we all want it to be.”\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Bitcoin","#Blockchain","#Proof-of-Work","#Bitcoin Mining","#Bitcoin Halving"],"author":"by Helen Partz","category":null}