{"id":"bd8a8c3f-7974-4962-b257-b164fd3944d1","article_link":"https://cointelegraph.com/news/microstrategy-bitcoin-decentralized-identity-solution","website_source":"Cointelegraph","article_type":"News Article","summary":"MicroStrategy has already built an application called Orange For Outlook on “MicroStrategy Orange,” which integrates digital signatures into emails to verify the identity of the sender.","title":"MicroStrategy to launch Bitcoin-based decentralized ID solution","detailed_content":"MicroStrategy, the largest corporate holder of Bitcoin, has announced it will launch a decentralized identity solution on the Bitcoin network that uses Ordinal-based inscriptions to store and retrieve information.\nThe solution — MicroStrategy Orange — was unveiled by MicroStrategy executive chairman Michael Saylor during the company’s Bitcoin For Corporations conference on May 1.\nMicroStrategy Orange is open-source, not dependent on sidechains and can process up to 10,000 decentralized identifiers in a single Bitcoin\nBTC\n$63,046\n transaction, Saylor claimed.\n“[Its aim is to] deliver trustless, tamper-proof, and long-lived decentralized identities using only the public Bitcoin blockchain as a data source,” according to an unofficial draft document of the solution shared by MicroStrategy on GitHub.\nThe decentralized identifiers (DIDs) will allow pseudonymity in the same way that real-world identities are not tied to Bitcoin addresses and transactions.\nSaylor speaking at the Bitcoin For Corporations conference. Source: YouTube\nMicroStrategy Orange comprises Orange Service, Orange SDK and Orange Applications.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOrange Service allows users to issue DIDs to their personnel and deploy applications, while Orange SDK and Orange Applications provide customization tools to integrate specific services on mobile and desktop devices.\nOne application already built by MicroStrategy is “Orange For Outlook,” which integrates digital signatures into emails to ensure recipients can verify the true identity of the sender.\nThe onboarding process involves accepting an invitation email signed by MicroStrategy’s DID, which will then generate a unique DID, a public and private key pair for the user.\nThe user’s DID and public key are inscribed on the Bitcoin network, and they can then start sending out invitations to their personnel to create their own digital identity.\nFlow diagram of how MicroStrategy’s Orange For Outlook application works. Source: MicroStrategy\nThe firm wants MicroStrategy Orange applications to extend to other messaging platforms, social media networks and applications in the e-commerce, enterprise and fintech industries.\nRelated: MicroStrategy listing in the S&P 500 index could expose millions to Bitcoin\nIt comes as MicroStrategy reported a $53.1 million net loss for the first quarter on April 30.\nHowever, the reporting using the traditional accounting method didn’t factor in the 65% increase in the market value of MicroStrategy’s 214,400 Bitcoin — worth $15.2 billion at the time — over the quarter.\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-02","tags":["#Bitcoin","#Blockchain","#Business","#Decentralization","#Identity","#Adoption","#Identification","#MicroStrategy","#Bitcoin Ordinals"],"author":"by Brayden Lindrea","category":null}