{"id":"be467ee0-91c3-4617-86b4-aaa7762d5cd8","article_link":"https://cointelegraph.com/news/tether-record-4-52-billion-profit-q1-2024","website_source":"Cointelegraph","article_type":"News Article","summary":"The majority, or $3.52 billion, of the profit stemmed from the firm’s financial gains on Bitcoin and gold, while the additional $1 billion came from operating profits.","title":"Tether nets record $4.5B profit in Q1 2024 — majority from Bitcoin and gold","detailed_content":"Tether Holdings, the company behind the world’s largest stablecoin, Tether\nUSDT\n$1.00\n, reported a record net profit of $4.52 billion in the first quarter of 2024.\nTether also revealed its net equity for the first time, which stands at $11.37 billion as of March 31. This represents a significant increase from the $7.01 billion worth of equity recorded at the end of December 2023, according to Tether’s attestation report for the first quarter of 2024.\nApproximately $1 billion stemmed from operating profits derived from United States Treasury holdings, while the remainder of $3.52 billion comprised the market-to-market gains in the firm’s Bitcoin\nBTC\n$63,046\nand gold positions.\nTether’s USDT is the world’s largest stablecoin, worth over $110 billion, according to CoinMarketCap data. The company issued $12.5 billion worth of USDT in the first quarter of 2024.\nThe report also revealed a $1 billion increase in excess reserves that are maintained as a buffer to support the company’s stablecoin offerings. Tether’s excess reserves stood just below $6.3 billion.\nTether financial reserves, Q1 2024. Source: Tether\nThe report further revealed over $104 billion worth of liabilities related to “digital tokens issued,” while the value of Tether’s reserve assets exceeded the value of its liabilities by over $6.2 billion as of March 31.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nRelated: Circle’s USDC overtakes Tether’s USDT in stablecoin transactions — Visa\nTether remains the world’s seventh-largest Bitcoin holder\nTether’s Bitcoin wallet, “bc1q,” currently holds 75,354 BTC, worth over $4.38 billion, according to on-chain intelligence platform Arkham Intelligence.\nTether acquired 8,888 Bitcoin worth $626 million from Bitfinex on March 31.\nTether Bitcoin holdings. Source: Arkham Intelligence\nThis makes Tether’s “bc1q” address the seventh-largest Bitcoin holder, according to BitInfoCharts. The firm said it would invest 15% of its net profit into Bitcoin to diversify the stablecoin’s backing assets.\nDespite Bitcoin falling below the $60,000 mark, Tether is sitting on an unrealized profit of over 91%, worth over $2 billion, according to the CoinStats portfolio tracker.\nTether Bitcoin holdings. Source: Coinstats\nRelated: Losses from crypto hacks plunge 67% in April to $60 million\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Bitcoin Price","#Tether"],"author":"by Zoltan Vardai","category":null}