{"id":"be815208-a23e-478b-9ab5-769c716f6c08","article_link":"https://cointelegraph.com/news/wormhole-crypto-bridge-hacker-briefly-eligible-for-airdrop-w-tokens","website_source":"Cointelegraph","article_type":"News Article","summary":"The hacker who once stole over $320 million from the Wormhole bridge appears to have been initially eligible to claim a Wormhole airdrop that would have netted them $50,000.","title":"Wormhole bridge hacker from 2022 was briefly eligible for the recent airdrop","detailed_content":"The hacker behind the infamous $320-million exploit of the Wormhole bridge in 2022 was initially deemed eligible for an airdrop that would have seen them claim $50,000 in newly launched W tokens. \nIn an April 4 post to X, pseudonymous researcher Pland claimed that the Wormhole team had forgotten to exclude a number of wallet addresses affiliated with an exploit that saw hackers steal $321 million in crypto from the cross-chain bridge in 2022.\nAccording to data from Solana-based airdrop checker Airdrop.link later cited by Degen News in an April 4 post to X, a total of four wallet addresses connected with the exploit were temporarily able to claim Wormhole’s airdrop.\nSource: Degen News\nIf the hacker had elected to claim their airdrops, they would have been eligible for roughly 31,642 Wormhole (W) tokens worth around $50,000 at current prices.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nCointelegraph independently checked the wallet addresses on Airdrop.link; however, we found that they were no longer eligible, suggesting that the Wormhole team may have already plugged the gap.\nCointelegraph contacted Wormhole but did not receive a response by the time of publication.\nAll four of the eligible wallet addresses were flagged as being linked to the 2022 Wormhole exploit by Solana block explorer Solana.fm.\nRelated: Wormhole crosses 1B in cross-chain messages ahead of token launch\nThe Wormhole bridge was exploited for a staggering $321 million in February of 2022, rendering it one of the largest hacks in the history of the crypto industry.\nHowever, in February 2023, Web3 infrastructure firm Jump Crypto and decentralized finance (DeFi) platform Oasis.app conducted a “counter exploit” on the Wormhole protocol hacker.\nSource: Spreek\nThe two firms managed to successfully claw back a total of $225 million in digital assets from the wormhole exploiter and subsequently returned them to safe wallets.\nOn April 3, Wormhole announced that it would be airdropping more than 675 million — worth roughly $850 million at current prices — of its new Wormhole (W) tokens to eligible users.\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-04","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Hackers","#Airdrop","#Hacks"],"author":"by Tom Mitchelhill","category":null}