{"id":"bee55b93-1309-4fd9-a8d7-585ccac495f4","article_link":"https://cointelegraph.com/news/circle-blackrock-transfers-usdc-buidl","website_source":"Cointelegraph","article_type":"Tweet","summary":"BlackRock USD Institutional Digital Liquidity Fund, the first tokenized fund launched by BlackRock, can now be transferred to Circle using the USDC stablecoin.","title":"Circle enables USDC transfers for BlackRock’s first tokenized fund","detailed_content":"Circle, the issuer of major stablecoin USDC\nUSDC\n$1.00\n, has enabled transfers of BlackRock USD Institutional Digital Liquidity Fund (BUIDL) shares to its stablecoin.\nCircle officially announced on April 11 a new smart contract functionality that would allow BUIDL holders to transfer their shares to Circle for USDC.\nCircle’s smart contract functionality enables the frictionless transfer of BUIDL shares in exchange for USDC to Circle on the secondary market. According to the announcement, the smart contract will enable “near-instant” BUIDL off-ramp that serves investors 24/7.\nLaunched by BlackRock in March 2024, BUIDL is a tokenized fund that operates on the Ethereum blockchain to offer U.S. dollar yields through tokenization.\nBUIDL allows investors to purchase tokens representing shares in the fund, which invests in assets like U.S. Treasury bills. The fund is referred to as the “digital liquidity fund” because it is digitized in the form of tokens on the Ethereum blockchain and operates as an ERC-20 token called BUIDL.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe new investment tool is the first tokenized fund introduced by BlackRock, which is also the operator of the fastest-growing spot Bitcoin\nBTC\n$62,997\nexchange-traded fund (ETF) in the United States.\nAccording to Circle co-founder and CEO Jeremy Allaire, tokenization of real-world assets is a rapidly emerging product category.\n“Tokenizing assets is but one important dimension of solving investor pain points. USDC enables investors to move out of tokenized assets at speed, lowering costs and removing friction,” Allaire stated.\nRelated: Binance follows Circle and drops USDC support on Tron\nBlackRock is one of the biggest players in the cryptocurrency industry, operating the iShares Bitcoin Trust (IBIT) spot Bitcoin ETF, which holds 266,580 BTC, worth $18.5 billion as of April 10. IBIT was among the first spot Bitcoin ETFs to launch in January 2024 following historic approval by the U.S. Securities and Exchange Commission.\nBlackRock’s latest collaboration with Circle follows years of cooperation in the crypto industry. In 2022, Circle started investing in the Circle Reserve Fund to manage a portion of the USDC reserves in cooperation with BlackRock. The firm expected its composition to continue to be around 20% cash and 80% short duration U.S. Treasuries.\nThe Circle Reserve Fund is a registered Rule 2a-7 government money market fund managed by BlackRock Advisors, and its portfolio consists of cash and short-dated U.S. Treasuries.\nMagazine: Synthetix founder: It’s DeFi that’s wrong, not the market\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-11","tags":["#Blockchain","#Smart Contracts","#Circle","#Ethereum","#Tokens","#USD Coin"],"author":"by Helen Partz","category":null}