{"id":"bf3423fd-5dbb-4bfb-9e77-5878d1eda716","article_link":"https://cointelegraph.com/news/chainlink-build-blockchain-adapter-institutions-rapid-addition","website_source":"Cointelegraph","article_type":"News Article","summary":"Chainlink Labs’ Vince Turcotte told Cointelegraph that they expect digitally-native institutions to be the first to adopt the integration.","title":"Chainlink to join Rapid Addition in building blockchain adapter for institutions","detailed_content":"Blockchain oracle project Chainlink has partnered with Financial Information eXchange (FIX) connectivity solutions provider Rapid Addition to develop a FIX-native adapter for institutional digital asset trading. \nIn an announcement, Chainlink said the adapter would be powered by its Cross-Chain Interoperability Protocol (CCIP), an interoperability protocol with use cases across token transfers, gaming and decentralized finance (DeFi).\nSource: Chainlink\nAccording to Chainlink, the collaboration will let banks and financial institutions send messages and engage with a “broad spectrum of tokenized assets.”\nThe organization believes this is an “untapped market opportunity” that could have applications across renewable energy products, carbon credits and real-world assets (RWAs) like real estate, infrastructure and collectibles.\nVince Turcotte, Chainlink Labs’ business development lead for Asia Pacific, told Cointelegraph banks and financial institutions could do many things with the adapter. Like the company’s work with the interbank messaging system SWIFT, Turcotte said that financial organizations can encode smart contracts with FIX tags and instructions. The executive explained:\n“We expect this will be particularly useful for the post-trade environment, as it will allow a single source of truth for trade allocations, which can be shared simultaneously and without duplication between asset managers, brokers, and custodians.”\nTurcotte added that this information can be fed into downstream legacy systems, lowering settlement error and rejection rates.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHe added that the integration between Chainlink and FIX ensures existing risk and execution platforms will “interoperate” with new blockchain-based asset types.\nRelated: Tokenization’s next phase requires real-world data integration — Chainlink\nWhen asked about how the new adapter may influence institutional adoption for blockchain or crypto, Turcotte expects digitally native institutions to be the first in line to adopt the integration. He explained:\n“We expect that digitally native institutions will be the early adopters of this integration. These institutions recognize the value of using the FIX protocol to engage with the broader TradFi ecosystem and the value of permanence and truth via blockchain.”\nMeanwhile, the Turcotte believes that asset managers and their clients could benefit from the infrastructure in terms of costs.\n\"Asset managers and their clients can save costs by having a single source of truth for settlement instructions available to all counterparties to a trade and constantly updated 24/7,” Turcotte added.\nMagazine: Web3 gaming won’t exist in 5 years, $656K for best crypto game pitch: Web3 Gamer\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Banks","#Adoption","#Chainlink"],"author":"by Ezra Reguerra","category":null}