{"id":"bfbe504e-53b2-42b7-8e04-6f72490cd1e0","article_link":"https://cointelegraph.com/news/solana-rival-base-network-reaches-400-tps-claims-core-contributor","website_source":"Cointelegraph","article_type":"Tweet","summary":"Impressive TPS figures are being shared by Base proponents, but critics say they may be skewed unfairly in the network’s favor by including failed transactions.","title":"Solana rival Base hits 400 TPS, claims core contributor","detailed_content":"Coinbase Ethereum layer-2 network Base has been hitting high transaction per second (TPS) throughput according to the firm’s head of protocols, Jesse Pollak.\nIn an April 9 post to X, Pollak reported seeing throughput as high as 300–400 TPS, which he said was being achieved “with no issues.”\nHowever, the Coinbase-backed layer-2 blockchain has a real-time TPS of 26.8 and a maximum recorded TPS of 292, according to Chainspect.\nLayer-2 ecosystem analytics platform L2Beat reported that average transactions per second on Base reached a peak of 37 on April 8, more than double Ethereum’s 14 TPS.\nSource: Jesse Pollack\nIn a response to Pollak’s original post on X, pseudonymous trader Wazz claimed that if Pollak’s observations were accurate, then the network could be achieving a similar TPS to the Solana network.\n“Correct me if I’m wrong but if true then Base is now doing the same TPS as Solana.”\nWazz added that around 60% of Solana’s reported 1,000 TPS were failed transactions, meaning that the actual TPS was closer to 400.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nSolana-based Helius Labs CEO Mert Mumtaz questioned Pollak’s TPS figures, arguing that failed transactions were not included in the Base figures.\nHe added that the biggest Base block in the data provided had 94% failed transactions, resulting in a real TPS of 41.\nSource: Mert Mumtaz\nThe findings come amid rising tensions between proponents of Ethereum layer-2 scaling solutions and advocates of the Solana network. In recent weeks, Solana has been plagued by vocal complaints of degraded user experience, failing transactions and other reliability issues.\nMumtaz previously claimed that Solana’s current issues are not due to a fundamental design flaw but rather a specific implementation bug in the networking protocol.\nOn April 9, Cointelegraph reported that several Solana project launches have been delayed due to ongoing network congestion.\nRelated: Base TVL doubles in a month as pundits tip memecoins to drive adoption\nBase has witnessed a sharp uptick in network activity in recent months, largely driven by an escalating memecoin frenzy.\nThe total value locked (TVL) on the Base network surged to an all-time high of $1.5 billion on April 9, according to DefiLlama data. This represents an increase of 235% since the beginning of this year as memecoin degens flocked to the network.\nBase TVL. Source: DefiLlama\nWhile degens have been racing to find the latest trend in new memecoins, an in-depth analysis of new memecoins on Base found that over 90% had at least one security vulnerability, while 17% were outright scams.\nMagazine: 1 in 6 new Base memecoins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-10","tags":["#Blockchain","#Transactions","#Base","#Solana"],"author":"by Martin Young","category":null}