{"id":"c2fc4722-10cf-497d-b281-8b25e36bcc7d","article_link":"https://www.wired.com/story/metaverse-business-commerce/","website_source":"Wired","article_type":"News Article","summary":"Businesses can get a head start on VR life if they transition to 3D-centric content now.","title":"It’s Not Too Early To Become Metaverse-Ready","detailed_content":"BY NOW, YOU’VE certainly heard enough hype about the metaverse to conclude that it’s on the horizon. But don’t expect many true metaverse experiences to gain mass adoption in 2023. Instead, 2023 will be the year when we’ll become “metaverse-ready.”  \nREAD MORE\nThis story is from the WIRED World in 2023, our annual trends briefing. Read more stories from the series here—or download or order a copy of the magazine.\nThere are already amazing immersive and interactive experiences available, including games like Fortnite, Minecraft, and Roblox. But none of these games truly pay off on the promise of the metaverse we imagine today, a virtual world in which we can meet friends and strangers from around the world to play, explore, shop, and interact. To bring that vision to reality, we have some work to do in areas like content production, technology standards, and virtual commerce.\nOne thing we know about the metaverse is that it will succeed only if it is filled with rich, interactive, personalized, and engaging 3D content. Many companies and creators have already begun ramping up 3D content creation, not only because it allows them to experiment with metaverse experiences for the future, but because it helps them solve business problems now. Creating in 3D lets companies create marketing images for websites, catalogs, and ads in a way that’s faster, cheaper, more scalable, and more sustainable. For instance, three-quarters of product images in IKEA catalogs are already rendered in 3D, rather than shot. Ice-cream maker Ben & Jerry’s produces thousands of product images in weeks, rather than months, by rendering them in 3D—and at a fraction of the cost.\nFEATURED VIDEO\nWhy Billionaires Are Actually Ruining the Economy\nMany companies are also now using 3D creation to design new products. Tommy Hilfiger used 3D assets to shave two weeks off its design review process. Designers at footwear brand Salomon also found that rendering new shoe designs virtually cuts the time to produce a prototype by up to 67 percent.\nIn 2023, having all that 3D content on hand gives companies the freedom to experiment with new metaverse concepts. They can pilot new approaches, partner with other companies, and see what works and what doesn’t. A great example is Amazon, which is experimenting with an augmented reality system that allows shoppers to place AR versions of products in their own homes. No one knows exactly what the metaverse will look like—it’ll come together through trial-and-error—but companies with libraries of 3D content to experiment with will be the architects of this new medium.\nThe other essential factor for the metaverse to succeed will be its technological standards. HTML, for instance, helped the internet flourish by ensuring that web pages looked and behaved the same way in all browsers. Similarly, companies and individuals won’t spend time and money creating content for the metaverse if they can’t publish that content anywhere and have it look—and behave—as they intend it to. There’s still lots of work to do here, but groups like Khronos Group, the Realtime Conference, and Metaverse Standards Forum are bringing together tech companies, hardware makers, and retailers to work on open standards that will begin to govern metaverse content. Among the standards under development is USD, known as the HTML of the metaverse, which will allow 3D assets to be shared and rendered across many different immersive experiences. Another standard, glTF, the JPEG of 3D, will allow 3D assets to be compressed so that they’re small enough to be transmitted efficiently.\nJust as hundreds of billions of dollars of purchases now happen on the internet, the metaverse will also become an important avenue for commerce. But the metaverse won’t just be a place to buy a shirt, coffee maker, or other physical goods. As people develop their personal avatars in the metaverse, they’ll want to equip their alter egos with virtual shoes, cars, and art. In 2023, we’ll start to establish how to buy and sell physical and virtual goods in the metaverse. We’re starting to see this already with NFTs. A key to their value is their portability—they can be stored, accessed, and transferred easily through the blockchain.\nOverall, the most important aspect of building a successful metaverse will be recreating human experiences at scale. In many ways, we all yearn for a small-town life—we crave digital experiences that feel more intimate, we want to do business with people who know us, and we want to build our community. The promise of the metaverse is to enable those kinds of essential human experiences in a world that is free from the laws of time, space, and physics. If we can get that right, there’s no question the metaverse will succeed.","creation_date":"2023-01-03","tags":["","VIRTUAL REALITY","VR","ECOMMERCE","AUGMENTED REALITY","3-D","THE WIRED WORLD IN 2023"],"author":"BY SCOTT BELSKY","category":null}