{"id":"c377e57f-8b6b-4132-be0d-b5dcd507c944","article_link":"https://cointelegraph.com/news/israeli-fintech-kima-mastercard-defi-credit-card-project","website_source":"Cointelegraph","article_type":"News Article","summary":"Kima is seeking to bridge traditional and Web3 finance and make the user experience more manageable.","title":"Israeli fintech Kima, Mastercard lab look to develop ‘DeFi credit card’","detailed_content":"Israeli fintech Kima and Mastercard’s FinSec Innovation Lab have launched a project to develop a use case for linking decentralized finance (DeFi) tools and traditional services such as credit cards and bank accounts. It described the project as “mak[ing] a ‘DeFi credit card’ a reality.” The Israel Innovation Authority is supporting the project.\nKima is a peer-to-peer money transfer and payment protocol that operates a blockchain without smart contracts, which it describes on its website as “buggy and experimental.” It intends to expand its existing protocol and launch a mainnnet and token in the second quarter of 2024. FinSec will operate a Kima node and be a key shareholder in the network.\nFinSec is supported by the Israel National Cyber Directorate, Finance Ministry, and Innovation Authority. It works with fintech and cybersecurity startups. The project with Kima was announced in July 2023.\nRelated: We need to fundamentally change how smart contracts operate\nThe project will concentrate on creating a bridge between DeFi and traditional finance and help users overcome technical and regulatory barriers to DeFi adoption. Kima co-founder and CEO Eitan Katz said in a statement:\n“The only way blockchain and DeFi will become fixtures outside the niche world of Web3 is if there is an easily accessible, secure, and affordable way to bridge blockchain networks with traditional financial means.”\nKima is expanding rapidly. It has announced six integrations and 18 new partnerships in 2024 alone. Those include ventures in Vietnam and Thailand. It has also joined the incubator of artificial intelligence protocol ChainGPT. Kima uses AI in its liquidity management algorithm.\nSource: Israel21c\nKima is one of 16 companies that FinSec supports. Mastercard has a hand in several blockchain development projects. It is working with United States banks on tokenized settlements on a shared ledger. It has partnered with crypto lending platform Nexo on a crypto-powered credit card in the European Economic Area, and is participating with blockchains and payment providers to research central bank digital currency.\nMagazine: Crypto as a ‘public good’ in the 22nd century\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Israel","#Fintech","#Mastercard","#DeFi"],"author":"by Derek Andersen","category":null}