{"id":"c43eb591-6176-4017-95cb-8a8721f031e4","article_link":"https://cointelegraph.com/news/blockchain-revolutionize-digital-securities-management-stock-exchanges","website_source":"Cointelegraph","article_type":"Tweet","summary":"Cointelegraph spoke with the Sui network to better understand how blockchain is playing a part in enhancing security and efficiency for the Athens Stock Exchange.","title":"Can blockchain revolutionize digital securities management for stock exchanges?","detailed_content":"The Athens Stock Exchange (ATHEX) is positioning itself to become a trailblazer in the financial world as it plans to integrate blockchain technology into its Electronic Book Building (EBB) system. \nATHEX announced the move in early March in collaboration with the Sui blockchain ecosystem to have securities minted as digital certificates for enhanced security, efficiency and transparency for its users.\nThe primary issuance process traditionally involves separate confirmations for securities allocation and settlement. However, integrating blockchain simplifies this by merging them into a single, streamlined confirmation.\nThis could translate to faster and more efficient transactions for everyone involved — the exchange, its members, investors and, most, importantly, issuers raising capital.\nCointelegraph spoke with a representative from Sui to better understand its collaboration with ATHEX and its blockchain being used to level up operations in a traditional finance (TradFi) setting.\nRelated: Wall Street’s new asset class: Will Grayscale survive the Bitcoin ETF era?\nEnhanced security and transparency \nOne of the primary motivators for integrating blockchain into a highly sensitive network — like a stock exchange dealing with billions of dollars on a daily basis — is a significant security boost. \nDigital certificates, inherent to blockchain transactions, provide an advanced layer of security alongside being on a public, immutable ledger, which can help eliminate the risk of manipulation — a persistent challenge in TradFi.\nThis transparency extends to regulatory oversight, allowing regulators to easily monitor trade activities for suspicious behavior. The Sui spokesperson commented:\n“Centralized processes of primary issuance have fallen victim to bad actors in the space for decades and malpractices of non-transparent allocation.”\n“Also having an immutable, public ledger reflecting trades would simplify regulators’ ability to monitor trading activities for suspicious transactions or improper allocations,” they said. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThey noted that this particular use case is suited for decreasing the risk of primary issuance and increasing the overall efficiency of capital raising, price formation and transparent allocation.\nElectronic book building on-chain\nEBB aims to be a future fundraising tool, allowing early-stage and mature companies to list transferable securities. \nAccording to the Sui representative, the Greek stock exchange’s EBB places it at “the forefront of innovation […] in comparison to exchanges around the world.”\n“ATHEX has made a successful use of the EBB,” they said, “to re-launch their corporate bond market with a large demand from retail and with significant oversubscription.”\n The goal in leveraging blockchain technology is to increase innovation while having the safety, security and transparency that individuals and regulators require.”\nThey also advised that when implementing blockchain in a project in the traditional financial market at scale, it is essential to prioritize the speed, security and fees of the given blockchain network.\nSui said that other exchanges had made attempts at adopting blockchain technology in other parts of their business strategy, but ATHEX’s committed partnership with Sui places it ahead of the pack in taking action with Web3 tools.\nWeb3 TradFi trends\nWhile ATHEX may be one of the pioneering stock exchanges implementing blockchain with its EBB tool, other global stock exchanges have been dabbling in the Web3 space, too. \nSignificantly, on March 11, the London Stock Exchange (LSE) declared its intention to consider applications according to the criteria outlined in its Crypto ETN Admission Factsheet for Bitcoin\nBTC\n$62,992\nand Ether\nETH\n$3,030\ncryptocurrency exchange-traded notes (ETNs) during the second quarter of 2024.\nOn March 25, it said that applications for the crypto ETNs could be submitted as soon as April 8, with successful funds to be listed the following month with approval from the country’s Financial Conduct Authority.\nWhile not a blockchain integration, the exchange’s openness and Web3-friendly approach could point toward a larger trend in TradFi.\nMagazine: Memecoins make millionaires, Terraform and Do Kwon liable for fraud, and more: Hodler’s Digest, March 31 – April 6\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Business","#Finance","#Adoption","#Greece","#Stock Exchange"],"author":"by Savannah Fortis","category":null}