{"id":"c44651c3-d29b-4347-a3d1-a6e1ae758298","article_link":"https://medium.com/@0xdtx/join-dtx-trading-competition-to-earn-5-000-blast-gold-a0a9d4ccb4f2","website_source":"Medium","article_type":"Blog Post","summary":"GM Traders","title":"Join DTX Trading Competition to Earn 5,000 Blast Gold!","detailed_content":"GM TradersGet ready for a Blast Gold extravaganza! We’re thrilled to announce a grand trading competition with a massive 5,000 Blast Gold prize pool up for grabs. Simply engage in perpetual trading on DTX during the competition period for your chance to claim victory. As always, every trade you make on DTX earns you Blast Gold and DTX Fuel, and this competition will further enhance your potential Gold earnings!Start Date: May 12, 2024, 00:00 (UTC 0)End Date: May 24, 2024, 23:59 (UTC 0)Duration of the competition: 13 DaysPrize Pool: 5,000 Blast GoldSimply engage in perpetual trading on https://dtx.trade during the competition period to automatically qualify for the competition and a chance to win. No registration needed.1-We will collect and analyze the trading data of all users during the competition period. The final rankings will be based on PNL(Profit and loss).2-Positions opened before the start of the competition and positions that remain unclosed after the competition ends will not be included in the ranking statistics.3-All positions opened for the listed trading pairs on the DTX platform will be accounted for in the statistics.4-You can view your ranking status on this page.Total prize pool: 5,000 USDBPrize Distribution:-All users with positive PnL (Profit and Loss) will share the 5,000 Blast Gold prize pool proportionally based on the percentage of their PnL contribution to the total positive PnL.-DTX will calculate rewards on the 24th of each month and distribute your Blast Gold shortly after.Achieve a positive PnL (Profit and Loss) through your trades. The bigger your PnL compared to other winners, the larger your share of the 5,000 Blast Gold prize pool!DTX is a decentralized perpetual exchange built on Blast L2 that provides access to 70+ crypto assets with up to 50x leverage. We are committed to giving back to our community by providing 100% Blast token airdrops and offering full refunds for gas fees.When using DTX for perpetual trading, you can also earn multiple rewards and potential profits from Blast and DTX, including Blast Gold & Points, which can be converted into Blast token airdrops, , and DTX Fuel, which can be converted into DTX token airdrops.Click here to learn about benefits from DTX.Become part of a thriving community of traders:Together, let’s navigate the exciting world of decentralized trading and redefine the crypto landscape. Join the DTX STARSHIP PROGRAM today!Join the DTX community now and embark on a journey of innovation, growth, and success!Website | Twitter | Discord | Telegram | Medium","creation_date":null,"tags":[],"author":"DTX","category":null}