{"id":"c46d0442-2f60-47cc-9f3c-46969ce726c8","article_link":"https://cointelegraph.com/news/hkma-project-ensemble-asset-tokenization","website_source":"Cointelegraph","article_type":"News Article","summary":"Regulators like HKMA and SFC united with local private sector firms like HSBC and HashKey to support the tokenization market in Hong Kong.","title":"Hong Kong central bank forms community to explore asset tokenization","detailed_content":"The Hong Kong Monetary Authority (HKMA), the financial regulator and central bank of Hong Kong, is collaborating with the industry to explore asset tokenization.\nHKMA officially announced on May 7 that it will form a special community comprising industry representatives and regulators to develop tokenization standards.\nCalled “Project Ensemble Architecture Community,” the community aims to supervise and support the development of tokenization projects in Hong Kong.\nThe initiative is also designed to promote and support interoperability among wholesale central bank digital currencies (wCBDCs) — a type of digital money used among banks and financial institutions.\nAccording to the announcement, the community will initially focus on establishing a mechanism to support seamless interbank settlement of tokenized deposits through wCBDC for tokenized asset transactions.\nAt launch, the Project Ensemble Architecture Community will comprise regulators such as HKMA, Hong Kong’s Securities and Futures Commission, the BIS Innovation Hub Hong Kong Centre, and the CBDC Expert Group.\nThe private sector is represented by seven members, including Bank of China (Hong Kong), Hang Seng Bank, HSBC, Standard Chartered Hong Kong, HashKey Group, Ant Digital Technologies and Microsoft Hong Kong.\nTogether, the companies and authorities are expected to design and launch the Project Ensemble Sandbox, which is targeted to launch around mid-2024 to facilitate further research and testing of tokenization use cases.\nRelated: RWA protocols are closing in on $8B total value locked: Messari\n“The formation of the Community is based on a range of careful considerations, including the members’ expertise in contributing to the development of the tokenization market in Hong Kong, experience and competency in relevant fields and innovative capability,” HKMA said in the announcement, adding:\n“The HKMA will be working closely with the industry, and review the size and composition of the Community as and when deemed appropriate.”\nHKMA’s announcement comes a few months after the authority first disclosed its Project Ensemble to support the development of the Hong Kong tokenization market.\nTokenization is the process of issuing a digital representation of real-world things such as fiat currencies, equity, commodities, real estate and others. Blockchain-based real-world tokenization (RWA) has emerged as one of the key trends in 2024 as investors look for new ways to diversify their portfolios.\nAccording to some forecasts, RWA tokenization could potentially revolutionize multiple industries and grow into a $16 trillion market by 2030.\nMagazine: Hong Kong Bitcoin ETF launch in ‘top 20%,’ STRK scam suspect busted: Asia Express\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Hong Kong","#Central Bank","#Tokens","#Regulation"],"author":"by Helen Partz","category":null}