{"id":"c5068d7e-a2ce-4d46-8518-33a86e0dcdc3","article_link":"https://www.wired.com/sponsored/story/google-for-startups-eastern-europe/","website_source":"Wired","article_type":"News Article","summary":"A string of tech hubs, from Tallinn to Prague, are breeding blessings of unicorns and pulling in new levels of international investment. Google for Startups is helping new entrepreneurs to build on that historic success","title":"Showcasing Eastern Europe’s Major Innovation Engines","detailed_content":"CITIES ACROSS CENTRAL and Eastern Europe, from Warsaw to Tallinn to Kyiv, are fertile ground for tech startups. Early success stories such as Skype, developed in Tallinn, LogMeIn (now GoTo), founded in Budapest, and UIPath (founded in Bucharest and launched on the NYSE last year at $30bn), have helped foster a dynamic ecosystem.\nGoogle for Startups’ Joanna Nagadowska says the region’s tech sector is being driven by a “positive flywheel” as it matures, with savvy and seasoned local talent now launching their own startups. “Central and Eastern Europe today is not an overnight success. It was built on a generation of entrepreneurs who know how to start and scale businesses.”\nWe’ve highlighted five key Central and Eastern Europe cities, including Kyiv. The Ukrainian capital’s tech sector has such momentum that it continues to grow, despite the Russian invasion. Warsaw remains the region’s tech hub and a number of Ukrainian startups have satellite offices in the city. Tallinn births more startups per capita than anywhere in Europe, while Vilnius has leveraged its liveability to develop a vibrant tech ecosystem. Prague has global credentials in developing cybersecurity tech, but boasts a growing and quickly diversifying startup scene.\nKyiv\nBefore the Russian invasion of Ukraine, Kyiv was the rising star of the European startup scene. It was the launch site for six unicorns, from GitLab to NFT pioneer Unstoppable Domains and workflow automation star, AirSlate—the latter two went unicorn this summer.\nThe IT sector is still growing in Ukraine, with many startups opening satellite offices in other countries, particularly Poland. Earlier this year, Google CEO Sundar Pichai announced the $5m Google for Startups Ukraine Support Fund, providing cash awards and mentoring support.\nElai.io was one of the first beneficiaries of the Ukraine Support Fund, and was launched in Kyiv last year by Vitalii Romanchenko, Alex Uspenskyi and Aleksey Pshenichniy, all relative veterans of the Kyiv tech scene.\nLeveraging advanced AI, Elai.io’s Software as a Service tool allows users to easily create videos using just text, putting words in the mouths of digital avatars. It offers a library of templates and animations, works in over 65 languages, and the avatars are based on a diverse range of real-life actors.\nRomanchenko argues that despite the vitality of the startup scene in Kyiv, and the depth of talent in the city, there is need for more outside investment. \"Kyiv is home to thousands of skilled engineers and IT professionals,” he says. “We have people who know how to build awesome products while working in big offshore businesses but a lot of time we lack individuals who actually start their own companies. We need help with building a stronger startup ecosystem, and getting more VCs and angels involved to support early-stage companies.\"\nThe Google for Startups Campus in Warsaw\nANNA LIMINOWICZ\nWarsaw\nGoogle for Startups opened its Warsaw Campus back in 2015, since then almost 100,000 startups and community members have visited. The city has also become a satellite base for Ukrainian tech firms, with Google for Startups providing workspace for firms in temporary exile. “The Google for Startups Campus in Warsaw is our hub for Central and Eastern Europe. It was built on a strong commitment to support this incredibly diverse startup ecosystem with its almost 200 million people across over a dozen countries. Especially in Poland we see an emerging number of unicorns like Allegro or Docplanner, fuelled by a solid pipeline of rising stars like Booksy, Brainly, ICEYE, Tylko or Packhelp. They are all testament to the strong momentum we see for Eastern European startups today.” says Michal Kramarz, head of Google for Startups, Central Europe.\n\"We strongly believe our platform will change how primary care is delivered,\" says Agata Mlodawska, content lead at Polish startup Infermedica. The HealthTech startup, an alumn of the Google for Startups programme, has a mission, she adds, to \"make healthcare accessible, affordable and convenient by automating primary care processes, from symptom to outcome\".Mlodawska says the city’s tech scene now needs to pick up on Google for Startups’ approach to shared growth. “We need more tech and growth meetups to share knowledge and experience, not only on technology but also about sales, scaling, building company culture and hiring.”\nVilnius\nPut simply, the Lithuanian government is extremely startup-friendly, and the capital, dotted with accelerators, has cultivated a close-knit business community. The pandemic has seen Lithuanians return to the capital from around Europe, and the city is also welcoming disgruntled tech talent from neighboring Belarus.\nFintech is a particular strength, but the city’s startup ecosystem is deep and broad: take the mobility platform Trafi; Blockchain banking platform Bankera; and fashion resale marketplace Vinted — its first unicorn.\nVilnius-based Kamilė Jokubaitė is cofounder and CEO of Software as a Service platform Attention Insight, which uses eye-tracking and AI to create attention heat maps, helping companies to make their landing pages, marketing and packaging as eye-catching as possible. Jokubaitė, who is a Google for Startups alum, explains that “we are forming a new niche in the market which perceives AI as our colleague—a way to do our work better, not as a threat taking over our jobs.”\nJokubaitė says Vilnius-based startups are a perhaps a little too reticent and slow to claim the attention they deserve. And argues that the Google for Startups programme has been a confidence booster and a space to share successes and failures. \"The program united cofounders into peer groups where we share our knowledge and experience of overcoming challenges,\" she says. \"It enables founders to create new products and projects without repeating mistakes.\"\nTallinn\nTallinn is a small but mighty tech-sector powerhouse, leading the rest of Europe in terms of startup creation and VC investment per capita. The customer relations management platform Pipedrive, and mobility app Bolt—both unicorns—are just two digital headliners launched in the Estonian capital. But it is Skype, developed in Tallinn in 2003, that established a model for the tech sector’s development as well as creating a funding and talent ecosystem that helped launch successive waves of startups in the city, including Transferwise (now known as Wise), Pipedrive, robot delivery specialist Starship Technologies, and the identity verification service, Veriff.\nLaunched in 2015, Veriff verifies customer identity using AI-powered factors including facial recognition, and behavioural and technological indicators, that show an individual is who they say they are. Its founder, Kaarel Kotkas, had previously worked in verification operations at Wise. Three years after launch, Estonian VCs named Veriff Startup of the Year 2018.\nPrague\nPrague is becoming one of the best places to start up or scale your business in Central and Eastern Europe. “Prague and other cities, such as Brno, are not only fantastic places to live in, but the overall startup ecosystem is picking up in terms of its overall maturity, access to smart angel, VC and PE capital along various verticals, meaningful connections to corporations and other actors of importance, an emerging community of founders and dedicated accelerators, and a quality pool of human capital,” says Petr Vítek, the cofounder of Impact Hub Prague, which is a Google for Startups partner. “It is great to see these developments materialize not only in unicorns such as Rohlik or ProductBoard, but also other awesome startups—which we will hear a lot about soon!”\nFor more information about Google for Startups' offering, visit startup.google.com\nThis article was originally published by WIRED UK","creation_date":"2022-10-06","tags":["","BRAND LAB","PROMOTION","GOOGLE"],"author":null,"category":null}