{"id":"c5b47ae3-7a2a-45bf-b85d-7e4e5a5e3eba","article_link":"https://cointelegraph.com/news/coinbase-vitalik-wallets-millions-stuck-bridge-contracts","website_source":"Cointelegraph","article_type":"News Article","summary":"Arkham Research tagged and notified wallet owners to look at the addresses and retrieve their funds, which have been stuck for months.","title":"Wallets linked to Coinbase and Vitalik Buterin have millions ‘stuck’ in bridge contracts","detailed_content":"Dozens of crypto whale wallets with assets ranging from six to seven figures are stuck on multiple decentralized finance (DeFi) bridge contracts.\nOne of these whale wallets is linked to Ethereum co-founder Vitalik Buterin, who has over $1 million worth of assets stuck for over seven months, with other wallets having assets unclaimed for over two years.\nAccording to a report published by crypto analytics firm Arkham Intelligence, several notable whale addresses linked to prominent crypto individuals and entities have their funds stuck in the bridge contracts for as long as two years.\nSource: Arkham\nDeFi bridge contracts are software protocols that allow the movement of assets and data between different blockchain networks, enabling interoperability within the DeFi ecosystem.\nHowever, not all DeFi bridges function the same. On the one hand, cross-chain bridges enable users to automatically obtain their assets on the other chain.\nOn the other hand, traders using native bridges must retrieve their funds manually as there is no way for the smart contract to remind users to do so, which could result in situations where users forget their money.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOne wallet linked to “thomasg.eth” has had $800,000 stuck in Arbitrum Bridge for one year and 10 months. Another wallet, linked to Bofur Capital, with 27 wrapped Bitcoin worth $1.8 million, has been stuck for two years and three months.\nSimilarly, another wallet linked to nonfungible token (NFT) user Mike Macdonald has about $117,000 in assets linked to CryptoPunks sales stuck on a bridge contract.\nArkham suggested the account owner take a look, reminding them that if they “own the account that sent 5 CryptoPunks to, then you might also own the account that received the proceeds after they were sold.”\nAnother wallet that received 50 Ether\nETH\n$3,032\nfrom Vitalik.eth seems to have been forgotten for seven months despite holding nearly $1 million worth of ETH on the Optimism bridge.\nSource: Arkham\nAnother linked to Coinbase crypto exchange was also identified and contains $75,000 worth of assets stuck for nearly six months.\nArkham suspects Coinbase tried bridging $75,000 worth of USD Coin\nUSDC\n$1.00\nto ETH and forgot about it. The assets are stuck in the Optimism bridge contract and waiting to be claimed.\nArkham notified whales linked to the stuck and forgotten funds to retrieve them in case they had forgotten about them. It also reminded the community that these instances can occur due to the nature of cross-chain bridges.\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-24","tags":["#Blockchain","#Coinbase","#Vitalik Buterin","#DeFi"],"author":"by Prashant Jha","category":null}