{"id":"c63fb5c0-ff44-4002-b291-07d4d8cd0479","article_link":"https://cointelegraph.com/news/mastercard-us-banking-tokenized-settlements","website_source":"Cointelegraph","article_type":"News Article","summary":"The partnership between significant banking giants in the U.S. and Mastercard aims to streamline multiple asset-class settlements on a shared ledger platform.","title":"Mastercard joins forces with US banking titans for tokenized settlement trials","detailed_content":"Payment processing and settlement firm Mastercard has joined hands with major banking institutions in the United States, such as Citigroup, Visa and JPMorgan, to test distributed ledger technology for banking settlements using tokenization.\nThe partnership between the banking giants and the payment processor aims to test shared-ledger technology called Regulated Settlement Network (RSN). RSN enables tokenized assets like Treasurys, investment-grade debt instruments and money from commercial banks to be settled collectively.\nCurrently, securities such as investment-grade debt and assets such as money from commercial banks function on different systems. Using RSN, settlement procedures will occur on a single platform by converting various assets into tokens and settling them on a distributed ledger.\nThe current trial phase expands on a 12-week pilot phase that started in late 2022. The test was earlier focused on cross-border and domestic dollar payments between banks. The ongoing proof-of-concept (PoC) RSN trials are focused on simulating settlements in the United States dollar.\nIn a May 8 statement, Mastercard said the project is focused on increasing the efficiency of cross-border settlements and reducing the chance of error and fraud.\nRaj Dhamodharan, head of blockchain and digital assets at Mastercard, said that the “application of shared ledger technology to dollar settlements could unlock the next generation of market infrastructures — where programmable settlements are 24/7 and frictionless.”\nRelated: Visa and Mastercard: A boon for wallet holders, a threat to crypto exchanges?\nThe RSN PoC has seen two significant additions to the participating banking institutions: interbank tokenized deposit networks, in which the USDF Consortium will be a direct participant, and the Tassat Group will be a contributor, and another banking giant, Deloitte, provides advisory services. The program manager will be the Securities Industry and Financial Markets Association.\nThere are 10 participant banking giants: Citi, JPMorgan, Mastercard, Swift, TD Bank N.A., U.S. Bank, USDF, Wells Fargo, Visa and Zions Bancorp.\nSix more project participants will offer their subject-matter expertise, including the nonprofit MITRE Corporation, BNY Mellon, Broadridge, the DTCC, ISDA and Tassat Group.\nMagazine: Crypto in the Philippines: Necessity is the mother of adoption","creation_date":"2024-05-08","tags":["#Blockchain","#Cryptocurrencies","#Banks","#Adoption","#United States","#Citi","#JPMorgan Chase"],"author":"by Prashant Jha","category":null}