{"id":"c74875f4-e152-475d-9732-adb6c6763334","article_link":"https://cointelegraph.com/news/crypto-privacy-zero-knowledge-proofs-protocols","website_source":"Cointelegraph","article_type":"News Article","summary":"The convergence of ZK-proofs and decentralized identity systems could create more compliant privacy-preserving protocols without sacrificing user privacy.","title":"Regulators are cracking down on financial privacy, but ZK-proofs can help","detailed_content":"Regulators are cracking down on privacy-preserving protocols like cryptocurrency mixers, but zero-knowledge (ZK) proofs could offer a solution for both developers and regulators.\nOffering privacy-preserving features in a legally compliant manner is among the biggest concerns of today’s privacy-focused blockchain protocols, which can be used by virtually anyone with internet access.\nHowever, the evolution of ZK-proofs, along with other privacy-preserving paradigms, like decentralized identity verification systems, could help protocols maintain privacy and ensure they aren’t servicing any terrorist organizations or money launderers, according to Matthew Niemerg, co-founder and president of AlephZero.\nIn an interview with Cointelegraph, Niemerg explained:\nMatthew Niemerg speaking to Cointelegraph. Source: Cointelegraph\nRegulatory compliance became even more critical for privacy-focused protocols on May 14 after Dutch authorities sentenced Tornado Cash developer Alexey Pertsev to five years and four months in prison for allegedly laundering $1.2 billion worth of illicit digital assets on the platform.\nADVERTISEMENT\nMAY 15, 2024\nWeb3 travel app turns regional experiences into mintable NFTs\nTravelers around the world are ready to discover new destinations, and blockchain is here to help connect local attractions to global experiences.\nTraveling to a new region always conjures up delightful experiences and vivid memories. From visiting a historical ruin for the first time to randomly attending a local musician’s performance, the satisfying feeling of embracing the entire essence of what a touristic visit can offer keeps most of the travel industry operational and thriving.\nHowever, as the idea of a regional visit slowly turns into a plan and then into a calendar-filling endeavor, travelers soon realize that it’s way easier to dream about going to Nordic fjords than actually realizing the whole trip through scheduling, booking and transactions.\nDespite the decade-long digitization of the industry, travel systems are still operating at a surprisingly regional scale. Along with travel agencies, regional attractions and vendors like museums or event venues face limited market reach, often hindering them from marketing and selling their offerings to a global audience. Even when they score by selling tickets to a global customer group for a period of time, the lack of better customer insights makes it hard to reproduce the success.\nFor travelers, that translates to unnecessarily complicated booking processes that require ticketing from multiple apps and services. Furthermore, the potential risks associated with first-time visits beg for full traceability and transparency across the travel experience.\nNFT ticketing for the masses\nThe traditional “Web2” travel industry lacks a reliable solution to seamlessly integrate local offerings with global platforms, and blockchain is here to change that. VisitorApp, a blockchain-powered ticketing solution, showcases how Web3 can simplify regional travel for both travelers and industry participants.\nUsing Camino Network, the first blockchain designed for the needs of the travel industry, VisitorApp offers users a one-stop shop for discovering and purchasing local offerings directly from regional vendors. The VisitorApp team has spent four years to forge regional platforms and mobile apps for cities, regions and event organizers.\n  Read more\nThe sentencing was handed down despite Tornado Cash being a noncustodial crypto mixing protocol — meaning that the funds that go through the protocol are never held or controlled by it.\nIn a promising development for open-source code developers, ZK-proofs could be used to guarantee that none of the cryptocurrencies on a set platform were previously related to any illicit activities, according to Niemerg:\n“From the time of the last 20 transactions or from block XYZ, [ZK-proofs] can create various types of proofs guaranteeing that these funds never touched anybody associated with the sanctions list.”\nWith a decentralized Web3 identity for each user, ZK-proofs could be used to verify that funds and wallets are unrelated to criminal activity while maintaining the user’s anonymity.\nHowever, Niemerg noted that both ZK-proofs and decentralized identity systems need more development before facilitating such complex functions.\nRelated: Coinbase recovers after system-wide outage, but user withdrawals remain offline\nFinancial privacy is not a crime\nFor AlephZero, helping developers build compliant privacy tools is a priority, according to Niemerg:\n“There’s plenty of actual real-world use cases whenever it comes to private transactions… Just because you want privacy, that doesn’t mean that you’re doing something wrong.”\nFinancial privacy has been a growing concern since 2022 when the United States government blacklisted Tornado Cash for alleged money laundering.\nThe concerns intensified on April 24 after the arrest of the Samourai Wallet founders. The cryptocurrency wallet’s CEO, Keonne Rodriguez, and chief technology officer William Hill will each face one count of conspiracy to commit money laundering and one count of conspiracy to operate an unlicensed money-transmitting business.\nThe arrest was classified as an attack on crypto privacy pioneers, according to Ki Young Ju, founder and CEO of CryptoQuant:\n“Privacy stands as a core value of Bitcoin. Mixing itself is not a crime. Even crypto exchanges use mixing to safeguard user privacy. It’s like punishing the inventor of the knife instead of the one who uses it.”\nRelated: Pre-launch token trading 20 times more volatile than post-launch trading — Keyrock\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-14","tags":["#Blockchain","#Cryptocurrencies","#Privacy","#DeFi","#zk-Rollup","#Regulation","#Tornado Cash"],"author":"by Zoltan Vardai","category":null}