{"id":"c7666521-0ec5-4e59-8bec-d3594ff8ba76","article_link":"https://cointelegraph.com/news/intent-execution-network-aims-to-simplify-blockchain-with-15m-investment-led-by-polychain","website_source":"Cointelegraph","article_type":"News Article","summary":"The rapid expansion of blockchain technology presents opportunities and challenges in scalability and user navigation within an increasingly fragmented ecosystem.","title":"Intent execution network aims to simplify blockchain with $15M investment led by Polychain","detailed_content":"As the blockchain landscape flourishes, scalability and user navigation emerge as significant challenges. DappOS, an intent execution network, secures $15.3 million in Series A funding led by Polychain to streamline on-chain outcomes.\nAs the blockchain world rapidly expands, the rise of layer-1 (L1) and layer-2 (L2) blockchains marks the beginning of an exciting era. L1 blockchains serve as foundational networks, like Ethereum or Bitcoin, where all transactions are processed directly on the chain. However, with the growth of these networks came congestion and scalability challenges.\nEnter L2 solutions, such as Lightning Network for Bitcoin or optimistic rollups for Ethereum, designed to alleviate scalability issues by processing transactions off the main chain yet ensuring they are still secured by the underlying L1 blockchain.\nEthereum founder Vitalik Buterin’s example of Ethereum as a layer-2 centric ecosystem from the 2024 Hong Kong Web3 Carnival\nThe blooming ecosystem of L1s and L2s, each fostering its mini-ecosystem, is set to dramatically lower the barrier to launching new blockchains. The result? There is a potential explosion in the number of networks, with many attracting significant investment. The proliferation promises to fragment the Web3 ecosystem further, making navigation and interoperability a daunting task for users.\nSimultaneously, the advent of innovative decentralized applications (DApps) in realms like social finance and game finance is ushering in users from the conventional Web2 world. The newcomers, unaccustomed to the intricacies of blockchain technology, seek streamlined workflows and intuitive interfaces akin to what they’re used to, further emphasizing the need for cohesive, user-friendly solutions.\nStreamlining blockchain interactions with $15M funding\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAmid this landscape of burgeoning blockchain technologies and the pressing need for streamlined, user-centric platforms, one solution emerges with a promise to bridge the gaps within the fragmented ecosystem. DappOS, an intent execution network, has secured $15.3 million in a Series A funding round, valuing the company at $300 million.\ndappOS raised $15.3 million in a Series A round led by Polychain at a $300 million valuation. Source: dappOS\nPolychain spearheaded the round, which included contributions from a diverse group of investors, including Nomad Capital, IDG, Flow Traders and NGC. The financial injection is earmarked for operational expansion and further development efforts.\nAdditionally, dappOS has gained recognition in the blockchain space, having been selected for the Binance Incubation Program’s Season 5 in December 2022 and receiving seed round investment from Binance Labs and Sequoia China in July 2023.\nThe project operates by creating a two-sided marketplace that addresses supply and demand within the blockchain ecosystem. On one side, service providers stake collateral to offer various execution services. On the other, developers utilize the platform to meet users’ needs by efficiently turning specific intents into on-chain results.\nOMS: Security solution for intent-based tasks\nTo enhance efficiency and cover various use cases, dappOS introduces the optimistic minimum stake (OMS) mechanism, which was developed to improve the network’s security for intent-based tasks.\nDappOS builds an intent-based infrastructure to solve scalability and complexity issues. Source: dappOS\nOMS mandates that each task be associated with a predefined value and potential compensation for failure, allowing for the execution of tasks before their outcomes are verified. If a task fails, the network employs a consensus process to slash the responsible service providers, ensuring users are either satisfied by the task’s completion or compensated accordingly.\nDappOS’ OMS system benefits both service providers, who are required to stake only slightly more than the total value of active intent tasks, and users, who enjoy cost-efficient and rapid task execution. The post-task verification process facilitates a decentralized verification strategy, bolstering the network’s efficiency and security in handling diverse use cases.\nWith over 20 corporate projects, including GMX, BENQI and QuickSwap, under its belt, dappOS has garnered a user community of over 350,000 and executed more than 1.5 million transactions.\nAmid a rapidly expanding blockchain ecosystem and its complexities, dappOS offers a solution for streamlined, user-centric blockchain interactions. Its innovative approach promises to redefine how users and developers navigate the increasingly fragmented landscape of blockchain networks and applications.\nLearn more about dappOS\n#Blockchain\n#Business\n#Security\n#Decentralization\n#Funding\n#Technology\n#Adoption\n#Scalability\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-09","tags":["#Blockchain","#Business","#Security","#Decentralization","#Funding","#Technology","#Adoption","#Scalability"],"author":"by Nihatcan Yanik","category":null}