{"id":"c79fee3f-8fa8-45b3-a560-3ba0d6568cef","article_link":"https://cointelegraph.com/news/paraguay-pauses-progress-bitcoin-mining-ban-bill","website_source":"Cointelegraph","article_type":"News Article","summary":"Paraguay’s lawmakers have proposed an alternative to a controversial Bitcoin mining blanket ban and are set to debate the topic later this month.","title":"Paraguay to reconsider Bitcoin mining ban, mulls selling energy to miners","detailed_content":"Paraguayan senators have halted progress on the proposed cryptocurrency mining ban introduced last week, with officials now considering the benefits of selling excess energy from its Itaipu hydropower plant to miners instead of exporting it to Brazil and Argentina.\nA debate will be held in an April 23 public hearing to discuss the benefits and drawbacks of Bitcoin mining in the country, Senator Lilian Samaniego confirmed in an April 10 Senate session.\nIt comes about a week after lawmakers introduced a draft law on April 4 to temporarily ban Bitcoin\nBTC\n$62,997\nmining for 180 days, claiming illegal cryptocurrency mines have been stealing power and disrupting the country’s electricity supply.\nHowever, days later, Paraguayan lawmakers approved a declaration to support local and foreign investment infrastructure four days later on April 8, which Senator Salyn Buzarquis hopes will push the Paraguayan Ministry of Industry to study the economic advantages of selling excess energy to Bitcoin miners instead.\nSenator Salyn Buzarquis speaking to Paraguay’s senate on April 10. Source: YouTube\nIn an April 8 letter to Congress, Buzarquis noted that that 45 licensed cryptocurrency miners are on track to generate $48 million for the National Electricity Administration (ANDE) by 2024 — expected to reach $125 million by 2025 after miners install more equipment.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nWith the cost of electricity production at Paraguay’s Itaipu’s hydropower plant hovering around the $22-per-megawatt-hour (MWh) range, ANDE could generate a 45% net profit margin by selling off excess energy to local Bitcoin miners at $40/MWh.\nThis equates to $73 million annually and about $17 million in value-added tax for the treasury, noted Buzarquis, who claimed that Bitcoin mining operations could even save ANDE from filing for bankruptcy.\n“This flow of funds is what is going to save ANDE from going bankrupt; to be able to invest more in infrastructure and not to raise the rate for Paraguyans.”\nParaguay currently sells energy to Brazil at a subsidized $10/MWh rate, Buzarquis noted.\nCryptocurrency mining could also generate more employment opportunities for the local economy, Buzarquis added in the April 10 senate session.\nRelated: Bitcoin’s halving won’t see a 600% return this year — so adjust your strategy\nIn the earlier April 4 bill, lawmakers argued that there have been 50 cases of interrupted power supply linked to cryptocurrency miners illegally tapping into these electricity sources since February.\nIf passed, it could impact one of the largest industry players, Marathon Digital Holdings, which expanded into Paraguay last November, deploying 27 MW around the Itaipu hydroelectric power plant.\nBut Paraguay would be shooting themselves in the foot by banning the entire industry, Hashlabs Mining co-founder and chief mining strategist Jaran Mellerud told Cointelegraph. \"The country would be best off cracking down on illegal mining operations while leaving the legal miners alone.\"\nIn addition to the 45 licensed miners, there are another 20 applicants seeking approval to mine in the country, totaling 2000 MW, according to an April 9 article by Digital Mining Solution's founder Nico Smid.\nThe controversy in Paraguay comes as Bitcoin miners prepare for the upcoming Bitcoin halving event expected to take place on April 20, which will slice miner rewards from 6.25 BTC ($442,000) to 3.125 BTC ($221,000).\nMagazine: Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-11","tags":["#Bitcoin","#Blockchain","#Mining","#Law","#Business","#Adoption","#Bitcoin Mining","#Bills"],"author":"by Brayden Lindrea","category":null}