{"id":"c7b6a5d9-1a8a-4aa9-a2b0-352d9ae570b7","article_link":"https://cointelegraph.com/news/summer-perfect-opportunity-investing-crypto-arthur-hayes","website_source":"Cointelegraph","article_type":"Tweet","summary":"The BitMEX co-founder says the current phase of price consolidation is ideal for accumulating crypto before macroeconomic factors trigger the next leg up in the bull market.","title":"Summer will offer ‘perfect opportunity’ for investing in crypto — Arthur Hayes","detailed_content":"According to BitMEX co-founder Arthur Hayes, the next few months will offer an ideal opportunity to accumulate crypto before the next leg up of the bull market kicks in.  \n“Those people who have fiat and extra cash that want to allocate to crypto, this is the perfect opportunity to do so,” Hayes told Cointelegraph in an exclusive interview, referring to the current rangebound market. \nAccording to Hayes, inflationary monetary policies will play the main role in propelling Bitcoin\nBTC\n$63,046\nand the broader cryptocurrency market higher later this year.\n“Major economies around the world are going to print even more money between now and, say, the next 18 to 24 months,” Hayes predicted. \nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAccording to Hayes, the upcoming United States presidential elections will be a bullish catalyst for crypto, as the country’s financial authorities will be incentivized to implement looser monetary policies, possibly to support President Joe Biden’s reelection. \nIn the past, periods of monetary expansion have led to crypto market rallies. \n“When you control the purse of the government, it’s very easy to do so by printing money, borrowing it, and handing it out to people in various forms,” Hayes explained. \nTo find out more about Hayes’ investment thesis on crypto for the second half of 2024, check out our full interview on Cointelegraph’s YouTube channel, don’t forget to subscribe!","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Altcoin","#Business","#Ethereum","#Bitcoin Price","#Bitcoin Analysis","#Bitcoin Halving","#DeFi","#Solana","#NFT","#Layer2","#Bitcoin Ordinals","#Ethereum ETF"],"author":"by Marco Castrovilli","category":null}