{"id":"c82f8bab-cb65-4bd0-a127-7851574a2214","article_link":"https://cointelegraph.com/news/cardano-founder-proposes-bitcoin-cash-integration","website_source":"Cointelegraph","article_type":"News Article","summary":"The ayes are winning with 8,301 votes to 4,212 against at the time of publication.","title":"Cardano founder proposes Bitcoin Cash integration in X poll","detailed_content":"Cardano founder Charles Hoskinson recently posted a “hypothetical poll” on the X social media platform asking the crypto community if they’d like to see a Cardano and Bitcoin Cash integration. \nThe poll received more than 12,000 votes in its first 24 hours with a 66.3% early majority voting “Yes” to the proposal.\nSource: Charles Hoskinson\nAs mentioned above, Hoskinson labeled his poll as being hypothetical. However, as Elon Musk has shown since his purchase of the X platform, it’s possible to use the platform as a steering point for decision-making.\n“Would you like to see Bitcoin Cash become a Cardano Partnerchain upgraded with Useful Proof of Work Leios, NiPoPoWs, and Ergo tech, thus being the fastest and most useful proof of work chain ever built?”\nBen Scherrey, founder and chief technology officer of blockchain firm Biggest Lab, posted commentary in favor of the move, stating that he’d “always thought there was some natural synergy between the two chains given the shared UTXO model that allows for high scalability and decentralization.”\nWhile the community appears to support the idea of a Bitcoin Cash and Cardano integration, how such a partnership would form and function is a bit murky.\nOn the technology side, Hoskinson used the term “partnerchain.” This seems to imply Bitcoin Cash (BCH) would have to be bridged or cross-chained in some form in order to operate with the proposed upgrades.\nAssuming both development teams could agree on the technical aspects of the partnership, there would still need to be a consensus among stakeholders and developers.\nHoskinson’s discourse on social media comes as Cardano prepares for two “major upgrades” in 2024. As Cointelegraph recently reported, the company is preparing for the “Chang” hard fork slated for sometime in the second quarter of 2024, as well as a new proof-of-stake model called “Ouroboros Leios.”\nHoskinson lauded the pending upgrades in his response to an April 7 video posted by crypto influencer Ben “Bitboy” Armstrong. In the video, Armstrong referred to Cardano as “dead.”\nRelated: Crypto veterans call out DOJ for targeting Roger Ver a decade after he left US\nExchange or buy ADA\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Charles Hoskinson","#Bitcoin Cash","#Cardano"],"author":"by Tristan Greene","category":null}