{"id":"c8327d70-c6a2-4208-9d21-f890b3e0beb7","article_link":"https://cointelegraph.com/news/crypto-payments-vs-apple-pay","website_source":"Cointelegraph","article_type":"News Article","summary":"Cryptocurrency-based mobile payments must be as functional as Apple Pay and Google Pay to challenge conventional payment services, according to Helio CEO Stijn Paumen.","title":"Apple Pay is the benchmark as crypto mobile payments push for adoption","detailed_content":"Cryptocurrency payment platforms are slowly being onboarded to major e-commerce platforms and retail stores, but their user experience and performance don’t quite match that of Apple Pay. \nStijn Paumen, CEO of growing crypto payments platform Helio, paints a picture of a sector still in its infancy during a one-on-one interview with Cointelegraph. \nThe CEO and founder said that while Bitcoin and Ethereum are pioneering decentralized blockchain protocols, the base layer of both chains cannot compete with the performance and functionality of traditional financial infrastructure.\n“I think the benchmark is Apple Pay. How are you going to beat Apple Pay, where I can just tap my phone and I’ve paid within three seconds,” Paumen explains.\nGareth Jenkinson (l) in conversation with Stijn Paumen. Helio operates out of London with a team of 15 people. \nThe advent of newer blockchain networks is beginning to bridge the gap, but not without teething issues, as Paumen said:\n“Now with the second generation of blockchains like Solana, even though there’s a lot of talk about congestion, we actually have the engineering resources to figure it out.”\nHelio was founded by Paumen and chief technology officer Jim Walker in March 2022. The pair had previously exited a successful startup and shifted into the crypto sector. Paumen says they were excited by the prospect of Solana’s high TPS and fast finality as the basis of building a new crypto payment platform.\n“Ever since someone paid 10,000 BTC for a pizza, crypto payments became a thing. But the user experience sucked. You had 20-minute payment times or payments not being processed at all,” Paumen said.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelated: How Solana developers are tackling network congestion challenges\nHelio’s platform allows merchants and e-commerce sites of all sizes to set up and accept cryptocurrency payments. According to Paumen, the platform facilitates $30 million in monthly payments but still mainly caters to the Web3 space on both the user and merchant fronts.\nIt has also made waves in the Solana ecosystem, facilitating the sale of some 80,000 Solana mobile phones through its payment plugin. Helio's high-profile integrations include managing the Solana Pay plugin on Shopify and its WooCommerce plugin. \nHelio has been operating the Solana Pay plugin on Shopify since December 2023. Source: Helio\nThe platform supports Bitcoin\nBTC\n$63,026\n, Solana\nSOL\n$154\n, Solana-based USD Coin\nUSDC\n$1.00\nand SPL tokens as well as Ethereum-based payments. Helio also facilitates ticket sales for the annual Ethereum Community Conference (EthCC), which connects to their Bizzabo event software.\nRelated: Boba Guys, Shopify users showcase adoption of Web3 tools — Solana Breakpoint\nPaumen believes that Web3 payments potentially challenging mainstream industry players remains an ecosystem challenge.\n“If you have a Phantom wallet and you know how to use it, you can pay on a Helio checkout with a single tap as fast as Apple Pay. But you need to assume that you're a crypto-fluent user, and that's a very small percentage,” Paumen admits.\nProgress will likely be gradual, as more crypto-curious users begin to use Web3 wallet and make payments in their token of choice. Paumen also says that the onboarding user experience needs to improve to be accessible to a wide demographic of users.\nHelio's platform allows merchants to accept a variety of cryptocurrencies as payment for goods and services. Source: Helio\n“We talk about this concept of crypto granny internally. What we mean is, when crypto granny buys a Bored Ape hoodie for her grandson, she needs to be able to do that without owning crypto, without even knowing what blockchain is,” Paumen added.\nHelio’s CEO concluded by saying that the future could see the likes of Apple Pay potentially settling payments on their own blockchain. However, he said he firmly believes in the idea of a decentralized way to send money worldwide “without intermediaries, with fast or instant settlement with low fees.”\n“I think it’s just a really powerful technology. We’re still early. The fact that Visa is partnering with Solana is a great signal, though.”\nWhile onboarding major e-commerce platforms is the lowest-hanging fruit for mass adoption, Paumen believes that streaming platforms like Vimeo and even OnlyFans also present an excellent platform for the utility of crypto payments. \nMagazine: Big Questions: How can Bitcoin payments stage a comeback?\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-22","tags":["#Blockchain","#Cryptocurrencies","#Payments","#Adoption","#Mobile Payments","#Micropayments","#Solana"],"author":"by Gareth Jenkinson","category":null}