{"id":"c8448c82-dee1-45d6-8be5-ab9c90b6339e","article_link":"https://cointelegraph.com/news/dfinity-launches-web3-accelerator-platform-internet-computer","website_source":"Cointelegraph","article_type":"Tweet","summary":"The accelerator launches with $15 million in funding and mentorship support from a plethora of investors.","title":"Dfinity launches Web3 accelerator platform on the Internet Computer","detailed_content":"The Dfinity Foundation, a not-for-profit organization based in Switzerland and major contributor to the Internet Computer blockchain, announced the launch of the Olympus Acceleration Platform.\nAccording to a press release, Olympus represents the first decentralized, on-chain Web3 accelerator. Dfinity said it’s “a first of its kind platform” that will be used by “teams around the world to organize and launch their own accelerator programs.”\nThe foundation also cites Olympus’ “Open Stake” model, where projects, mentors and investors can “interact freely, enabling permissionless ecosystem inclusivity and unlimited integrations” as a determining factor separating it from similar accelerator programs.\nDominic Williams, founder and chief scientist of the Dfinity Foundation, described the platform as “a global platform for everyone, in a statement:\n“By creating a web3-based global platform for everyone, we're able to bring together top talent, projects, investors, and mentors to create a credible and trustless marketplace offering equal opportunity and access to all qualified projects. Traditional accelerator programs are permissioned and operate as silos, many are also not sustainable and rely on grants. Olympus is a new model.”\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe new platform will purportedly feature what Dfinity calls a “trustless perpetual loop,” providing on-chain verification of key project growth metrics, via the infrastructure of the Internet Computer Protocol.\nRelated: Internet Computer users pledge $80M to decentralize its project ecosystem\nThe Internet Computer is a decentralized computing platform that leverages blockchain technology to host software directly on the internet. According to its mission, the Internet Computer’s supporters aim to democratize internet infrastructure and foster a more “open and equitable digital ecosystem.”\nOlympus was developed with support from Hong Kong-based Web3Labs, a blockchain accelerator and with mentorship and other support from investors and partners at VC funds including Fenbushi Capital, Fundamental Labs, Softbank Vision Fund, NewTribe Capital, Cypher Capital, Bitcoin Frontier Fund, Summer Ventures, L2IV, Dext Force Ventures, Leadblock Partners, viaBTC Capital, Cipholio Ventures, Chiron Group, 3X Capital, Plutus.VC and others.\nExchange or buy ICP\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Blockchain","#DeFi","#Web3","#Internet Computer"],"author":"by Tristan Greene","category":null}