{"id":"c84b6735-b73e-4469-aaca-b6676b96ebcc","article_link":"https://cointelegraph.com/news/runes-protocol-sees-significant-decline-in-activity","website_source":"Cointelegraph","article_type":"News Article","summary":"Despite generating hundreds of thousands of dollars in daily fees, Runes has only surpassed $1 million in total fees twice in the last 12 days.","title":"Runes protocol sees significant decline in activity","detailed_content":"Activity on the Runes protocol has significantly decreased since its first week of trading. There was a notable decline in activity on May 10, with very few new mints and new wallets interacting with the protocol.\nAccording to a Dune Analytics dashboard, the protocol’s fee revenue has steadily declined. Although Runes still earns hundreds of thousands of dollars daily in fees on the Bitcoin blockchain, the total fees have only surpassed $1 million twice in the last 12 days, indicating a downward trend.\nRunes is a new Bitcoin token standard that allows users to create fungible tokens on the blockchain, launched by Ordinals creator Casey Rodarmor. Ordinals enabled nonfungible tokens on Bitcoin.\nThe Runes protocol debuted on April 20, which coincided with the latest Bitcoin halving event. The launch of Runes triggered a frenzy among investors, leading to a surge in transaction fees and a record-breaking windfall for Bitcoin\nBTC\n$62,406\n miners, with over $135 million generated in fees during the first week alone.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nData from Dune Analytics shows that until April 24, Runes-related transactions made up the majority of the transactions on the Bitcoin network. On April 23, Runes claimed its highest transaction share of 81.3%, pushing the Bitcoin transaction share down to 18.15%, with Ordinals and BRC-20 transactions at 0.1% each.\nRunes transactions dwindled consistently over the next nine days until May 2. From May 3, Runes began to recover, regaining its transaction share above 60% on May 4 and 5.\nRelated: Bitcoin’s Ordinals, Runes key to solving the mining subsidy problem: ViaBTC\nThe mining community welcomed the rising fees, as their earnings dropped significantly following the Bitcoin halving. In May, total revenue for Bitcoin miners dropped to under $30 million per day.\nRunes, like Ordinals, launched a new token standard on the Bitcoin blockchain. Bitcoin recently processed its one billionth transaction.\nRunes has already achieved significant success, with several Rune collections boasting market capitalizations in the hundreds of millions of dollars, according to data from Magic Eden.\nAdditionally, Rodarmor recently hinted at an innovative audioreactive generative art project during an Ordinals event in Hong Kong, further showcasing the platform’s potential.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-12","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Bitcoin Mining","#Bitcoin Halving","#Runes Protocol"],"author":"by Amaka Nwaokocha","category":null}