{"id":"c8ef8139-7da7-4347-bd19-c073502ce79b","article_link":"https://www.wired.com/story/the-rebel-drone-maker-of-myanmar/","website_source":"Wired","article_type":"News Article","summary":"In a cave in eastern Myanmar, a young engineer who goes by the nom de guerre “3D” is building weapons to fight against a brutal military dictatorship.","title":"The Rebel Drone Maker of Myanmar","detailed_content":"“WE NEEDED WEAPONS, and we needed them fast,” 3D says, sitting beneath the stalactites in a dimly lit cave, somewhere deep in the jungle in eastern Myanmar. The space reverberates with the hum of 3D printers, the devices that gave 3D his nom de guerre. A network engineer, 3D comes across as controlled and cautious, but from time to time, mostly when he’s speaking about his printers, a playful grin appears on his face. He spoke on condition that WIRED would not reveal his real name or show his face. “My parents would kill me if they [knew] what I’m up to,” he says. Not only does 3D face the risk of arrest, torture, and execution for his part in the revolution, but the military would also not hesitate to arrest his parents if they were to discover 3D’s identity.\nMyanmar’s borderlands have been plagued by civil conflicts since the end of World War II. Rebel groups, often delineated along ethnic lines, have sought autonomy from a state that was stitched together by the British Empire, and which unified distinct ancient kingdoms. The civil war escalated dramatically after the military seized power in February 2021, reversing years of tentative democratic progress. Thousands of people took to the streets to protest, but the military cracked down with stunning brutality, killing hundreds of civilians across the country. Many people took up arms against the regime, or joined existing insurgencies. Today, over 250 rebel groups are fighting against the military dictatorship in all corners of the country, turning Myanmar into a patchwork of front lines, no-man’s-land, and islands controlled by a mosaic of insurgents.\n3D joined the peaceful protests in the eastern town of Loikaw in the aftermath of the coup and witnessed the bloody response. “They fired with live ammunition at the protesters and killed many,” he says. After he saw that, 3D decided to join the revolution. He enrolled in an armed insurgent group that consisted of civilian volunteers like himself, named the Karenni Nationalities Defence Force (KNDF). What he found was a resistance movement that was massively outgunned. “We had nothing when our resistance began two years ago, and we took up against a military titan,” 3D says. “That’s when I thought, I have to find a way to make weapons from scratch.” Before the revolution began, 3D already owned a 3D printer. “But I just used it as a hobby. When I saw the urgent need for weapons, I decided to find a way to use my 3D printer.”\nFEATURED VIDEO\n Today, 3D’s printers are at the heart of the rebel group’s in-house weapons program, producing drones, stabilizers for mortars, and other munitions to support the pro-democracy fighters. These are tools that have become closely associated with Ukraine’s scrambled, open sourced defense against Russia’s invasion, but, as 3D’s work on Myanmar’s front lines shows, the bootstrapping of warfare has become a global phenomenon.\n“Without 3D printing, someone can manufacture a very high-quality weapon,” Yannick Veilleux-Lepage, assistant professor of political science at the Royal Military College of Canada, says. “But that does require a great deal of skill. You need to be a competent metal worker, and that takes a long time. With a 3D-printed firearm, it doesn’t take very long to go from no skill to [creating] something lethal. That’s how things are changing, the lethality and the ease of it.”PHOTOGRAPH: DAPHNE WESDORP\nThe first weapons that 3D manufactured for the revolution were FGC-9s, 3D-printed semiautomatic rifles. The blueprint for the weapon was created in 2018 by a gun designer using the pseudonym JStark1809. Over the course of several years, the designs were uploaded to several easily accessible online platforms, including Odysee, an open source blockchain-based media website. FGC stands for “fuck gun control,” as the gun can be manufactured without any regulated commercial gun components. It is composed of a mixture of custom 3D-printed parts, readily manufacturable metal components, and store-bought screws, springs, and bolts. JStark’s motto, “live free or die,” is engraved on a tag around 3D’s neck.\n3D produced the first FGC-9 in the early months of the coup, and the guns were used on the front line. But it soon became clear that plastic firearms weren’t up to the rigors of the battlefield, and the 3D-printed guns have been relegated to use in defensive actions or limited hit-and-run attacks. When it became clear there was no longer a need for plastic rifles, 3D started to think about how his 3D printer could help the revolution in different ways. So, in December 2022, he began working on a drone.\nInspired by a Ukrainian-made drone called the Punisher, the Liberator-MK1 was his first attempt. This small, fixed-wing reusable aircraft could carry up to 1.5 kilograms of explosives, and has already been deployed at Myanmar’s scattered front lines. The frame of the drone was 3D-printed and then covered with fiberglass. The other components—its battery, motor, and control surfaces—have to be smuggled across the border from Thailand. As cars and fuel are both expensive and scarce in rebel-held territories, the Liberator needed to be transportable by scooter, and therefore had to be compact. “There were so many things to take into account while making the design,” 3D says. “But the biggest problem we had was a weak wing structure. It couldn’t support the plane’s weight and broke in the middle.”In February this year, 3D refined the designs with the MK2. All told, it costs around $5,000 to produce a drone. Once all the components are in the country, they can be assembled in around two days.\nThe merging of 3D-printing technology and drone development has opened up new possibilities for both conventional military development as well as for non-state actors such as Myanmar’s anti-junta fighters. Military organizations have adopted 3D-printing technologies to produce sophisticated, low-cost, disposable aircraft—most visibly, and arguably most successfully, in Ukraine. This convergence has been particularly valuable to some non-state actors, like Myanmar’s rebel groups. When you lack foreign allies and your borders are sealed, you need to be innovative to get hold of weapons and bypass the conventional supply chain.\nGroups like the KNDF, which consists of mostly millennials and Gen Zs, thrive on having digital natives who can find and tweak designs online. Manuals on how to weaponize and build drones circulate online, and non-state actors often learn from the tactics of other groups that are disconnected from them, or even their enemy. When the war in Ukraine started, Ukrainians were even translating Islamic State manuals that contained instructions on how to weaponize drones, in order to prepare the population to wage an insurgency in case the Russians attacked. As Veilleux-Lepage says: “No technology is neutral. Every technology has essentially the purpose for which it is built, but can be used in various ways, by people with different ideologies.”\nIn Myanmar’s case, what these weaponized drones offer is an opportunity to strike back in an incredibly asymmetrical war. While the rebels struggle to access basic munitions, Myanmar’s military has obtained at least $1 billion in weaponry and materials needed to make weapons since the coup, according to a United Nations report that was published in May 2023. The cost of that imbalance is measured in lives. The past summer has been the deadliest for the pro-democracy rebels in the past two-and-a-half years, and casualties are reported daily.\nOn a misty morning, a dusty pickup arrives carrying the remains of a young fighter. “He died on the way here. He was injured in an airstrike,” the driver says. After the fighter is carried out of the car, a medic lifts his arm and inspects the fatal wound in his side, where a piece of shrapnel has pierced his body. On his arm, he has a self-made tattoo that says “happy,” covered in blood. To honor fallen fighters, three shots are fired in the air. “But even those shots are blanks,” says the deputy chief commander of the KNDF, who uses the alias “Maui” (named for the main character from the Disney film Moana—a giant, and the archetype of a warrior). “Ammunition is like gold for us. We don’t have the luxury to waste a single bullet.”\nWhile they’re training, KNDF volunteers are given only two .22-mm bullets to try to hit a target with. “The military junta can buy all the heavy weapons they want, but we barely have bullets to shoot with,” says Maui. “Real practice is done during active combat. But [the military] still can’t defeat us on the ground, so they attack us from the sky.”PHOTOGRAPH: DAPHNE WESDORP\nWith his drones, 3D hopes to redress that imbalance. One of his team members, a young man wearing a stained purple T-shirt, grumbles in irritation as he unsuccessfully attempts to set up the Liberator drone for a test run. “Bad compass health,” a voice from the drone repeats, as it lies on the dusty earth. “That means we have a problem with the compass,” 3D says, while he walks over to help his friend. “Without it, the drone won’t be able to be controlled properly.”\nTesting the drones is conducted at various undisclosed locations. There are spies, who might report on their position, but also junta scouting planes. When they hear the roar of an aircraft, 3D and the team operate like a well-oiled machine. Someone sprints to the drone, whose white fuselage stands out against the iron-rich red soil, and covers it with a dark net. The others hide between the foliage and under improvised bamboo roofs. Even though there is no way the scouting plane can hear their voices, no one speaks a word.\n“The launching process is the make-or-break moment,” 3D says after the scouting plane has passed. “Once it’s in the air, we know there’s no reason to worry, but sometimes it crashes due to malfunctions. There are many errors we need to consider. That’s why we continue to refine our designs. Several drones have already been lost in midair.”\nWhen everything is ready, a team member raises the drone high above their head in an open area, preparing for a running start. Once given the green light, he sprints a few meters, leaps, and releases the drone into the sky. 3D and the others cheer as the drone takes off, the craft growing smaller and smaller until it becomes merely a black dot against the blue sky. However, despite the promising launch from the ground, 3D’s expression soon turns to disappointment. “It fell about 500 meters from here,” he says.\nTwo members of the team jump on a scooter and drive off to the crash site. All that is left from the $5,000 drone is a small bundle of burned wires. 3D collects the parts that he hopes are still usable. He suspects a cable from the motor came loose, causing the drone to crash, which led to the battery exploding. “Off to the next one,” he says, with a strained laugh.\nEven though 3D’s drones have successfully attacked military command centers and outposts, it is not yet clear if they can indeed make a significant change on the battlefield. But right now, for Myanmar’s rebel groups, the Liberator is the only way to visit some of the same terror they experience on their enemy. “[The military] can’t win on the ground, so they resort to bombing us from above. We can’t defend ourselves. All we can do is hide,” 3D says. “Drones are the only thing we have to make them feel even a fraction of the trauma we feel when they bomb us with their fighter jets.”","creation_date":"2023-09-29","tags":["","DRONES","DEFENSE","GUNS","3-D PRINTING","MILITARY"],"author":"BY DAPHNE WESDORP","category":null}