{"id":"c9fc3f82-73e9-4875-8541-ab43832868bd","article_link":"https://cointelegraph.com/news/ethereum-tracking-billion-yearly-profit-from-defi-activity","website_source":"Cointelegraph","article_type":"News Article","summary":"Ethereum saw first-time profits only last year and if it can keep pace with its 2024 first-quarter results, it could see $1 billion in yearly income by the end of the year.","title":"Ethereum on track for $1B annual profit as DeFi drives Q1 revenue","detailed_content":"Blockchain network Ethereum is on the path to $1 billion in annualized profits after it netted income of $365 million in Q1, coming alongside a year-on-year quarterly revenue growth of 155%.\nThe network’s 2024 first-quarter income is a nearly 200% bump from the $123 million profit in Q4 2023, according to an April 17 report from The DeFi Report analyst Michael Nadeau.\nEthereum’s fee revenue — earned through users paying for transactions — hit $1.17 billion, up 155% from Q1 2023 and an 80% increase from the prior quarter.\nEthereum’s yearly profit and loss since launching in 2015. Source: The DeFi Report\nIncreased network activity “primarily driven by a surge in DeFi activity during the quarter” was the cause of the revenue bump, Nadeau said.\nThe activity surge has seen average daily transactions on the blockchain in 2024 already surpass last year’s figures and are closing in on the results from Ethereum’s peak in 2021.\nEthereum's average daily transactions per year (blue) and Ether burned (pink). Source: The DeFi Report\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nOver 1.15 million average daily transactions have taken place in 2024, slightly up from the 1.05 million last year and just shy of the 1.25 million recorded in 2021.\nEthereum was launched in 2015 but only had its first profitable year in 2023 — earning $623 million — despite its revenues that year being 75% lower than its peak $9.9 billion 2021 revenues.\n“This is largely due to the move to proof-of-stake consensus in September of ‘22 — in which token incentives paid to miners (now validators) dropped roughly 80%,” Nadeau explained.\nHe added Ethereum’s fees have grown at a rate of 58% since 2017.\n“Crypto will outperform everything else” in the years ahead\nNadeau gave his market predictions for the coming years and concluded that “crypto will outperform everything else.”\nHe expected rising liquidity conditions for the “next few years” as the United States has a large amount of debt needing refinancing this year and the market had priced in three rate cuts this year from the Federal Reserve.\n“This should provide a tailwind for risk assets such as tech stocks and quality crypto.”\nThe U.S. spot Bitcoin\nBTC\n$63,002\nexchange-traded funds, the Bitcoin halving and what Nadeau called “the innovation cycle” were three additional catalysts “pointing to a bullish setup for the next few years.”\nRelated: Bitcoin fees top Ethereum for 3 days in a row as halving approaches\nThe Bitcoin ETFs will serve as a “gateway drug” for increased interest in cryptocurrencies as they enable broad access and the halving — slated for April 20 — “has historically led to a bull run in the year after.”\nThe “innovation cycle” will also draw in new venture funding and renew retail interest in crypto as it matures, Nadeau believed.\nHe claimed Bitcoin and Ether\nETH\n$3,031\nare “quite correlated” — Bitcoin outperforms early in the bull market as it is the most recognizable cryptocurrency while ETH and altcoins tend to outperform it in the later stages of the cycle.\n“It’s noteworthy that altcoins actually rallied so much in the last two cycles that they outperformed Bitcoin across the full length of both cycles,” Nadeau added.\nHe believed this would continue but only with altcoins “that have clear product market fit.”\nMagazine: Joe Lubin — The truth about ETH founders split and ‘Crypto Google’\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Ethereum","#Transactions","#DeFi"],"author":"by Jesse Coghlan","category":null}