{"id":"ca602647-a3c1-47c8-8911-0734f849ff28","article_link":"https://cointelegraph.com/news/ethereums-pectra-hard-fork-could-solve-lost-private-keys","website_source":"Cointelegraph","article_type":"Tweet","summary":"The social recovery tool requires users to have first transferred all their assets to an invoker contract, which will perform all future transactions for the user.","title":"Ethereum’s next hard fork could make lost private keys a thing of the past","detailed_content":"Ethereum users may no longer need to worry about losing their seed phrases ever again after the Pectra hard fork — thanks to a new “social recovery” feature part of the planned Ethereum Improvement Proposal (EIP) 3074 upgrade. \nEIP-3074 was confirmed as a new addition to the Pectra hard fork by Ethereum core developer Tim Beiko in an April 11 X post.\nThe upgrade will see a “supercharging” of ordinary Ethereum wallets (externally owned accounts) with several new smart contracts capabilities, including the ability to recover assets, Ethereum Foundation researcher “Domothy” explained in a March 25 blog post.\nHowever, to leverage the social recovery tool, users must first have transferred ownership of their assets to an invoker contract via a digital signature, which will perform future transactions and function calls on the user’s behalf.\nWhile ownership is delegated, the message in the digital signature will enable the user to retrieve their assets if they lose or forget their seed phrase.\nThe feature will be made possible by the implementation of the “AUTH” and “AUTHCALL” opcodes, cryptocurrency commentator Cygaar explained in an April 11 X post.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAUTH will take a user’s signature and intended action and verify it was signed properly. AUTHCALL will then call the target contract to carry out the transaction but will assign the user as the caller instead of the invoker contract.\nSource: Cygaar\nDomothy, however, shared concerns that funds could be drained if users delegate their assets to a malicious invoker contract, though he also expects a few formally verified and fully audited invoker contracts to become available after the Pectra upgrade.\nIt has been estimated that billions of dollars worth of cryptocurrency have been lost over the years due to users forgetting or losing their private keys. \nRelated: Key elements to watch on the Ethereum network roadmap\nMeanwhile, another key advantage of EIP-3074 is that users won’t need any Ether (ETH) in their wallet to send transactions, as the entity behind the invoker contract can pay for that upfront.\n“This could be huge for gaining mass retail adoption,” Cygaar noted.\nIt will also enable multiple actions to be taken in one transaction.\n“Right now in order to swap tokens on Uniswap, you have to first approve Uniswap to use your tokens, and then run the actual swap. Not great.”\n“[But] with 3074, these two actions can be batched into a single tx,” Cygaar added.\nThe Pectra hard fork is reportedly expected to occur in late 2024 or early 2025.\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-12","tags":["#Blockchain","#Smart Contracts","#Ethereum","#Private Keys","#Developers","#DeFi"],"author":"by Brayden Lindrea","category":null}