{"id":"cb3f427d-65bc-4875-b492-5793f94b9703","article_link":"https://cointelegraph.com/news/the-battle-against-bots-how-to-secure-social-media-in-the-age-of-ai","website_source":"Cointelegraph","article_type":"Tweet","summary":"Blockchain-based Web3 technologies can cleanse social media of fake accounts and AI-driven disinformation.","title":"The battle against bots: How to secure social media in the age of AI","detailed_content":"As artificial intelligence (AI) continues to evolve, it brings opportunities and challenges, particularly in social media. On the one hand, AI’s integration into social media analytics has transformed how businesses engage with audiences, enabling more personalized content. 97% of surveyed business leaders agree that AI and machine learning will significantly enhance companies’ ability to analyze social media data and insights more efficiently.\nOn the other hand, AI also presents new risks, such as the creation of sophisticated bots and the spread of disinformation. A study suggests that on X (formerly Twitter), fake news spreads six times faster than real content, with 70% of users unable to distinguish between real and fake news.\nFacebook is a more striking example, having deleted 6.5 billion fake accounts in 2021. The social media giant also took action against fake accounts by addressing 691 million such accounts in the fourth quarter of 2023.\nThe number of worldwide fake accounts removed from Facebook. Source: Statista\nWhile the issue of authenticity in traditional social networks remains a significant challenge, AI-powered bots continue to be a headache across the internet. Research shows that over 49% of web traffic in 2023 came from bot activities, and 32% were bad bots.\nIn response to fake social IDs and AI-based bot challenges, Web3 provides a promising environment powered by blockchain, aiming to create more secure and reliable online communities. Decentralized networks have the potential to increase user control and integrity, building a future where digital interactions are both empowering and safe.\nSustainable and ethical interaction model\nA Web3 social app designed for the permissionless and noncustodial ecosystem, Phaver combats the persistent problems of fake messages and identities. The platform helps users cultivate their reputations within and across decentralized social networks, rewarding them with off-chain points for each constructive contribution.\nFounded by Joonatan Lintala and Tomi Fyrqvist, who have worked for companies such as Google, Facebook, Goldman Sachs, and Alibaba, Phaver offers a sustainable and ethical social interaction model. The founding duo is working to fix the broken social ecosystem from the ground up by focusing on user ownership and interoperability through Web3 technology.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nPhaver aims to build a future where online social graphs are owned and built by users, not companies. Source: Phaver\nPhaver leverages the Lens Protocol created by the decentralized finance (DeFi) platform Aave with the goal of enabling users to own their social relationships and interactions through nonfungible tokens (NFTs). Lens Protocol is a decentralized social graph that allows creators to own their content as NFTs.\nIn addition to Lens, Phaver supports decentralized social graphs such as Farcaster, MocaID and CyberConnect. With all supporting social graphs, Phaver makes social connections more secure and permanent by improving user control and enabling interoperability.\nA seamless transition to Web3 social interaction\nCointelegraph Accelerator participant Phaver provides a simple introduction to its platform without requiring any crypto wallet for initial registration. Users can sign up using a traditional email or Web2 login, suitable for those new to Web3 technology. Once registered, users can create a Phaver profile without requiring any blockchain knowledge. For those with a Lens profile, Phaver allows easy integration during the registration process.\nIn the Phaver app, users have the flexibility to personalize their experience. Phaver users can subscribe to various interests or follow other participants. If no specific selection is made, the feed will default to showing the latest popular content so new users can discover exciting discussions and content.\nTo enhance users’ personalized experience further, Phaver incorporates a unique reward system called Cred. Users can connect one or more wallets and start earning Creds and points based on their activity on the platform and the eligible NFTs they own. The score measures users’ reputation within the platform, taking into account their contributions and interactions. Users with higher Cred scores have greater influence and trustworthiness within the community, which encourages positive engagement and discourages malicious behavior.\nCreating a Phaver profile requires no blockchain knowledge, making it accessible to all users. Source: Phaver\nBuilding on its innovative reward system, Phaver is also taking proactive steps to secure the platform against AI manipulations and the creation of fake content by introducing the Anima proof-of-personhood. The platform stores each user’s unique privacy-safe facial print in the user’s wallet. Participants can connect their wallets and complete a facial scan to claim a unique NFT, proving their uniqueness.\nPhaver also offers advanced features, such as purchasing points or participating in gamified social experiences for more meaningful engagement. These features reward the creator and allow the “stakeholder” to earn rewards if the promoted posts become popular.\nKeeping users engaged\nSince its founding, Phaver has reached 300,000 unique app installs, 50,000 weekly active users and $150 million in connected NFT value on Phaver Cred. Behind this data lies user retention ability, a critical metric for any social platform. In South Korea, for example, users spend an average of six hours a week on Phaver, underscoring the app’s ability to keep users engaged.\nPhaver has also formed partnerships that enhance its platform and expand its reach. Notable collaborations include Lotte Group’s NFT arm in Korea and The Smurfs, both of which are exploring and expanding their Web3 footprint.\nPhaver is poised to solidify its position in the Web3 social media space through several strategic initiatives. The platform plans to improve multi-protocol integration by adding support for additional decentralized social graphs such as CyberConnect and Farcaster.\nPhaver is dedicated to creating an internet where users have ownership. Source: Phaver\nPhaver is also preparing to transform the onboarding process for new users with a Web2 background. By making points available for purchase as in-app purchases, Phaver aims to simplify entry into the Web3 space and make it as easy as downloading and interacting with a traditional app.\nMoreover, Phaver will continue to develop its proprietary trust score and expand it to cover a broader range of social metrics. At the same time, the platform is exploring the introduction of NFT-gated topics that will bring together select NFT holders for exclusive discussions and networking opportunities.\nPhaver envisions a future where users can freely engage in decentralized social networks without fear of encountering AI-generated content or bots. By implementing innovations such as the Anima proof-of-personhood platform and Cred scores, the platform aims to mitigate the risks posed by AI threats and foster a more authentic and trustworthy online experience.\nSupporting user-centered platforms that prioritize security, authenticity and community participation will contribute to the development of the crypto and Web3 ecosystem. As Web3 technologies develop, more authentic and secure interactions will be possible.\nLearn more about Phaver\n#Blockchain\n#Technology\n#AI\n#Social Media\n#Web3\n#Cointelegraph Accelerator\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-04","tags":["#Blockchain","#Technology","#AI","#Social Media","#Web3","#Cointelegraph Accelerator"],"author":"by Emre Günen","category":null}