{"id":"cb7189bf-40b9-434c-a66c-e239a6e6678e","article_link":"https://cointelegraph.com/news/scammers-exploit-google-promote-phishing-site","website_source":"Cointelegraph","article_type":"News Article","summary":"The malicious actors have reportedly registered multiple domains mimicking Whales Market.","title":"Scammers exploit Google platform to promote phishing site","detailed_content":"Google appears to be promoting a malicious crypto website that directs users to a phishing website clone that drains users’ crypto through Google Ads, an online advertising platform enabling businesses to showcase ads on Google’s search engine results pages.\nAccording to a report by BleepingComputer, threat actors have discovered a method to advertise a counterfeit version of Whales Market, an over-the-counter (OTC) cryptocurrency platform facilitating the trading of airdropped tokens.\nThe report indicates that the fake version is being advertised as a sponsored link at the top of Google search results.\nCointelegraph has verified that Google is currently promoting the counterfeit Whales Market as an advert. Although it displays a seemingly genuine domain address on the search results page, users are rerouted to [www.whaels.market] instead of the authentic [www.whales.market] upon clicking.\nFake version of Whales Market promoted by Google Ads   Source: Google\nBleepingComputer also notes that the malicious actors have reportedly registered multiple domains mimicking Whales Market, including [www.whaless.market], which is already inactive.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe fake version replicates the interface of the authentic Whales Market site, deceiving users into connecting their digital wallets. However, malicious scripts are activated upon doing so, siphoning crypto from victims’ wallets.\nThis incident contributes to similar events where scammers have used Google’s platform to advertise deceptive services.\nAn example is the nearly $900,000 worth of crypto drained from one of the hot wallets belonging to billionaire investor and Dallas Mavericks owner Mark Cuban by an unidentified hacker.\nRelated: Scam crypto projects using stolen funds for liquidity disappear\nIn December 2023, Scammers used a wallet-draining service called “MS Drainer” to siphon approximately $59 million in crypto from victims over the past nine months.\nThe scammers used Google Ads to target victims with fake versions of popular crypto sites, including Zapper, Lido, Stargate, DefiLlama, Orbiter Finance and Radient.\nWhile the individuals responsible for this recent phishing campaign are still unknown, Google appears to be taking action against scammers.\nIn April, Google filed a lawsuit against Chinese nationals Yunfeng Sun and Hongnam Cheung for deceiving individuals with counterfeit crypto investments through the Google Play store.\nWallet drainers have become a major problem in the Web3 ecosystem. In November 2023, the developer of the “Inferno” drainer claimed to be retiring after successfully stealing more than $80 million from victims during the software’s lifetime.\nIn March, the developer of “Monkey Drainer,” which had successfully stolen an estimated $13 million up to that point, also announced their retirement.\nMagazine: Google sues crypto app scammers, Crypto.com in Korea\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-19","tags":["#Blockchain","#Cryptocurrencies","#Google","#Business","#Scams","#Web3"],"author":"by Amaka Nwaokocha","category":null}