{"id":"cb87548d-af87-4e2c-a206-1cab87a20a43","article_link":"https://www.wired.com/story/meta-layoffs-overhiring/","website_source":"Wired","article_type":"News Article","summary":"The social media company's failed projects required thousands of staffers who swelled the ranks and never left.","title":"The Reason for Meta's Massive Layoffs? Ghosts in the Machine","detailed_content":"REMEMBER Libra, Meta’s ambitious plan to enter the cryptocurrency market? Or Lasso, Meta’s ambitious attempt to outdo TikTok? Alongside projects like Shops, Meta’s ambitious plan to turn Instagram and Facebook into e-ommerce giants; its podcast plans; Facebook Portal and a Meta smartwatch to compete with the Apple Watch, they all failed.\nIn pursuit of becoming the everything platform, Meta CEO Mark Zuckerberg has thrown a lot of stuff at the wall. Precious little of it has stuck, except for the headcount brought to work on these projects.\nYesterday, Zuckerberg announced mammoth layoffs at Meta: 11,000 people in all—some 13 percent of the company and nearly three times the number let go by Twitter, which fired 50 percent of its workforce on November 4. He blamed his own decision to increase investments and an ad revenue crunch caused by Apple’s decision to give users more control over how their personal information is used for advertising purposes.\nFEATURED VIDEO\nThis Heart is Not Human\nBut that only tells part of the story, according to company insiders and people tracking the company’s business from the outside. “Today’s news isn’t only a correction of the pandemic years,” says one former Meta employee with knowledge of the company’s operations, who left shortly before the layoffs were announced and spoke anonymously because his current employer would not grant him the right to speak on the record to WIRED. “I would say it’s probably the last five to 10 years”—originating even before Zuckerberg’s Metaverse obsession. Some of the losses can be attributed to the sheer range of risky and failed experiments the Facebook, WhatsApp and Instagram parent company has conducted over the years, the former employee says. “I just can’t think in the last five years of a successful Meta app or feature that wasn’t acquired,” the ex-employee says—before suggesting Stories, perhaps, which itself was borrowed from Snapchat.\nThose distractions from Meta’s core business are what the former employee says are harming the company—and are why the layoffs this week were quite so significant. Had there been natural attrition as each attempt to innovate failed and fell by the wayside, the reduction in staff numbers would have been stretched out over time. “We just launched this huge blockchain initiative that required hundreds of people—or maybe even more,” says the former employee. “When that thing went away, what happened to those people? They just kind of stayed and worked on other experiments and research.” The former employee cites issues with internal communication that suggested people drifted off into obscurity within the massive Meta machine. “It seemed like we were doing all these things that went nowhere, but we never got an update of: ‘It went nowhere, but here’s the actions we’re taking’,” he says.\nNew projects helped Facebook to accumulate employees rapidly. Flush with cash as one of the world’s biggest companies, and with big plans for dominating all aspects of consumers’ lives, the company formerly known as Facebook hired plentifully. In 2017, Meta employed 25,000 staff. And before it sliced 11,000 from its payroll, it had 87,000 employees. The company has grown headcount by an average of 28 percent in each of the last five years. Even after these latest cuts, the newly slimmed-down Meta is still three times as large as it was in 2017.“They’ve overhired and are trying a lot of different things,” says Bill George, a senior fellow at Harvard Business School. “Mark Zuckerberg right now is not clear about what he wants from his company.” George points to the rebranding of Facebook as Meta as an example of the uncertainty around the future direction of the company: “It sent signals that maybe he felt that Facebook and Instagram and WhatsApp had tapered off, and that he wanted to move to VR. But that obviously has not paid off yet.” Meta did not immediately respond to a request for comment.\nA former Meta engineer, who left before this week’s cull, tells WIRED they were brought into the company to work on a project that months later was canned. The engineer was left to float within the company.\n“Meta layoffs are an ominous sign of dark days ahead for Zuckerberg,” says Dan Ives, managing director and senior equity analyst at Wedbush Securities. Both he and George of Harvard question Zuckerberg’s decision to go all in on the metaverse.\n“I believe that Mark needs to be chairman and give up the CEO job and bring in a professional CEO,” George says. Other tech companies have successfully divided the roles of founder and CEO, he says, including Microsoft, Amazon, Apple, and Oracle. “I think Mark could concentrate on his dream for Meta, but at the same time, somebody's got to run the business and many of his advertisers are pulling out,” he says. “And that's where the revenue comes from.”\nThat bloat, and the ghosts in the machine that it left, has been Meta’s fatal flaw, the former employee suggests. “The company just kept growing and growing,” he says. “No one seriously thought: ‘Why are we growing? Do we actually need the people we’re hiring, or are we just hiring because we like to hire?’”","creation_date":"2022-11-10","tags":["","FACEBOOK","SILICON VALLEY","MARK ZUCKERBERG"],"author":"BY CHRIS STOKEL-WALKER","category":null}