{"id":"cc0a3e97-34aa-4443-982b-7b24970ef488","article_link":"https://cointelegraph.com/news/ethereum-l2-eigenlayer-last-life-changing-airdrops-experts-say","website_source":"Cointelegraph","article_type":"News Article","summary":"Issues such as community discontent, farm accounts and restrictive criteria have plagued recent airdrops.","title":"Ethereum L2 EigenLayer is last of ‘life-changing airdrops,’ experts say","detailed_content":"An ongoing, much-hyped airdrop conducted by Ethereum restaking protocol EigenLayer continues to generate controversy over its restrictive qualifications for claiming rewards. Project founders and users from across the crypto ecosystem are chiming in as a result. \n“The reality is that, in all likelihood, the era of life-changing airdrops is now behind us,” said Leandro Schlottchauer, co-founder and CEO of smart contract developer Kuyen Labs, in a statement. “It should be clear by now that no airdrop or similar incentive can satisfy all community members,” he continued, adding: \n\"Community members have been divided on the core team’s plans, including the amount to be airdropped to early contributors and the limited number of jurisdictions from which users will be able to claim.\"\nMeanwhile, Mohak Agarwal, CEO and founder of liquid-staking protocol Claystack, said EigenLayer’s decision to announce its airdrop as a surprise is not a workable model for the long term. “While the mysterious approach may initially evoke excitement, it often leads to disappointment later on,” said Agarwal. “This pattern suggests a tendency for projects to announce a small airdrop supply initially, anticipating user disappointment, and then offering additional tokens to appease them — a short-term fix that isn’t sustainable in the long run.”\nIn a surprise blog post on April 29, EigenLayer, the second-largest decentralized finance protocol with $15.67 billion in total value locked, unveiled its airdrop plans where among other items, only 5% of the initial token supply would be allocated to early users who participated in Season One. The remaining allocation would be distributed to users in the following “seasons.” In addition, users from 30 countries — including the United States, Canada, China and Russia — would not be able to claim EIGEN tokens.\nCountries excluded from the EigenLayer airdrop. Source: Bonecondor\nThe announcement quickly drew widespread community condemnation. “Accepting stake from those countries and not rewarding them isn’t right. They took a very real risk for nothing,” wrote one user on social media platform X in response to the protocol’s geoblocking efforts. In response to community feedback, EigenLayer announced in a follow-up post on May 3 that they would airdrop an additional 28 million EIGEN to 280,000 wallets. \nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nDespite booming development activities within the crypto ecosystem, recent airdrops often failed to follow up on their initial traction. \nOn April 4, cross-chain messaging platform Wormhole transferred $800 million worth of its W tokens to select users, with its post-airdrop valuation surging to a stunning $22 billion measured in fully diluted market capitalization. Since then, however, the token has lost more than 50% of its value and traded at $0.6457 at the time of publication.  \nSimilarly, STRK, the native token of the Ethereum layer-2 scaling solution Starknet, has lost 43% of its value since its February airdrop. At the time, allegedly, 701,544 eligible wallets were controlled by airdrop farmers who claimed STRK tokens by creating duplicate developers’ accounts on GitHub. \nCointelegraph previously reported that due to their popularity, airdrops have been frequently targeted by farm accounts and Sybil accounts, thereby allocating large swaths of tokens to otherwise unqualified accounts instead of to genuine ecosystem users. \"As a result, a project’s reputation is damaged, its token supply inflates, and price manipulation may occur as a result of excessive dumping by airdrop farmers after the event is over,\" commented researchers at Gamic HQ regarding the practice. \nRelated: EigenLayer users fume over restrictive airdrop, others say it’s ‘generous’\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Ethereum","#Adoption","#Airdrop"],"author":"by Zhiyuan Sun","category":null}