{"id":"cd393b2c-4d56-4c69-a803-38f93bb15b57","article_link":"https://cointelegraph.com/news/sui-network-clears-up-misunderstandings-on-token-supply","website_source":"Cointelegraph","article_type":"News Article","summary":"Sui maintains that its tokenomics are sound and that it uses reputable third parties to handle token storage.","title":"Sui Network addresses claims about its token supply","detailed_content":"The Sui Network has clarified misunderstandings about its token supply. In a post on X, the layer-1 blockchain refuted criticism of the tokenomics around distribution and control of its S SUI token.\nIn the statement, Sui maintains that its tokenomics are sound and that it uses reputable third parties to handle token storage. It claims tokens are released according to a predetermined schedule, they are publicly accessible, and its founders cannot control the treasury or tokens allocated to investors, including the community reserve.\nSui said the Sui Foundation manages the primary wallet holding locked tokens, which are released under specific conditions. The token releases support various projects, including Move programming language development, network security enhancements, hackathons and developer grants.\nSui explained that staking rewards comprise stake derivatives and network commissions, all of which are returned to the community.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHowever, Justin Bons from Cyber Capital expressed concerns about the Sui team’s token holdings. Bons suggested that the founders may control a substantial portion of staked tokens, posing a centralization risk, and he called for greater transparency and accountability from Sui.\nSource: Justin Bons\nOn the other hand, Sui disputes Bons’ claims, and it said it has disclosed that all tokens, whether distributed or not, are managed in compliance with legal and regulatory standards overseen by reputable custodial service providers like BitGo, Anchorage and Coinbase Prime.\nRelated: Can blockchain revolutionize digital securities management for stock exchanges?\nBons challenged Sui’s claims of transparency by urging them to represent the st and demonstrate that the founders cannot move or access it.\nBons suggested that misrepresenting the token status undermines transparency claims and that true transparency requires clear evidence that the allocated tokens are securely held and cannot be manipulated.\nIn September 2023, the Sui Network streamlined Web3 logins for users on its apps with zero knowledge login via Google, Facebook and Twitch. Since its launch, it has built a reputation for handling high transaction volumes while maintaining low fees.\nMagazine: Memecoins make millionaires, Terraform and Do Kwon liable for fraud, and more: Hodler’s Digest, March 31 – April 6\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-05","tags":["#Blockchain","#Cryptocurrencies","#Decentralization","#Tokens"],"author":"by Amaka Nwaokocha","category":null}