{"id":"cd423035-0908-43ec-8e10-d92cd09758de","article_link":"https://medium.com/@AlphPad/introducing-key-upgrades-to-alphpad-enhancing-flexibility-and-fairness-in-token-sales-4a7630b18f23","website_source":"Medium","article_type":"Blog Post","summary":"AlphPad is set to undergo an upgrade that introduces new functionalities aimed at enhancing the fairness and efficiency of token sales on…","title":"Introducing Key Upgrades to AlphPad: Enhancing Flexibility and Fairness in Token Sales","detailed_content":"AlphPad is set to undergo an upgrade that introduces new functionalities aimed at enhancing the fairness and efficiency of token sales on our platform. These upgrades are designed to provide project teams with more tools to manage their sales effectively and to ensure equitable distribution among participants.To address community feedback and ensure fair access to token sales, we are implementing a maximum purchase limit per address during public sales. This feature is crucial for preventing the accumulation of a significant portion of tokens by a few participants, which can negatively affect the distribution and health of the project.Benefits Include:We’re introducing vesting with a cliff option for token sales, providing projects with the flexibility to set up short or long-term vesting periods. This feature is particularly useful for managing the market impact post-sale and aligning token release schedules with project milestones.Implementation Uses:This new vesting functionality is especially beneficial for projects that cannot launch in a modular fashion. Such projects often need complete development before launch, requiring substantial funding secured across multiple stages.Advantages of Multi-Round Sales:With the Rhone upgrade, storage rent fees are dropping to 0.1 ALPH from the previous 1 ALPH. We will make the necessary preparations to implement this change as soon as Rhone is live, ensuring that bidding on launches will require locking up 0.1 ALPH instead of the current 1 ALPH.This update represents our commitment to improving AlphPad’s infrastructure to better serve the community and project teams.Next Steps:These updates are part of our ongoing effort to refine and enhance the user experience on AlphPad, ensuring it remains a leading platform for launching new and innovative projects on the Alephium blockchain.","creation_date":null,"tags":["Launchpad","Alephium","Blockchain","Cryptocurrency","Smart Contracts"],"author":"AlphPad","category":null}