{"id":"ce69b6ed-47d6-4a77-a073-6572141f9110","article_link":"https://cointelegraph.com/news/starknet-foundation-5m-grant-program","website_source":"Cointelegraph","article_type":"News Article","summary":"The funding aims to help developers with final-stage blockchain projects come to market and boost overall blockchain innovation.","title":"Starknet Foundation launches $5M grants program","detailed_content":"The Starknet Foundation announced a new grant program with $5 million worth of USDC for emerging projects on the network.\nThe new $5 million Seed Grants Program aims to support at least 200 promising teams, with $25,000 in USD Coin\nUSDC\n$1.00\nper award recipient, offering a “final push” to help final-stage projects launch on Starknet, an Ethereum layer-2 scaling solution based on zero-knowledge rollup technology.\nThe $5 million grants program came in response to the main challenges of current Starknet developers, according to Diego Oliva, the CEO of Starknet Foundation. Oliva told Cointelegraph:\n“We’ve been listening carefully to devs [developers] and hearing about the main challenges they face. We are talking about people with amazing creativity and vision who need support with that ever-hard ‘last mile’ to get a project over the line and into production. So we responded with this program, which is intended, very directly and with minimal bureaucracy, to address this.”\nThe grant targets Starknet-related projects that already developed a minimum viable product (MVP) or proof-of-concept. According to Oliva, the main goal is to foster more blockchain innovation. He added:\n“In general, we want to reduce the barriers and burdens young teams face when considering starting a project. We’re trying to clear the path to innovation.”\nStarknet has been attracting increasingly more developers to its ecosystem. Total monthly developers rose to over 22,400 in December 2023, up over 113% in the past three years, from 10,500 in December 2020, according to Electric Capital’s 2023 Developer Report.\nMonthly active developers. Source: Electric Capital 2023 Developer Report\nRelated: Robinhood crypto business slapped with SEC Wells notice\nWeb3 gaming remains a top utility driver for Starknet and the wider blockchain space\nWhen asked about the most exciting projects and protocol categories building on Starknet, Oliva said blockchain gaming remains a top use case. He told Cointelegraph:\n“Starknet is leading the way in fully on-chain gaming. Key projects in this area include Realms, Influence and Dojo. This sector is growing fast, with more teams building on Starknet using the Dojo standard. Gaming is important not just for gamers but for everyone because it's demanding on the network, testing its capabilities and demonstrating its power.”\nBlockchain gaming accounted for 35% of the total decentralized application activity, with over 2.2 million daily unique active wallets, according to DappRadar data.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nHe made an NFT card game in 2015... Now it’s worth Millions | Crypto Stories Ep. 6. Source: Cointelegraph\nRelated: Bitcoin distribution ‘danger zone’ over, analysts say\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Funding","#Adoption","#Developers","#Blockchain Game","#Web3"],"author":"by Zoltan Vardai","category":null}