{"id":"ce99bbb3-9673-4a60-9aa8-517859e85f55","article_link":"https://cointelegraph.com/news/shibaswap-moves-shibarium-enhanced-dex","website_source":"Cointelegraph","article_type":"News Article","summary":"Previously only available on the Ethereum blockchain, the DEX will now operate on both Shibarium and Ethereum.","title":"ShibaSwap rolls out major upgrade, moves to Shibarium","detailed_content":"ShibaSwap, the decentralized exchange (DEX) aligned with the Shiba Inu ecosystem, has rolled out a major upgrade — moving to the Shibarium blockchain. \nAccording to a recent press release, the move will offer a “variety of new decentralized exchange and decentralized app (DApp) utilities” for users. \nThe press release detailed new features including a new dashboard, improved user experience, discovery charts “for new and trending tokens,” and the onboarding process of news tokens on the DEX. \nSource: Shytoshi Kusama\nShiba Inu\nSHIB\n$0.000024\nlead developer, Shytoshi Kusama commented on the upgrade:\n“The new ShibaSwap empowers DEFI innovators looking for the next hit on Shibarium to find, swap, and interact with community tokens in an entirely new way! It is the redesigned beating heart of a freshly forked Shibarium, where community tokens can flourish. We invite the community to try our new swap and invite current Shibarium tokens to port over to our swap with ease. Finally, rest assured, this new UX is still an early ShibaSwap version, with more updates in the pipeline for the product.”\nThe upgrade will utilize “part of the transaction fees portion” to improve the value of liquidity pools (LPs) in swap transactions. This will result in increased LP token value for users and benefiting the yield farmer community, according to the press release.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nRelate: Over 1 million new crypto tokens have been launched since April\nFellow pseudonymous SHIB developer and contributor Kaal posted on X explaining that the upgrade rollout will be “focused on discovery” and that more regular “updates and upgrades” should be expected. \nSource: Kaal\nAccording to the press release, this upgrade is focused on minimizing gas fees and fast transactions. \nShibarium also supports the other growing segments of the Shiba Inu Ecosystem, including the $SHIB and $LEASH tokens, SHEboshis DN-404 tokens, SHIB The Metaverse, the ShibaSwap DEX, and the Shiba Eternity game.\nThe layer 2 Shibarium mainnet went live in August 2023, featuring the creation of 21 million wallets and trialed by millions of users. The debut introduced a new consensus mechanism dubbed proof-of-participation (PoP), which works by selecting validators based upon their holdings of the associated cryptocurrency.\nAt the time of writing, the price of SHIB is $0.0002548 — up almost 7% in the last 24 hours, with the 11th-largest market cap, according to CoinMarketCap. \nExchange or buy SHIB\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-16","tags":["#Blockchain","#Cryptocurrencies","#Community","#Upgrade","#Shiba Inu","#Memecoin"],"author":"by Josh O'Sullivan","category":null}