{"id":"ceb24dcd-dcae-4fbf-8d20-56f02b19edbb","article_link":"https://cointelegraph.com/news/bitcoin-whale-wallets-move-sixty-million-in-bitcoin-after-decade-dormancy","website_source":"Cointelegraph","article_type":"News Article","summary":"The two wallets acquired a total of 1,000 Bitcoin more than 10 years ago when 1 BTC was worth $134.","title":"Bitcoin whale wallets move $61M in BTC after a decade of dormancy","detailed_content":"Two mysterious Bitcoin wallets holding a combined 1,000 Bitcoin — worth $61 million at current prices — have suddenly awoken after a 10-year hiatus, transferring out almost every single satoshi.\nWallet address “16vRq…qjzEa” transferred out its 500 Bitcoin (BTC) at block 843,131 on May 12 at 7:10 pm UTC, while the other 500 Bitcoin was sent by address “1DUJuH…NgfC5” two blocks later, according to Blockchain.com’s Bitcoin block explorer.\nThe wallets each received 500 Bitcoin on Sept. 12 and Sept. 13, 2013, when Bitcoin was priced at $134, according to CoinGecko.\nAt current prices, the combined amount transferred is now worth 456 times more than their acquisition price, at $61.2 million.\nSince the transfers, one of the receiving addresses from “16vRq…qjzEa” has already transferred the 500 Bitcoin onward to a multitude of wallets, while the receiver from “1DUJuH…NgfC5” is still holding its 500 Bitcoin.\nThe proximity of the inward and outward transfers prompted blockchain analytics firm Lookonchain to pair the two transactions together, onlookers believe the two wallets were owned by the same person or entity.\nSource: Lookonchain\nBefore the transfers, the two addresses were the equal 4,353rd-largest Bitcoin whales, according to BitInfoCharts.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nLess than a week ago, a Satoshi Nakamoto-era Bitcoin wallet transferred 687 Bitcoin, worth $43.9 million, to two separate addresses.\nRelated: 'Epic sat' mined from fourth Bitcoin halving block sells for $2.1M\nWhile at least one of these early-day Bitcoin wallets tends to wake up each month, nearly 1.8 million Bitcoin addresses have remained dormant for over a decade, according to a recent analysis by Chainalysis and Fortune.\nThese wallets, excluding Nakamoto’s wallet, contain about $121 billion worth of Bitcoin, Fortune said.\nWhile it is impossible to know how much this has been lost, the 1.8 million addresses account for 8.5% of the total 21 million Bitcoin that will ever exist.\nPeople often speculate that dormant wallets may be waking up to sell Bitcoin at an opportune time,  others suggest it could be to transfer the funds to a different address, perhaps under a more secure noncustodial wallet service provider.\nBitcoin is currently priced at $61,450 and is up 130% over the last 12 months, according to CoinGecko.\nBitcoin’s change in price since April, 2013. Source: CoinGecko\nBig Questions: How can Bitcoin payments stage a comeback?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-13","tags":["#Bitcoin","#Blockchain","#Satoshi Nakamoto","#Bitcoin Wallet","#Wallet"],"author":"by Brayden Lindrea","category":null}