{"id":"ceb3a6d0-c85b-4480-9579-4ced556531cb","article_link":"https://cointelegraph.com/news/no-signs-bitcoin-miner-capitulation-despite-plummeting-revenue-cryptoquant","website_source":"Cointelegraph","article_type":"News Article","summary":"CryptoQuant CEO Ki Young Ji said that despite a drop in Bitcoin mining revenues since the halving, Bitcoin miners haven’t shown any signs of capitulation.","title":"‘No signs’ of Bitcoin miner capitulation despite plummeting revenue","detailed_content":"Bitcoin miners show no signs of “capitulation” despite their revenue falling to 14-month lows following the halving event in April. \nIn an April 30 post to X, CryptoQuant CEO Ki Young Ju said that following a drop in revenue to levels post having, Bitcoin\nBTC\n$63,046\n miners now face two options, capitulation or await growth in the price of Bitcoin to cover their costs.\n“Now they have two options: 1. Capitulation, or 2. Waiting for a rise in BTC price.”\nCiting the 365-day Puell Multiple chart — a metric that estimates the level of sell pressure from miners — Ju said miners show no signs of capitulation “for now.”\nBitcoin miner revenue has fallen to lows not seen since Feb. 25, 2023. Source: CrytpoQuant\nJu’s analysis comes as a recent crypto price dip has sparked concerns about miner capitulation.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBitcoin miner revenue soared immediately following the halving with rare satoshi hunters and Runes Protocol degens paying through the nose for space on the first blocks mined after the halving on April 20.\nHowever, the appetite for these novel Bitcoin-based assets has declined in recent weeks — weighed down by a wider lull in price action across the crypto market.\n“Miners had a brief reprieve following the halving as bitcoin’s price rose, but their profits are now being seriously crunched post-halving now that the spot BTC price is moving against them,” said market research provider The Bitcoin Layer in an April 30 post on X. \n“Miner capitulation risk is on the rise, with profits as squeezed as they are. If bitcoin’s price continues correcting downward over the next few days and it stretches into a weeks-long spell, big miners are at risk of having to liquidate a bunch of bitcoin on order to hedge themselves,” the firm added.\nRelated: Bitcoin’s ‘euphoria phase’ cools, but a BTC bottom could be near — Glassnode\nNotably, Bitcoin’s hash price — the expected value of one terahash of hashing power per day — has fallen to an all-time low of $46.55, down 74% from its post-halving peak, according to Hashrate Index data.\nThe price of Bitcoin is currently sitting at $60,400, down 18% from its March 14 all-time high of $73,700 per TradingView data.\nSimilarly, the second largest cryptocurrency, Ether\nETH\n$3,033\n, is also down 26% from its yearly high of $4,070 on March 12.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-01","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Bitcoin Price","#Bitcoin Mining","#Bitcoin Halving"],"author":"by Tom Mitchelhill","category":null}