{"id":"cf8e7162-77ed-4bc2-b48a-7093a3de0db7","article_link":"https://cointelegraph.com/news/polkadot-active-addresses-600-k","website_source":"Cointelegraph","article_type":"News Article","summary":"Active addresses on Polkadot have hit a new all-time high of 600,000 despite the community’s memecoin efforts failing to bring more attention to the protocol.","title":"Polkadot active addresses hit record 600K","detailed_content":"The Polkadot blockchain has reached a new all-time high in active addresses on its network.\nPolkadot amassed over 600,000 active addresses on-chain by the end of March, according to data by DotLake, shared in an April 7 X post by Polkadot.\n“Activity continues to grow in the Polkadot ecosystem, where many apps use dedicated blockspace to prevent issues like network spam.”\nPolkadot: Active addresses chart. Source: Polkadot\nOver 41%, or 248,000 of the 605,000 addresses, are attributed to the cross-chain smart contract platform Moonbeam, while 191,000 addresses were created directly on Polkadot, according to DotLake data.\nThe number of unique accounts with non-zero balances is also on the rise, surpassing 5.59 million accounts at the end of March, up from 5.53 million at the end of February.\nNumber of unique accounts. Source: DotLake\nHowever, total transactions remain subdued on the network. Polkadot saw a total of 11.58 million monthly transactions in March, slightly up from 10.8 million in April but far below the 31.78 million transactions recorded in December 2023.\nNumber of transactions. Source: DotLake\nPolkadot’s\nDOT\n$7.09\ntoken fell 3.3% in the 24 hours leading up to 12:38 pm UTC to trade at $8.95 as the 14th-largest cryptocurrency by market capitalization. DOT is currently down 83% from its all-time high of $55 reached in November 2021, according to CoinMarketCap data.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: Bitcoin mining profitability won’t necessarily fall after halving\nDED memecoin fails to deliver\nIn an effort to capitalize on the current memecoin frenzy and bring more participants to the blockchain, the Polkadot community spun up its own memecoin, DOT is $DED (DED), which started trending on X on March 23. Investors holding Polkadot were eligible for 36 DED tokens for every 1 DOT held.\nRetail sentiment turned sour after the team reduced the initial airdrop allocation from 100% of the token supply to just 5% to create a longer financial runway for the memecoin, explained one of its pseudonymous developers, Giotto De Filippi, during a March 24 X Spaces.\nDED is currently worth a little over $0.001, with seemingly little interest following the airdrop distribution. The DOT/DED trading pair only amassed $20,536 in 24-hour trading volume, according to the liquidity pool on Hydradx.\nRelated: Google sues alleged China crypto app racketeers: Report\nExchange or buy DOT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-08","tags":["#Blockchain","#Altcoin","#Polkadot","#Memecoin"],"author":"by Zoltan Vardai","category":null}