{"id":"cfe0a80d-0db5-4254-8f63-6177b4fd5d9d","article_link":"https://cointelegraph.com/news/ethereum-validator-p2p-org-7-5-billion-tvl-saab","website_source":"Cointelegraph","article_type":"News Article","summary":"P2P.org’s new SaaB model aims to help businesses better handle staking functionalities, promotion and revenue generation.","title":"Ethereum validator P2P.org hits $7.5B TVL, adds new SaaB model","detailed_content":"P2P.org, a validator for the Ethereum blockchain, has hit a new growth milestone and is launching a new staking model designed for businesses.\nThe Ethereum validator has seen its total value locked (TVL) increase from $5 billion in February to more than $7.4 billion in March, the firm said in an announcement to Cointelegraph on April 10.\nP2P.org’s TVL rose from $1.4 billion by the end of the first quarter of 2023 to $7.3 billion at the end of Q1 2024, or a 396% year-over-year increase.\nAccording to data from Dune Analytics, P2P.org’s market share in terms of the total staked Ether\nETH\n$3,030\naccounts for 0.75% or 240,832 of staked ETH as of April 8.\nIn contrast, Lido, the largest Ethereum validator, has a 29% share of the total staked Ethereum, or 9.5 million ETH. According to Dune Analytics, as much as 17% of the market is staked by unidentified validators.\nEthereum stakers by the amount of staked Ether. Source: Dune Analytics\nIn conjunction with the TVL milestone, P2P.org announced the launch of a new staking model targeting businesses. The new staking-as-a-business (SaaB) model addresses staking difficulties that some businesses face, including those related to functionalities, promotion of staking services and revenue generation.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“Our objective is to assist in the establishment or amplification of staked assets within institutional products, ensuring that staking contributes a minimum of 10% to total revenue, ideally reaching 20%,” P2P.org CEO Alex Esin told Cointelegraph. He added:\n“This is not just a service or a solution; it's a partnership model that helps businesses to scale by integrating new DeFi and Staking services into their platforms.”\nEthereum staking is a process of locking up Ether to maintain the Ethereum network and rewarding users with newly minted ETH. Ethereum’s staking mechanism was introduced in September 2022 when the ETH network adopted a proof-of-stake (PoS) consensus mechanism.\nRelated: Fidelity amends spot Ethereum ETF proposal to include staking\nUnlike a proof-of-work (PoW) consensus mechanism — which is used on the Bitcoin blockchain — the PoS consensus mechanism does not need mining and relies on validation instead.\nEthereum validators are entities that stake a minimum of 32 ETH in the network to participate in running Ethereum’s PoS consensus blockchain. According to data from Beacon Cha, there were 980,000 validators on the Ethereum blockchain as of April 9.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-10","tags":["#Blockchain","#Proof-of-Stake","#Ethereum","#Validator","#Staking"],"author":"by Helen Partz","category":null}