{"id":"cfe6a8c9-441b-4f11-8dbf-3b4d3ecb30d9","article_link":"https://cointelegraph.com/news/tokenholders-approve-7-5-billion-ai-merger","website_source":"Cointelegraph","article_type":"News Article","summary":"The Artificial Superintelligence Alliance’s new ASI token will begin trading soon and will be valued at $7.5 billion at launch.","title":"Tokenholders approve $7.5B AI merger","detailed_content":"Tokenholders of SingularityNet, Fetch.ai and Ocean protocols have approved a $7.5 billion merger that would create a combined Artificial Superintelligence Alliance (ASI) project.\nAccording to the April 16 announcement, the Fetch.AI (FET) token will become the ASI token with a total supply of 2.6 billion. Meanwhile, SingularityNet (AGIX) and Ocean (OCEAN) tokens will be converted into ASI at approximate ratios of 0.43:1, with ASI tokens having a combined value of $7.5 billion post-merger. The ASI has yet to schedule a launch date. \n\"Our mission is to create a decentralized AI infrastructure at scale, ensuring ethical and trustworthy practices,” said Humayun Sheikh, chairman of the Artificial Superintelligence Alliance and CEO of Fetch.ai. “By combining our platforms, we empower developers and users alike, fostering a more democratic and transparent AI ecosystem.\"\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe ASI is currently examining three distinct product pipelines: deployment of AI agents in commercial settings, neural symbolic language learning models (LLMs), and AI data sharing and utilization. “In the near term, we anticipate generating revenue as we launch the agentic network for deployment,” Sheikh told Cointelegraph in a statement. “In the short term, we’ll focus on deploying numerous commercial products that breathe life into AI applications.”\nAs for the project’s upcoming roadmap, ASI plans to further invest in its GPU infrastructure for its commercial, computing, and data efforts. Last month, Fetch.ai launched a $100 million investment to deploy Nvidia H200, H100, and A100 GPUs to create a platform for developers and users to utilize computing power. \nBased in Cambridge, Fetch.ai uses LLMs and AI agents for its computing marketplace that matches users with AI-powered services. Meanwhile, SingularityNET, headquartered in Zug, Switzerland, explores the use of AI in realms such as finance, robotics, biomedical AI, media, arts, and entertainment. Finally, Singapore-based Ocean enables businesses and individuals to trade tokenized data assets via its platform.\nBlockchain has recognized significant synergies with AI since the popularization of LLMs such as ChatGPT last year. In an interview with Cointelegraph on April 12, Booksie founder and CEO Sol Nasisi discussed the potential for AI and blockchain to enable self-publishing book platforms in the near future. \nRelated: SingularityNet, Fetch.AI, Ocean Protocol merger will drive decentralized AI development: ChainGPT CEO\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#AI"],"author":"by Zhiyuan Sun","category":null}