{"id":"d0691a90-10b6-4655-8363-96055f047da4","article_link":"https://medium.com/@dot9app/we-are-hiring-and-we-pay-in-gold-and-silver-59fbc71d5a51","website_source":"Medium","article_type":"Blog Post","summary":"Are you an adept navigator of the digital realm, skilled in fostering online communities and disseminating accurate information? #Dot9App…","title":"WE ARE HIRING AND WE PAY IN #GOLD AND #SILVER.","detailed_content":"Are you an adept navigator of the digital realm, skilled in fostering online communities and disseminating accurate information? #Dot9App is seeking dedicated individuals to join our esteemed community team. Embark on a journey with us to shape the future of #Dot9App and revolutionize the #gold and #silver NFT experience!Available Positions:Telegram Moderators (5 positions)\nCompensation: $6 per hour + 1 troy ounce of pure silver per month.\nWork Schedule: 4 hours per day, 4 days per week\nResponsibilities: Serve as the frontline communicators, relaying precise updates and announcements from the Dot9 team. Uphold the integrity and professionalism of our Telegram community by enforcing guidelines and fostering constructive discussions. Curate engaging content and facilitate interactive sessions to enhance community participation and retention.Discord Moderators (8 positions)\nCompensation: $11 per hour + 1 troy ounce of silver per month.\nWork Schedule: 4 hours per day, 4 days per week\nResponsibilities: Act as guardians of our Discord realm, ensuring a welcoming and secure environment for members. Facilitate seamless communication channels between users and the Dot9 team, addressing inquiries and concerns promptly. Cultivate a vibrant community atmosphere through event coordination, content creation and proactive engagement initiatives.Twitter Ambassadors (12 positions)\nCompensation: $190 per week + 1g of pure gold per month.\nAdditional Benefit: Exclusive Twitter affiliate logo placement. Responsibilities: Craft compelling narratives around #Dot9App developments, captivating the Twitter audience with engaging content and updates. Establish and maintain positive interactions with followers, representing #Dot9App’s values and ethos in all interactions. Spearhead promotional campaigns and collaborations to amplify #Dot9App’s presence on the platform, driving user acquisition and retention.How to Apply:\nInterested candidates are invited to submit their comprehensive profiles along with a personalized cover letter to stephan@dot9.app. We value your expertise and passion above conventional qualifications, seeking individuals who embody our mission and vision. Shortlisted candidates will undergo a thorough evaluation process, including interviews with our esteemed team members.Additional Information: All positions entail a contractual commitment of no less than 6 months and up to 1 year. Payments will be disbursed weekly in $SOL, $EGLD, or $USDT, with precious metals delivered monthly.\nNote: Deadline for Applications: June 10th.Knowledge in @solana and @MultiversX blockchain constitutes an advantage.Please note that all applicants must be at least 18 years of age.\nGood luck!","creation_date":null,"tags":[],"author":"DOT9APP","category":null}