{"id":"d0a5f441-2cf6-453f-b19e-fac9e3d0717d","article_link":"https://cointelegraph.com/news/el-salvador-new-hilton-hotel-tap-into-tokenized-debt-bitcoin","website_source":"Cointelegraph","article_type":"News Article","summary":"Investors will need to make a minimum $1,000 investment to purchase the token, which will be issued on the Bitcoin layer 2 Liquid Network under the ticker HILSV.","title":"El Salvador’s newest Hilton hotel to tap into tokenized debt on Bitcoin","detailed_content":"Investors will soon be able to own a slice of a new 4,500-square-foot Hampton by Hilton hotel in El Salvador by buying tokenized shares issued on the Bitcoin layer 2 Liquid Network.\nThe country’s first-ever tokenized asset raise will be facilitated by Bitfinex Securities, the first licensed and registered digital asset provider in El Salvador, while the debt issued from Inversiones Laguardia S.A. de C.V.\nThe hotel will be constructed at El Salvador’s international airport, with Inversiones Laguardia looking to raise $6.25 million from crowdfunders in exchange for a 10% coupon over a five-year term.\nSource: Paolo Ardoino\n“[This] represents an important step forward in developing its nascent capital market as well as introducing a major new asset class into the market,” said Paolo Ardoino, chief technology officer of Bitfinex Securities, in an April 11 statement.\n“For the first time, investors who do not usually have the opportunity to invest in such assets have the opportunity to do so, while issuers in markets which have less access to capital, are able to tap into a new asset class to raise finance.”\nInvestors will need to make a minimum $1,000 investment to purchase the token under the ticker HILSV on the Liquid Network. Liquid was built by Blockstream in 2018, a Bitcoin-focused infrastructure firm led by long-time cypherpunk Adam Back.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nRelated: El Salvador’s Bitcoin treasury is now $85M in profit amid BTC rally\nThe hotel project will have five levels, 80 rooms, five commercial spaces and other hotel amenities, including a swimming pool, restaurants, a gym, gardens and multipurpose rooms, Bitfinex noted.\nSource: El Economista\nHILSV tokenholders will also be offered some free night accommodations at the hotel based on the size of their investment.\nEl Salvador, widely known for its Bitcoin investment and adoption strategy, decided to expand into the real-world asset tokenization space in April 2023 when it granted Bitfinex a digital asset service provider license.\nPrior to Bitcoin\nBTC\n$62,997\n, many locals in El Salvador were stuck between no investments and buying an entire house, said Jamie Robinson, chief strategy officer of The Bitcoin Hardware Store, in a recent interview with Cointelegraph.\nBut Bitfinex’s expansion marks a “new era of capital markets” on Bitcoin in El Salvador, noted Bitcoin commentator Stacy Herbet, which will offer the local population a new way to access financial markets.\n“This capital raise not only marks our first venture in El Salvador but also stands as a testament to the transformative power of Bitcoin-based capital markets,” said Jesse Knutson, head of operations at Bitfinex Securities.\nSource: Gerson Martínez\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-12","tags":["#Bitcoin","#Blockchain","#Business","#Adoption","#Bitfinex","#Real Estate","#El Salvador"],"author":"by Brayden Lindrea","category":null}