{"id":"d19e4766-d9af-4b16-84f0-ea9569dd20b1","article_link":"https://www.wired.com/story/have-a-nice-future-podcast-25/","website_source":"Wired","article_type":"News Article","summary":"From online voting to frictionless taxes, Estonia’s government services can sound like sci-fi to outsiders. Its chief information officer talks about how it works—and what other countries might learn.","title":"How to Digitize an Entire Government","detailed_content":"ON THIS WEEK’S episode of Have a Nice Future, Gideon Lichfield and Lauren Goode talk to the chief intelligence officer of Estonia, Luukas Ilves, about the country’s completely online government. In Estonia, citizens can access any government service, including voting, online. What would it take to create that kind of digital infrastructure in the United States?\nShow Notes\nCHECK OUT OUR coverage of government, politics, and voting. Read about why the US might look to Estonia to bolster cybersecurity and Estonia's plan to use AI in the courtroom.\nLauren Goode is @LaurenGoode. Gideon Lichfield is @glichfield. Bling the main hotline at @WIRED.\nSign Up Today\nSign up for our Podcasts newsletter to catch all our latest audio offerings, including the Have a Nice Future podcast and our huge library of narrated articles.\nHow to Listen\nYOU CAN ALWAYS listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nFEATURED VIDEO\nExperts Predict the Future of Technology, AI & Humanity\nIf you're on an iPhone or iPad, just tap this link, or open the app called Podcasts and search for Have a Nice Future. If you use Android, you can find us in the Google Podcasts app just by tapping here. You can also download an app like Overcast or Pocket Casts, and search for Have a Nice Future. We’re on Spotify too.\nTranscript\nNote: This is an automated transcript, which may contain errors.\nLauren Goode: Hi, I'm Lauren Goode. Nope, I hated that.\n[Laughter]\nLauren Goode: Three, two, one. Hi, I'm Lauren Goode.\nGideon Lichfield: And I'm Gideon Lichfield. And this is Have a Nice Future, a podcast about how terrifyingly fast everything is changing.\nLauren Goode: Each week we talk to someone with big, audacious, and sometimes unnerving ideas about the future, and we ask them how we can all prepare to live in it.\nGideon Lichfield: Our guest this week is Luukas Ilves. He is the chief information officer of the government of Estonia, which people often talk about as one of the most digitally advanced governments in the world.\nLuukas Ilves (audio clip): The fact that other countries in a couple of years time can look at what we've done, learn these lessons, and then kind of catapult themselves into being the same league with us, that gives me ground for optimism that actually governments can get better at this.Lauren Goode: So Gideon, I've heard passing references to Estonia as this magical, futuristic place where everything runs on the blockchain or something. But I have to confess, I know very little about Estonia. I am going to be the proxy today for audience members listening to this who are like, “I know nothing about Estonia, tell me.”\nGideon Lichfield: That is your job.\nLauren Goode: That's my job.\n[Chuckle]\nGideon Lichfield: OK, well, so let me ask you something. In the last five years or so, how many times do you think you have filled in exactly the same information: your name, address, phone, email, social security number, health conditions, whatever, every single time you've gone to see a new doctor or applied for a driver's license, or done pretty much any other bit of bureaucracy?\nLauren Goode: A lot. A hundred. You're saying within the past year? I can't even begin to count.\nGideon Lichfield: Or five … However long. Yes.\nLauren Goode: I can't begin to remember. That's actually just called adulting.\nGideon Lichfield: That's why it's so hard.\nLauren Goode: Yes.\nGideon Lichfield: So what if you never had to do that again? You show up at a new doctor's office or at City Hall or at the bank, and you just prove to them that you are you, and they say, “OK, thank you Ms. Goode. Just tap here to accept our services, and we will have all the data on you that we need.”\nLauren Goode: So it's like Apple Pay for government?\nGideon Lichfield: Sure, if you want.\nLauren Goode: I think this is good as long as the data is secure.\nGideon Lichfield: Yeah. So what Estonia has is this advanced system for permissioning data. Different bits of the government, and also different private companies, all have data on you. But you can decide who gets to see which data from which place. This system they call the X-Road is basically a backbone for transferring data between different entities. And what's more, you not only can give permission to individual people or entities to see bits of your data, you can also see who has looked at it every single time, so you have total transparency into how your data is being used, which you certainly don't here in the US.\nLauren Goode: Ah, that must be where the blockchain comes in.\nGideon Lichfield: Somewhere in there the blockchain comes in. Yeah. It's possibly the first use of a blockchain I've actually believed in.\nLauren Goode: OK.\nGideon Lichfield: So let's go even further. Let's say you don't have to file your taxes—\nLauren Goode: I'm listening.\nGideon Lichfield: You just get a notification from the government that your tax return is ready, you take a look, and if it looks good to you, you click accept, and your taxes are done.Lauren Goode: What if they don't look good?\nGideon Lichfield: Then you can change them.\nLauren Goode: OK. I'm just saying if you have, like, a quibble about something.\nGideon Lichfield: Yes.\nLauren Goode: OK. I like the sound of this too.\nGideon Lichfield: And now let's imagine you're eligible for some kind of state benefit, like disability or an education grant or childcare but you don't have to apply for it, you don't even have to know it exists, you just get a notification from the government saying that you qualify for this thing, do you want it? If yes, click here.\nLauren Goode: How does the government know you're about to have a baby? Are they spying?\nGideon Lichfield: [Chuckle] No, but if it knows you've had a baby, if you've been to the hospital and registered a birth—\nLauren Goode: OK.\nGideon Lichfield: Then they—\nLauren Goode: OK.\nGideon Lichfield: Kick in automatically.\nLauren Goode: OK, so there's one side of this that sounds a little bit Big Brother, and then there's another part of me that thinks this is probably how a fully digitized government should work.\nGideon Lichfield: Right. It's kind of like Steve Jobs used to say about Apple products, “It should just work.”\nLauren Goode: And so, Luukas' job is to make this all work?\nGideon Lichfield: Well, not his job alone, but he is the guy in charge of overseeing the digital transformation that started about 30 years ago, and continuing to advance it across all the government.\nLauren Goode: Estonia is pretty small though, right? So to ask a question that perhaps a Silicon Valley VC would ask, can it scale? Is this something that the United States could conceivably do?\nGideon Lichfield: Well, that's what I wanted to talk to Luukas about. Because Estonia is seen as this poster child for digital government, to the point where it's kind of become a cliché. People say, “Oh, yeah, Estonia.” But good luck trying to replicate what Estonia does anywhere else. I basically wanted to ask Luukas how exportable is the Estonian model. And he seemed to think it wasn't as unique to Estonia as you might imagine.\nLauren Goode: Well, I can't wait to hear this.\nGideon Lichfield: And that conversation is coming up right after the break.\n[Music]\nGideon Lichfield: Luukas Ilves, welcome to Have a Nice Future.\nLuukas Ilves: Thanks, Gideon, it's a pleasure to be on.\nGideon Lichfield: Are you having a nice future?\nLuukas Ilves: I am. Although for me, it's my present.\nGideon Lichfield: I think most of our listeners probably have heard that Estonia is a pioneer in digital government, but they don't know much about what that means in practice. So can you briefly talk about the key things that make it a leader?Luukas Ilves: Sure. I mean, the headline point is really simple, which is just that everything's digital. There isn't a government service or an interaction between citizen or business and government that hasn't been digitized at this point. So everything from the mundane that should be digital at this point in pretty much every country in the world, like filing your taxes, permitting of any kind to—you know, some things that are a bit less digitized in most parts of the world, such as voting, where we've been able to vote online since 2004, and in our most recent elections, more than half of people did. And of course beyond just digitizing things, we have a very strong focus on taking advantage of all the sort of, the tools that new tech gives us to constantly make stuff better, whether that's better from the perspective of transparency and accountability, convenience, or cost effectiveness. So in some ways, I'd say it's almost unremarkable. We do in government what pretty much everyone in the world everywhere does with digital transformation, which is to find ways to constantly get better at what they're doing using the technologies of the day.\nGideon Lichfield: Estonia has been on this journey of digitizing government for about 30 years, so how did it get started, and why do you think it got a head start on so many other places?\nLuukas Ilves: Well, the interesting thing is we didn't get a head start, we had a very late start. So when did the US start digitizing government? Late ‘40s or the early ’50s with a bunch of mainframes. And even countries that you don't think of as being wealthier, super technologically advanced, have been doing digital government, at least in the sense of having government mainframes running back-office processes since the 1960s. Estonia was forcibly occupied by the Soviet Union until 1991, and so in a sense, a lot of our government processes were much more backward technologically. And when we regained our independence in 1991, we effectively had a clean reboot of a lot of how government functioned, and so we got lucky in timing. We started at a time where the thinking had just radically shifted in terms of what providing a service means. We were in the era of the internet. And the second is that we didn't have a lot in the way of resources. So we couldn't just sort of take 1980s enterprise IT, because we didn't have the ability to afford IBM and Accenture to come in and build that for us. And so, you know, initially, a lot of what we did was bootstrapped, and at the time fairly young tech guys figuring out very organically, well, what makes sense, what kind of fits our functional requirements?\nGideon Lichfield: Let's talk about some of the implications of what that actually means for users of government services. So Estonia has this principle that no piece of data should have to be entered twice. How does that change the experience for people compared with a country like sitting here in the US, every time you go to see a different doctor, you have to fill in forms all over again?Luukas Ilves: That's right. So that's what we call the once-only principle. If the government has asked you for a piece of data, they don't have a right to ask you for that same data again in a different context. So that means prefilled tax declarations, where Estonians like to compete on how long it takes them to declare their taxes, and what they're really competing on is who's faster at logging on to the tax service, pressing accept, and being done.\nGideon Lichfield: How long does it take then to file one's taxes?\nLuukas Ilves: If you don't actually look at the declaration, you can do it in about 15 seconds. So what's happening in the background there is that we have a pretty good taxonomy of the data that government has, and when one public body has a reason to use data, then they go and query that from another public body based on the legal authorization they have to use that data. But the benefits aren't just around convenience. It makes our public services work more effectively, it reduces a lot of error, and a lot of the sort of difficulties in public service delivery where disadvantaged populations might not get access to a service because they don't know about some kind of an opportunity or an entitlement—that you can sort of do away with. It reduces a lot of opportunities for fraud on the one hand, but also corruption on the part of officials. And it also, we at least think, makes us better at protecting our citizens' data, because instead of having massive amounts of data over-collected everywhere and generally not necessarily thawed and safeguarded too well, if we've got a piece of sensitive data, then we focus on keeping that well protected in one context, making sure the access rules are strictly enforced and making sure the right protections are in place, and then giving our citizens transparency on how that data is actually used.\nGideon Lichfield: So my sense from having visited Estonia a number of times over the last couple of decades, it's a pretty technologically literate country. But there will always be some people, and especially the elderly, who find digital services a little harder to handle, or who are especially vulnerable to hacking and having their data compromised. How do you help those people, and how do you make sure nobody's getting left behind?\nLuukas Ilves: So there's a two-part answer. The first, of course, is how you actually build your digital services to address these problems. So it's a basic, first of all, user design question, where you can have very complex services that can still be easy to use or that can be a nightmare to use. And the same thing is true for instance, for questions around identity theft or hacking. Part of having a security ID is it puts additional barriers in place to some of the usual ways in which credentials would get stolen. So for part of the elderly population, you're gonna solve that question by having easy-to-use convenient services that don't create those problems. And by the way, it's not just an elderly question, if we look at the largest proportion of calls to our help lines are actually from people in the age bracket of 18 to 25, because a lot of how government agencies design services, even Estonia, isn't really built for how Gen Z, which only uses mobile devices, which has a different expectation of user experience, how they're used to using services. So it's not always the case that younger means that they have an easier time using a service. But for the elderly, you're never gonna hit 100 percent. You're always going to have people with enough cognitive or sensory impairment that they really can't use a service, you're going to have people who just refuse to use a service, and we don't force citizens to use digital services, there is always an in-person or paper alternative. But it becomes a numbers game. The more you can move people into the online and automated channels, the more you can take the resources that you would use for in-person interactions to actually make the interaction for the complex cases work better. The idea is not that we move everyone into digitization, but that if we can move 80-20 or 90-10—the vast majority—into digitized automated channels, then we use the resources we have to then deal with the other 5 or the 10 percent in a way that actually pays more attention to their needs and gives them better outcomes.Gideon Lichfield: Right. So it seems like one of the big shifts that is happening at the moment in Estonia is a move to proactive public services, the idea that if you're entitled to some benefit, you shouldn't have to apply for it, it should just appear automatically. Where do you expect that to end up?\nLuukas Ilves: The idea is really quite simple, which is that the triggering conditions for most public services are written in the law somewhere. It can be anything from as mundane as, well, your passport needs to be renewed, to something a bit more sophisticated like means-testing for a public benefit. And if we know that we have the data that determine whether you are entitled to a benefit or should be using some kind of a service, then we're kind of sitting on our hands if we don't reach out to you when those data or those events indicate something should be happening. So the basic idea is just—it's a convenience point, it's as simple as me getting an SMS saying, “Hey, your passport's gonna expire in two months, here is a link to renew it.” But as you then start going through more complex events and services, you get into situations where you're notifying people of benefits that they weren't aware they're eligible for, you might in particular be focusing on disadvantaged populations where the information about the availability of these benefits isn't really there. Or you're pushing out things like, for instance, in the case of Covid, where we had additional unemployment benefits and then health benefits and support also for enterprises, you're going to the people that these benefits are meant to target without waiting for them to come to you, which should be contributing to actually achieving the desired outcome—the reason for which those benefits or those targeted forms of support were created in the first place—more effectively.\nGideon Lichfield: Right. I mean, it seems kind of obvious. And yet in most places around the world, it's assumed that if you want something from the government, you have to ask for it.\nLuukas Ilves: Yeah. And there may still be asking for it, I have to ask to have my passport renewed. But why shouldn't the government tell you that, “Hey, you can ask for it.” Wouldn't you like to ask for it? Because again, all of these various forms of benefits and services, ostensibly they exist because they're in the public good and because the lawmaker wants them to be used. So if we're kind of funding something, we're creating a legal framework and then we're just failing to tell our users that it's out there, it's really sort of doing 95 percent of the work and then failing in the last 5 percent.\nGideon Lichfield: Let's talk about online voting. This year, Estonians voted, and for the first time, more than half the votes were cast online. Tell us, first of all, how that online voting system works, what makes it secure?","creation_date":"2023-10-18","tags":["","HAVE A NICE FUTURE","PODCASTS","GOVERNMENT"],"author":"BY GIDEON LICHFIELD","category":null}