{"id":"d1d5ebe1-0200-4ec2-80c7-e559234fed12","article_link":"https://cointelegraph.com/news/bitcoin-ethereum-options-expiry-volatility","website_source":"Cointelegraph","article_type":"News Article","summary":"Deribit exchange data reveals that the put-to-call ratio for Bitcoin options contracts is currently at 0.50, with a maximum pain point of $61,000.","title":"Bitcoin and Ether options worth $2.4B set to expire May 3, max BTC pain at $61K","detailed_content":"Bitcoin (BTC) and Ether (ETH) options contracts worth a combined $2.4 billion are set to expire on May 3, which could lead to increased market volatility.\nA Bitcoin options contract is a derivative contract that allows investors to speculate on Bitcoin price movements without owning Bitcoin itself.\nThere are two types: call and put options. Call options give investors the right to buy a cryptocurrency at a specific price before a certain date. Put options, on the other hand, allow investors to sell a cryptocurrency at a particular price before the expiry date.\nInvestors often use the put/call ratio as a metric to assess the general state of the market. If traders are purchasing more puts than calls, it is considered a bearish sign, and if they are purchasing more calls than puts, then the market sentiment is considered bullish.\nA put-to-call ratio below 0.7 is considered bullish, while a ratio of more than 1 is regarded as a bearish indicator.\nRelated: US lawmakers urge SEC to approve Bitcoin options trading\nOn May 3, a total of 23,367 Bitcoin contracts worth $1.39 billion are set to expire. Data from the Deribit exchange reveal that the put-to-call ratio for Bitcoin options contracts is currently at 0.5, with a maximum pain point of $61,000. The maximum pain point refers to the price at which the asset will cause financial losses to the greatest number of holders.\nBitcoin options expiry. Source: Deribit\nSimilarly, a total of 334,248 Ether contracts with a notional value of $1 billion are expected to expire on Friday as well. These expiring contracts have a put-to-call ratio of 0.37 and a maximum pain point of $3,000.\nEther options expiry. Source: Deribit\nThe expiry of options contracts has historically been followed by short-term price volatility in the spot crypto market. Bitcoin and Ether have experienced bearish pressure in the past couple of weeks.\nThe BTC price fell below $60,000, marking an almost 20% weekly correction post-halving. The Ether price also fell below $2,900. The crypto market often bounces back from the options-led volatility within days of expiry.\nMagazine: Hong Kong Bitcoin ETF launch in ‘top 20%’, STRK scam suspect busted: Asia Express\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-03","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Bitcoin Options","#Ethereum Options"],"author":"by Prashant Jha","category":null}