{"id":"d2a3aa21-3bae-4dac-9c51-7e4fb58f52ba","article_link":"https://cointelegraph.com/news/whats-up-with-travel-the-shift-from-learning-to-building-with-blockchain","website_source":"Cointelegraph","article_type":"News Article","summary":"ITB Berlin Convention 2024 hosted bright ideas to move the travel industry forward, with blockchain and AI playing a key part.","title":"What’s up with travel: The shift from learning to building with blockchain","detailed_content":"The impact of blockchain on travel — including the travel-focused blockchain infrastructure, Camino Network — took center stage at the ITB Berlin Convention.\nTravel industry professionals continue to discover the potential of blockchain technology as Web3 grows and expands. Each new use case unlocks a different aspect of blockchain for travel, each new partnership paves the way for a more connected ecosystem. And what better way to exchange information and experience than an industry-wide international gathering?\nITB Berlin is a prominent trade show known for gauging the trends in the travel industry for over 50 years. The 2024 iteration of the ITB Berlin Convention saw over 100,000 visitors and 5,500 exhibitors from 170 countries gathering at the Berlin Exhibition Grounds from March 5-7.\nITB Berlin 2024 hosted over 100,000 visitors and 5,500 exhibitors. Source: fvw Medien\nEmulating the evolution in the travel industry, this year’s event focused on the developments in travel tech — mainly in artificial intelligence (AI), blockchain and Web3. When speaking about the hype and trends of travel tech, industry leaders — including key executives from travel tech pioneers like Camino Network — stressed the inclusion of AI into every discussion “just like how metaverse did last year” while blockchain and its applications moved to an infrastructure layer.\nWeb3 to enable connected trips\nITB Berlin Convention 2024 reserved several panels for deep discussions into the potential Web3 holds for the travel industry. As the broader business world agrees upon, personalization is key to driving any sector forward. For the travel space, the ‘marriage’ of Web3 and AI has the potential to introduce personalized travel experiences at an unprecedented level.\nBy seamlessly integrating all aspects of travel, guests and passengers will experience efficient and personalized travel catered to their specific needs and expectations through context-aware services.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe ITB Berlin Convention of 2024 proved a success for Camino Network, marking a notable increase in engagement and awareness around blockchain technology within the travel sector. The event saw unprecedented participation from established travel tech companies and emerging startups, reflecting a growing interest in the potential of blockchain technology.\nValidators such as ISO-Gruppe, BEWOTEC and Peakwork were present, underlining the importance of collaborative efforts in shaping the future of travel tech. From the Camino Network ecosystem, notable participants included Berge & Meer, eMind and Invia, each contributing to the vibrant dialogue and exchange of ideas that characterized the event.\nOne of the notable attendees was Sleap.io, a hotel booking platform built on blockchain that offers over 350,000 hotels globally and accepts over 250 cryptocurrencies. Sleap.io illustrates the industry’s shift toward embracing decentralized solutions, showcasing the practical application of blockchain in facilitating secure, efficient and personalized travel arrangements.\nThe increased presence and enthusiasm for blockchain and decentralized systems among participants from various facets of the travel industry underscore the expanding recognition of blockchain technologies’ impact on travel’s future.\nTravel companies are ready for Web3\nAt the 2024 ITB Berlin Convention, a clear signal was sent by travel companies showing a strong inclination toward building in the Web3 space, indicating a shift toward innovative technology adoption. Driven by a consortium of travel-related companies, Camino Network aims to spearhead the movement.\nITB Berlin 2024 was a great success for Camino Network. Source: Chain4Travel\nThe organizations in Camino’s consortium bring a wealth of experience and a rich content portfolio, ready to leverage the newly presented distribution tool — Camino Messenger, a wallet-to-wallet communication system designed for the travel industry, offers encrypted and seamless travel data management and exchange.\nCamino Messenger exemplifies the practical application of blockchain for B2B interactions in the travel sector. It operates on the Camino Messenger Protocol, which provides a structured framework for travel data communication, ensuring efficient and standardized interactions across the network.\nThe adoption and enthusiasm for Camino Messenger among service providers and distributors underscore the industry’s readiness to embrace blockchain for more unified and secure business-to-business (B2B) travel distribution processes.\nThe Camino Token, the essential fuel for transactions and operations within the ecosystem, powers the network. Currently available for public sale, the Camino Token facilitates the seamless and efficient exchange of value and information across the travel industry’s blockchain-powered distribution channels.\nSolving travel tech challenges with Web3\nIn the spirit of innovation and collaboration highlighted at the ITB Berlin Convention, Camino Network invites enthusiasts, developers and visionaries to join Decode Travel, set to take place on April 23-26, 2024, in w3.hub Berlin. The event presents an opportunity for participants to merge their Web3 knowledge with the expertise of travel tech developers.\nThe Decode Travel hackathon will give participants a chance to directly address real-world travel industry challenges presented by actual businesses using Web3 technologies. Giving an opportunity to create real use cases for real businesses, the hackathon will also present competitors with potential career opportunities in the emerging sector.\nAs demonstrated at ITB, the travel industry’s curiosity about Web3 is on the rise, presenting a unique opportunity for developers to lead the charge in innovation. With only a few spots remaining, Decode Travel invites anyone with an interest in Web3 and travel technology to contribute their skills and ideas, aiming to catalyze the development of real-world applications for travel tech.\nFind out more about Camino Network\n#Blockchain\n#Travel\n#Business\n#Adoption\n#Web3\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-08","tags":["#Blockchain","#Travel","#Business","#Adoption","#Web3"],"author":"by Serkan Keskin","category":null}