{"id":"d2ae113f-f53a-4512-8dc8-3a96e3449b8e","article_link":"https://cointelegraph.com/news/blockchain-tech-tracking-africa-motorbike-taxis","website_source":"Cointelegraph","article_type":"Tweet","summary":"Nodle’s underlying blockchain infrastructure will enable real-time location data of motorcycle taxis in East Africa financed by Watu.","title":"Boda boda blockchain boost: How tech is tracking Africa’s motorbike taxis","detailed_content":"Boda bodas are synonymous with life in East Africa, and in bustling cities like Nairobi, Kampala and Dar es Salaam, these motorbike taxis are the best way to weave your way to your destination.\nFor millions of Africans, boda bodas are a primary mode of transport and a vital means of income. The sector is about to experience a wave of fresh innovation, with blockchain technology set to provide real-time tracking of vehicles financed by asset financing company Watu.\nMotorbike taxis, known as boda bodas, are a primary means of transport in Uganda. Source: Entebbe Airport Express\nIn an announcement shared with Cointelegraph, Watu outlined a new partnership with Nodle’s blockchain-powered decentralized physical infrastructure network (DePIN) to enhance vehicle tracking of motorbikes it has financed.\nRelated: IoT project turns smartphones into blockchain nodes to broaden connectivity\nWatu has provided loans to over one million Africans in seven countries, allowing individuals to access finance to purchase motorcycles and offer taxi services.\nNodle’s DePIN infrastructure will power real-time location data for the vehicles, aimed at protecting owners in case of theft and helping Watu have better visibility of the assets it has financed.\nThe project will start in Uganda in May 2024 and expand to Kenya, Tanzania, Nigeria, Sierra Leone and the Democratic Republic of the Congo over the next few months.\nData visualization of Nodle’s network coverage in Uganda. Source: Nodle Explorer\nThe Watu asset location solution will be built on the Nodle Network, a decentralized mobile network where users’ smartphones act as nodes in a secure DePIN.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nNodle’s DePIN operates on smartphones and is touted to provide wide coverage and precise tracking due to the ubiquity of smartphones and advanced geolocation capabilities.\nRelated: Blockchain IoT firm Nodle goes open source with Web3 Bluetooth ‘nanocomputer’ sticker\nNodle co-founder and CEO Micha Benoliel said the partnership with Watu will significantly boost the deployment of the network in Africa. He added that smartphones will account for 88% of mobile connections by 2030, up from the present rate of 50%.\nWatu head of GPS tracking Gunars Bidins said that Nodle’s network is ideally suited for Watu’s asset management needs:\n“This collaboration allows us to track our asset fleet more efficiently and cost-effectively, ensuring the safety and security of our assets across our expanding African operations.”\nRelated: Blockchain key to verifying authenticity of real-world media — Nodle\nNodle’s chief product officer, Florent Stroppa, believes the use case explored with Watu demonstrates DePIN’s benefits to economies and society. He said that the crowdsourced network will allow new services to be deployed quickly and cost-effectively:\n“In this particular instance, the technology is used to track assets that are usually difficult to locate. We are really excited to work with Watu in this deployment.”\nDePINs are a fast-growing sector of the blockchain industry. The technology is being used to source cloud computing resources through projects like io.net and a host of other real-world use cases recently explored in the latest podcast episode of Decentralize with Cointelegraph.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-01","tags":["#Blockchain","#Technology","#Adoption","#Smartphone","#Taxi driver","#mobile tech","#E-Mobility"],"author":"by Gareth Jenkinson","category":null}