{"id":"d398c057-af89-4b7f-8d0f-4dd0c864b51c","article_link":"https://cointelegraph.com/news/bitcoin-fees-top-ethereum-3-days-btc-halving-approaches","website_source":"Cointelegraph","article_type":"News Article","summary":"Transaction fees will play an important role in keeping Bitcoin miners afloat after the halving as the subsidy for mining a block falls from 6.25 BTC to 3.125 BTC.","title":"Bitcoin fees top Ethereum for 3 days in a row as halving approaches","detailed_content":"Fees on Bitcoin have surpassed Ethereum for three consecutive days as miners and traders prepare for the upcoming Bitcoin halving and, to a lesser extent, the introduction of Runes on Bitcoin.\nBitcoin (BTC) miners cashed in $7.47 million in fees on April 17 — about $160,000 more than the $7.31 million paid to Ethereum stakers, according to Crypto Fees.\nBitcoin miners also raked in $9.98 million and $5.91 million across April 15 and 16 — beating out Ethereum stakers by $3.5 million and 1.1 million on those respective days.\nEthereum, however, maintains a narrow lead on a seven-day average fee basis at $8.55 million compared with Bitcoin’s $7.57 million.\nLargest fees by blockchains and decentralized finance projects. Source: Crypto Fees\nBitcoin transaction fees are determined by the size or data volume of the transaction and blockspace demand at the time of the transaction request.\nThe uptick in Bitcoin fees comes at a crucial time for Bitcoin miners, as April 20’s Bitcoin halving event will result in the mining subsidy being sliced from 6.25 BTC ($398,000) to 3.125 BTC ($199,000).\nCurrently, about 900 BTC is mined per day, which equates to about $57.2 million at current prices.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nUsing April 17’s $7.47 million fee count, this means transaction fees accounted for 11.5% of the Bitcoin mining industry’s total block rewards.\nHowever, the share of block rewards from transaction fees will increase considerably after the halving event, as approximately 450 BTC will be mined then.\nMiners will, therefore, rely more on higher fees and a continued increase in Bitcoin’s price to make up for the revenue fall that it will experience — at least in the short term — from the halving.\nMeanwhile, the introduction of NFT-like Ordinals inscriptions in January 2023 has helped Bitcoin miners chalk up more revenue from transaction fees — and a new revenue stream will become available when Runes, a new Bitcoin token standard, is released when the halving occurs at block 840,000.\nRelated: China has a Trojan Horse in US Bitcoin mining infrastructure\nRunes will compete with Ordinals by aiming to make it easier to create fungible tokens on Bitcoin for memecoin enthusiasts and other community-driven audiences.\nIts creator, Casey Rodarmor — who also invented Ordinals — said Runes are fully UTXO-based and, therefore, should not spam Bitcoin to the same extent that Ordinals has.\nSource: Casey Rodamor\nThe recent uptick in Bitcoin fees may have been partially driven by a decline in BRC-20 token prices in recent days as some trader attention shifts to Runes.\nOrdinals (ORDI) and Sats (SATS), the two largest BRC-20s by market capitalization, have seen falls of 38% and 43%, respectively, over the last week, according to CoinMarketCap.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Bitcoin","#Blockchain","#Mining","#Ethereum","#Transactions","#Bitcoin Mining","#Uniswap","#NFT","#Transaction Fee"],"author":"by Brayden Lindrea","category":null}