{"id":"d3a2f5cf-4d6e-46c0-90d9-d16b9da8e714","article_link":"https://cointelegraph.com/news/hybrid-nft-standard-combines-erc-20-and-erc-721-with-low-transaction-fees","website_source":"Cointelegraph","article_type":"Tweet","summary":"NFTs can become more resilient to market downturns with a hybrid approach that combines the best parts of ERC-20 and ERC-721 with lower gas fees.","title":"Hybrid NFT standard combines ERC-20 and ERC-721 with low transaction fees","detailed_content":"Nonfungible tokens (NFTs) might be one of the most hyped innovations spurred during the rise of Web3, but the last bear market showed that they are not immune to a market downturn. Studies say that NFT sales are mostly driven by a combination of luck, scarcity and optimism, implying room for improvement to make them more resilient to market conditions.\nUnlike other blockchain-based assets, NFTs have their own challenges on top of the common issues troubling the broader Web3 ecosystem. Despite their popularity and the vast range of uses — from art to gaming to digital identities — NFTs face significant hurdles impacting user experience and adoption.\nKey NFT challenges\nLiquidity\nLiquidity is a primary challenge in the NFT market. As seen in the so-called crypto winter, NFTs are much harder to cash out than cryptocurrencies. This is because each NFT offers unique features or utilities, making it harder to find buyers or sellers during a market downturn.\nPrices become more volatile, and the duration for which assets remain unsold extends. The liquidity issues lock existing users’ capital while deterring potential investors’ participation due to asset fluidity concerns.\nFractionalization\nAny crypto user can buy one-thousandth of Bitcoin\nBTC\n$62,992\n, but the same is not true for a Bored Ape Yacht Club NFT, which usually has a floor price of far above 10 Ether\nETH\n$3,030\n. The lack of fractionalization in NFTs creates a massive barrier for newcomers, especially smaller investors, preventing them from participating in the market.\nTransaction costs\nThe more advanced features NFTs offer, the more complex their transactions become to process. While newly emerging standards can address inherent issues of NFTs, they still suffer from the high gas fees for which the Ethereum Virtual Machine-based networks are infamous.\nIntegration and Composability\nThe unique nature of NFTs makes them a challenge to integrate and add to a platform, even within the Web3 ecosystem. Most platforms and protocols are simply not equipped to handle the transactions and storage of NFTs, preventing NFT holders from enjoying the most common functions of decentralized finance (DeFi), such as lending, borrowing and yield farming.\nLack of control over NFTs\nThere are new standards, such as ERC-404, that aim to merge ERC-20 and ERC-721 qualities, but their approach doesn’t give enough control to users over the fractionalized NFTs they hold. For example, if the tokenholder has fractional ownership of multiple unique NFT artwork, they can’t pick which artwork they want to let go of while trying to sell it on a decentralized exchange (DEX).\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nHybrid approach to ERC-20 and ERC-721\nA hybrid approach that combines the strength of the two most common token standards — the ERC-20 and ERC-721 — has the potential to effectively address the NFT challenges, primarily the ones regarding fractionalization and liquidity. While there are already some experiments on the topic, these efforts still need to figure out how to deal with the ever-rising transaction costs of networks based on Ethereum Virtual Machine (EVM).\nThis is where HybridX emerges with its gas-efficient hybrid token, HX, combining the ERC-20 and ERC-721 standards. The unique blend introduced by HybridX aims to harness the strengths of both standards to offer efficiency and flexibility in the trading and management of digital assets of the broader Web3 ecosystem.\nFractionalized, low-cost NFTs\nThe hybrid HX token model allows for the fractionalization of NFTs to increase market liquidity, enabling users to buy and sell portions of NFT assets. The fractionalized NFTs can potentially become more accessible and appealing as digital asset investments for a wider demographic.\nOn top of addressing the liquidity and fractionalization issues plaguing the NFT market, the first project on HybridX — XDragon — has selected the Internet Computer Protocol (ICP) as its infrastructure primarily due to its capabilities that enhance the project’s features. ICP’s on-chain Verifiable Random Function (VRF) allows for the truly random generation of NFT artworks upon conversion from fungible tokens, a contrast to the sequential allocation common in most NFT collections. The on-chain VRF ensures that each NFT acquired is a surprise, enriching the user experience with genuine uniqueness.\nAdditionally, ICP facilitates the on-chain storage of all NFT metadata, a move that eliminates the need for off-chain components and bolsters the security and integrity of the data.\nThe hybrid token model integrates with DeFi and NFT platforms for enhanced composability. NFT holders can leverage their assets through the HX token in various DeFi applications.\nHybridX also offers flexible management of NFT collections. Users can selectively sell or burn assets without being constrained by current standards’ first-in-first-out (FIFO) restrictions. This allows tokenholders to take a strategic approach to their portfolios.\nSeamless switch from fungible token to NFT\nThe innovative approach to NFTs has already established use cases to demonstrate the flexibility and efficiency of HX, including the Web3-powered Dragon Eyes dice-rolling game.\nDragon Eyes introduces the XDragon as a switchable NFT to memecoin. Users can shapeshift their fungible EYES token, the reward token of the game, to mint an Xdragon NFT. The game applies a 1% fee distributed back to the NFT holders through pool fee distribution and gamification. The shapeshift fee is directly proportional to the token price, providing fundamental value and utility for XDragon.\nXDragon will be featured in the upcoming global ICPCC event on May 10, which will showcase how ICP technology can be used to enhance decentralized applications on any blockchain.\nXDragon Gamblification Economy\nXDragon collection is designed to be self sustained through gamblification and shapeshift fee distribution.\n\nIn HybridX standard, you can only hold Fungible OR Non-Fungible, unlike like ERC-404.\n\n\"Shapeshift\" is the action to change mode from NFT to… pic.twitter.com/xnho541mTH\n— 🐉 Dragon Eyes 👀 | XDragon 🐲 (@ICDragonEyes) March 13, 2024\nFollowing the release of the HybridX Tools as a user-friendly interface for on-demand minting and burning of ERC-20 and ERC-721 tokens, the HX ecosystem aims to expand with a range of key Web3 milestones. The expansions include exclusive NFTs for HybridX members, the CrossPollinate program for incentivizing ecosystem projects, a launchpad powered by NFTs and a DEX for both fungible and nonfungible tokens.\nAs the blockchain-based internet continues to expand and evolve, HybridX envisions a fluid future of digital assets “where the values are seamlessly discovered and exchanged, fostering innovation and accessibility in the evolving Web3 economy.”\nFind out more about HybridX\n#Blockchain\n#Adoption\n#ERC-20\n#Web3\n#NFT\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-04","tags":["#Blockchain","#Adoption","#ERC-20","#Web3","#NFT"],"author":"by Mike Kara","category":null}