{"id":"d3ab5a59-767f-4ca2-a556-72c9f6622f12","article_link":"https://medium.com/lost-relics/echoes-of-time-efdacbf4df29","website_source":"Medium","article_type":"Blog Post","summary":"In the lands of Inverdhen, where time’s whispers play, A challenge arises with the break of day. Echoes of Time, a test of skill and might…","title":"Timemaster’s Epoch","detailed_content":"Testing your skill in speed of completion, this new game mode pits you against the clock. There are 4 new adventures to explore in Inverdhen, and each can be run as a standard adventure, or the more enticing Echoes of Time.You’ll need an initial Sigil from Thornix Stonecarver to activate this mode, depending on the rarity you choose, but as long as you don’t die, you’ll be able to retry as many times as you like, until you succeed and move to the next tier.If you succeed in beating the clock, your sigil will be replaced with the next tier higher, allowing you to compete at the next level!As you progress through the tiers, you’ll find that monsters gain more health and are stronger overall. To really hit a home run in this mode, you’re going to need to use consumables. Fortunately there are a few new items in this update which you can use in your arsenal! Additionally securing yourself a blockchain weapon, will help you make light work of this increased threat!There are a total of 4 tiers for each of the 4 new adventures, starting with Bronze, then Silver, Gold and then Platinum. There is a weekly Time Chest for any player who completes any of the tiers in any of the adventures; however note that you can only win 1 Time Chest per week. The Time Chest will be awarded for the highest rarity adventure you complete within the week and the rarity based on the tier that’s completed.For example if you complete up to Gold Tier in Epic, and then move to Legendary and complete Bronze, you’ll be awarded the Bronze Legendary Time Chest.There are a total of 16 Time Chests, each with increasingly more lucrative rewards. May the RNG be with you!Additionally there’s an overall leaderboard to compete on, with the top 3 players in each rarity receiving an additional prize at the end of the week. The ultimate prize being the Timemaster’s Chest!You’ll need to complete a Quest in Inverdhen before unlocking access to Echoes of Time.The appearance of Armor has been updated, along with it’s effects.The property differences between each tier of Armor has been increased and plate armor vs leather armor has a greater difference depending on your playstyle.If you’re playing mostly ranged, you’re going to want to secure yourself some good quality leather armor, because plate armor, which is great at mitigating incoming damage, isn’t so optimal with ranged energy use.Additionally the new game mode Echoes of Time has a chance to grant rewards which can be taken to Thornix Stonecarver to create even more powerful armor.Finally, when armor breaks, it no longer breaks into Armor Remains, instead it functions the same as all other items that break. This change will help with resource demand in the marketplace.The variety of monsters has expanded to include an additional 24 new monsters! Some monsters have unique abilities which you’ll need to figure out the best way to counter. They might seem daunting at first, but with a little practice you’ll be owning them in no time. Other new monsters will gain additional abilities in the future.The monster population has been spread out across all adventures, with more variety added to every theme. Be sure to take extra consumables and maybe a teleport scroll if you’re revisiting a favorite adventure in this update.Monster damage output has also been revised with this update to better align with the armor and other changes.You’ll be able to unlock the Gem Disaggregator at Inverdhen, giving you the power to extract Shattered Gems from various items. See Thornix Stonecarver in Inverdhen for help with this.These shattered gems have multiple uses, one of which is used to upgrade armor with additional properties.Additionally you can use shattered gems to create a teleport scroll which takes you straight to Inverdhen if you’ve already unlocked it!Some items have been shifted around in Alchemy and Cooking, after their effects have been updated. These changes were made to better align Alchemy and Cooking to the most recent meta changes. You’ll find that fish are for restoring your health and energy, while potions are for buffing your combat.Experience values have also been adjusted to provide a smoother progression curve as you level up your skills, removing the progression curve hills that existed before.Additionally some items have been removed from Alchemy and Cooking to simplify the available recipes. See Old Item Removal and Old Item Swaps below for more information.Untethered Tonic, Spellbreak Potion, and Acceleration Potion have also been updated with a new name and effect (The marketplace listings have been cancelled for you). Untethered Tonic has been changed to Overload Serum, Spellbreak Potion to Bastion Brew, and Acceleration Potion to Precision’s Peak Potion.All Blockchain weapons now have basic effects added to them, in preparation for future expansion through the Weapon Upgrade system. We also added an effect to Emblem of the Ancients.The full list is as follows:Krong’Oul’s Last End Conductor, Shapeshifter’s Demise, Starcaller, Axe of Antagony, Cavalier Crusader, Glint of Asperity, Heartstriker, Incarnated Ravager, Mooncleaver, Night Shredder, Obsidian Defender, Pride of the Fleet, Reaper’s Toll, Silent Song, Sky Spire, Stormsong, Thunderstrike, Valkyrie, Wings of Surety, Axe of the Intolerant, Blade of the Ember Pact, Blood Eclipse, Breeze Bender, Conquest, Doomblade, Fortune’s Warblade, Ghost Reaver, Ice Wrath Cleaver, Long Reign, Obsidian Katana, Ritual Rapier, Silent Assassin, Silver Broadaxe, Silver Saber, Skeletal Warblade, Skull Breaker, Soul Infused Copper Warblade, Viper War Axe, Volcanic Broadaxe, Scathing Ruin, Wildone’s Axe, Refereum Sword, Godslayer and Emblem of the Ancients.Morphs have been upgraded to now stay morphed until you demorph, perform an action, or take damage. There’s no longer a limit to the distance you can travel while morphed, and there’s no time limit that you can stay morphed. Using doors or stairs also no longer demorphs you.The cooldown after demorphing is now always 5s, instead of being scaled to the distance you travelled.Overmorph Potion has also been updated. Once activated, it’ll allow you to instantly morph but at the cost of 50 energy. The effect can be used in town, and lasts for 20 minutes. The 5s cooldown after use still applies.We’ve been working towards a 2 stage integration with Enjin’s Matrixchain. The first tier is complete on our side, which is to allow sending and receiving of ENJ to the game and back. This process has taken far longer than expected because we discovered issues that needed resolving on Matrixchain before we could launch.This update will initially launch with sends/receives turned off, and once we’ve been able to perform further testing, we’ll enable and send out an announcement that it’s ready.Matrixchain also has network fees (whereas JumpNet had none) so be aware of that when you’re sending and receiving your ENJ. (Although they’re far less than they ever were on Ethereum). Additionally the withdraw fee from the game has been set to 0.03 ENJ and the 24 hour cooldown on withdraws has been removed. You are also able to unlink your wallet, however a fee of 10,000 Luneri applies. These fees are in place to discourage certain negative behaviors and to also help pay for ecosystem costs. They may be reviewed in the future but we believe they’re set appropriately.You’ll also notice that Shadowstones have been removed. We’ve completely replaced all reference to Shadowstones with Enjin Coin and updated how we display the value. So before, if you had 530 Shadowstones, you needed to divide that by 100 to know that you had 5.3 ENJ. From now on though, you’ll no longer need to do this, as the value in game will simply show 5.3 Enjin Coin.Please take care as you trade on the marketplace, as your muscle memory may want you to type 100, instead of 1. Double check everything until you’re used to the new values!Shadowstones that you found within the game are now represented as Enjin Gems. These were always separate internally, but they’re now distinct, because it’s a little confusing that you could send some of your Shadowstones out of the game, but others needed to be used in the market first. Now it’s very clear that if you have Enjin Gems, you must spend them in the marketplace. (This value is still only displayed under the Enjin Coin tooltip at the top of the screen)The 2nd stage of integration with Matrixchain will be recreating all of the items. This 2nd stage will be launched at a later date, once we’re happy with the performance and reliability of Matrixchain and we’ve heard your feedback about the whole process.The interface displayed when interacting with NPCs who exchange items with you has been improved to align better with the existing interfaces.Additionally some NPCs now have additional items available for exchange!Due to the upcoming new content, we found it necessary to rebalance certain items, as some were either too weak or too strong.Instead of attempting to adjust each individual item, we have made the decision to remove them altogether. We appreciate your understanding that such adjustments may occur during the early stages of development.To express our gratitude, if you had any of the affected items, we have credited you Gold Coins based on how many old items you held, and additional bonuses depending on how many of the items you held.The affected items are:Protection Potion, Swiftness Potion, Brute Force Potion, Antirange Potion, Dynalyte Potion, Fortification Potion, Raw Hock and Hock.You’ll receive a gift containing the gold and any bonuses. You’ll have 60 days to open the gift, after which it’s contents will expire and the gift will disappear. (These gifts will take time to send out, and may not be immediately available when you launch the update)The below bonuses are additive, and per unique item type (Except for Elixir Evaporated which is limited to 1 per account).So if you had 650 Brute Force Potions and 250 Swiftness Potions, you’ll receive: 35,000 Gold Coins, 4x Wheel of Wonder Tokens, and 1x Frostfall Siege Key.Thank you for supporting us during the early development phase of the game!We’ve clarified the Alchemy and Cooking skills and therefore some items have been removed and swapped with other items instead.This greatly simplifies the consumables available and improves the quality of the remaining items.All swaps are one for one. Any of the removed items that you held, will be replaced with the other items below:(These swaps will take time to credit, and may not be immediately available when you launch the update)","creation_date":null,"tags":["Videogames","Blockchain","Blockchain Technology","Development"],"author":"Lost Relics","category":null}