{"id":"d4ca6eef-6b8d-41df-92c0-20d429e9320d","article_link":"https://cointelegraph.com/news/cypher-contributor-admits-stealing-gambling-protocol-funds","website_source":"Cointelegraph","article_type":"News Article","summary":"The contributor, “hoak,” said their actions were due to a “crippling gambling addiction” and “psychological factors that went by unchecked.”","title":"Cypher core contributor admits to stealing $260K and gambling it away","detailed_content":"An anonymous core contributor to the Solana exchange Cypher Protocol has confessed to stealing and gambling away around $260,000 worth of the project’s cryptocurrency recovered from a $1 million exploit last year.\n“The allegations are true, I took the funds and gambled them away. I didn’t run away with it, nor did anyone else,” the contributor, who goes by “hoak” wrote in a public statement they shared in a May 14 X post.\nAnonymous Cypher contributor “Barrett” had earlier posted a document to X alleging that a wallet owned by hoak made 36 transactions withdrawing various amounts of Ether (ETH), Bonk (BONK), Wrapped Solana (wSOL) and other cryptocurrencies from Cypher’s redemption contract — totaling around $260,000.\n“I never thought this would be a possibility, having a core contributor who stayed on after the exploit to try and rebuild the project be the one who rugged funds from the redemption contract,” Barrett wrote on X.\nThey added they notified law enforcement of hoak’s alleged actions.\nSource: Barrett\nIn hoak’s statement, they wrote that “likely nothing I say or do will make things better — perhaps other than rotting in jail.”\nHoak said their actions were “the culmination of what snowballed into a crippling gambling addiction” along with “multiple other psychological factors that went by unchecked for too long.”\nThey said after a string of personal and career issues they found footing with Cypher but claimed they failed “to innovate within the DEX design space.”\nSource: Hoak\n“I worked and worked,” hoak wrote. “I failed, I worked some more and I broke.”\nRelated: WBTC thief returns $71 million worth of stolen funds\nHoak said they “let too many things pile up in my head for too long, I let them consume me.”\n“I completely lost it late last year and earlier this year to the point where simply trying to hold it together was impacting everything else in my life, distancing myself from long-time friends, family, not being able to meet the deadlines I set for myself, having erratic behaviours, you name it,” they wrote.\nIn August 2023, an exploiter pilfered Cypher Protocol for — at the time — $1 million worth of Solana (SOL) and USD Coin (USDC).\nThe protocol managed to freeze $600,000 worth of the stolen crypto, it later created the redemption contract and a recovery plan to pay back users for their stolen funds.\nMagazine: Cryptocurrency trading addiction — What to look out for and how it is treated\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Gambling","#DeFi"],"author":"by Jesse Coghlan","category":null}