{"id":"d5a993e6-ea8e-4474-ae9e-b7c96d3cac42","article_link":"https://cointelegraph.com/news/eigenlayer-restaking-launch-ethereum-mainnet-missing-key-features","website_source":"Cointelegraph","article_type":"News Article","summary":"EigenLayer is live on the Ethereum mainnet, but several crucial features are still on the way “later this year.”","title":"Restaking protocol EigenLayer partially launches on Ethereum mainnet","detailed_content":"Ethereum restaking protocol EigenLayer, which touts over $13 billion in assets, has launched onto the blockchain’s mainnet, but some key features are still to come and will go live sometime in 2024.\nEigenLayer announced the launch in an April 9 blog post but added in-protocol payments to operators from actively validated services (AVS), such as apps and cross-chain bridges, are yet to come.\nA mechanism called slashing — when validators get their staked crypto taken from them if they don’t do their job correctly — is also still on the way.\nBoth will come “later this year” after the EigenLayer marketplace has time to “develop and stabilize,” the protocol said without disclosing a timeline.\nAs of today, restakers can now delegate their restaked ETH balance to Eigenlayer operators, who in turn operate AVS.\n“So there’s still no restaking rewards?” Galaxy Digital vice president of research Christine Kim rhetorically asked in a responding X post.\nSource: Christine Kim\nThe promise of restaking protocols such as EigenLayer is to allow users to earn rewards for restaking their already-staked Ether\nETH\n$3,030\ntokens — which are 1:1 representative tokens tied to ETH staked in a protocol such as Lido or Rocket Pool.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nCoinbase analysts said on April 2 that restaking could increase earnings but “can also compound risks” as the same funds could be shipped around to multiple protocols, which could create complex security and financial issues.\nAlongside its mainnet launch, EigenLayer also released a data availability service EigenDA, the first AVS to launch on the protocol aiming to help other blockchain apps store transaction data.\nRelated: Aave contemplates fee distribution in DeFi shake-up\nOther AVS, however, will have to register with EigenLayer and cannot fully deploy right now.\nIn a separate X post, Galaxy’s Kim said she didn’t understand “why everyone’s hyped about this [EigenDA] news, 99% of getting restaking right depends on the economics, balancing risk with reward.”\n“There’s still no risk (ie, slashing) or reward (ie, AVS payouts) live on [EigenLayer] SO there’s no restaking really happening yet [in my opinion],” she added.\nEigenLayer has a total value locked of $13.33 billion, according to DefiLlama.\nEigenLayer’s total value locked in U.S. dollar terms since its launch. Source: DefiLlama\nIt overtook Aave in early March to become the second-largest decentralized finance protocol behind Lido, with $33 billion in locked value.\nMagazine: Ethereum restaking — Blockchain innovation or dangerous house of cards?\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Blockchain","#Ethereum","#Staking"],"author":"by Jesse Coghlan","category":null}