{"id":"d67b8ea4-c4ed-456e-96df-684ebebce423","article_link":"https://cointelegraph.com/news/bitcoin-reaches-one-billion-transactions","website_source":"Cointelegraph","article_type":"Tweet","summary":"An average of 178,475 daily transactions have been made on Bitcoin during its 5,603-day existence.","title":"Bitcoin reaches one billion transactions","detailed_content":"The Bitcoin network has processed its one billionth transaction — marking a huge milestone moment for the network 15 years after its creation.\nClark Moody’s Bitcoin dashboard shows that transaction 1,000,000,000 was processed in block 842,241 at 9:34 pm UTC on May 5.\nTotal number of transactions processed on the Bitcoin network. Source: Clark Moody\nIt comes 15 years, four months and four days after the pseudonymous creator Bitcoin (BTC), Satoshi Nakamoto, mined the network’s first block on Jan. 3, 2009.\nThe network has processed an average of 178,475 daily transactions in its 5,603-day existence.\n#Bitcoin has officially processed over 1 billion transactions. pic.twitter.com/kS704YYoW5\n— Wicked (@w_s_bitcoin) May 5, 2024\nHowever, the count doesn’t include transactions made on the Lightning Network, a Bitcoin layer-2 payment protocol enabling faster transactions.\nData from the Bitcoin-only exchange River found the Lightning Network processed a lower-bound estimate of 6.6 million transactions alone in August 2023, suggesting that hundreds of millions of transactions have been made on Lightning since it launched in January, 2018.\nDaily transactions on Bitcoin spiked around the network’s fourth halving event on April 20, with a record high of 926,000 transactions processed on April 23.\nMuch of this demand came from the launch of the Runes protocol at block 840,000.\nThat said, Bitcoin’s daily transaction count has since cooled off to 660,260 on May 4.\nDespite Bitcoin being the oldest cryptocurrency network, it isn’t the first of its kind to process one billion transactions.\nBitcoin’s biggest rival, Ethereum, has processed well over two billion transactions since it launched in July 2015, Etherscan data shows.\nRelated: Impact of Bitcoin halving event on transaction confirmation times\nBitcoin is currently priced at $63,750, up over 12% since it hit a two-month low of $56,800 on May 2, according to CoinGecko.\nHowever, it is still down 13,6% from its all-time high of $73,740 set on March 13.\nBitcoin’s change in price over the last 12 months. Source: CoinGecko\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Transactions","#Adoption","#Bitcoin Mining","#Microtransactions","#Bitcoin Halving","#Runes Protocol"],"author":"by Brayden Lindrea","category":null}