{"id":"d7020aac-798e-4d7f-bd03-20535d752639","article_link":"https://www.wired.com/story/margaret-atwood-interview/","website_source":"Wired","article_type":"News Article","summary":"The author spoke with WIRED about her new short story collection Old Babes in the Wood, crypto, the end of Roe v. Wade, and what’s left to inspire hope.","title":"Margaret Atwood Is Ready to Let It Rip","detailed_content":"WHEN I FIRST see Margaret Atwood, she’s bundled up. Red hat over her famous silver curls, long puffy coat, boots befitting a Canadian winter. The right outfit for a profoundly gray Toronto day, especially since she’d trudged over snow-piled sidewalks to meet me. “I always walk everywhere!” she says merrily, unspooling her scarf. \nIt almost made me feel bad for taking a cab to the restaurant. But best not to compare oneself to the author of The Handmaid’s Tale. She’d strolled over to tell me about her new book, Old Babes in the Wood. It’s her ninth short story collection, adding to a sprawling body of work that includes 17 novels and 18 volumes of poetry. \nBOOKS\nDystopia Is All Too Plausible in The School for Good Mothers\nKATE KNIBBS\nTV\nMade for Love, Handmaid’s Tale, and the Trap of Dystopian TV\nKATE KNIBBS\nBOOKS\nMargaret Atwood's The Testaments Is Done With Handmaids\nSOPHIE CHARARA\nOld Babes in the Wood gives readers Atwood at her most whimsical: a snail swaps bodies with a human, an alien tries to translate a fairy tale, a seance summons the ghost of George Orwell. This varied fare is bookended by two suites of bruising stories about Nell and Tig, a devoted couple Atwood first introduced in 2006’s Moral Disorder. This time around, Nell mourns Tig’s illness and eventual death; time blurs as she grieves, skipping through memories of earlier seasons of her life. These stories layer onto each other, forming a melancholy love story as affecting as any of Atwood’s strongest work. \nAs the author sat down, I pulled a list of questions from my purse, eager to get insight into her newest work and seemingly indefatigable creative process. I did, eventually, but our conversation ended up being wider-ranging and slightly stranger than expected. With exactly nothing to prove and no one left to impress, she seemed happiest bantering. (By the way, in case Condé Nast’s expense department is reading this: I didn’t order the $45 foie gras. Or the whiskey. You try telling an 83-year-old living literary legend what they can or can’t order.) We might have kept talking straight until dinner, except Atwood realized she was very late for her next appointment, and bundled back up in record time.\nBut returning to the beginning of the meal. After removing all her winter gear, she kicked off the conversation with a very WIRED opening line. \n“Did you know,” Atwood asked, “that amongst other things, I’m also a tech entrepreneur?”\nWIRED: I heard you invented—was it a remote book-signing device? \nMargaret Atwood: Yes. Longpen. One day FedEx showed up with a parcel and I signed for it. I thought, why can’t we use this sort of thing to sign books? I thought my signature was going through the air and somehow turning into ink somewhere, which of course it wasn’t. When I said that to people more knowledgeable than myself, they laughed and laughed. So I said, OK, that doesn’t happen … but could it? They researched, and there was nothing similar. The closest sort of device to what I was envisioning was used for remote surgery. \nActual surgery? \nActual surgery. There was nothing like it. So we made it. Publishing didn’t quite grasp the beauty of it, but now it’s used in business. Do you have any other tales of tech entrepreneurship I should know about? Have you secretly joined BookTok? \nNo, but I’ve heard about it. It’s really young people, so I think if I went on there, they’d scream and run. \nThey’d be excited to see you. \nI’m not sure about that. I know older businesspeople don’t like it so much, because they can’t tell young people what they ought to be reading anymore. And they don’t necessarily have the same taste. \nI definitely don’t always like the books I see recommended on TikTok. But I’m older than your average TikTokker, too. \nWell, and tastes change over time. A lot of the books you loved in your teens, you’ll revisit later and think: Why did I ever like that? Then you’ll think something is the most boring thing you’ve ever read, but pick it back up at 35 and see the beauty.\nThat reminds me of one of the first questions I was going to ask you. \nWhat’s it like to be really, really old? \nNo!\nIt’s more fun than you’d think.\nWell, actually—expand on that. \nAs long as you’re not actually dying or having dementia, you just have a lot less to lose. You can color quite a lot further outside the lines, especially compared to young people these days, in an age of anxiety. People are afraid of being beaten up by their peers on social media. They haven’t been hardened in the fire. If you have been hardened, you can just let it rip. \nPHOTOGRAPH: JINGYU LIN\nThe actual question I wanted to ask, about how our perspectives change over time, relates to one of the stories in Old Babes in the Wood. “Freeforall,” a speculative piece about a world where widespread fear of disease leads to government tyranny, was originally published in 1986—Oh, yes. The editors were very keen to include it. They thought it was of historical interest, since it’s kind of a flip on Handmaid’s Tale. \nAh, so you didn’t pick it yourself? \nI thought it was too long, so I changed it a bit. I mean, I think it is of historical interest, but as a story-story, it wouldn’t be top of my list. I’m being self-critical here. \nI thought it was great. So I assumed you’d chosen to include it. \nWell, if I’d wanted to dig my heels in, I could’ve said no. \nI was going to ask you if you felt as connected to it now as you did when you originally wrote it. Do you still feel connected to the work you wrote decades ago? \nAs when I was writing it? Of course not. \nDo you even feel like the same person? \nNo. I got older. It would be bizarre if I was the same person. I’d be a vampire. \nSo you don’t generally consider revising or revisiting old work—\nA whole book? No. I changed “Freeforall” to make it more succinct. But to redo a novel, no. \nI don’t think you need to redo any of your novels, by the way. \nThey are a snapshot in time. They are of their age. So, much to my surprise, The Edible Woman [Atwood’s 1969 debut novel] still sells a lot. That was from the age where there weren’t even pantyhose. \nJust stockings? \nTwo stockings, and you held them up with garter belts or girdles. But young people still connect with The Edible Woman, because it’s about the job problem—what are you going to live on? What jobs can you have, and what comes next? Should I get married? I mean, “Should I get married?” was more pressing in those days. More of an either/or choice. \nCOURTESY OF PENGUIN RANDOM HOUSE\nBuy this book at:\nAmazon\nBookshop.org\nBooks-A-Million\nApple Books\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\nLike “Freeforall,” the characters of Nell and Tig, who first appeared in another collection of short stories, have been with you for decades. Are the Nell and Tig of Old Babes in the Wood the same people, to you, as the Nell and Tig of Moral Disorder? \nYes. Otherwise their names would be different. [Both laughing.]\nSo they’re not, say, in a different dimension—\nThey’re not in a different dimension. \nOK. Just wanted to make sure there’s only one Nell and Tig cinematic universe. \nJust the one. Why don’t you ask me about snails? \nOh, of course. Tell me about snails. \nMost shape-changer stories are about bears, wolves, seals, and snakes. Those are the main ones in folklore. Oh, and I forgot, birds. But there is one about a snail. It’s Chinese. A rather quiet, well-behaved wife spends half her life in a bucket outside the door as a snail. \nWas the Chinese folklore about the bucket-snail wife the inspiration for your snail story?  \nWell, yes and no. I’ve always been keen on snails. \nIf you had to body-swap with an animal, what kind of animal do you think would make the best Margaret Atwood? \nA fox. They’re wily.\nThere are a ton of foxes in my neighborhood now. They’re eating all the local hens. \n[Several minutes of detailed discussion about how to best fox-proof a henhouse takes place.] If you go onto my Substack, you can find three stories having to do with domestic fowl. Do you like Substack? \nSo far, so good. But it’s work. I don’t like work. I’m quite lazy. \nYou don’t seem lazy. I read somewhere that you’d described other writers as entering the “gold watch and goodbye” portion of their careers. You could’ve entered that phase if you wanted to rest on your laurels, but instead you’re producing this vital new work. \nYou do it because it’s what you like to do.\nHas your writing routine changed? \nI don’t have one. I never have. When you have a day job, you just stuff it in when you can, in the evenings. When you have a small child, you do it when they’re down for a nap, and then at school. It shifts around. What is it now? Aeroplanes are good. But not always. Sometimes you would rather watch the movie. Kung Fu Panda, Captain Underpants.\nModern classics. \nI would think so. But yes, routine—part of the reason I don’t have one is that I’m so old, I didn’t go to creative writing school, because there were hardly any back then. That meant nobody told me to specialize. Are you a novelist, a short-story writer, a poet? Nobody said you should choose. \nYou have a reputation for conjuring these very prescient futures. One thing that struck me about this collection, though, is how focused it is on the past. Was this looking-back deliberate? \nNothing is deliberate. I was just writing the stories I wanted to write. I mean, sometimes—there’s that story, “Impatient Griselda.” That was part of a project involving a number of writers, where we were meant to reinterpret The Decameron. It was during early Covid, when we were still disinfecting cardboard boxes from grocery deliveries.\nI remember that phase. \nSo I picked this story, “Patient Griselda,” because it always annoyed me. This woman gets married to a duke, a sadistic monster who subjects her to all kinds of humiliations, which she patiently endures, and she’s supposed to be a model wife. Out upon it, say I. So I redid it into a version where the duke gets devoured.\nI like that version better. \nSo do I. \nAre there other stories in the collection especially dear to your heart? \nI’d never say so. The others would get annoyed at me. I’m of the old school, in which the book has a life. \nWell, I definitely want to talk about your George Orwell story. \nThat was another ask. INQUE magazine. They said, pick whatever dead writer you want to have a conversation with. Orwell was pretty obvious for me, because he was an influence on my work. Plus, he ruined my young life. \nHow so? \nI read Animal Farm without knowing it was an allegory about the Soviet Union. I thought it was really going to be about animals, like Wind in the Willows. \nWhen I was reading the Orwell story, I was thinking about how people always compare Nineteen Eighty-Four to Aldous Huxley’s Brave New World. Yes, in the ’80s and the ’90s, we had a contest going, which was going to win? The answer was: Why not both?\nYou did your own twist on both, I think. The MaddAddam books have some echoes of Brave New World, where the BlyssPluss pill is a bit like Huxley’s soma. \nEnhanced sex with no consequence. \nYes! Do you feel like one of your dystopian worlds is more accurate than the other right now? \nWell, right now, The Handmaid’s Tale is. But that will change. \nThere’s that saying, “History doesn’t repeat itself, but it rhymes.” Do you think there’s any way to actually break the rhyme pattern? Should we be hopeful about the future?\nHope is built in. Human beings have hope. If they didn’t, they wouldn’t get up in the morning. You got up in the morning today and you thought: I hope we all have a nice life.\nI do hope we all have a nice life. \nPeople aren’t going to want to lose their jobs. They don’t want to lose their Medicaid, or Social Security.\nDo you think that’s enough of a bulwark against reactionary forces? \nWell, what determines American elections? Independent voters. The Republicans have been devoted to dismantling FDR’s New Deal ever since Ronald Reagan was elected. Trickle-down economics didn’t work. Trickle-down debt does work—if you’re interested in reading about that, it’s in my book Payback.\nSince you wrote about debt in Payback in 2008, the world has grown increasingly financialized—\nNo, it hasn’t. It’s become financialized in different ways.\nIs this your way of telling me you’re dabbling in crypto? \nNo. But I’ve been observing. We did this virtual course called Practical Utopias this fall. The premise of the course was that people built their own utopias. The social mandate was to be carbon neutral or carbon negative, and scalable. We had hundreds of participants from around the world working in eight teams. It was more of a success than I thought it was going to be. Part of it was going to be an NFT. But then I said, we can’t do this, because these things take a lot of energy.\nSo you didn’t make the NFTs because of their environmental impact? \nWe did eventually, because we found another blockchain that used a different system to handle the energy issue. Tezos.\nEvery single proper noun in the crypto universe would be at home in the MaddAddam world. Bored Apes. It feels impossible to satirize because it’s already so absurd. \nPeople get carried away. Especially if they have too much money, and they’re too young. They get sort of drunk off it.\nI think I might be legally obligated to ask you if you’ve been delving into the world of ChatGPT. \nI know about it. I think we could fix all this anxiety by making it mandatory to have a seal on everything generated by ChatGPT.Like a watermark? \nYes, that’s what I mean. \nDo you think it’s overhyped? \nOrwell already thought it out. Machines that turn out trashy literature for the masses? Nineteen Eighty-Four!\nI was briefly convinced it would clog up the internet with infinite junk—\nIt’s already clogged up.\nExactly. So, I can definitely assure my readers you’re not going to use ChatGPT to create a third trip to Gilead?\n[Atwood places her hand over her heart as if taking an oath.] Why would I do that? That would be bad. \nYou do so many interviews. Are there questions you’ve been waiting for someone to ask you? \nQuestions have changed a lot over the years. Nobody asks me anymore, “Why do you hate men?” They do ask a lot about hope now, which feels quite significant. It’s on peoples’ minds. Is it all done for? No! That’s why I did Practical Utopias. It was a hopeful project. Do you know about the Future Library of Norway?\nIs that where you wrote a book to be read in the future? \nWell, we don’t know if it’s a book. We know it’s made of words. There were two strictures: It has to be made of words, and you can’t tell anybody anything else. It could be a letter, a novel, a screenplay, a poem, an essay …\nSo you have a word-based project. \nYes.\nAnd you feel confident people will read it in a hundred or so years? \nI don’t care. I’ll be dead. But, it’s a very hopeful project, because it assumes that there will be people, there will be a Norway, that the library of Norway will still exist. \nI wanted to ask about your story “Airborne: A Symposium.” It made me laugh. There was an exchange that very succinctly captured some attitudes about the discourse right now. The characters are academics, and one of their friends has gotten into a controversy. Someone asks which panel she was speaking on when she got in trouble. “Gender,” another says. “Fuck,” the first character replies. “A snake pit!” Do you feel this is a particularly snake pit-y time?\nTo be in an academic institution, yeah. Very snake pit-y. They’re getting so much pressure from state governments—\nLike Florida’s state government? \nYes, like them for instance. Quite snake pit-y. I feel happy I’m not teaching anymore.\nBack to what you were saying earlier, about having less to lose at this point in your life—do you still worry about the snake pit of the internet or do you feel immune? \nNobody’s immune to anything. You have to understand the different kinds of pressures people feel like they’re under. What do totalitarian governments of any kind try to do immediately? They try to control communications networks. In a coup, they grab the radio and television. They try to shut down communications, and education, so that nothing is taught that isn’t copacetic with their own views. Those are two things totalitarian governments will try to do. A third is to control the judiciary, so the views of the judges and lawyers are the same as the regime. This is an old playbook. That’s why I struggle with feeling hopeful. \nI am not counting the United States out. It’s a diverse country with a lot of ordinary people fighting back. The midterms. Overturning Roe v. Wade was not a smart move. \nI will say, I was assuming there’d be more of a giant Women’s March–style outpouring into the streets when it got overturned—\nWhat you need right now is grassroots, block-by-block, constituency-by-constituency organization. To say, here are other things people want to take away from you: women’s health care, Medicaid, Social Security, the education of your child. The left has not been smart. Number one, they should have shown some support for freedom of expression, whereas in fact they rolled their eyes and said that’s a tool of the right. It didn’t start out that way. In the history of the United States, it was actually the union movement.\nI haven’t actually seen many lefties sneering at freedom of expression. Is there an example that leaps out in your mind? \nMay I quote Elizabeth Barrett Browning? “Let me count the ways.” So that’s your job, you can have a look. Some of us signed that Harper’s letter calling for more reasonable discourse and got shouted at a lot from the left. “No, we don’t want to do that. We just want to denounce people.” That’s just a gift to the right. The center has to repel the extremist hordes on both sides. It’s always the center that’s under the most crossfire.\nPeople on the left are criticizing the Harper’s letter, sure. But people on the right are banning books. \nA lot of the impulses are the same.\nI hope that’s not true. \nDare I say Chairman Mao? Joseph Stalin?\nDo you think they were really leftists? \nNot if you mean the nice people you know who want things to be fairer. But if you mean the flags they were flying, yes. Look at the early history of the USSR. Very communitarian, equal rights for women. That got shut down very quickly. Early Christianity was also very communitarian. And then what happened? You must be aware of the fact that these things go in cycles. \nThat’s what I was talking about earlier, thinking about ways to actually break history’s rhyme pattern. Or are we doomed for everything progressive to be met with reactionary forces?\nI don’t like the term “progressive.” It assumes there’s a yellow brick road that leads to a city of Oz that doesn’t exist. I prefer to say “fairer.” Can things be fairer? Yes. Will it take work? Yes. Do you get to just call yourself progressive and pat yourself on the back? Not in my book. Plus, the eugenics movement, which caused a lot of women to be sterilized, was thought of as a progressive thing. So let’s do a little rearranging of the language that doesn’t come with that baggage. “Fairer.” I like that.\nThis interview has been edited and condensed.","creation_date":"2023-03-07","tags":["","BOOKS","LITERATURE","FICTION","DYSTOPIA","MAGAZINE-31.05","BIG INTERVIEW"],"author":"BY KATE KNIBBS","category":null}