{"id":"d73ae94f-bca3-4a45-93c0-c71d3bdf58d8","article_link":"https://cointelegraph.com/news/zilliqa-restores-network-after-disruptions","website_source":"Cointelegraph","article_type":"News Article","summary":"Following a series of network disruptions, Zilliqa has restored network functionality and is focused on debugging amid its v9.3.4 network upgrade.","title":"Zilliqa battles back-to-back network disruptions amid latest upgrade rollout","detailed_content":"The Zilliqa network has recently experienced several operational disruptions, which have impacted block production on its mainnet. However, as of May 10, full network functionality has been restored, though the cause is still under investigation. \nZilliqa notified the community that the network was now online following “temporary disruptions to block production on mainnet.” With network functionality restored, the infrastructure team is continuing to “monitor the stability of the network as it works to diagnose the underlying cause of the recent disruptions.”\nSource: Zilliqa\nSince the initial signs of disruption on May 8, when a slowdown in block generation was identified, the Zilliqa network technical team has remained active for almost 48 hours, aiming to prevent further disruptions.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOn May 9 at around 9:30 am UTC, the Zilliqa technical team discovered a malfunction that returned a null value “instead of a node’s RLP following a possible invalid database lookup.”\n“The team has created internal rehearsal networks to recreate this issue and trial bug fixes, allowing for possible solutions to be tested within an isolated environment before progressing to Testnet and mainnet deployments.”\nBy around 2:30 pm UTC on May 9, the team had restored full functionality through a fix, alongside the rollout of the Zilliqa version 9.3.4 network upgrade. The team noted that the upgrade would include “a number of enhancements to EVM compatibility” and apologized for the inconvenience caused to users and the Zilliqa community.\nHowever, despite the fix and upgrade rollout, a further disruption to block production hit the Zilliqa mainnet again on May 9 around 7:05 pm UTC. At this point, the team enhanced debugging processes to better diagnose the issue and address the root cause of the disruption.\nThis is not the first time Zilliqa block production has been hit with disruptions due to technical issues. In December 2023, an “interruption to block production” saw daily Zilliqa blockchain transactions plunge roughly 50%, from around 61,000 to 30,906.\nThe Zilliqa team is continuing to investigate the underlying cause of the recent network disruptions and thanked the community for their “patience and support during the course of resolving” the issue. \nExchange or buy ZIL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-10","tags":["#Blockchain","#Security","#Technology","#Zilliqa"],"author":"by Alek Hidell","category":null}