{"id":"d75e6602-0b4f-454b-839e-2ebab0e0dbac","article_link":"https://cointelegraph.com/news/tradfi-firms-to-choose-public-blockchains-for-rwa-tokenization","website_source":"Cointelegraph","article_type":"News Article","summary":"Celisa Morin, the lead of Reed Smith’s on-chain crypto group and a former executive at Grayscale, says traditional financial institutions will likely follow BlackRock’s lead in using public blockchains.","title":"TradFi firms now prefer public blockchains: Ex-Grayscale exec","detailed_content":"Traditional financial institutions are more keen on tokenizing assets on public blockchains than ever before, says a former Grayscale executive.\nSpeaking with Cointelegraph, Celisa Morin, who served as Vice President of Platform Distribution at Grayscale until mid-2022, said that a new BlackRock-led narrative among TradFi institutions could see more firms look to tokenize assets on public chains over private ones.\n“I think we see a preference for private chains with JPMorgan’s Onyx. But I do think that this was the narrative a few years back. Now, I think it's very much the public blockchains.”\nMorin is now the head of international law firm Reed Smith’s crypto department, explaining it would make sense for larger traditional financial institutions to follow the lead of BlackRock — which launched its $100 million tokenized ‘BUIDL’ fund on the Ethereum network on March 18.\nThe BUIDL fund now holds $288 million in assets per Dune Analytics data.\nTop tokenized funds of government securities. Source: Dune Analytics\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBlackRock’s move to launch a fund on Ethereum wasn’t without controversy, with the asset manager’s on-chain wallet quickly becoming the target of various spoofs from crypto enthusiasts.\nDeposits to BlackRock’s public wallet included legally dubious transactions from the now OFAC-sanctioned mixer Tornado Cash, as well as a roster of various cryptocurrencies from real-world asset (RWA) tokenization projects and memecoins.\nDespite the potential legal troubles that come with opting to tokenize assets on public blockchains — instead of using a more KYC and AML-friendly private network, Morin said many firms would likely take the lead from BlackRock.\n“If BlackRock has made these choices, I don’t know why the rest of the crew would be held back.”\nMorin also noted that Franklin Templeton had already made the “forward thinking” move to launch its tokenized money market fund on the payments-oriented Stellar Network in 2021. The fund integrated with the Ethereum layer-2 scaling solution Polygon in October last year. \nRelated: Over $1B in US Treasurys have now been tokenized on-chain\nFranklin Templeton’s three-year-old Franklin OnChain U.S. Government Money Fund (FOBXX) now boasts a total of $360.2 million in U.S. Treasurys. In total, $1.08 billion in U.S. Treasurys have now been tokenized across 17 products.\nEthereum ETF in May unlikely\nMorin was less enthusiastic about spot Ether\nETH\n$3,030\nexchange-traded funds (ETFs), saying it's unlikely they would be approved in May. She agreed that the lack of communication between the United States Securities and Exchange Commission between prospective fund issuers was a bad sign.\nEchoing the sentiments of Senior Bloomberg ETF analyst Eric Balchunas — Morin said the chances of an approval by VanEck’s deadline on May 23rd grew slimmer with each day the SEC refrained from engaging in public comment.\nMagazine: Bitcoin ETFs make Coinbase a ‘honeypot’ for hackers and governments — Trezor CEO\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-15","tags":["#Blockchain","#Cryptocurrencies","#Business","#Finance","#Bitcoin ETF","#Adoption","#United States","#Tokens"],"author":"by Tom Mitchelhill","category":null}