{"id":"d785bfe1-d843-46ee-8230-04ae7ef07578","article_link":"https://cointelegraph.com/news/base-overtakes-arbitrum-most-active-addresses-this-month","website_source":"Cointelegraph","article_type":"News Article","summary":"Coinbase layer-2 network Base has seen a strong start to April with active addresses outpacing Arbitrum.","title":"Base overtakes Arbitrum for most active addresses so far this month","detailed_content":"The Coinbase-supported Base network has now surpassed Arbitrum as the leading Ethereum layer-2 network by active addresses this month.\nBase has seen over 1.48 million new active addresses over the first nine days of April — narrowly beating out Arbitrum One with 1.43 million active addresses, according to data from growthepie.\nEthereum scaling solutions zkSync Era and the Optimism mainnet rounded out the top four with 1.21 million and 650,000 active addresses, respectively.\nHowever, Arbitrum One still maintains a slight lead over Base in active addresses over the last 30 days, at 3.84 million, compared to Base’s 3.76 million.\nChange in monthly active users on Arbitrum One, Base, zkSync Era and OP Mainnet over the last 30 days. Source: growthepie\nMeanwhile, Starknet and Mantle have seen the largest falls in active addresses at 51% and 40% over the last 30 days.\nIt comes as Base recently surpassed the $4 billion mark in total value locked on the protocol earlier in the month. It now only trails Arbitrum One and OP Mainnet, according to L2BEAT.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nBase also boasts the largest 30-day transaction count at 53.1 million, more than 10 million clear of Arbitrum’s 41.2 million and Ethereum’s 37.9 million over the same timeframe, according to L2BEAT.\nBase’s increase in active addresses has partly been fueled by a recent memecoin mania on the Coinbase-supported network.\nBrett (BRETT) and Degen (DEGEN) are among the largest memecoins on Base, with respective market caps of $720 million and $523 million, according to CoinGecko, while Toshi (TOSHI) and Normie (NORMIE) are also highly traded memecoins on the network.\nRelated: Coinbase partners with Lightspark for Bitcoin Lightning payments\nHowever, Base’s popularity has also attracted scammers, as the network saw an 18-fold increase in successful phishing scams from January to March — with $3.35 million stolen last month.\nA recent analysis shows one in six memecoins are Base are scams and that 91% of Base memecoins possess security vulnerabilities that could expose users to big losses.\nCoinbase officially launched Base last August. The cryptocurrency exchange is the sole sequencer of Base, according to L2BEAT data — meaning the chain is fully controlled by the exchange.\nHowever, the firm has iterated its intention to progressively decentralize Base over time.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Coinbase","#Altcoin","#Transactions","#Adoption","#Base","#Scams","#DeFi","#Layer2","#Arbitrum"],"author":"by Brayden Lindrea","category":null}