{"id":"d930e3b1-e4bd-4262-bc23-86d9a2e3c206","article_link":"https://cointelegraph.com/news/gnus-discord-hack-causes-1-27-million-losses","website_source":"Cointelegraph","article_type":"Tweet","summary":"The attacker was able to view team members’ private Discord messages, allowing them to gain access to the team’s wallet address and mint 100 million fake tokens.","title":"Gnus.AI Discord hack causes $1.27M in losses","detailed_content":"The Gnus.AI artificial intelligence network lost approximately $1.27 million through a token-minting exploit on May 5. The team announced plans to release a new version of the Genius (GNUS) token and that users should no longer buy the old version.\nSource: Gnus.AI\nGnus.AI is a blockchain network that allows users to perform AI computations in exchange for tokens.\nRelated: AI Blockchain platforms attracted $5 billion in funding in Q1 2024\nAccording to a May 6 post from blockchain security firm CertiK, the attacker pulled off the exploit by gaining the private key to the team’s account that begins with 0x18. Once they had control of this account, they copied the token’s “salt” data from Ethereum, allowing them to use the Axelar bridge protocol to create a Fantom network version of the token.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAfter that, 100 million fake GNUS tokens were minted, bridged to Ethereum and sold into the market. The resulting price crash transferred the wealth of existing tokenholders to the attacker, as the attacker received real assets in exchange for tokens that were created out of thin air.\nSource: CertiK\nIn a May 5 post on social media platform X, Gnus.AI CEO “SuperGenius” claimed that the 0x18 account was compromised when an attacker gained access to the team’s private Discord communications, stating, “Apparently the hackers can watch private messages on discord.”\nSuperGenius stated that as a “quick fix,” the team will deposit $500,000 worth of Ether\nETH\n$3,033\nfrom its own funds into a liquidity pool for the new token once it is launched. In addition, the team will deposit $500,000 worth of fees they are owed but that are currently locked until February 2025. This is a total of $1 million in compensation.\nCertiK estimated that $1.25 million was lost in the exploit, which implies that the initial distribution of funds will cover 80% of losses.\nBlockchain networks continue to experience exploit risks. However, some evidence indicates that these attacks may be declining as security practices improve. In April, rypto users suffered the fewest amount of losses from exploits since 2021, according to an April 30 report from CertiK.\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Altcoin","#Hackers","#AI","#Cybersecurity","#Hacks"],"author":"by Christopher Roark","category":null}