{"id":"d94f737a-bea5-4599-8c8a-ad789506e75f","article_link":"https://www.wired.com/story/whats-next-for-ethereum-after-the-merge/","website_source":"Wired","article_type":"News Article","summary":"The blockchain project’s cofounder Vitalik Buterin says its recent big upgrade lays a path for more technical changes, and greater adoption.","title":"What’s Next for Ethereum After the Merge","detailed_content":"LATE IN THE day on September 14 and into the early hours of the following morning, Vitalik Buterin and a few dozen crypto developers crowded into an office space in Berlin to flip the switch on the Merge.\nThere wasn’t a literal switch to flip: Buterin, the 28-year-old Ethereum cofounder who has been active in cryptocurrency since his teens, had long ago envisioned a system that would basically run itself. The crypto research and developer community would agree on what a change looks like, coders would type out a command and time-stamp it, developers on the client side would download these bits of code, and then at the predetermined time, the system would manifest the change by itself—in this case, the Merge. It changed how transactions on the Ethereum blockchain are verified, a much-delayed upgrade that has been hailed as a major moment in crypto land.\nThat doesn’t make the current landscape of crypto apps, and the blockchain technology they’re built on, any less complex for the average individual. Buterin seems mostly aware of this. In the lead-up to the Merge, he collated some of his earlier essays about crypto into a book titled Proof of Stake: The Making of Ethereum and the Philosophy of Blockchains. Given how quickly crypto technologies are changing, the book already feels slightly outdated, peppered with coins and DAOs that may no longer exist and concluding in an essay from January 2022, just before the crypto market tanked. But the collection serves as a kind of crypto Old Testament, a historical record and first-hand account of a mind-shift toward decentralized networks that inspire a host of lofty promises.\nFEATURED VIDEO\nInside the Largest Bitcoin Mine in The U.S.\nWIRED’s global editorial director, Gideon Lichfield, and senior writer Lauren Goode spoke with Buterin over Zoom about the recently burst crypto bubble, whether decentralized technology can support society-scale decisionmaking, and what next great innovation may follow the Merge. The conversation has been edited and condensed.\nGideon Lichfield: So I guess congratulations are due on the Merge. How do you feel it has gone?\nVitalik Buterin: I'm definitely happy, and definitely relieved. This is a transition that the whole Ethereum community has been working towards for the last eight years. Along the way there have been a lot of people—whether from the Bitcoin community, or people skeptical of crypto in general—who have doubted whether or not the Merge, this switch to proof of stake, would happen. We're very happy to have proven all of them wrong finally.\nThe WIRED Guide to the Blockchain\nThe idea of creating tamper-proof databases has captured the attention of everyone from anarchist techies to staid bankers.\nBY WIRED STAFF\nGL: Just to boil things down really simply, the presumed advantages of proof of stake are that it uses much less energy and has lower barriers to entry, so there's less risk of centralization. It's more secure against attacks. But what would you say, in lay terms, are the biggest opportunities that proof of stake opens up?\nI think there are a few. One of them is from the economic resources that the ecosystem no longer has to spend on proof of work. All kinds of projects are going to have somewhat more resources than they did before.Another is the greater legitimacy the switch to proof of stake gives to Ethereum. A lot of institutional actors, whether it's governments or corporations, their biggest reason to be skeptical of or not want to use Ethereum has been the proof of work and environmental aspect. After the Merge, Ethereum is not a proof of work network anymore, and that makes people who had those kinds of concerns a lot more willing to use it now. There’s probably going to be a lot of people who have been quietly on the sidelines who now are going to come in and start using Ethereum.\nA third one is that proof of stake is an opportunity to redesign the protocol in a lot of ways. Probably the biggest problem that people have with blockchains—outside of proof of stake or their practical ability to use them—is scalability. Sending transactions is expensive, because blockchains are not very scalable. The reason why is this architecture where every node in the network has to personally verify every single transaction. We have ideas around technologies to fix that and turn Ethereum into a system that processes transactions in a way that's still decentralized, but a lot more efficient.\nLauren Goode: You sort of answered my next question, which is, what is the next biggest innovation we can look for post-Merge? Can you give a specific example of developers building something that they weren't able to build, or build efficiently, before?\nScaling is really the big one. Ethereum has what we call this two-layer scaling model, and the plan is to upgrade it a little bit, by making it possible for the chain to process a much larger amount of data. And then there are these separate protocols that take that data as an ingredient and create kind of like mini-Ethereums inside of Ethereum, on top of that. These together would be able to process a much larger number of transactions. Instead of the roughly 20 transactions per second that Ethereum can process today, potentially between 5,000 and a 100,000 transactions.\nA bunch of work needs to happen in the Ethereum ecosystem on building these layer-two protocols. And the Merge makes it much easier. The transition to scalability is probably the next big thing that the Ethereum ecosystem is doing after the Merge. It's, in my opinion, equally exciting. It could be equally as big of a game changer.\nGL: How do you think the crypto crash of this year affects Ethereum now, in the wake of the Merge?\nMmm, it's a good question. I have, I think, said publicly on a couple of occasions that to some extent I look forward to the bear market. One of the unfortunate things that's happened around crypto, especially in the 2020 and 2021 bubble, is that it got big before it was really mature enough to handle the level of attention it was getting. If you look at the chart of how much energy Ethereum consumed, I think more than half, maybe more than two-thirds, was within the last two years. If the Merge had happened two years earlier, things would be even better, and if it got delayed by another five years and it happened after another really big crypto bubble, things could have been vastly worse.That’s also true from the scalability point of view. Transaction fees on Ethereum got up to $5 and even $20 [per transaction] last year, and if there is another big price bubble we could easily see fees go up to $100 or $200. In that kind of a world, talking about the promise of crypto as a way of empowering the third world, banking the unbanked, supporting people who are marginalized by existing institutions, just clearly starts looking ridiculous.\nI've always really wanted to solve scalability properly before the next big rise in adoption and attention on the ecosystem happens. One of the saving graces of prices going down for a while is that we are going to get an opportunity to be able to do that. Proof of stake does not reduce transaction fees, but it is the big thing that we've had to get out of the way before we can go full steam ahead on doing the stuff that will.\nLG: Your last essay in the book, written in January 2022, is about NFTs. Since then the market has changed dramatically. How confident are you in some of the ideas that you were exploring, like the “Proof of Attendance Protocol”? For what it’s worth, event ticketing seemed to be one of the more valid uses of NFTs. But the market for NFT art has just cratered.\nMy take on NFTs is the same as it was a year ago, which is that I think the NFTs that are going to be sustainable are the NFTs that are going to be useful. In the beginning stages, there is tradable art and cat pictures, and a lot of that stuff really has cratered. For an NFT to have lasting value there needs to be some benefit of holding it other than just being able to say that you hold it.\nThe most successful NFT use case so far, and it's been so successful and pervasive that people don't even think about it as NFTs, is ENS domain names. I'm sure last year you saw a lot of people on Twitter putting up dot-ETH names. I still have Vitalik.ETH. Those names are NFTs that are in the wallet of a particular address. If you have that NFT, then if I want to send someone Ether, or interact with them through some Ethereum application, then I can put in their dot-ETH name. It’s really convenient to do that—the same sort of function that domain names on the internet or usernames have in any kind of chat application—except in this big decentralized Ethereum ecosystem.\nAnother interesting use is the whole NFT gaming space. Games like Axie Infinity were really successful last year, but then Axie Infinity got hacked. Even aside from that, it hasn't really been able to recover. The reason for that in my view is that the people who designed these first-generation NFT games approached it with the attitude that the financialization aspect by itself was enough to make the game fun. But that’s clearly not enough, and a successful NFT or play-to-earn game itself needs to be fun even without the monetization aspect. Whoever figures out how to make a blockchain game that is a fun game first, those are the kinds of projects that are going to win.","creation_date":"2022-09-26","tags":["","BITCOIN","BLOCKCHAIN","CRYPTOCURRENCY","FINANCE","MONEY","REGULATION","ENCRYPTION"],"author":"BY LAUREN GOODE","category":null}