{"id":"d98aadf8-4715-4e8e-b058-5314521bf47b","article_link":"https://cointelegraph.com/news/gamefi-studios-comeback-crypto-bull-market-returns","website_source":"Cointelegraph","article_type":"News Article","summary":"New Web3 gaming projects continue to enter the sector as the price of cryptocurrencies surge.","title":"GameFi studios are booming once again as crypto prices recover","detailed_content":"GameFi projects, the darling of the crypto industry that captivated investors’ attention during the bull run of 2020 to 2022, have made a much-anticipated comeback as Bitcoin\nBTC\n$66,082\neyes all-time highs. \nOn May 15, Ethereum Web3 gaming studio Immutable announced the release of its flagship title, Guild of Guardians (GOG), on Google Play and the Apple App Store. Guild of Guardians sees players venture into Elderym, a world on the brink of destruction at the hands of the Dread. To save the world, players assemble a team of Guardians to embark on an adventure fighting through dungeons and bosses while earning GOG token rewards. \nAccording to Immutable Games director Chris Clay, the team is planning to showcase the Immutable Passport and Immutable zkEVM. \"The past fifteen months of development have been a whirlwind of laying the foundation for a game and universe we’ve only just begun building upon,” he said. \nAs part of the game’s debut, developers have allocated $1 million in GOG tokens and various hero nonfungible tokens (NFTs) as additional rewards. \nImmutable's Guild of Guardians gameplay: Source: YouTube\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nElsewhere, Animoca Brands Japan announced on April 22 that the firm would partner with Square Enix, creator of the Final Fantasy series, to develop the latter’s nonfungible token (NFT) hero game Symbiogenesis. “Animoca Brands Japan will support Symbiogenesis by providing its expertise in the overseas expansion of Japanese projects, global NFT sales and marketing activities, and by promoting collaboration opportunities to Animoca Brands' large network of portfolio companies and partners,\" the company wrote. \nIn Symbiogenesis, players will descend into a devastated high fantasy world and try to solve riddles through missions designed around the theme of monopoly and distribution. The game is playable through any of its 10,000 NFT characters, which also serve the dual purpose of being personal profile pictures. \nOn April 19, Cointelegraph reported that the ARPG classic dark fantasy game Seraph: In the Darkness, built on Arbitrum and developed by Seraph Studio, recently surpassed sales of over 11,000 Ether through multiple in-game NFT sales consisting of heroes, in-game equipment, priority passes, and others. The game is undergoing continuous development and is currently in the preseason phase. \nSeraph: In the Darkness gameplay. Source: Steam\nLikewise, on May 13, Pixels, a casual Web3 game that offers an open-ended world of farming and exploration, surpassed 1 million daily active players. It has generated $4.4 million in token revenue over the past month from VIP subscriptions and in-game transactions. In February, the Pixels game surpassed a valuation of $2.7 billion after migration to gaming blockchain Ronin and its token listing on crypto exchange Binance. \nNew projects have dominated the novel and ongoing crypto bull market, as opposed to ones from the previous cycle. Two years prior, fantasy monster battle NFT game Axie Infinity accounted for nearly two-thirds of all blockchain GameFi NFT transactions. At that time, Axie Infinity players amounted to around 2.7 million per month, which has since fallen to 342,353. \nRelated: How AI could ruin gaming, The Voice, addictive Axies game\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-15","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#DeFi","#Web3","#Gaming","#GameFi"],"author":"by Zhiyuan Sun","category":null}