{"id":"da0b1898-2abb-49da-85ac-2e3c71574791","article_link":"https://cointelegraph.com/news/12-solana-presale-memecoins-abandoned-after-one-month","website_source":"Cointelegraph","article_type":"News Article","summary":"The 12 now-defunct projects raised a total of $26.7 million by way of a controversial fundraising method known as a presale.","title":"12 Solana presale memecoins abandoned after just a month","detailed_content":"At least 12 Solana presale memecoins have been “completely abandoned” in the last 30 days after raising a combined $26.7 million from investors, according to figures shared by independent blockchain sleuth ZachXBT. \nIn an April 21 post to X, ZachXBT highlighted 12 Solana memecoin projects that raised funds through the controversial presale method, many of which have plunged significantly since launching and one which appears not to have launched any token at all. \nSource: ZachXBT\nAccording to ZachXBT, the most costly “abandoned” presale project was a memecoin dubbed “I like this coin,” which sported the ticker LIKE.\nThe project’s pseudonymous founder, pokeee.eth, raised a staggering 52,220 SOL\nSOL\n$154\ntokens ($7.7 million at current prices) for the memecoin and launched the coin on March 17 with a market capitalization of $577 million; however, the memecoin’s value plunged rapidly, falling more than 90% in the first eight hours.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nAs of the time of publication, LIKE is down 99.2% from its launch price. Notably, the memecoin’s official X account hasn’t made a single new post since March 31 — and pokeee.eth hasn’t mentioned the coin since then either.\nThe second-largest alleged abandoned presale is for a token called MOONKE.\nLaunched by another pseudonymous founder, RockyXBT, on March 20 to an outsized valuation of nearly $500 million, MOONKE soon charted a similar path to LIKE, plummeting more than 99% from its launch price in a matter of hours.\nThe MOONKE memecoin failed to gain traction. Source: Birdeye\nOne project that raised 4,567 SOL ($812,000 at current prices) never even launched its token.\nCointelegraph contacted both pokeee.eth and RockyXBT for comment but did not receive a response by the time of publication.\nRelated: What are memecoins good for? Social signaling, says Avalanche founder\nThe market’s enthusiasm for memecoins has dwindled somewhat in recent weeks, with several of the larger Solana-based memecoins, including Dogwifhat (WIF), sliding more than 40% since April 1.\nSolana memecoin market leader Dogwifhat has tumbled more than 40% since April 1. Source: CoinGecko\nAt the time, last month’s memecoin frenzy saw several market pundits draw comparisons to the Ethereum initial coin offering (ICO) era boom of 2017 where hundreds of crypto projects raised millions of dollars, but ultimately, most failed to deliver.\nOne of the most notable Solana presale debacles in recent months came in March when the developer of a memecoin called Slerf (SLERF) claimed to have accidentally burned the entire presale allocation of SLERF in a “fat finger” burn error.\nDespite the Slerf dev burning a staggering total of 535,000 SOL (worth around $10 million at the time), the coin soon quickly became a cult favorite among memecoin investors, who rallied behind the token and saw it rally to a market cap peak of around $750 million.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-22","tags":["#Blockchain","#Cryptocurrencies","#Altcoin","#Solana","#Memecoin"],"author":"by Tom Mitchelhill","category":null}