{"id":"da20e9f0-a423-4ee5-98c6-0bf7bc027586","article_link":"https://medium.com/@supervlabs/supervillain-sidekicks-whats-coming-after-the-sidekick-draw-4e6deca52ef8","website_source":"Medium","article_type":"Blog Post","summary":"A brief guide on what’s happening next with Sidekicks, and how they relate to our roadmap.","title":"Supervillain Sidekicks — What’s Coming After the Sidekick Draw?","detailed_content":"Supervillain Labs is building games that derive from the concept of community. To elaborate, we always consider the community factor first when designing a game. Will this bring fun to the community? Will this benefit the community? Will this in any way affect the community?The term “community” does not merely refer to the mass of people playing the same game. It is a broader term that describes the connection between content (the game) and the surrounding ecosystem. The community is partly the ecosystem and partly the content itself.Sidekick is our initial approach to building the community. We aimed to raise awareness about the game, have people enjoy the draw and talk about their experiences, invite other communities to the world of Supervillains, and create opportunities for inter-project collaboration. In short, we introduced Sidekicks to the world to energize a vibrant community.In this article, we’d like to delve into more detail about Sidekicks. Some information is known, while other aspects are new ideas. We hope this text helps you understand our plans for Sidekicks and gets you excited about what’s to come!Sidekicks are creatures in the upcoming Supervillain Idle RPG that enhance the abilities of Villains. Together, the two form a strong bond and eventually evolve into Supervillains, characters with ultimate power.Sidekicks can be acquired both outside and inside the game.Out-of-game, in the web environment, Sidekicks are obtained through web-based gacha, as was the case in the Sidekick Draw.Another method to acquire a new Sidekick will be through Sidekick Fusion, which we will cover later in this article. Sidekicks obtained from the web can be easily utilized in the game by using the Supervillain Inventory.In-game, they will appear during gameplay, and players will be able to capture them. These Sidekicks obtained in the game, however, are not tradable unless a special item is used to make them tradable. This measure is designed to prevent inflation in the Sidekick supply. More details on how this will work will be provided as the game approaches its launch.In the Supervillain Sidekick Draw, five different rarity grades could be found: Common, Uncommon, Rare, Epic, and Legendary.In the future, a sixth grade, Mythic, will be added. Mythic is a higher rarity than Legendary. Although still undisclosed, Mythic Sidekicks will only be obtainable by possessing Legendary Sidekicks. Details on how to obtain a Mythic Sidekick will be revealed soon, so please stay tuned!Legendary Sidekicks are exclusively available, meaning there is a limited supply.In-game, 1,000 Legendary Sidekicks will be distributed over 18 months. They cannot be purchased via in-app purchases (IAP) but will only be obtainable through gameplay.Out-of-game, in the web environment, there will also be 1,000 Legendary Sidekicks. They can be obtained either by gacha or Sidekick Fusion. (Please note that the number of total web Legendaries might exceed 1,000 in the unlikely event of two incidents occurring within a very short time span.)Additionally, more will be granted to top contributors to the game, such as rankers, creators, guild masters, etc. The method and numbers are yet to be disclosed, but please understand this as the direction we’d like to build our policies toward.Now let’s talk about Sidekick Fusion: Fusion is a way to get (the opportunity to get) a Sidekick of a higher grade, which includes Legendary.The scheme is as follows: You take 2 Sidekicks of the same rarity grade, fuse them together — and you get 1 new Sidekick of the same or higher grade. The 2 Sidekicks you used for the Fusion will be burnt.The higher the grades of the Fusion materials are, the more likely you are to get a Legendary Sidekick. Of course, if you are extremely lucky, you might be able to obtain a Legendary Sidekick by putting 2 Common Sidekicks together… Well, we hope for the best!Sidekick Fusion will be updated at https://supervlabs.io on May 29.The answer: On-Chain Randomness!Games are all about probabilities. Every action, like a character hitting a monster, is influenced by probabilities. From critical hits decided by chance to the random variability in basic damage and defense, randomness is a cornerstone of gameplay. Supervillain Labs aims to ensure all this happens with the robust transparency of blockchain transactions.Specifically, for the Sidekick Draw this time, we created a web dashboard where all draw attempts and their outcomes were recorded. The analysis of over 83,000 draws resulted in a 99% confidence interval for the Legendary drop rate. Anyone could verify the logic and draw results because we made use of the Aptos Roll, the on-chain randomness API developed by Aptos, the sources of which are open and accessible to anyone.Now that the event is over, the dashboard has a new look: Please take a look here if you’re interested!Here is our roadmap, which provides an overview of what’s happening at Supervillain Labs in the near future — and hopefully makes you feel excited about it!To be frank, we feel significant pressure once the assets we release gain real value on the market and people actually start to trade them. Planning is difficult, executing the plan is even more challenging. Without action, however, even the best plans are useless.We are carefully designing the Sidekick distribution: it is strategically planned to maintain asset value and adjust according to the increase in in-game users. While we will continue to be disruptive in presenting new models in web3 gaming, we promise to be careful in maintaining asset value, as it belongs to the community — not something we are allowed to deliberately touch or manipulate. But from the deepest bottom of our hearts, we sincerely hope that the games and content we provide bring true fun and value to you.Thank you so much for being part of our journey! See you again soon.","creation_date":"2024-05-01","tags":[],"author":"Supervillain Labs","category":null}