{"id":"da49da25-1be3-4ea7-bc89-42a62e0f28e4","article_link":"https://cointelegraph.com/news/bridging-data-gaps-in-defi-oracle-platforms-merge-to-improve-transparency","website_source":"Cointelegraph","article_type":"Tweet","summary":"Oracles are critical in decentralized finance for bridging real-world data with blockchain networks, yet challenges persist in achieving accurate asset valuations and detailed credit assessments.","title":"Bridging data gaps in DeFi: Oracle platforms merge to improve transparency","detailed_content":"Gora and RociFi merge to form the DeFi Risk Oracle, integrating their strengths in data feeds and credit scoring to address DeFi’s challenges with asset valuation and risk assessment.\nAccess to accurate and comprehensive data is pivotal for maintaining secure and fair financial systems in decentralized finance (DeFi). Oracles play a crucial role by bridging the gap between real-world information and blockchain networks, which are inherently isolated.\nDespite the integration of oracles, the DeFi sector still grapples with issues such as ensuring precise asset valuations, essential for financial activities like loan management. Additionally, the lack of detailed, individualized credit data complicates risk assessments, which can hinder the development of customized financial products and governance systems, highlighting the need for improved mechanisms to bolster transparency and efficiency in DeFi operations.\nA symbiotic union with the goal of accelerating innovation\nIn a move to innovate the DeFi landscape, Gora — an oracle platform built on Algorand — and RociFi, a oracle provider of on-chain credit scores from Ethereum Virtual Machine (EVM) wallets, announced their strategic merger. The union combines Gora’s capabilities in providing diverse data feeds across blockchains with RociFi’s specialized credit and risk scoring protocols to introduce the DeFi Risk Oracle.\nGora and RociFi are merging to introduce the DeFi Risk Oracle. Source: Gora\nOracles are essential in DeFi ecosystems, serving as bridges that fetch and verify real-world data for blockchain networks, which are otherwise closed systems. With the DeFi Risk Oracle, the merger aims to forge a comprehensive solution for DeFi applications.\nIntroducing a solution for comprehensive DeFi operations\nCointelegraph Accelerator participant Gora operates as a multichain oracle network and offers tailored data feeds crucial for various on-chain operations. RociFi’s role complements Gora’s features by providing a protocol that assesses the creditworthiness of blockchain wallet addresses based on their transaction histories, which is instrumental in determining personalized borrowing terms and risk assessments.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nBorn from the merger, the DeFi Risk Oracle integrates Gora’s data feeds with RociFi’s credit scoring expertise to deliver:\nReliable collateral price feeds: Gora’s oracles provide accurate price feeds, which are essential for DeFi lending platforms where accurate pricing of assets is crucial for calculating loan-to-value ratios and health factors of loans.\nWallet-level credit data: RociFi’s credit scoring features allow for a more nuanced risk assessment by evaluating the credit history tied to individual blockchain wallet addresses, enhancing risk assessment capabilities.\nProjects integrating the DeFi Risk Oracle gain real-time access to comprehensive wallet information, enabling:\nSybil-resistant governance: By verifying voters’ uniqueness and reputation, the oracle prevents manipulation and ensures fairness in decentralized voting systems.\nCustomized borrowing terms and targeted airdrops: Designed to improve user retention, these features aim to effectively reward the most active users within projects’ ecosystems.\nTransparent protocol health monitoring: Offering insights into the overall risk of DeFi protocols aids stakeholders in making more informed decisions.\nThe merger is structured equally, with the RociFi brand and its ROCI token transitioning into the Gora Network ecosystem. ROCI holders will be able to utilize a seamless conversion to GORA tokens on a 1:1 dollar value basis, allowing them to benefit from Gora’s offerings. The benefits include participating in node operation and staking systems, which offer competitive annual percentage returns (APR).\nExpanding multichain and DeFi adoption\nFurthermore, the collaboration is set to accelerate RociFi’s product development timelines by leveraging Gora’s established network. It also prepares the ground for the launch of the Gora.Fi platform and an ERC-20-compliant GORA token, enhancing liquidity and multichain functionality.\nIn celebration of the merger, Gora will collaborate with Qoda Finance, a peer-to-peer lending protocol on Arbitrum, to pilot unvested token lending on the Arbitrum network. The initiative will explore the potential for decentralized autonomous organization (DAO) contributors to obtain liquidity against their future token allocations, utilizing Gora’s collateral price feeds and RociFi’s credit scoring systems.\nThe strategic merger between Gora and RociFi marks an advancement in addressing DeFi’s core challenges. By combining the platforms’ strengths, the DeFi Risk Oracle emerges as a tool to enhance asset valuation accuracy and provide insights into individual credit risks, promising greater transparency and efficiency in DeFi operations.\nLearn more about Gora\n#Blockchain\n#Business\n#Decentralization\n#Partnership\n#Transparency\n#DeFi\n#Cointelegraph Accelerator\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-22","tags":["#Blockchain","#Business","#Decentralization","#Partnership","#Transparency","#DeFi","#Cointelegraph Accelerator"],"author":"by Nihatcan Yanik","category":null}