{"id":"dad5d7c2-d313-46cb-874d-874ec6e81df1","article_link":"https://cointelegraph.com/news/coinbase-base-blockchain-evm-usdc-ethereum-integration","website_source":"Cointelegraph","article_type":"News Article","summary":"Coinbase head of tokenization Anthony Bassili described plans for its Base network at TokenizeThis 2024 in Miami.","title":"Coinbase sees infinite interoperability potential with Ethereum and USDC","detailed_content":"Coinbase is preparing for a future of a billion customers using decentralized applications on millions of blockchains safely and securely in a system integrating the Ethereum Virtual Machine (EVM) and Circle’s USD Coin (USDC). \nCoinbase head of tokenization Anthony Bassili, speaking at TokenizeThis 2024 in Miami, said Coinbase’s Ethereum layer-2 Base blockchain will save time on Know Your Customer (KYC) and Anti-Money Laundering (AML) with identity attestation through the Ethereum Attestation service and Coinbase verification, which creates a tag on the user’s so-called smart wallet.\nCoinbase verification is available after the customer has completed its KYC procedure. While that may not be sufficient in all cases, Bassili said:\n“We expect that eventually to evolve into something like a KYC reliance model. […] And it will start to form market structure that makes it a lot easier for a simpler KYC process.”\nAlready more than 300,000 wallets have been attested.\nRelated: Coinbase's Base could make it the NVIDIA of DeFi\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nTo give those customers with wallets and verified identities Web3 access, Base will leverage the interoperability of EVM networks. The ecosystem will be supported by USDC. Coinbase took an equity stake in Circle in August. “Right now, we're somewhere above $28 billion of total assets” in Circle, Bassili said. Coinbase also has the ability to mint USDC.\nCoinbase head of tokenization Anthony Bassili (right) at TokenizeThis 2024. Source: Sam Bourgi/Cointelegraph\nWhen robust tokenized assets in different asset classes arise, it could become possible to trade assets for assets, without going through the intermediate step of trading them for dollars. Bassili said:\n“I think […] we're a while away from [that goal], because we need regulatory structures to show up, we need products themselves to be designed with identity checks instantly, and there is a lot of market structure that is still has to come.”\n“Crypto is the perfect embodiment of a liquid free open market structure where you can design any amount of complexity into it and have assets, trade with each other, don't have to be dollar pairs trade,” Bassili said. In the meantime, USDC provides a first step to developing that market structure.\nMagazine: 6 Questions for Kim Hamilton Duffy of Centre\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Blockchain","#Coinbase","#Decentralization","#Ethereum","#KYC","#AML","#Base","#USD Coin","#Regulation"],"author":"by Derek Andersen","category":null}