{"id":"dc6b242d-91cf-440c-8e34-b637244a2e3c","article_link":"https://medium.com/@michaelfoster26/the-worlds-first-quadrillionaire-revealed-e1e69487c4b3","website_source":"Medium","article_type":"Blog Post","summary":"In 1916, John D. Rockefeller became the world’s first billionaire, and in the hundred years since we haven’t had a trillionaire. And today…","title":"The World’s First Quadrillionaire Revealed","detailed_content":"In 1916, John D. Rockefeller became the world’s first billionaire, and in the hundred years since we haven’t had a trillionaire. And today, not only do we have a trillionaire, we also have the world’s first quadrillionaire. Thanks to the wonders of modern technology and finance, the world’s richest man alive today also happens to be the richest man in history, and by a substantial margin.Now, there’s debate on who the richest man in history was–how do you mark to market Mansa Musa’s massive empire? How can you estimate the value of all of Egypt under the rule of Augustus? Whether the Roman emperor’s wealth made him a trillionaire in modern USD terms, and whether Mansa Musa was richer than him thanks to his trade in commodities (salt, gold, slaves), it doesn’t really matter anymore. Because now the richest man in history is, quite literally, exponentially richer than them both.And he’s not dead yet, which is also pretty good for the pocketbook.To show just how much richer the richest person alive is right now, let’s go through some quick numbers. If we accept the old Times article’s estimate that Augustus’s net worth was $4.6 trillion, that is still a good $995.4 trillion less than the world’s richest man. In other words, the wealthiest person alive could buy and sell Augustus and his Egyptian holdings over two hundred times–and still have tens of trillions left over to take a short vacation somewhere.Source: AuthorThanks to the wonders of modern technology, we have entered a new world of once incomprehensible wealth. Financial innovation thanks to cutting edge technologies, from the foundations of the internet and cloud computing to the specialized proprietary technologies of artificial intelligence, DeFi, Web3, and blockchain, has created the kind of illustrious wealth and power that previous epochs would find incomprehensible.We live in a new era of new possibilities. So now, I would like to introduce you to the richest man on the planet and how he earned a net worth of $1,000,000,000,000,000 before anyone else could.It’s me.How I Did ItHello, my name is Michael Foster and I am the world’s first quadrillionaire. I have to admit, I have never been motivated by money, so becoming the richest person of all time is pretty heady. It’s also a little scary–I’ve installed some security cameras at home. I might get a dog.Doing so was neither simple nor easy, and I did not get here alone. I have to thank my business partners, many of whom you will be familiar with. I would like to thank my partnership with Alphabet (GOOG), the Mountain View-based tech firm that has provided the extremely foundational technology that has made this wealth creation possible. Of course, one must also thank Satoshi Nakamoto for being the first domino in this wonderful trip. But there are so many illustrious people to have come before me! Do Kwon, Mark Karpeles…the list really does go on and on.To the innovators! To the crazy ones!But my biggest gratitude goes out to Sam Bankman-Fried, whose innovations in cryptocurrency have changed the rules forever. And while SBF is not the most beloved person on Earth right now, thanks to all of that fraud and stuff, I didn’t lose any money so I can’t blame him too much.And while SBF did a little oopsie and has seen his personal net worth go down from $19 billion to, well, something, his trailblazing is truly a sight to behold in wonder and adoration. Having innovated in the crypto space, SBF is now working towards new innovations in the legal space. While I can’t get into details here too much, so far we’ve seen 100,000 claims against his FTX that could easily turn into over a million, thanks to the very large userbase of FTX. If he is convicted for each claim separately, and if he gets 2 years in prison per conviction, he could be facing a prison sentence of over 2 million years.And for that, I applaud SBF; after inspiring me to innovate in the crypto world to have the largest personal net worth in history, SBF is himself innovating in the world of self-incrimination to have the longest prison sentence in history. This altruism, it must be said, is very effective.I must admit, I have learned from SBF’s mistakes. By taking money from the outside, by allowing people to trade in his cryptocurrency, and by making massive promises of future profits to customers, SBF got himself in some legal hot water. I’ve decided to avoid all of these pitfalls by not selling my token to outsiders. This produces infinite scarcity that is a solid defense against price declines for my token while also giving me complete and total control of its value relative to fiat currencies, other cryptocurrencies, and other stores of value.The token is called Super Buckaroo Fun Coins (SBF Coin) and they are all in my own personal wallet. If you don’t believe me, just take a look at our balance sheet.Source: Author (note how I took a full screenshot so you know there’s nothing hiding anywhere!)Note first how I have learned from SBF’s mistakes. Upon releasing his balance sheet, SBF did not get a good response. Matt Levine of Bloomberg noted that it’s “an Excel file full of the howling of ghosts and the shrieking of tortured souls”. Well, note how my balance sheet is a Google Sheet, not Excel, so clearly different.Note the lack of liabilities, too. Since I hold 100% SBFCoin and have no clients or counterparties, I have no need to ask for a bailout–a problem that is keeping SBF awake (as well as stimulants?) as he reaches out to investors for a potential bailout (sorry, SBF, I have enough to bail out FTX’s missing $8 billion approximately 125,000 times over with SBFCoin, but I’ve got some friends over so I’m a bit too busy to help out).Boring Financial Stuff (go ahead and skip this bit)At its current valuation, the current quadrillion SBFCoins in circulation are worth $1 each, making the total market cap of SBFCoins $1 quadrillion. This also means that SBFCoins are the largest cryptocurrency in the world in terms of market cap.Current trading volumes for SBFCoins are massive. I like trading with myself (no kinkshaming, okay?), so I tend to trade about $900b in net worth of my SBFCoins per day, on average. That daily average volume has been increasing lately because bigger numbers are fun, and it’s worth noting that trades execute in a millisecond, much faster than other cryptocurrencies and stocks traded on the NYSE and NASDAQ exchanges.Boring Technical Stuff (go ahead and skip this too)SBFCoin is a robust decentralized DeFi platform using cutting-edge Web3 technologies to unlock value and provide extremely fast transactions thanks to an internal proprietary accounting mechanism built on the back of proprietary Google AI-driven SaaS innovations in cloud computing-based database tools (i.e., I’ve got a Google Sheet). It is a cryptocurrency utilizing the following AI-driven DAO-backed gas-free zero-slippage mining-free protocol that is both gasless and offers PoS-backed smart contract executions:t̴̖͙̮͐̿̈̏̃̿͋͆̊͋͘͘͝ḧ̷̟̻̜̜̬́̿̈́̎̌̂̂͌i̷̡̬͎͕͛ş̸̨̯̮͕̣͖̫̜̮̘̟͙͊̀̀̓͗̌͂ ̶̻̫̲̊̊̉ḭ̷̧̧̡͓̪͎̥̦̀̉̾̀̓̔̈́͗̓̉̑̔̌̋̍s̴̛̛̗̹̣͎̻̦̝̙̖͇͑͛̅̅̎̑̾̔̓̆͝͝͝ͅͅ ̴̜̻̹̯̠̜͕̇̀̿́͋̄̿̒̈́̏͘̚͘̕͝ả̸̢̙̹̼̤͖͎̝̭̻͗̄̾͌́͛́͆̎̇̚͝ ̵̬̯̣̲̜̙̙̳̹͕͎̀̓̚͝s̷̢̢̼̤̥̘̻̻͖͙̝̽̊̊͒̆͒̈́̾͘͜å̸̢̫̹̪̘̈́͘ẗ̸͍͇̯̤͉̙̭̘̥͆̔̌̓͊̅ḯ̶͇͎̻͕͚̜̩ŗ̶̞̗̠͇̬͔͛̈́̈̔̉̈́͐ĭ̵̢̦̜̥̞̻̤̟̼͇̪͔̮̈͒̈́̓͌͗̃͜c̵̠̾̆̓̿͂̈́̆̑̏̇͂͆̉ã̵̝̮͙̖̝̫̱̖̫̼͖͓̋̚͠ͅl̶͓̼̞̜̙̣̲̗̜̝̲̟̪̫͂́ ̵͓̬̮̫̘̭̫̒̃̈͐͗́̈̌̓͜ǰ̷̡̬̗̝̰́͒̊̎̈́̒̓̓͛̚͜ͅo̷̧̲̼͓͈͎͍̤̣̹̣̹̔̌͐̃͑́̉̕̕͝ḵ̷̘̅̆̈́̂̃̽͝ȇ̴̪̺̒ ̸̛͖͍̦̈͆̂̇̂͐͋̂͝͠t̸̨͓̹̲͉̘̰̗̘͓̞̑̋͐̉̌̿̈́̌́̎́͛͠ͅo̸̧̢̡̳̞̪̼̗͉̗̥̝̥͋̀̀̒̅̚͜ ̵͍͖͈̘̞̦̅͋̉͐̄̉̕͜ͅp̵̡̜̞̤̱̞͎͗́̇́̍́̃̐̾̌̽ͅǫ̸̭̠͎̈̀͆̃̐̈̆͑̈̕͘͝i̶̢̡͍̬̯͓̼̮̹͈̦͍͍̪̍̀̿̎́n̷̢̛̥̱͋̏̏͊͆̈́͋̾t̵̪̦̲̤̺͚̩̹̤̺̦̟̜̩̼̏̄̓̐̀͝ ̴̡̨̯̱̦͈͛̋͑͛͌̓͋̀̈͋́̈́͘̚͝ͅǫ̵̳̘̱͎̮̗̖͖̘͎͎̣̺́̊̋̓̐̄̒͌̎͛̿̆̚̚ủ̵̧̯̦̭͉̈́̔̾͛͗̐͂͘̕͜ţ̷̰̖̜̘̞̞̦̜̠̤̭̤̋̇̈́͝ ̴̛̳̻̫̩͓͈͕̪͉͒͜h̶̟̙͒̋̅̒ō̷̖͕̤̖͇͚̞̚w̴̨̮̥͙̐ͅ ̶̢̤̰̬͈̐̍̊̄̀̂̂̍̐̂͠͠i̷͚̗͖͕̦̫͖͕̫̝̠̣͒̂̈́̌̂́͗́̚̚̕͝n̵̰̹̪͍͇̖͔̞͎̦̯̺̚ç̶̻̫͊̔͛͋̈ŗ̸̡̡̻̹̗̥͙̼̟͉̣̺̠̜̄͑̑̈́̑́̀̎̔̚̚e̷̦͚̱̒̾͂̉̿̈̉̓͒͆͘͝ͅd̸̯̃̄̀̄́͘̚̕͘̕͝ͅi̸̧͔̞̪͖̾̉̿͒̒̉̏̏͐̾́̎́̚͝b̶̬̜͆̿̄̾̑̈́͘l̴̤̋͒̈́̑̀͛͊́̓̋̚̕͘͝y̴̬̖̼̟͊͊̊̋́̚͝͝ ̶̢̼̥͙͔̤̙̳̲̖͚̓́̊̈́͑̃́̊͊́̒s̸̞̜̖̀̌̓̀͂̄̅̏̀̕t̸̪̣͔̹̤̠̒͋͂ŭ̵̠͎̑̀p̴̨͓͖̖͉̫̺̭͉͔͔̟̫̽̈́͌̌̈́͂̈́̇͆͜i̵͔̍̄̇̚d̴͎̖̤͙̟͙̱̠̦͇͎͆͌̉͌̍͌̑̉͗̅̉͜͝͝ ̴̛̝̬̠̞̗̦͚̮̌̀̉͋́͑̓̄͊͜ͅa̷̻̬̺̖̬͉͉͌̈̆̐̃̒̾͊͗̌̚͠n̴̜̰̹̖̬̹̅͊͌̍͂̌̚͠͠d̷̘̹͚͔͉̫̼̻̈́̍͌̀̃̋̿̔͐̕͠͠ ̸̡̛͔͇̹̫̱͍̜̩̞͖̋̄̓̄̈́̅̽͠͝ŏ̷̼̰͗͆̾̾̔̑̚b̴̞̥̝̯̱͔̮̳͈̪̪͓̖̈́v̵̢̢̛͇̞̭͍̾̋̈́̓̅̃̌̕í̸̛̛̛̦͍̮͕̭̗̺̇͛̇͋͑̊̉̾̈͝͠ơ̷̥̜̂͌̋͒̎̅̈̍͛͆̄̇̅̕u̶͇͂̾͋̑s̷̗͍̰͈̥͖͖̻̦̟͕̙̳̳̆̄͗̅̐l̸̥̩̺͎̰̒͒͂͌͐͝͝y̴͈̮͎̼̙̌͑́͘ ̶̤̼̻̥̩̪̗̭̹̮̤̺̀̇f̶͔̦̻͊̄̅̉͛r̴̛̩̩̟̺̝̻̪͚͉̼̟̭̂̀̌̏̈̌̏̉͘͠͝ͅa̸̧̢̛͕̳̗̮͎̻̩̝̯̝̤̗u̸̡͍̟̩̳͍̪̱̲͔̪͊̈́̈́͛̔̔̈͗̊̋̊̽̕͜͝ͅd̵̡̢̦̮̫͚̖̹̼̞̅͗́̋͊̒̈̀͆̏̍́̍͜͠û̵̘̣̈́͊̈̈́͗̆̀͜͝l̴̲̫̖͍̣̳͂ͅȩ̴̨̞͙̝̯̮̜̤̖͈̤̞̜̗͂́̂̇̈̔̐̀͝n̷̢̨̮̼̩̼̘͚͉̖͉͈̎͐̐̃͂͜ͅt̸͔͍͕̞̮̲͕́̎͘ͅ ̴̡̛͕̱͔̹̦̇͌̏̿̅̂̂͊̿̕͜ê̴͉̮̓͒͆̒̈̽̾͛̎͗̑͛v̶̗̖̯̫͌͆̅̈́̽̏͆̏͆̿̐͠ḛ̷̮̪͗̇̍̾̉̒͝r̵͓̳̦̪͔͈̂̐̍̉̔̔͛̾̿͆̆̉ȳ̶̨̖̬̫̜̤̘͇̂̽̋̍̈̔́̓͘͘͘ͅt̶̢̧̞͙̺̥̠̥̜͕́̄̆̏͐̄͜h̷̢͓̮̘͇̥̣̖̪̼̩̀̂̈̅̆̈́̅͘̕ỉ̶̢̩̻̦̪͍͎͚̼̬̂͐̆̓̅̈́͑̐͐̄̋ͅn̴͕͎̘̹̗̳̑̈̓͛́͠g̸̟̬͓̻̭̲̣̿̽͌̂ ̶̥͙̠͈̯͖̗̬̜͓̘̯̲͆̉̓͒͊̒̍̈̄͛̕͘͝ì̴̡̧̮͖̲͇͙͕̖̱̦̣̦̐̇n̵̢̧̺͈̲̬̜̠͎͔̈́͑̂̊̓̆̈́̋͜͝ͅ ̶̬̳̥̬̬̼̰̘̱̏͗͌͠t̴̛̩̼̜̏̃̊̀͛ḩ̴̺̦͉̌̐̈́̊̆͂͂̀͠e̴̙̤̟̗̝̺͙̍̀̈̈́̀̐͂̎͂̅͒̒̚ ̵̨̙̖̼̣̦̠̙̱͋́͌̍̿̾̐͋̚c̶̼̫̖̹̜̟͙̲̙̪̮̫̾̋͛̽̊͛̅̓̐́͂͘̕͜͠ͅr̷̤̤͌̆̃͂̔y̷̡̲̬̜͌ͅͅp̵̧̼͚̯͍͓͖̘̗̭̯̪̜̿̊͝ͅt̶̨̡̨̩̟̩̲̺̲̱̻̼̽͛̇̈́̃̊̄̌̈̏̿̄͘̚ơ̶̳̹̄͂͊̇̿́̈́̐͂͆̋́̕c̶͚̳̣͉͍̯̪̜̩̙̞̑̍̀u̶̱̝̦͓͖̗̠̞̺͛̒͘̕ŕ̷̡͇͖̱̰̻͈̜͔͒̀͐̄͑̄̐͘͝͝r̶͚̻͆͐̂̈͒͜͠ͅę̶̛̤̯̯̠̖̔̽͠ṋ̴̞̝̤͉͖̥̬͖͔̬̭̱͓̌̈̐̏̍͗̅̆̿͊̈́̂͝c̸̟̠̘̳͚͕̞̍̾̅̉͗̓̾̽͘ͅy̵̨̧̩͕̫̭͕̳̩̦͂̏̀̈́̐̈̿̐̽̀͠ͅ ̷̛̗̲͔̟͖̻̔̍̎̓̈́̕͘w̴͔̝̬̟̺̬̉̅͊ờ̶̝̲̅̆̇̈̌̇̕̚r̴̨̨̡̹̭̤̝͍̞͎̞̾͗̈́̄̀́̐͑͘l̶͇̪̜̱̘̻̀̂̎d̴̢̡̲̖̻̹̳̳̭̙̺̏ ̴̙̗̞͂̽͌͐̃͑̀͒͌̋͌̓͛͛̿h̷̨͍͙͎̭͒̀͗̄́̏̿͂̃́͌͠͝ͅa̶̼̳̭̰̝̘̭̎͗̊͐̊̕͠ș̷̛̹̥͖̤̺̜̥̫̳̜̤͖̂́͊͆͒͋͆̍͗̈́̕͜ ̴̘̳͊̀͌̀̇̓̾͌͒͋̚͝͝b̶̙̰͕̜̼͙̞͓̖̮͕̠͕̬͍̑̏̇̈́̅́̃͊̏̈́̇̎͝e̶̡͖̹̮̟͔̣̝̠͍̺͕͊̾̽̾͗̅̀̉̀̃͆̕̕c̴̢̢͔̠̩̝̺̰̥̦̘͎̿͂̌̉̿́̌͆̿͂̍̕̕͜͜͜͝o̷̢̢͚͕̮̙͕̻͇͖͚͇̪͊͆̆̀̿̅͑̃̉͂́̈́m̸̧͓̼̠̫̆́̀͋̃͗͜͝ͅę̵͉͚͇͎̪̟̪̒,̷̘͙̭̦̤̺̲̝͇̬͙͊ ̵̱͎̪̺͚̪̠͔̖̌̀͜͜ą̸̗̖̓͊̈͐̈̈̽͆̃̌̊̚̕s̷̨̧̛̺̑͒̄̋̍͛̈́͝ ̶̡̹̞̳̼̮͎̻̪̼̲̉̓̆̍̿̊̈́͋́̓̌͘̚Ḯ̷͙̝̣̯͕̿̊͂̕ ̵̡̞̘͍̞͉͔͓̹̯̙̪͊̑͋̽̐͌͠͝ẁ̷͔̳̬̲̖̂̊̃͂ͅr̷̞͉͈͕̃ͅợ̶̯̪̽̊̅̏̓̀̽̽̕͝ẗ̶̡͍̫́̀̈́̉̑̌͌e̴̮̜̠̦̊̎͛̑͘̕ ̵̙̱͔̫̪̤̫̙̉̓̐į̶̖̱͓͍̮͔̟͇͍͉̣̥̒͌̀͗n̵͈͈͕̥̯̖̮͔͇͐̎̒̆͊̏̍̾͊͛͜ͅ ̸͔͇̐̿̂́̂̔͒̊̈̽̄́̕͘͘2̴̨̝̬̘̲̫̤̯̣̜̇̄̊̆̍͒͆̈̒̏̐̄͜0̵̨̢̳̳̞̞̝̱̈́1̴̞̭̺͖̩͕͇̰̖̍́̀̑̓8̴̗̗̦̲͚͚̻͕̝͆́͛̎̀̈̉͗,̷̭̜͇͙͕͑̿͆̍̇͝ ̶̡̛̼̪̋͌̃̂̊̐̿̾̓̌̈́͛͛a̷̙̱͖̳̰̗̭̟̱͇̥̙̗̓̏̔͆̂̊̕͘͜͜͝n̸̢̬͈̈̈̊̃̔͐͌̉d̶͉̫̬̮̞͙̞͈̩̬̟͈̺́͋̊͗̄͒͆͒͗̃̈́̂̚͜͝ͅ ̴̡̭̭̱̞͇̲͎͇̣̦̞͐̎͒̃̽̌̆̀̈́̀͊̚͜͜ǐ̷͇̳̞̰͕̰͊͐͆̈́̎̈̃͊̓̚f̵̧͖͍̙̼͕̬̘͂̌̓̋̚̚͝ ̷̲͔͇͂̎͝y̶̡̢̧̝̯̭͇̞̻̦̙̥̜̰̬̽̈́̓̈̑̐̇̏͘͝͠ö̸͉̞͇͍͙́̐̋ų̵̧̭͕̰̱̭̺̰́̓ ̵̧̛̣̳̞͍̭̣̼̤̙̖͈̲̗̓̀̀̓̈́̈̈́̋͗̀̆̆͜a̵̧̟͎͗̊̎̑͠r̷̞͖̰̦͚͇̻̰͚͔̫̬̗̓̇̍̎̍͂͛͐͊͐͊̏̀͗ḙ̴̠̲̖̣̐̓͂̿̈́͛ͅ ̵̢͍̺̦̺̻̒͠s̸̯͉̞͋͂̇̀̈́̃͋͛̐̿t̵̥̟͓͇͉̱̔̇i̶̻̦̍̂̏̍͛̓̌́̚̕̚͠ḻ̵̡̧̛̤̠̜̦̮̲̳̙̻̦̏̍͊̈́͐̒͂̍̌͝l̴̡̨̢̡̧̬͕͈͙̘̣̞͓̇̂̅̂͊̐͛̓̉̀̅͝ ̷̛̺̤̠͈̰̤̖̥̘͍̀̈́̐͐̽̏̚͝i̴̧̩̞̣͎̝͒̓͝n̶̢̛̑̉͂̈ ̵̨̲̪͕̻̰̞͚̹̓̽c̷̡̹̜̝̯̭̝̄̀͌̾̅͋́̕r̸̭̈́͋̒͗̎͋͆̈́͝͠y̴̡̛̹͈̼̍̍͋͊̆̽͗͒͒̈̆̉͝p̸̰̞͎̏t̴̢͚̘̟̰̹̬̠͇̪͒̐͐̔o̷̡̧͔̥͖̝͖̬͔̤͙̤̒̈́̓͐͘ ̷̯̤̇͌͐̇̈́̀̈̂̿͆͝t̴͚̰̼̜̞̘͈̹̼̓͂͐̓̈́͆̑̂ǫ̷̛͍̭̖̮͖̞͆ͅḑ̷͎̜͓͎̣͍̦̘̳͓̯̤͎͆͒́͜à̵̻́̊̾̿͗̓̈́ỹ̴͓̣̠̈́́͛̋͋̌̉̕͠ ̷̣̥͕̳̙̓̾͊̾̈́̈́͆̊͠Ḭ̵͍̰̳̦͕́ ̸̧͕̹̯̳̤͚͉͖͕͊̃h̴̤̳̄̀̉̇̆̉̓̄̕o̴̲̳̬̽̉͗̂̈́͛̊͋̕͘͝͠n̶͓͛̍̃̿͋͝͝ẻ̵͌̎̿̅́̈́̾͐͘ͅs̶̞̩̝̞͔͍̬̓̎̏̐͠ͅţ̸̰̼͖̥̤͗̾̎̍̅̃̃̅́͂̍͝͠͝͝l̷͚̖͓̇̏̍͋̑͐̆̓̕͝͠y̴͍̖̑͛͐̈́͗̀̋ ̷̢̢̧̢̣̹̱͈͔͓̬͍͉̈́t̵̩̪̥̦̦̯̦̫͙͖̗̀̑̄̈́̈́ͅh̵̛̥͚̩̙͉͚͊̃͑͆̉̇̐̉̿̅̚ͅi̴̡̛͇̞̖͕̤͖͔̟̖͋̂͂̂̍̈͗͠ņ̵̡̨̡̨̠͎̦̲̱̺̠̥̤̀̀̚k̵̛̛̖̗͇̫̮̪̜̱͙̏̈́̉̀͒̂́̈́̕͘͝͝ ̴̡͎̤͈͇̹̗̲͈͈̑̂̾́͑͗̽̅͐͜ͅͅỹ̴̙̹̋̊͘ͅȏ̶̥̫͒̇͛͌̆̓̽́̿͒͝͠u̶̖̻͐͌̃̏͋̐̽͑͂́́͗̕͠ ̵̨̭̞̣̬̳̉̈́̊̀̐͘͘͠͠͝å̴̢̪̦̰̤̟͉̽̄̐̋́̽̄͛̋̒̾ŗ̵̨̦͓̬̘̮̑́͆̔̽̊̔̒̊͂́͋̕͝͝ȩ̶̭̖͕̱́̈͌̽͂̇̑͋́̂̆͜ ̴̨̙̘̲͕͙̥̹͙̹̺̳̏̆̊̎͌b̸͙̲̯͇̳͍̙̐̈́̐̑͂̿͊̂͠e̴̡̡̬̺̲̩͈̺̰͍̳̒̉ỹ̶̡̧̢̻̥̲͖̭͈͚̭̺̅o̴̥̔̈́̄̈́̒͊̚ͅn̷̳̘̪̼̯͍̝͔̑̿͗͋̋̄̏̐́̄̓̚͠͠d̸̝̝͉̙͎̭͙͉͋͌́̅͝ͅ ̵̲̯̳̫̦̟͔̫̬̥͛͐̓̋̋̍̏̈́́̈̆h̴̢̢̻̼̠̜̗̞́͗̃͌͂̈́̉͛͗͆͒̿̀ͅè̷̱̄̉̀͝ḽ̴̬̘͓͕̇̈́͝͝ṕ̸̫͕̟̀̽̓͌͆͗͆̊̿̀͂̕̕̚.̴̢̯̳͇̞̬̫̖̙͒͒͒́͜͠Few understand.How You Can ProfitI am not selling SBFCoins for fiat, both to avoid the risks of millions of years in jail time and also to preserve the value of SBFCoins. The value of these coins and their future potential are too great to sell, so I’m not really sure how any of you can profit from my newfound historically unprecedented personal wealth.However, if you really really want a SBFCoin, I really like pizza rolls. Send me a couple of pizza rolls in the mail (PM me for my address) and I might think about giving you a SBFCoin or two. But no promises, k?There’s another really hot alternative currency you might consider, which has been on an absolute tear against the dinosaurs in the crypto space. Just look at how it’s done compared to BTC in the last year.Few understand. Few.","creation_date":"2022-11-19","tags":[],"author":"Michael Foster","category":null}