{"id":"dd562528-9e8f-43b8-a45b-fb990db8a035","article_link":"https://medium.com/@ola_zkzkvm/ola-1st-token-distribution-snapshot-rewarding-200k-massive-early-users-ed59640125ba","website_source":"Medium","article_type":"Blog Post","summary":"On May 6, we reached an exciting milestone — 200K sign-ups on Massive! This achievement is a testament to the strong support from our…","title":"Ola 1st Token Distribution Snapshot: Rewarding 200K+ Massive Early Users","detailed_content":"On May 6, we reached an exciting milestone — 200K sign-ups on Massive! This achievement is a testament to the strong support from our community, who have been instrumental in helping us reach each milestone. In rewarding our community, we are thrilled to announce that we will reserve a portion of Ola tokens for our early and active Massive participants.Massive, a decentralized ZKP verification network, is dedicated to fostering mass adoption for Web3 technologies. Since its launch on the Ola testnet on April 2, 2024, Massive has experienced impressive growth solely through organic traffic. Within just a month, we’ve reached nearly 200,000 registrations and activated over 100,000 users. We are immensely thankful for the ongoing support and trust from our community, which has propelled us to this significant milestone.To express our appreciation and to protect the interests of our early community members from dilution by newer users, we have decided to conduct the first token distribution snapshot for early Massive participants.Phase 1: The first token distribution snapshot is scheduled for May 11 at 12:00 UTC. This will secure a portion of tokens specifically for Phase One participants, acknowledging their early support and active participation.Phase 2: Following the completion of Phase 1, we will initiate Phase 2, which involves resetting scores and starting anew for all participants. This ensures that Massive remains a fair game for everyone, with all users starting on an equal footing. Scores from Phase 1 will be preserved and displayed, maintaining transparency and continuity.Participants must keep their addresses active on Massive until the Token Generation Event (TGE) to qualify for the final token distribution. Detailed information about the token allocation and release rules will be announced prior to the TGE.The total amount of Ola Tokens you receive will be determined by the combined total of your invitation points and ZKP verification completion points accrued across each phase.In line with our commitment to ensuring “Massive is a fair game for all,” we will adjust the initial snapshot scores by considering the compensation score and actual mobile connections. These adjustments are necessary to accurately reflect your invitation points and ZKP verification efforts, ensuring fairness for all participants.The OlaVM Points (OVP) program is designed to reward and incentivize our community members. Currently, over 60,000 OVP holders are an essential part of our community. As loyal participants, many OVP holders have been actively engaged in registering as Massive nodes and participating in ZKP verification since Massive’s inception. For those of you holding both OVP and earning Massive Points, we have some exciting surprises planned for the future.Massive represents a bold initiative by Ola to realize a vision for the industry that not only brings technological innovation but also introduces new use cases. Although still in the early stages, the overwhelming support from our community gives us the confidence to continue pushing forward. With a commitment to innovation and fairness, Massive is poised to significantly impact the Web3 landscape and offer users multiple and continuous rewards.Not yet on board❓Check out the step-by-step tutorial to download the Massive app and begin your Massive journey. Let’s make it massive together!Stay tuned for more updates as we continue to grow and innovate together on this exciting journey.Ola is an open-source Hybrid ZK Rollup contributing to a fair, decentralized, permissionless world. Incubated by cryptographers and engineers of Sin7y Labs in 2022, Ola offers a layer2 ZK Stack, featuring Ola-lang, OlaVM, OlaUI, OlaOS, and a series of developer-friendly tools, facilitating the development of any type of contracts. In 2024, Ola released the PreAlpha testnet in Feb, along with Olavm-point-based incentive programs. While preparing the mainnet launch in mid-2024, Ola is introducing a set of exciting products for both developers and general users, covering ZKP verification on mobile, a full-featured ZK-Stack, community-driven governance systems, and more! Come and join us on this thrilling expedition now!Website | Twitter | Discord | Telegram | Whitepaper | GitHub | LinkedIn | YouTube | HackMD | Medium | HackerNoon","creation_date":null,"tags":["Web3","Blockchain","Zkp","Depin","Snapshot"],"author":"Ola","category":null}