{"id":"dd74456d-ebd5-4b3a-a947-c5bd91348561","article_link":"https://cointelegraph.com/news/from-obscurity-to-prominence-web3-protocol-celebrates-growth-with-dao-powered-event","website_source":"Cointelegraph","article_type":"News Article","summary":"The transformative journey of leading blockchain technology: Protocol brings the community together in a DAO-driven event, empowering connectivity for the Web3 landscape.","title":"From obscurity to prominence: Web3 protocol celebrates growth with DAO-powered event","detailed_content":"After raising over $100 million during the peak of the ICO boom in 2018, the Dfinity Foundation gathered a team of 200 cryptographers to bring to life a new blockchain technology: the Internet Computer Protocol (ICP).\nAfter years of development and anticipation, the mainnet launched in 2021, brimming with potential to revolutionize the Web3 space. However, the path for ICP was anything but smooth.\nInitially, the ICP token faced a harsh reception with a massive price drop resulting from a series of challenges, including alleged market manipulations, poorly structured token unlock schedules and various operational setbacks. Despite these tumultuous beginnings, ICP’s underlying technology remained robust — a fact largely unrecognized in the broader Web3 community.\nFrom obscurity to prominence\nThe narrative began to shift dramatically for ICP from October 2023 through January 2024. The ICP token surged by an impressive 490%, climbing from $2.93 to $14.37 and marking one of the first significant rallies of the emerging bull market.\nThe ICP token enjoyed a major pump during the last quarter of 2023. Source: TradingView\nThis resurgence recaptured the market’s attention and spotlighted ICP’s recent advancements, particularly its pioneering capability to host fully functional decentralized applications and artificial intelligence (AI) models.\nAmid this revival, the ICP community has rapidly expanded, catalyzing the formation of a new decentralized autonomous organization (DAO) that will steer a major Web3 conference series, setting the stage for a deeper exploration of its untapped potential.\nMajor ICP event to become a DAO\nICPCC, the ICP ecosystem conference series, is the largest attempt at demonstrating the progress made by the Internet Computer Protocol in terms of blockchain and Web3 usability. Scheduled for May 10, the event consists of a free nine-hour global livestream accompanied by a number of community-organized watch parties in 25 major cities worldwide.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nDuring the ICPCC livestream, the ICP-focused event series will become a fully DAO through a decentralization swap sale. The newly formed entity, ICPCC DAO LLC, will then operate as a community-owned, self-sustaining, decentralized conference event series with an aim to celebrate The Internet Computer Protocol and broadcast how the ICP connects and empowers the broader Web3 space.\nA closer look at the FTX scandal\nIn a move to showcase a thriving blockchain ecosystem, the ICPCC24 will offer several key highlights from the community.\nThe first one is ‘Cracking FTX,’ a documentary that seeks to unveil a new “dark side” of FTX, focusing on the alleged market manipulation during the ICP token launch. Created by YouTube content creator Kyle Figs, the documentary will premiere during the ICPCC livestream on May 10, taking viewers on a global investigative journey.\nThe main premise of the film is the revealing of how the now-defunct crypto exchange FTX allegedly used synthetic assets to sabotage major Web3 projects, including the Internet Computer Protocol and Ronin Network.\nAside from an investigative backdrop — from Los Angeles, United States to Zurich, Switzerland — the film also features interviews with prominent figures from the broader blockchain and crypto community, including Ben Armstrong (a.k.a. Bitboy Crypto), Bitcoin Renegade, Crypto WendyO and Jordan Mack.\nCommunity-driven blockchain projects\nAs a gold sponsor of the ICPCC, the CLOWN community will also have a chance to onboard new “ICP Clowns” — a Web3 community that promotes ICP-powered projects without permission or provocation.\nFostering a new gathering around a token that was abandoned by its creators following a rug pull attempt, a stockbroker from New York led the revival of the CLOWN token’s community until it took on a life of its own. The CLOWN community is now building a thriving team of self-declared “clowns” to fuel various initiatives, including creating flashy memes promoting different ICP projects.\nWindoge98 offers a functional operating system with games. Source: Windoge98\nAnother fun project joining the event is Windoge98, a retro-meets-meme type of project that brings the look and feel of Microsoft Windows 98 on blockchain with a “Doge” sauce. Aiming to bring people to the Internet Computer in a similar way that Dogecoin\nDOGE\n$0.15\nhelped people into Bitcoin, Windoge98 has a functional operating system with an array of playable games —such as 3D Pinball — as DApps hosted on the Internet Computer.\nWeb3 grows on robust infrastructure\nFollowing a rocky start with the price charts, the ICP blockchain has found its footing thanks to the Dfinity Foundation’s delivery of the promises on the tech and infrastructure side. From integration with key blockchain protocols to launching a Web3 accelerator platform, the ICP ecosystem continued to build with over 300 developers regardless of the market condition, earning the ICP community a place in the top 5 development activity charts.\nOrganizing its own “Community Conference” is a way for the ICP ecosystem to show what’s been cooking in the kitchen to a much bigger audience. “This won’t be our DAO, the ICP community really is taking over total control,” said Code & State venture lead Isaac Valadez, adding:\n“This is a major Web3 event series converting into a protocol that needs no custodians or centralized dependencies, it’s an experiment that could outlast all of us.”\nAttendees of the ICPCC24 will have the opportunity to see the growth of the ICP community, along with the potential ICP holds in bringing emerging technologies like AI to Web3 with a seamless experience.\nLearn more about the ICPCC24\n#Blockchain\n#Event\n#Community\n#AI\n#Internet Computer\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-09","tags":["#Blockchain","#Event","#Community","#AI","#Internet Computer"],"author":"by Mike Kara","category":null}