{"id":"dde9765f-363b-4962-848a-70b958d8d385","article_link":"https://cointelegraph.com/news/institutional-adoption-blockchain-crypto-at-its-highest-point-block-daemon-bitcoin-etf","website_source":"Cointelegraph","article_type":"News Article","summary":"Barnaby Hodgkins is bullish on mass adoption, Ethereum ETFs, and the future of the industry.","title":"Institutional adoption in blockchain and crypto at its highest point, says Blockdaemon strategist","detailed_content":"Blockdaemon’s Barnaby Hodgkins recently sounded off on the future of the blockchain/cryptocurrency sector at the Token2049 event on April 20 in Dubai.\nDespite a freak storm delivering the most rainfall the United Arab Emirates has seen in some 75 years, attendees were able to brave the weather.\nHodgkins, Blockdaemon’s Senior Manager of Growth Strategy, sat down with Cointelegraph’s Ezra Reguerra to discuss the current state of the industry as well as what to expect going forward.\nAs to the current state of the industry, Hodgkins says there’s still room for growth:\n“I would probably say that institutional adoption in the space is at its highest point it's ever been, but I wouldn't mistake that with saying that there's loads of institutional adoption.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nHe expanded, adding that there was work yet to be done, “It's the highest it's ever been and as a result there's a lot of reason to be bullish around what's happening.”\nHodgkins cited the launch of the first Bitcoin spot ETFs in January and their ensuing adoption rates as bullish indicators. But there appears to be plenty of runway left for adoption:\n“When it comes to wide scale adoption in institutions across the spectrum of institutions, from asset managers to pension funds, to hedge funds, to sovereign wealth funds, I think we're still very much at the foot of the hill.”\nBlockdaemon, and by extension its growth manager, Hodgkins, are well positioned to garner a bird’s eye view of the blockchain industry. The company, according to Hodgkins, is “the world's leading Blockchain infrastructure provider.”\nIts services span “the entire spectrum of infrastructure needs from dedicated node access, API access ability, to run validators and staking rewards, all the way through to MPC wallet technology.”\nHodgkins says the next few cycles could produce even more industry-changing events. “What we might see in the near future is, potentially, an Ethereum ETF,” he told Cointelegraph, adding that the myriad use cases for blockchain and cryptocurrency technology could lead to mass adoption by industries such as the automotive and transportation sectors.\nRelated: What are memecoins good for? Social signaling, says Avalanche founder\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-20","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Interview","#Business","#Event","#Ethereum","#Ethereum ETF"],"author":"by Tristan Greene","category":null}