{"id":"df8ede7c-cf5d-44c0-95da-ab2318c435b5","article_link":"https://cointelegraph.com/news/web3-investment-up-55-q1-crypto-vc-interest-rebounds","website_source":"Cointelegraph","article_type":"News Article","summary":"The number of Web3 venture capitalist deals also rose 36% in the first quarter of 2024, indicating wider interest in Web3 protocols.","title":"Web3 investment up 55% in Q1 as crypto VC interest rebounds","detailed_content":"The total investment in Web3 firms increased by 55% in the first quarter of 2024, signaling the return of venture capital (VC) interest to crypto.\nIn addition to an increase of over 55% in total investment, the number of Web3 VC investment deals rose 36% in the first quarter of 2024 compared to the previous quarter, according to a Q1 on-chain report by QuickNode and Artemis.\nArtificial intelligence (AI) and gaming-related Web3 protocols took the lion’s share of the investment. According to the report:\n“[This indicates] that investments are increasing for the first time in over a year, and suggesting a favorable shift in VC sentiment for web3. In particular, AI and Gaming have garnered the most resounding revival of venture capital enthusiasm among the categories.”\nQuarterly number of Web3 investment deals. Source: QuickNode\nFurther showcasing VC interest in Web3, crypto-focused VC firm Paradigm led a $225 million funding round into Monad Labs, which is building a new layer-1 blockchain network set to compete with Solana. The round was announced on April 9.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nTwo of the quarter’s largest early-stage rounds included a $42 million Series B round by Berachain and a $35 million pre-seed round for 0G Labs, a data availability blockchain for AI protocols.\nSeed round deals saw the most growth, up 53% quarter-on-quarter, suggesting increased interest in early-stage deals. Series A and seed funding rounds nearly doubled their capital inflows compared to the previous quarter, “reflecting VCs’ renewed willingness to invest in Web3,” according to the report.\nQuarterly number of Web3 investment deals, by round. Source: QuickNode\nRelated: With 10 days to the halving, analysts predict $150K Bitcoin top\nCrypto VC interest reignites ahead of the Bitcoin halving\nSeveral notable investment deals were announced in the period leading up to the 2024 Bitcoin halving.\nOn April 9, Bitcoin layer-2 network Mezo announced the completion of a $21 million Series A funding round led by Pantera Capital. Mezo enables investors to earn yield based on the time they hold their tokens. They describe it as a “Bitcoin Economic Layer.”\nOn April 3, reports emerged about Paradigm negotiating to raise up to $850 million for a new fund, which would make it the largest raise in the crypto industry since May 2022, when Silicon Valley-based VC firm Andreessen Horowitz raised a record-setting $4.5 billion.\nWhat Could Go Wrong with Bitcoin Halving? Source: Cointelegraph\nRelated: Binance Labs shifts investment focus to Bitcoin DeFi\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Venture Capital","#Investments","#Adoption","#Web3","#Gaming"],"author":"by Zoltan Vardai","category":null}