{"id":"e1c07d9a-9eaf-4ab3-b2da-d3cc49a21545","article_link":"https://cointelegraph.com/news/bitcoin-testnet-needs-reboot-block-storms-bad-actors-jameson-lopp","website_source":"Cointelegraph","article_type":"News Article","summary":"Bitcoin’s testnet needs to be reset so it can remain free for developers to use, says software engineer Jameson Lopp.","title":"Bad actors and ‘block storms’ — Bitcoin dev calls for testnet reboot","detailed_content":"Bitcoin’s most popular testnet is in dire need of a reboot due to “block storms” and projects being able to charge users for testnet Bitcoin (TBTC), said Jameson Lopp, co-founder of Bitcoin custody firm Casa.\nIn a May 4 essay titled “Griefing Bitcoin’s Testnet,” Lopp argued the Bitcoin testnet needs to be reset partially due to ongoing “block storms,” which come about due to a unique consensus mechanism on the testnet.\nWhile the Bitcoin mainnet produces an average of 144 blocks per day, the testnet, which is subject to “slightly different consensus rules,” will occasionally produce over 10,000 blocks in a single day.\nBitcoin’s testnet has produced over 10,000 blocks in a single day on several occasions. Source: Jameson Lopp\nLopp explained that as a result of these “block storms” the network stands at a current block height of 2,811,000, which is the equivalent of where the Bitcoin mainnet would be in 2061.\nLopp noted that due to the vast increase in the testnet’s block height, the rewards for testnet miners had been reduced to near zero, making the network practically unusable for developers looking for new tokens.\nRelated: Someone ‘shit in the jacuzzi’ — Bitcoiners furious after testnet griefing\nAdditionally, Lopp said that the now-scarce testnet Bitcoin was being co-opted by certain projects looking to take advantage of the token’s scarcity.\n“It’s not uncommon for malicious folks to prey upon people’s naïveté and sell them testnet bitcoin at mainnet Bitcoin exchange rates,” he said.\nHe pointed to a recent example of a Bitcoin-based layer-2 network dubbed SatoshiVM, which had been using TBTC to distribute airdrops to its holders as an example of a project that had been creating artificial value on the testnet for its own purposes.\nHe called out several projects, including a decentralized exchange called MotoSwap and a brokerage firm called Buy Tesnet for selling testnet tokens to users.\n“The sole reason I’m advocating for a testnet reset is because testnet is supposed to be free for developers to use. Other than that, everyone should be free to use testnet for whatever development purpose they wish.”\n“It’s important for every wallet that supports testnet to have a bold disclaimer on the main screen that testnet coins have no value!” Lopp added.\nUltimately, Lopp concluded that the only way to ensure a testnet does not accrue value is to “instill a culture of regular resets” and advised Bitcoin developers and users to migrate their infrastructure to “testnet4” in the coming months.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?","creation_date":"2024-05-06","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Adoption","#Community","#Bitcoin Mining","#Developers","#Jameson Lopp"],"author":"by Tom Mitchelhill","category":null}