{"id":"e1e423e2-ebbb-490f-8056-a3be6b07bab2","article_link":"https://medium.com/@joshgans/desocs-dark-heart-e20448866363","website_source":"Medium","article_type":"Blog Post","summary":"DeSoc, for all its talk, has a very dark element as proposed","title":"DeSoc’s Dark Heart","detailed_content":"There has been much talk recently of a new paper by Weyl, Ohlhaver and Buterin on soulbound tokens and their use to create Decentralised Society or DeSoc. The paper provides a potential way of powering web3 by virtual of tokens that are attached and used to establish unique identities on the web. That sort of thing is critically important for web3 as I discussed here. But read the paper carefully and there is worrying element with regard how it might use those identities in practice.It starts with the common issue that many who push for blockchain solutions to things worry about … decentralisation.The reason this is a concern is that the whole point of establishing unique identities is so that governance is not subject to coordination. In blockchain circles one such concern is the 51% attack where a single entity controls the majority of the ‘votes.’ But there is more than that:To do this the authors propose “a protocol [that] could examine the correlations between SBTs held by different Souls and discount votes by Souls (pooling them as only partially separate) if they share a large number of SBTs.” What do they mean by this? There isn’t much discussion but what they mean is plain for all to see in the mathematics left in an appendix to the paper.Suppose you have three people who are part of a DAO (decentralised autonomous organisation). They are deciding on something and they could vote on what to do based on quadratic voting that has some nice properties (but that isn’t critical to the story). They show that three voters — Abdu, Shou and Belle — can vote for good outcomes if they do so independently.But what if some of the voters have something in common, such as where they work?They don’t take the extreme approach. Instead, the authors argue that a “simple approach, which we call “clustering,” would put two co-workers “under the same square root” in the quadratic formula to offset their tendency to already coordinate.”There is a lot going on there. Basically, the move is away from one person, one vote to taking the votes of people who are presumed to have some common interest — in this case, where they work — and then putting them together to weaken their force. In other words, their votes count for less!And it is not just one dimension but potentially a whole lot of dimensions that could determine your power in voting before getting a chance to vote.Now I’m not going to necessarily equate the authors’ motives with voter suppression tactics that are used except that they really seem to be that. I mean what else do we call limiting the voting power of people with certain affiliations and characteristics?Why are the authors led down this dark path? The reason is that something like quadratic voting can really be exploited when people coordinate their actions. In that way, they can get together pre-vote, work out a plan that is good for them as a group and obtain that outcome via coordination which is better for them than what is likely to arise if they all vote independently. One way to deal with that is not to use quadratic voting. The other way is to adjust this. It is that path that the authors lean into.But there is a reason that we don’t like fiddling with characteristics and affiliations this way — it makes some people more equal than others. And who is to say how this should occur? The whole point of voting on stuff is to surface what we don’t know and that is more valuable precisely when we can’t have the knowledge to presume that we will know what an outcome will be. This is a slippery slope towards exclusion which would surely be anathema to the whole exercise.The authors seem enamoured by the autonomous part of DAOs rather than the need to engage in policing explicit collusion or coordination — i.e., vote selling. Indeed, almost as an afterthought in the appendix, the authors discuss “pairwise matching” which is based on the idea of one of them that monitors the network for specific attacks. They realise its advantage in that “it has the important advantage that it does not require an extrinsic source to specify who is coordinating and who is not; instead, this information is extracted from the contribution values themselves.” There are dangers here but it is akin to policing voter fraud rather than pre-emptively discounting the votes of some people.","creation_date":"2022-06-13","tags":[],"author":"Joshua Gans","category":null}