{"id":"e22052db-f561-42f3-9057-93646cfd2fa4","article_link":"https://cointelegraph.com/news/hederas-hbar-token-pumps-nearly-one-hundred-percent-misinterpreted-blackrock-announcement","website_source":"Cointelegraph","article_type":"News Article","summary":"A widely misinterpreted announcement from the HBAR Foundation has sparked confusion among crypto influencers and sent the price of HBAR token soaring.","title":"Hedera’s HBAR token pumps 96% on misinterpreted BlackRock announcement","detailed_content":"Shares of a BlackRock money market fund have been tokenized on the Hedera blockchain sending the Hedera\nHBAR\n$0.11\ntoken on a 96% rally in the last 24 hours — but the world’s largest asset manager confirmed it has no relationship with Hedera despite many believing it was actively involved.\nThe widely misinterpreted April 23 HBAR Foundation X post — an organization working with the Hedera community — shared that blockchain trading and infrastructure firms Archax and Ownera tokenized BlackRock’s ICS US Treasury Fund on its network.\nThe video shared with the announcement seemed to suggest Ownera, Archax, and BlackRock were partnered on the venture and HBAR claimed it was “bringing the world’s largest asset manager on-chain.”\nA BlackRock spokesperson confirmed to Cointelegraph it “has no commercial relationship with Hedera nor has BlackRock selected Hedera to tokenize any BlackRock funds.”\n\"As we have in the past, BlackRock will communicate directly with the public on the evolution of our digital asset strategy,” the spokesperson added.\nSome crypto influencers with large X followings shared a misinterpretation of the post — which had amassed over 1.6 million views and 2,700 reposts over the last 15 hours — believing it to mean BlackRock was responsible for the $22.3 billion fund’s move onto the blockchain or had partnered with Archax and Ownera.\nSource: Mason Versluis\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nCardano Ghost Fund DAO founder Chris O’Connor posted that BlackRock had “no involvement” with Hedera’s development and slammed the HBAR Foundation for the way it framed the announcement.\n“What did happen was a HBAR project through the secondary market tokenized shares of a BlackRock fund. Much like I can buy a Rolex take a pic and post it on my X account. Doesn’t mean Rolex ‘partnered’ with me.”\nArchax co-founder and CEO Graham Rodford replied to O’Connor, saying “it was indeed an Archax choice to put [BlackRocks fund] on Hedera” and added that “everyone involved was aware.”\nRelated: Envision partners with HBAR and UN on new digitization platform for carbon markets\nHBAR’s 96% rally in the past day has pushed its price to $0.175 — a two-year high, according to CoinGecko.\nHBAR’s price over the last three months. Source: CoinGecko\nDespite the price pump, HBAR is still down over 69% from its September 2021 all-time high of $0.57.\nThe announcement came as the Hedera Global Governing Council — which oversees the Hedera network — recently approved allocating 4.86 billion HBAR ($408 million at the time) for further network development.\nThe funds are part of the HBAR Foundation’s plans to strengthen its user base in 2024, following 2023’s performance, which saw 33 billion transactions processed on the network, the foundation claims.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nUpdate (April 24, 7:30 am UTC): This article has been updated to add an X post from Graham Rodford.\nUpdate (April 25, 12:55 am UTC): This article has been updated to add comment from BlackRock.\nExchange or buy HBAR\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-24","tags":["#Blockchain","#Business","#Adoption","#Tokens","#Hedera"],"author":"by Brayden Lindrea","category":null}