{"id":"e39346a0-1462-4729-b85f-8c9a5eaeac1c","article_link":"https://cointelegraph.com/news/ripple-joins-derec-secrets-management-web3","website_source":"Cointelegraph","article_type":"News Article","summary":"Ripple joins the Hedera and Algorand Foundations and industry players to advance a recovery standard to rival ERC-4337.","title":"Ripple joins multi-chain DeRec Alliance for secrets management","detailed_content":"Ripple is among the new members onboarded to the Decentralized Recovery Alliance (DeRec), an industry organization seeking to create a simplified, standardized secrets management system. It brings XRPL Labs with it and joins Algorand and Hedera and members of their ecosystems, among others.\nDeRec is developing a tool to make Web3 more accessible by providing open-source management for “secrets,” such as digital assets, accounts, keys, passwords, photographs and other digital material, that will not require the high level of user sophistication necessary today. The DeRec app would simplify storage and provide a means of recovering information in case of a lost device. It was invented by Hedera co-founder Leemon Baird and debuted in January.\nSource: Dagnum P.I. \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe DeRec app allows users to select helpers who will hold encrypted fragments of the user’s secrets held in a library file. It hopes to introduce Helper-as-a-Service in the future. Helpers will not have access to the fragments, although the organization notes that it is liable to 51% attack:\n“If less than half of Alex’s [a hypothetical “layperson”] helpers were to collude, the helpers would still be unable to access the vault.”\nThe DeRec app is setting itself up as an alternative to Ethereum’s ERC-4337 smart account standard, known as account abstraction, introduced in March 2023. Polygon, Optimism, Arbitrum, BNB Smart Chain, Avalanche and Gnosis Chain are among the Ethereum Virtual Machine-compatible networks that can use that standard.\nRelated: Tokenized mortgages can prevent another housing bubble crisis, says Casper exec\nBesides being available to other blockchains, the DeRec app claims to be able to hold secrets of any type, whether onchain or offchain. In addition, its use would be undetectable, and the identities of the helpers could not be discovered. RippleX Senior Vice President Markus Infanger commented:\n“Together, we can revolutionize how users manage their private keys, representing a major step forward for user security and adoption – not just for XRP Ledger users, but for everyone in crypto.”\nRipple joins the Algorand Foundation, Hedera-affiliated Swirlds Labs and Ripple-associated XRPL Labs as founding members of DeRec, giving it a seat on its Technical Oversight Committee. Besides the three major blockchain organizations and their affiliates, blockchain-enabled healthcare network Acoer, industry service providers The Building Blocks and BankSocial, wallet infrastructure provider Blade Labs, the Casper and Constellation blockchain foundations and Key backup and recovery solution provider Revive Labs are members of DeRec.\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\nExchange or buy XRP\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Blockchain","#Ethereum","#Ripple","#Private Keys","#Algorand","#Hedera","#Seed Phrase"],"author":"by Derek Andersen","category":null}