{"id":"e4083b62-52d9-4698-b547-b4cf635b9369","article_link":"https://medium.com/quadrans/quadrans-and-truebit-revolutionizing-textile-industry-3aecd7a74a86","website_source":"Medium","article_type":"Blog Post","summary":"The Project","title":"Quadrans and Truebit revolutionizing Textile industry","detailed_content":"The TRICK project, supported by the EU’s Horizon 2020 program, aims to promote sustainable practices in Europe’s textile, clothing, and food industries through a digital platform.Within the architecture of the TRICK platform, the Quadrans Foundation with the continued support of Truebit Team has developed a unique tool to enable verified textile traceability information to be provided to the end consumer.Quadrans, with its global accessibility, emerged to serve the intricate needs of industries and supply chains. It offers automated processes through traceability and smart contracts, thereby lowering costs and bolstering security and enables seamless collaboration and cross-border transactions.Quadrans is an open-source Blockchain ecosystem derived from Ethereum, retaining elements like the Ethereum Virtual Machine (EVM). The platform has evolved to integrate unique features while maintaining interoperability with Ethereum, supporting seamless transitions of existing solutions. Looking ahead, Quadrans plans to implement a hybrid consensus protocol combining Proof of Work (PoW) and Proof of Stake (PoS) to enhance security and efficiency.For those reasons Quadrans was chosen by the TRICK consortium as the reference public blockchain and data plane where information regarding production processes to consumers and stakeholders can be saved.The Identity-Manager Smart Contract provides a decentralized mechanism on the blockchain for managing and verifying the associations between user identifiers and their corresponding public addresses. It supports functions like adding or editing identities and retrieving associated public addresses or user IDs. It ensures controlled access by allowing only a designated IdentityManager address to modify identities, enhancing decentralization by eliminating reliance on a centralized database for storing these associations.The Portability Smart-Contract on the public layer stores all public documents for each instance of the portability process. The smart contract is designed to allow write access solely to its owner, enhancing security by ensuring that only the owner can add data, and upon completion, ownership can be relinquished to a null address to seal the data permanently. This design prevents unauthorized data alteration even if the private key is compromised. In brief, the smart contract can handle the following data:Data portability empowers users by allowing them to transfer their data across various services or platforms, thereby avoiding vendor lock-in and enhancing competition among providers. This flexibility is especially important in the blockchain ecosystem, where it supports the interoperability of decentralized applications and aids in operational efficiency and disaster recovery. A number of alternative solutions were examined before implementing portability on blockchain via Truebit:The Quadrans Team has developed a key component called the Verifier Agent that allows the authenticity and integrity of data to be verified before it is published on Portability Smart-Contract.In the TRICK Project, the NFTs represent individual products, enhancing their authenticity, traceability, and security by embedding a uniqueProductID that links back to centralized systems. Additionally, each NFT has a meta-data file stored on IPFS, detailing the product’s attributes and ensuring transparency.The activity of testing and adapting the product to real business needs is ongoing. Pilot projects are currently being conducted by major textile companies such as Fratelli Piacenza S.p.A and the Customs and Monopolies Agency, among others. The expectation is to release the first apparel samples associated with Quadrans NFT by the end of 2024.Stay tuned","creation_date":null,"tags":["Blockchain","Fashion","Smart Contracts","Quantum","Cryptocurrency"],"author":"Davide Costa","category":null}