{"id":"e55e168a-1be6-4441-b401-ce7e45a15dca","article_link":"https://medium.com/@CallumHowe/samurai-starter-rivalz-node-sale-guide-70095133f0e5","website_source":"Medium","article_type":"Tweet","summary":"Earn passive income and an airdrop for running a Rivalz node","title":"Samurai Starter — Rivalz Node Sale Guide","detailed_content":"Samurai Starter is excited to announce that we’ve landed an allocation in one of the most bullish node sales of the year with AI powerhouse Rivalz: the data infrastructure layer powering the next generation of AI applications.With its combination of decentralized storage and a modular, programmable blockchain for AI-powered DApps, Rivalz has already attracted a host of quality VCs and strategic partners. We’re thrilled to be able to offer our community a chance to claim their share of this massive AI infrastructure play (with lucrative token rewards attached)!So what exactly does purchasing a Rivalz node license actually get you? And how can you best monetize it to your advantage?Today we’ll be breaking down the answers to those questions into the simplest possible terms, as well as giving you the lowdown on all the innovative tech that Rivalz are building.We’ll start with…Let’s cover the most important question first: what exactly are you buying when you participate in a node sale? Well, here’s the simplest answer possible: a node license is an NFT which allows you to generate passive income.If we want to get a little more complex: a node license is an NFT which gives you the right to run a node on the Rivalz blockchain. Rivalz validator nodes (zNodes) are the building blocks of the network, which control the authentication and flow of data throughout the ecosystem. As a reward for this service to the network, zNode operators get paid out fees in the form of $RIZ tokens.A full 20% of the total supply is set aside to be distributed to zNode operators across the first 2.5 years after TGE. That means that — following the mainnet launch in Q3 2024 — each zNode will generate passive income for a full 30 months. Further rewards will be paid out after this first rewards pool is exhausted.To sweeten the deal even further, a further 2% of $RIZ supply will be airdropped to node sale participants directly at TGE, with 100% unlock!Although the language surrounding nodes might at times sound complicated, actually running a node doesn’t have to be complex. You can simply delegate your node to a third-party node operator service, who will run it for you (for a portion of the fees). Rivalz is partnering with multiple of these service providers to support one-click deployment.Closer to the launch of the mainnet in Q3, we will provide a simple guide on how to go about setting up your node through these service providers (along with a guide on how to run the nodes directly on your own hardware, if you’d prefer to do so).To recap:Now let’s take a deeper look at the nuts and bolts of what Rivalz are actually building: a network for the storage and interchange of data for AI systems. To understand the significance of this mission, we should address the problem they’ve set out to solve.When AI developers build applications, they need access to large datasets in order to generate reliable results. As things stand, the sources of this data are often fragmented, incomplete, or even unethically sourced.Rivalz aims to use the power of decentralized computing to intelligently collate, clean, and index this data into a brand new type of reliable and transparent source: a decentralized, cross-chain hub where AI applications can tap into vast and dependable data resources. This is why they call themselves the ‘first AI intel layer’ in Web3.This streamlined AI infrastructure can then be used to power myriad kinds of AI-powered applications: AI agents, trading bots, GameFi projects, DeFi protocols — essentially any project which seeks to implement AI in its tech stands to benefit from integration with the Rivalz data infrastructure.The Rivalz network is made up of two main layers. The first is the Rivalz RollApp — this is essentially an EVM compatible blockchain, built for plug-and-play access to the Rivalz data infrastructure. Here developers can build and integrate their AI-powered DApps, and connect them cross-chain through the power of EVM interoperability.The second layer is the Rivalz DePIN (decentralized physical infrastructure network). Simply put, this is the decentralized network made up of every device around the world running a Rivalz node. It’s here that the data inputted into the network is validated, streamlined, cataloged, stored, and managed.Rivalz nodes are responsible for all of the above processes, as well as controlling the inflow and outflow of information between the DePIN layer and apps built on the RollApp. This is what you’ll be contributing to when you buy and run a node through Samurai Starter!On the Rivalz DePIN storage layer, zNodes (validator nodes) handle the authentication and secure processing of data flowing in and out of the storage layer. These are the backbone of the whole decentralized infrastructure, and receive a high rate of $RIZ reward emissions as a result — as we mentioned before, 20% of total supply paid out over 30 months, with 2% of the supply airdropped at TGE.That’s why node licenses are required to run a zNode, and why demand for them is so strong. These licenses are non-transferrable for the first year, after which they can be freely traded (although with the rewards on offer, we’re not sure why you’d want to!).Besides those, the Rivalz network also features rNodes (worker nodes) which provide the actual data storage space for the network. These don’t require a node license to run, but pay out a much lower level of rewards as a result.The programmability and inter-chain compatibility of the Rivalz RollApp means that developers will be able to build their tech directly on top of the protocol in order to access its AI data infrastructure. To showcase the power and potential of this system, Rivalz are also developing their own pair of flagship applications which harness the power of their DePIN system.The first is Agentz: a ‘cross-chain infrastructure AI agent hub’ which enables intelligent programs such as AI trading bots to access the datasets of the Rivalz DePIN storage layer, and operate cross-chain through integration with the Axelar Network.The second is Clonez: the platform where users can ‘license themselves to the world of AI’ by consensually submitting personal data through the platform (including even their voice or likeness), to be indexed on the Rivalz DePIN. AI firms will then be able to license this data from a central marketplace, with users receiving payouts whenever their information is used.In future, each of these flagship Rivalz DApps will get its own deep dive. For now, suffice to say we’re excited about the possibilities that their platform opens up for the next wave of innovative AI-powered applications!The $RIZ token is the native utility token of the Rivalz network. It will be used for transaction fees on the network, paying out rewards to node operators, and be integrated with DApps building on top of the Rivalz RollApp.The token will go live with the launch of the mainnet in Q3 2024, at which point every node license holder will receive a share of 2% of the total $RIZ supply airdropped to their wallets. This airdrop will be 100% unlocked from day one!Rewards for node operators will also be paid out using the token, in the form of $sRIZ (staked RIZ). When claiming their rewards, operators will be able to choose a vesting schedule of 60, 90, or 120 days for their tokens — with greater payouts for longer vesting.Aside from the $RIZ token, zNode operators will also enjoy airdrops from partner projects which build on top of the Rivalz network in future, meaning potential exposure to a wide range of innovative AI projects in the months and years to come.Now that you understand why Rivalz is such a strong AI infrastructure play, let’s dive into the details on how to get involved…Node sales are structured a little differently to standard IDOs, with multiple different price tiers offered. This pricing structure means that those who get in early enjoy the best prices, while latecomers are forced to FOMO in at a much higher cost.The total supply of Rivalz node licenses is 68,000. These are split across 20 tiers, each with a different price. However, regardless of price, all node licenses are exactly the same. You can see the breakdown of the price tiers for the entire campaign here:We at Samurai Starter have been able to secure 400 node licenses for our community at great prices: 200 at Tier 3 and 200 at Tier 4. On top of that, we’ve even managed to secure a 10% discount on the listed prices!This means that we’ll be offering 200 nodes at $536 and a further 200 nodes at $616 — some of the best prices possible.These two different price points mean that those who participate fastest will enjoy the best prices. Read on to make sure you don’t miss out…We’ll be splitting the sale into two rounds. These will be similar to the ‘guaranteed’ and ‘FCFS’ rounds from previous sales.For details on the total number of nodes each person can buy in each round, check this quick reference chart:Both price tiers of zNode will be available to buy from the start of Round 1 on a FCFS basis. On the launchpad page, you’ll be able to select the number of nodes you wish to purchase at each price point, and the system will automatically calculate how much USDC to charge.Those who participate the fastest will be able to secure their nodes at the cheaper price point. Once those cheaper nodes are sold out, their input box will be greyed out.You’ll be able to participate in this sale much like any other raise on Samurai Starter:It’s that simple. However, remember that you’ll need to be quick on the trigger: the first 50% of participants will enjoy a cheaper price!And that’s really all there is to it . Now you have a solid understanding of what Rivalz is all about, the value of their zNodes, and how to get your hands on them during our sale.We could spend 10,000 more words diving deeper and deeper into the Rivalz tech — we’ve really only scratched the surface today! If you’re interested in learning more, follow the links below to dive into their socials and docs. You’ll no doubt find even more reasons to be bullish.After that, we’ll see you on the launchpad at 11:00 UTC on Monday!Website: rivalz.aiX: x.com/Rivalz_AITelegram: https://t.me/RivalzAI_AnnDiscord: https://discord.gg/rivalzaiSamurai Launchpad: https://samuraistarter.comSamurai Community Chat: https://t.me/SamuraiStarterSamurai Announcements: https://t.me/samurai_starter_annSamurai Medium: https://medium.com/samurai-starterSamurai LinkedIn: https://www.linkedin.com/company/samurai-starter/Samurai Twitter: https://twitter.com/SamuraiStarterSamurai Warpcast: https://warpcast.com/samurai-starter","creation_date":"2024-05-03","tags":["Cryptocurrency","AI","Node","Blockchain","Launchpad"],"author":"TCC Cal @ Samurai Starter","category":null}