{"id":"e5695ca3-369d-4fe9-83ca-cb914f43b342","article_link":"https://medium.com/@orion0serg/weird-friends-litepage-5df815efb61e","website_source":"Medium","article_type":"Tweet","summary":"ECONOMIC MODEL: Weird — token of the Weird Friends project, Neutron network. Total token supply 2000000 $WEIRD.","title":"WEIRD FRIENDS LITEPAGE","detailed_content":"ECONOMIC MODEL:\nWeird — token of the Weird Friends project, Neutron network. Total token supply 2000000 $WEIRD.1000000 Weird tokens are allocated to the NFT Weird Friends treasury. Also, a pool of 1000000 Weird tokens is created on the nftgang platform, these tokens are distributed to users as rewards for participating in staking on the platform https://nftgang.net/Collections/WeirdFriends/ The staking scheme is 1 NFT Dark Shadow + 1–20 NFT Weird Friends. The reward depends on the number of NFTs sent to staking and the time they are held (1 WEIRD token per 1 NFT Weird Friends per day, currently not accounting for NFT rarity).*Responsibility for the security of tokens and NFTs on the nftgang platform lies with the nftgang team.Tokens (1000000 WEIRD) in the NFT Weird Friends treasury:LIQUIDITY INCREASE:This will help maintain stability and accessibility of liquidity, as well as increase the value of WEIRD and PHMN tokens.*Any changes are possible through joint decision-making by SubDao participants.AIRDROPS AND WEIRD TOKEN BURN MECHANISM:*Responsibility for token burning lies with the nftgang team.*Any changes are possible through joint decision-making by SubDao participants.SUBDAO NFT WEIRD FRIENDS:*Changes in the membership criteria for SubDao are possible through joint decision-making by SubDao participants.PARTNERS:It is possible to allocate funds from the SubDao treasury to partners for agreements on distributing airdrops or WL for our community.LINKS:Weird Friends on Stargaze — https://www.stargaze.zone/m/stars1ufjxnat78ftny4jmmcyujd0w00kt5ktvk4xpgmge4czja2dyn8tqpcn7ja/tokensDark Shadows on Stargaze — https://www.stargaze.zone/m/stars1m3swrmg20v4cfnugtv4w2dz2k3l3sgahyyxenrt5fvgxd98r58gqhrtrlr/tokensStake on NFTGANG — https://nftgang.net/Collections/WeirdFriends/ SubDao — https://daodao.zone/dao/juno1htezk0nukqah65d9qn9xg7cvk0pd4207farr0lldjjt5f2qhk9hqnlp7nxTwitter — https://twitter.com/s__orionTG Chat — https://t.me/+ZUfWNgBD2l03ODAy","creation_date":null,"tags":["Gemstone","Blockchain","Cosmos","Blockchain Technology","Nft"],"author":"orion","category":null}