{"id":"e5787679-c21c-4328-821c-bfde6e8453a2","article_link":"https://cointelegraph.com/news/crypto-mixing-not-crime-crypto-quant-ceo","website_source":"Cointelegraph","article_type":"News Article","summary":"The arrest of the founders of Samourai Wallet led to widespread concerns in the crypto community that the U.S. government was attempting to crack down on the industry.","title":"Crypto mixing is ‘not a crime,’ says CryptoQuant CEO","detailed_content":"Crypto mixing services are not a crime, wrote Ki Young Ju, the founder and CEO of CryptoQuant, in response to the recent arrest of the Samourai Wallet founders.\nThe United States Department of Justice (DOJ) has arrested pioneers in Bitcoin privacy, according to Ki, who wrote in an April 25 X post:\n“Privacy stands as a core value of Bitcoin. Mixing itself is not a crime. Even crypto exchanges use mixing to safeguard user privacy. It's like punishing the inventor of the knife instead of the one who uses it.”\nOn April 24, Cointelegraph reported that cryptocurrency wallet Samourai Wallet CEO Keonne Rodriguez and chief technology officer William Hill will each face one count of conspiracy to commit money laundering and one count of conspiracy to operate an unlicensed money transmitting business.\nThe arrest caused widespread concerns in the crypto community, as participants feared that it could signal another U.S. government attempt to crack down on the industry.\nNSA whistleblower Edward Snowden called the arrests an attack on financial privacy, in an April 24 X post:\n“The Department of ‘Justice’ has once again criminalized the developers of an app that restores financial privacy. The way to fix this is to make money private by default. Privacy must never be ‘exceptional,’ or they will make it criminal.”\nThe DOJ alleged that Samourai Wallet “executed over $2 billion in unlawful transactions and facilitated more than $100 million in money laundering transactions from illegal dark web markets.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOthers also perceived the enforcement action as a crackdown on financial privacy from the DOJ, including crypto analyst Ryan Adams, who stated in an April 24 X post:\n“These developers face up to 25 years in prison for writing code. The US is sending a message. No transaction will be private.”\nThis isn’t the first time that authorities are cracking down on privacy-preserving technologies like cryptocurrency mixers.\nIn August 2023, the U.S. DOJ charged the developers of crypto mixer Tornado Cash with money laundering, sanctions violations and operating an unlicensed money transfer business.\nThe three developers, including Alexey Pertsev, were arrested in August 2022, days after the U.S. Treasury sanctioned Tornado Cash for allegedly being used by the North Korean Lazarus Group to launder over a billion dollars worth of crypto.\nTornado Cash fallout: What does it mean for Ethereum? Source: Cointelegraph\nRelated: Runes are offering a significant lifeline for Bitcoin miners — TeraWulf CEO\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-26","tags":["#Blockchain","#Privacy","#Edward Snowden","#Department of Justice","#Regulation","#Tornado Cash"],"author":"by Zoltan Vardai","category":null}