{"id":"e5f06ac6-bc58-4190-a66e-5cc6c392b6d1","article_link":"https://cointelegraph.com/news/memecoins-good-social-signaling-avalanche-founder","website_source":"Cointelegraph","article_type":"News Article","summary":"Emin Gün Sirer believes memecoins have become an entertaining entry point for crypto-curious newcomers but remain risky investments.","title":"What are memecoins good for? Social signaling, says Avalanche founder","detailed_content":"Love them or hate them, memecoins are all the rage in 2024. Despite the inherent risks of aping a new coin, Avalanche founder Emin Gün Sirer believes they are bringing value and new users into the cryptocurrency ecosystem.\nSpeaking exclusively to Cointelegraph report Ezra Reguerra at Token2049 in Dubai, Gün Sirer weighed up the benefits and drawbacks of the rise of memecoins across several blockchain protocols. From Bitcoin, Ethereum, Solana to Avalanche, memecoins have made fortunes and ruined portfolios in recent months.\n“They’re great for the space because they bring people in, they keep them excited, occupied and concentrated on what the technology can do,” Gün Sirer said.\nThe CEO of Ava Labs conceded that many critics argue that memecoins bring no value to the ecosystem, just as the rise of nonfungible tokens had detractors. Gün Sirer said their value is not tied to the prospect of making fortunes but to attracting newcomers to the space.\nCointelegraph's Ezra Reguera (l) alongside Emin Gün Sirer at Token2049 in Dubai. Source: Cointelegraph\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“As someone who is very conservative financially and has been in this space for a very long time, I spent a fair bit of time criticizing Dogecoin and Shiba Inu. But you realize after a while that memecoins serve a purpose, and that purpose will not be obvious to boomers,” Gün Sirer said.\nThe former Cornell University professor sees memecoins as an opportunity for younger, risk-taking crypto enthusiasts to signal their aptitude for betting on the right projects.\n“What is that purpose? That purpose is social signaling. In the same way that some people use a Bored Ape Yacht Club NFT as a profile picture, they’re saying I made so much money off trading that I can afford this,” Gün Sirer explained.\nThe Ava Labs CEO said that most memecoin traders are not holding tokens long-term and that the nature of the emergent trend relies on the ability to constantly adjust to the movement of value between different memecoins.\n“They don’t see it as an investment in that fashion. They see it as a transitory phase. It’s like riding a bike. It’s a dynamic equilibrium. you have to constantly make corrections.”\nGün Sirer conceded that luck also plays its part as traders jump from coin to coin. “You have to be at the forefront of that community movement. You have to guess right. It’s not easy to do, and not everyone can do it,” he said.\nThis is also why memecoins have “such a premium associated” with people who understand these memes and act early on projects. Gün Sirer said Avalanche has attracted a thriving memecoin culture on its protocol.\nThe founder said the Avalanche Foundation was one of the first cryptocurrency ecosystem players to endorse memecoins and wants to see the community grow publicly. He cited an influx of users to Avalanche as a direct result of memecoins.\nMagazine: Get Bitcoin or die tryin’: Why hip hop stars love crypto\nExchange or buy AVAX\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-19","tags":["#Blockchain","#Adoption","#Avalanche"],"author":"by Gareth Jenkinson","category":null}