{"id":"e626ca9f-752f-405e-9f4f-decd3273c4b6","article_link":"https://cointelegraph.com/news/defi-whales-millions-stuck-forgotten-bridge-contracts","website_source":"Cointelegraph","article_type":"News Article","summary":"One of the wallets includes $1.05 million worth of funds stuck in the Optimism bridge contract, which previously received ETH from Vitalik Buterin.","title":"DeFi whales have millions ‘forgotten’ in bridge contracts: Arkham","detailed_content":"Several identified crypto addresses have millions of dollars either “stuck” or “forgotten” about in at least two large bridge contracts, according to blockchain intelligence firm Arkham.\n“There are dozens of accounts with 6-7 figures stuck in bridge contracts, forgotten about,” said Arkham in an April 22 X post., including wallets connected to Ethereum co-founder Vitalik Buterin, crypto exchange Coinbase, and several DeFi whales.\nThe firm attached two screenshots of fund transfers to and from the Arbitrum and Optimism bridges to support their case.\nSource: Arkham Intelligence\nArkham noted a wallet that received 50 Ether (ETH) from Buterin has had $1.05 million stuck in the Optimism bridge for seven months now. If the address is owned by Buterin, it would represent a small fraction of his $789 million cryptocurrency portfolio, according to Arkham’s data.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAnother wallet linked to Bofur Capital, which shares the same name as a Celsius creditor, has $1.8 million in wrapped-Bitcoin (WBTC) stuck in the Arbitrum bridge, which hasn’t moved in 27 months, while Thomasg.eth — the pseudonymous founder behind decentralized air transportation solution Arrow — has $800,000 in Ether stuck in the Arbitrum bridge.\nFurthermore, Coinbase tried to bridge $75,000 in USD Coin (USDC) to Ethereum six months ago via the Optimism bridge, but it hasn’t been claimed on Ethereum’s base layer yet, Arkham said.\nRelated: Wormhole bridge hacker from 2022 was briefly eligible for the recent airdrop\nThere is, however, also a possibility that the owners behind these wallets still have complete control of the funds and have voluntarily chosen to park the funds there for the time being.\nCross-chain bridges play an important part in modular blockchain networks like Ethereum, which prioritizes data availability and security on the base layer and offloads transaction responsibilities to layer 2s.\nHowever, bridges have become a honeypot site for hackers, as they are often automated by potentially vulnerable smart contracts or a highly centralized validator set.\nFor example, the $650 million Ronin bridge hack orchestrated by North Korea’s state-backed Lazarus Group came after it obtained access to five of the nine private keys held by transaction validators in March 2022.\nMagazine: ‘SEAL 911’ team of white hats formed to fight crypto hacks in real time\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-23","tags":["#Bitcoin","#Blockchain","#Coinbase","#Smart Contracts","#Ethereum","#Vitalik Buterin","#Hackers","#Private Keys","#Hacks","#DeFi","#Arbitrum"],"author":"by Brayden Lindrea","category":null}