{"id":"e75931c9-2e73-478a-8d65-aa951108ac5e","article_link":"https://medium.com/@jade-ordinals/defining-the-defi-future-jade98-platform-mechanics-b81a71a84ad8","website_source":"Medium","article_type":"Blog Post","summary":"Ordinals. The Origin","title":"Defining the DeFi future - Jade98 Platform Mechanics","detailed_content":"Ordinals became a significant game changer in the NFT segment in 2023. Since their introduction on the Bitcoin blockchain, the daily inscriptions have shown a consistent increase. As of now, there have been a total of 66,348,042 inscriptions.Ordinals introduced an innovative approach to creating NFTs, meme tokens, and other digital assets on the Bitcoin blockchain. However, it caused lots of discussions within the community. Ordinals utilize inscriptions to store content directly on the blockchain, leading to skepticism among many users about its overall benefit to the ecosystem. Concerns were raised that the block space occupied by these NFTs could potentially increase fees and reduce transaction speeds.Over time, it became clear that Ordinals have become a crucial component of the Bitcoin blockchain, laying the foundation for their integration into decentralized exchanges, lending protocols, and yield farming platforms.Michael Saylor, the founder of MicroStrategy, stated, “Bitcoin-NFT technology has the potential to foster innovation in the digital asset market.” He also mentioned that the creation of applications and further development of the blockchain would accelerate its mass adoption. As observed, the number of application inscriptions grew significantly in 2024.Taking that into account, it was only a matter of time before Ordinals and immersive augmented reality (AR) merged.The Jade98 platform introduces the first-ever AR inscriptions (Jade ARdinals), set to redefine the standards of digital collectibles. It was created to enhance efficiency, transparency, and unique user engagement in the DeFi segment.With the Jade98 platform, you can not only upgrade your existing BRC collections but also craft ARdinal collections right from scratch.Let’s explore the groundbreaking Jade98 platform, which allows its users to create Jade ARdinals and earn rewards for their activity.To understand the whole Jade98 Platform ecosystem, it’s important to learn the main functionality of its basic element.The JD98 token is the cornerstone of the entire ecosystem. It facilitates payments for core functionalities, such as using AR technologies, on the platform. Creators also receive staking rewards in $JD98 tokens.Its primary utility is to support commissions and transactions throughout the platform, serving as its vital lifeblood.At the heart of Jade98 platform lies the concept of epochs — fixed intervals of time 1999998 sec. At the end of each epoch, significant events occur, such as stakers receiving their JD98 rewards or the burning of the revenue treasury.Check out the detailed scheme of the platform below:These are the main tokenomics processes that maintain the functionality and financial payback of the system. Unlike the tokenomics of many other DeFi platforms, all processes on the Jade98 Platform are fully transparent, with no hidden pitfalls.Now, let’s review each of these processes individually.Central to Jade’s platform revenue model is the provision of augmented reality (AR) services. You have the freedom to craft an exciting ARdinal collection from scratch, complete with all metadata. Overall, you get the full package: create your AR, mint it on the blockchain, and showcase your unique digital masterpiece.For these innovative opportunities, users pay a service fee in BTC upon initiating the mint transactions (similar to Luminex/Unisat inscription service).This revenue is collected in the platform’s treasury for subsequent distribution through various mechanisms: rewards pool for stakers, Buyback and Burning mechanism, and other processes that ensure sustained growth and profitability of Jade98 platform.Another important feature of Jade98 platform is the Buyback and Burning mechanism, wherein 20% of incoming revenue is allocated towards purchasing $JD98 tokens from the market.The process is depicted in detail in the upper part of the whole Jade98 platform tokenomics scheme.As you see, the Service Revenue users pay for ARdinals creation is then converted to JD98 for the further Burning and then accumulated in the Burning Treasury to be systematically burned at the end of each epoch. The system sends them a Bitcoin Eater address, thereby enhancing the token value.Stakers on the platform can enjoy multiple avenues for staking, enabling them to extract tokens from circulation and lock them within the platform in exchange for a share of profits generated during the epoch.As you can see from another part of the tokenomics scheme, there are several ways of staking available.In this case, you’ll receive your rewards at the end of the epoch.For the Jade Pair Staking, you’ll need to get an ARdinal from Jade ARdinals Collection. This will increase your rewards by staking a special Jade ARdinal with JD98$.The payment amounts and, accordingly, the APY indicator are affected by:Initially, Simple Staking will be developed and launched using a simplified formula. Over time, it will be enhanced by refining the formula and adding additional assets for boosting.At the end of each epoch, rewards from the previous epoch are calculated and disbursed from the Reward Pool in $JD98 tokens. Thus, new rewards are sent to users every 23 days. Regular revenues enable you to redistribute your income correctly and reinvest a portion for additional earnings.Users have the option to receive payouts directly to their addresses or initiate transactions to claim their rewards, with the latter option to minimize transaction fees.Additionally, accrued rewards incur compound interest if left unclaimed.At Jade98 Platform, we strive to develop the effective and transparent tokenomics system that will not only enhance AR/VR functionality but also contribute to our users’ success and increase their income.The groundbreaking integration of AR services with Ordinals will boost the incorporation of the Bitcoin blockchain into the DeFi sector and its mass adoption worldwide. This represents a perfect new direction for immersive, real-world applications to develop and a powerful means to foster a sustainable digital economy.Follow our X(Twitter) to get more information about upcoming events.Join Telegram chat for discussions.","creation_date":"2024-05-02","tags":[],"author":"Jade ARdinals","category":null}