{"id":"e830d542-0af8-4897-89b3-66d80e5d29a4","article_link":"https://cointelegraph.com/news/financial-system-outdated-crypto-no-fix-either-us-swing-voters","website_source":"Cointelegraph","article_type":"News Article","summary":"In a survey by the Digital Currency Group, 70% of swing state voters agreed the current financial system is “outdated” and in need of an overhaul, but most don’t think crypto is the answer either.","title":"Financial system ‘outdated’ but crypto is no fix either — US swing voters","detailed_content":"The majority of voters in swing states in the United States say the financial system is “outdated” but agree crypto may not be the solution either, a survey reveals.\nThe study, conducted by the Digital Currency Group and the Harris Group, surveyed 1,201 people in six “swing states” — a term given to states that could be won by either the Democratic Party or Republican Party in a statewide election.\nCointelegraph’s earlier reporting found that over 90% of these respondents plan on voting in the upcoming U.S. election and that a politician’s crypto stance could play a key role in their choices.\nHowever, while 70% of the surveyed voters agreed that the current financial system is “outdated” and 74% say the system needs an “overhaul,” only a third of respondents agreed crypto could solve this problem, the May 7 report found.\nFour out of five participants said the current financial system favors the elites over regular people, but nearly 75% of respondents said crypto isn’t more equitable than the current system either.\nOnly 41% of swing voters agree that crypto represents a new way toward financial security and prosperity, while 35% believe crypto is the future of transacting.\nParticipants’ views on the current financial system and whether crypto can solve those problems. Source: Digital Currency Group, the Harris Group\nHowever, there was a large discrepancy in answers between those who own crypto or have owned crypto in the past and those who have never touched it.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMore than 90% of current crypto owners plan to buy more coins or maintain their portfolios over the next six months, while only 7% of non-crypto owners plan to invest in the asset class in that time.\nAbout 76% of voters who hold or have held crypto said it positively impacted their financial well-being.\nRelated: Crypto voters could provide ‘key swing’ in 2024 US elections: CCI poll\nThe participants — from Michigan, Nevada, Ohio, Montana, Pennsylvania and Arizona — took part in a 10-minute online survey conducted between April 4 and 16, 2024.\nParticipants had to reside in the United States, be at least 18 years old and be registered to vote to participate.\nThe survey also found that swing voters do not trust political candidates who are interfering with cryptocurrency developments, particularly those who don’t understand how the technology works.\nMagazine: Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-08","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Banking","#Adoption","#Survey","#United States","#Cryptocurrency Investment"],"author":"by Brayden Lindrea","category":null}