{"id":"e8e3a279-ad80-449e-9abf-dc4ceb42c9df","article_link":"https://cointelegraph.com/news/bankrupt-voyager-484-35-m-creditor-repayment","website_source":"Cointelegraph","article_type":"News Article","summary":"This secured fund, including interest, accounts for about 25% of Voyager creditors’ aggregate claims and is anticipated to be disbursed shortly.","title":"Bankrupt Voyager platform secures $484M for creditor repayments","detailed_content":"Bankrupt crypto firm Voyager Digital has made progress toward compensating its creditors by securing $484 million through settlements with FTX, Three Arrows Capital (3AC) and Directors and Officers (D&O) insurance claims. This marks a significant milestone in the company’s financial recovery and creditor reimbursement efforts.\nIn an April 9 filing in the United States Bankruptcy Court for the Southern District of New York, Voyager disclosed that the majority of the reclaimed funds, roughly $450 million, stem from a settlement with FTX.\nVoyager filed for Chapter 11 bankruptcy in July 2022 as the crypto market suffered several shocks, including the collapse of the Terra ecosystem in May.\nIn October 2023, the U.S. Commodity Futures Trading Commission and the Federal Trade Commission (FTC) filed parallel lawsuits against former Voyager CEO Stephen Ehrlich for fraudulent statements.\nThis settlement, including interest, accounts for about 25% of Voyager creditors’ aggregate claims and is anticipated to be disbursed shortly.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nIn addition to the FTX agreement, Voyager has obtained a claim of approximately $675 million from its ongoing litigation with Three Arrows Capital. Of this amount, $20.43 million represents Voyager’s proportionate share of the initial distribution from 3AC.\nThe administrator expects additional payments to be disbursed in the coming years as assets are sold off and further litigation settlements are secured. A settlement reached through D&O insurance mediation will also allocate at least $14.35 million to benefit Voyager’s creditors.\nRelated: Former SEC official compares Dallas Mavericks’ Voyager partnership to heroin\nAs Voyager progresses through its financial recovery journey, the company faces operational hurdles, including many uncashed checks. Around 270,000 checks totaling $17 million remain uncashed, with the majority valued at less than $25.\nVoyager has set a deadline of April 20, after which these uncashed checks will be voided if not claimed.\nVoyager is also still dealing with the repercussions of an FTX data breach. An investigation is being conducted to identify the origin and consequences of the breach, which resulted in the compromise of creditor data.\nAs of May 2023, a restructuring plan proposed having Voyager customers recover 35.7% of their claims in cryptocurrency or cash. The crypto exchange settled with the FTC for $1.65 billion in monetary relief in November 2023.\nMagazine: Billions are spent marketing crypto to sports fans — Is it worth it?\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-11","tags":["#Blockchain","#Law","#Business","#Bankruptcy","#Cryptocurrency Exchange","#FTX"],"author":"by Amaka Nwaokocha","category":null}