{"id":"eb46be4c-964c-4daf-945e-31c40debfea9","article_link":"https://cointelegraph.com/news/binance-cofounder-dwf-labs-speaks-out-against-market-manipulation-allegations","website_source":"Cointelegraph","article_type":"News Article","summary":"Both firms deny any involvement in the allegations brought forth by The Wall Street Journal.","title":"Binance co-founder and DWF Labs speak out against market manipulation allegations","detailed_content":"Amid new allegations of market manipulation brought by The Wall Street Journal, both Binance co-founder Yi He and market make DWF Labs have denied any involvement. \nIn an X post on May 9, He described the media report as an occurrence that “greatly increased our exposure and saved us a lot of marketing budget.” However, the co-founder denied any of the allegations made against Binance, writing: \n“I have noticed an interesting phenomenon where some mainstream media articles are increasingly driven by emotions and biases rather than facts. For example, the complaints of former employees can become the basis of an article, while Binance’s proactive assistance to law enforcement agencies in investigating and apprehending the mastermind behind Zkasino (as a matter of fact) is not deemed worthy of reporting.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nIn a similar post the same day, DWF Labs said the allegations were “unfounded and distort the facts” and that the firm “operates with the highest standards of integrity, transparency, and ethics, and we remain committed to supporting you and our over 700 partners across the crypto ecosystem.” \nEarlier on May 9, a Wall Street Journal report claimed that DWF Labs, one of Binance’s largest trading clients, engaged in market manipulation, wash trading and inflated trading volumes amounting to $300 million through deals with crypto projects. After the exchange’s surveillance team recommended offboarding the client, Binance allegedly sided with DWF Labs and fired the investigator, arguing insufficient evidence for the claim.\n“We affirm our strict market surveillance program [and] do not tolerate market abuse,” He commented. “Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use,” He added, continuing: “Market maker competition is fierce, and our investigation team’s job is to be neutral and look at the evidence without any bias, including bias that might come from market-making firms’ claims against their competitors.”\nDWF Labs is a prominent trading firm in the crypto industry. Founded by Andrei Grachev in 2021, the firm invests in promising projects and provides long-term financial support. \nRelated: Binance denies reports of DWF Labs market manipulation\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Cryptocurrencies","#Business","#Binance"],"author":"by Zhiyuan Sun","category":null}