{"id":"eb62a0d5-a257-41f2-97d5-604db6d431d3","article_link":"https://medium.com/@theoldcastledefense/fomo-airdrop-on-the-base-blockchain-how-to-get-more-benefits-in-the-old-castle-defense-tocd-3d4ce5b415cc","website_source":"Medium","article_type":"Blog Post","summary":"The Old Castle Defense (TOCD) marks a revolutionary moment in the world of blockchain gaming with the release of the $FOMO token, points","title":"$FOMO Airdrop on the Base blockchain: How to get more benefits in The Old Castle Defense (TOCD).","detailed_content":"The Old Castle Defense (TOCD) marks a revolutionary moment in the world of blockchain gaming with the release of the $FOMO token, $FOMO points, and Farcaster Tipping system. Based on a unique points distribution system, $FOMO is a token with Fair Launch and Equal distribution between active participants and players of TOCD Studio. TOCD Studio brings an additional utility to $FOMO in order to gain more — you can stake your $FOMO and fight for more $FOMO.$FOMO Points are distributed to our Early Contributors — OGs for:And the most important thing is that this time you are here in time so as not to miss the benefit!To ensure a fair distribution of points, TOCD implements a system that adapts to the outcomes of games:2% of Free Points are distributed for each winning Siege until all 10 million points have been awarded.In the event of one team’s dominance (e.g., a score of 41:0), the system adjusts the number of distributed points to ensure balance and prevent disproportionate accumulation of rewards.This system rewards not just victory but encourages participation in creating a captivating and competitive gaming environment.Total Supply: 100,000,000$FOMO Token is supported by BuyBacks & Burn to sustain the economy and make tokens difficult to acquire.Have $FOMO instead of FOMO.$FOMO tokens are distributed among $FOMO Points holders at the end of each month and the volume of rewards will depend on the amount of $FOMO points accumulated. This makes every step you take in the game important, every action — significant, as they will determine your share in the overall “pie” of $FOMO tokens. We will announce the exact date of distribution so that no one participant misses their chance to become part of TOCD’s and $FOMO history.Once you claim your $FOMO Tokens, your $FOMO points balance becomes 0, but $FOMO Tip allowance will stay the same and refreshed as you’re the part of ecosystem and should choose wisely who in your mind is unique and should be rewarded.Check your Eligibility for the Airdrop in the Google Sheets.\nhttps://docs.google.com/spreadsheets/d/1HvippGZjZ2rtRBeXb1AXKVXVMZ2c5Z9Kgc99x7fdOi0/edit#gid=0Do you want more $FOMO?Joining TOCD and actively participating in its ecosystem has never been more appealing. With the introduction of $FOMO, every action you take brings you closer to a reward that will be determined by your actions. This is your chance to make your mark in TOCD history and receive the rewards you deserve.Stay tuned for announcements to not miss the $FOMO distribution date and maximize your points before then. In TOCD, every step you take brings you closer to rewards, making every action and every point part of your journey to success.Don’t miss your chance to be part of this unique story!Best regards,\nYour Beloved Team of The Old Castle DefensePrev. Articles:\n• The Old Castle Defense Development Update –19/03/2024–https://medium.com/@theoldcastledefense/the-old-castle-defense-development-update-19-03-2024-launch-of-the-fomo-points-token-on-base-8fa8eb4949b2\n• How to Acquire TOCD NFT and Earn for Free?–04/03/2024–https://medium.com/@theoldcastledefense/how-to-acquire-tocd-nft-and-earn-for-free-d22745b66f97","creation_date":"2024-04-03","tags":["Fomo","Staking","Airdrop","Blockchain"],"author":"The Old Castle Defense(TOCD) - High Yield Staking","category":null}