{"id":"ec0e6691-9bad-4c65-853b-156f7a92258b","article_link":"https://medium.com/@shibarimoto/earn-karma-with-a-sora-chameleon-01b25c12fd49","website_source":"Medium","article_type":"Blog Post","summary":"TL;DR","title":"Earn Karma with a SORA Chameleon","detailed_content":"Important upgrades to the SORA tokenomics are under way and an exciting part of this is going to be Chameleon liquidity pools on Polkaswap. These are special liquidity pools where Kensetsu XOR (a Kensetsu asset that will be pegged to XOR) will be able to act just like real XOR and be able to swap for assets. Why this matters will become apparent as more parts of the tokenomics are released in the coming weeks, but initially this will be enabled for the XOR-ETH liquidity pool on Polkaswap.Just as the initial KEN supply was determined by burning XOR for KEN, a burn-drop will be done for $KARMA tokens. This time the rate will be 100 million XOR burnt for 1 $KARMA, making it the ultimate status symbol. Just imagine the look on the ladies faces when you pull out your Fearless Wallet and show them that you have a the full girth of a $KARMA token sitting there. Burning more than 100 million XOR will get you proportionally more $KARMA tokens, but burning less than 100 million XOR will get you nothing! You have between blocks 15,739,737 and 16,056,666 to burn your XOR to count towards the $KARMA burn-drop.$KARMA is a farming reward token meant to incentivize liquidity for Chameleon pools on Polkaswap (initially XOR-ETH). For each Kensetsu XOR minted from collateralized deposited, 1% extra of the KXOR stablecoin will be minted and used to buy back and burn $KARMA tokens. 80% of the burned $KARMA tokens will be reminted and distributed to Demeter farm for farming rewards on the Chameleon pools (initially XOR-ETH only) on Polkaswap.Kensetsu XOR will be explained in future articles, but let’s just say that there will likely be a whole lotta Kensetsu XOR created in the future.To up the stakes, to get an allocation of the initial $KARMA supply, you will literally have to burn money by burning XOR, the sexiest money there is.Burning XOR for fun and profit can be done using the nifty dotapps interface. Just click on this link, and fill out the form as follows:To fill out the form:Then sign the transaction and confirm that your XOR balance went down correctly, showing you burned the XOR.All XOR burned by calling the assets.burn extrinsic between blocks 15,739,737 and 16,056,666 will be considered in the calculated burned amount. To be eligible for the $KARMA drop, at least 100 million XOR should be burned by an account. 1 $KARMA will be given for each 100 million XOR burned.For example, if 99,999,999 XOR are burned, 0 $KARMA will be given to an account. If 100 million XOR are burned, 1 $KARMA will be given to an account. And if 169 million XOR are burned, then 1.69 $KARMA will be given to an account.So get out there and earn your $KARMA!SORA $KARMA Chameleon is just the first step towards the SORA v3 tokenomics. The hottest parts are still coming.","creation_date":null,"tags":["Sora","Polkaswap","Polkadot","Kensetsu","Blockchain"],"author":"Satoshi Shibarimoto","category":null}