{"id":"ec3fa21e-970b-4850-a1a8-17dcd4d9f95a","article_link":"https://www.wired.com/story/do-kwon-terraform-terraform-labs-liable-civil-charges/","website_source":"Wired","article_type":"News Article","summary":"When Do Kwon’s crypto empire fell to pieces, tens of billions of dollars were wiped out. A civil jury in the US has found he lied to investors.","title":"Crypto Magnate Do Kwon Found Liable for Multibillion-Dollar Fraud","detailed_content":"A federal jury in New York has found South Korean crypto magnate Do Kwon—and his company Terraform Labs—liable for defrauding investors who collectively sank billions of dollars into cryptoassets whose value later fell to near zero.\nFiled in February 2023 by the Securities and Exchange Commission, a regulatory body responsible for protecting US investors, the civil complaint alleged that Kwon and Terraform had “perpetrated a fraudulent scheme that led to the loss of $40 billion of market value,” whereby they lied to investors about the prospects and stability of the cryptotokens they issued.\nKwon, who went into hiding after the tokens crashed in 2022, is facing criminal charges in the United States and South Korea. He was recently released on bail from a prison in Montenegro, where he was arrested last year and awaits extradition.\nFEATURED VIDEO\nExpert Explains One Concept in 5 Levels of Difficulty - Blockchain\nIn Kwon’s absence, the jury in the US civil trial in the Southern District of New York heard evidence from investors who bought into Terraform tokens, whistleblowers from companies with which Terraform partnered, and other witnesses. After a deliberation lasting less than two hours, the jury found Kwon and Terraform liable on civil fraud charges related to making false claims and misleading investors in Terraform’s cryptotoken.\n“We are pleased with today’s jury verdict holding Terraform Labs and Do Kwon liable for a massive crypto fraud,” said SEC Division of Enforcement Director Gurbir S. Grewal in a statement. “For all of crypto’s promises, the lack of registration and compliance have very real consequences for real people.”\nThe resolution of Kwon’s civil trial—along with the recent sentencing of Sam Bankman-Fried, founder of fallen crypto exchange FTX—will help to draw a line under a traumatic period for the crypto industry, says market analyst Noelle Acheson, formerly of crypto brokerage Genesis Trading. “Many feel hurt by what Do Kwon did. Those that invested feel betrayed,” she says. “Hopefully, people will be reminded to do more homework and ask better questions, to avoid getting drawn into rather flimsy claims again.”\nKwon started Terraform in 2018, alongside cofounder Daniel Shin. By 2020, the company announced plans to launch a stablecoin called TerraUSD (UST), whose value would remain pegged to the US dollar, ostensibly providing holders with a refuge from the volatility of other crypto assets.\nStablecoins are typically held to a specific value by an underlying basket of assets—including cash and short-term government bonds—for which they can be redeemed at any time. But UST, claimed Terraform, would be pegged to its dollar value by way of a complex algorithm, tying it to a second coin issued by the firm known as LUNA. If the value of UST were ever to diverge from $1, traders would theoretically be incentivized to either buy or sell the stablecoin until the target value was restored.\nAt the height of its popularity, in early 2022, LUNA was among the 10 largest cryptocurrencies in the world by the combined value of coins in circulation—and UST wasn’t far behind. “It was an intriguing and very novel mechanism,” says Acheson. “Many smart people believed it would work.”In May 2022, it all went wrong. When holders of large amounts of UST sold the token in bulk, it slipped from its dollar peg, leading to panic and a broader sell-off that drove the price practically to zero. LUNA and Terraform’s other coins were decimated along with it. “The mechanism was based on the faulty assumption that people would want it to self-correct and therefore it would,” says Acheson. “[Kwon] made marketing claims about the stability of stablecoins that weren’t true.”\nThe incident sent crypto markets into a downward spiral and catalyzed a chain reaction that brought a string of crypto companies to their knees. The failure of Terraform’s tokens contributed to the collapse of hedge fund Three Arrows Capital in June, followed by crypto lenders Voyager Digital, then BlockFi, then Genesis—and, in a roundabout way, FTX too.\nAfter the incident, Kwon fled Singapore, where Terraform was headquartered, for Dubai and then Serbia. He was later apprehended by authorities in Montenegro, where he was sentenced to four months in prison for attempting to leave the country on a fake Costa Rican passport. The kind of “hubris” displayed by Kwon, says Acheson, “has been part of the crypto ecosystem for some time.”\nThe SEC’s case was built around two core allegations: First, that Kwon and Terraform had misled investors about the capacity for UST to restore itself to a dollar valuation—to self-heal—without intervention; and second, that they had lied about Chai, a large Korean payments firm founded by Shin, utilizing Terraform technology to conduct its operations, leaving investors with an unmerited confidence in the prospect of widespread adoption.\nIn May 2021, after UST had fallen from its peg for the first time, the SEC alleged, Kwon struck a secret deal with trading firm Jump Trading, which agreed to purchase the token in large volumes until its value was restored to the target level. At trial, a whistleblower who had worked as a software developer at Jump Trading testified to that effect. (During the SEC investigation, the president of Jump’s crypto trading division declined to comment in a deposition, invoking his Fifth Amendment rights against self-incrimination. Jump has not been charged by the SEC.)\nAlmost as soon as Jump intervened to manually restore UST to its dollar valuation, the SEC claimed, Kwon and Terraform began to make misleading public statements, telling people the token “automatically self-heals” by design.\nA second SEC whistleblower, a former Chai executive, testified that the payments company did not process or settle transactions using Terraform technology, as Kwon had claimed. Instead, the SEC alleged, Terraform had artificially mirrored Chai transactions on its network to create the impression of legitimate traffic. It presented to the court messages between the two Terraform cofounders in which Kwon suggested they create “fake transactions that look real,” and promised to “try my best to make it indiscernible.”\nBoth strands of the SEC’s case were “extremely strong,” says Daniel Silva, a former US prosecutor and attorney at law firm Buchalter. “It’s easy when you have people lying. ‘Fraud’ is a fancy word, but really it’s just lying to gain property. And everyone understands lying is wrong—or at least that it can get you in trouble.”","creation_date":"2024-04-05","tags":["","CRYPTOCURRENCY","BLOCKCHAIN","CRIME","FRAUD"],"author":"BY JOEL KHALILI","category":null}