{"id":"ec8a49b0-c738-46f7-904a-7cde1a1dc540","article_link":"https://cointelegraph.com/news/an-atomic-swap-protocol-aims-to-bring-defi-on-bitcoin-without-wrapped-tokens","website_source":"Cointelegraph","article_type":"News Article","summary":"Although Ordinals injected new excitement into Bitcoin, layer 2 solutions are now showcasing their advantages over layer 1, with Bitcoin poised to welcome a new L2 DeFi ecosystem powered by atomic swaps.","title":"An atomic swap protocol aims to bring DeFi on Bitcoin without wrapped tokens","detailed_content":"AtomiqDeFi, powered by Mintlayer’s innovative atomic swap technology, aims to enhance interoperability, eliminate reliance on custodians and unlock new possibilities for decentralized finance on Bitcoin.\nCreating a decentralized finance (DeFi) ecosystem on Bitcoin\nBTC\n$62,974\nhad never gained mainstream blockchain adoption before the Taproot upgrade, which has opened the door to smart contracts —self-executing codes that eliminate intermediaries— on Bitcoin’s layer 1 blockchain.\nProjects like Ordinals introduced new capabilities to Bitcoin’s network and led to a surge in demand for Bitcoin’s DeFi functionality. Users began to realize that building on layer-1 had flaws, so developers began exploring layer-2 (L2) strategies to address the bottlenecks of building on layer 1. Although there were already solutions for Bitcoin DeFi using layer 2, most relied on Wrapped Bitcoin or wrapped tokens in general, which made it possible to use BTC across different blockchains.\nHowever, Wrapped Bitcoin and its derivatives required custodians for reserve management, undermining decentralized structures. The model also introduced counterparty risks and additional attack vectors, such as those seen in smart contract breaches on Poly Network, a cross-chain interoperability protocol.\nWrapped BTC may introduce additional possible attack vectors, counterparty risk and concerns about centralization. Source: AtomiqDeFi\nIn response to Bitcoin DeFi challenges, atomic swaps emerged, removing the need for wrapped tokens. Atomic swaps facilitate direct transactions between blockchains while ensuring simultaneous execution.\nOvercoming Bitcoin DeFi-related risks\nAs a Bitcoin L2 protocol, Mintlayer is developing the technologies to facilitate atomic swaps. Additionally, AtomiqDeFi, the first project incubated by Mintlayer, is developing a suite of decentralized applications (DApps) using Mintlayer’s atomic swap technology. These DApps will include the world’s first Atomic-Swap-powered decentralized exchange (DEX) on Bitcoin. Charlie Shrem, founder of the Bitcoin Foundation, expressed his excitement regarding the project, stating:\n“Exploring the frontiers of Bitcoin DeFi, Atomiq DeFi's DEX and its atomic swaps technology is nothing short of revolutionary. It's like we're opening a new chapter in the saga of blockchain evolution. Being one of the early believers in Bitcoin and Mintlayer, I can't help but feel a surge of excitement seeing our path now merging with the groundbreaking efforts of Atomiq DeFi. It's a thrilling time to be part of this journey.”\nAtomiqDeFi is building an ecosystem of tools, including a launchpad, a decentralized exchange (DEX), an end-user-focused wallet and a cross-chain bridge, all powered by the Mintlayer protocol.\nOne of the ecosystem’s products is the Atomiq DEX, which will be implemented in phases and allows users to trade Mintlayer-based tokens and BTC directly from their wallets. The first version of Atomiq DEX will enable same-chain atomic swaps. Later stages will allow the exchange of BTC and stablecoins for Mintlayer’s native token ML and assets that support Mintlayer standards. Lester Lim, founder of X21 Digital, praised Atomiq DeFi’s DEX, saying:\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\n“The introduction of Atomiq DeFi’s atomic swap-powered DEX marks a pivotal moment for Bitcoin. It’s a testament to the innovative spirit driving the DeFi space and a clear sign that Bitcoin’s untapped potential is finally being realized.”\nMintlayer offers the Atomiq Pad for initiatives looking to launch projects within the ecosystem. The platform assists projects seeking early-stage liquidity and offers token distribution as a solution to help kickstart their communities. It also aims to be compatible with the Lightning Network, an L2 payment channel for scalable transactions.\nBeyond AtomiqPad, the ecosystem hosts a noncustodial wallet called the Atomiq Wallet, which will support multiple cryptocurrencies and blockchain networks. With the wallet app, users gain complete control over their digital assets, including the ability to stake tokens to benefit, participate in governance and access DApps.\nThe Atomiq Bridge marks a strategic expansion for the team, aiming to boost the ecosystem by enabling easy transactions between Ethereum Virtual Machine (EVM) compatible chains. The project is pursuing partnerships with bridge providers like Layer0 and Wormhole to help speed up integration with the Mintlayer protocol.\nFunded and comprised of Bitcoin industry experts\nAt the helm of Atomiq DeFi is Zaid Ismail, who is transitioning out from his role as the chief operating officer of Mintlayer to the founder and CEO of Atomiq DeFi. Zaid’s journey from AI-driven healthcare innovation in New Zealand to working on enterprise automation platforms laid the foundation for his role in blockchain technology. Under his leadership, Atomiq DeFi became the first project to receive $1.5 million from the Mintlayer Ecosystem Fund, marking a step toward unlocking Bitcoin’s DeFi capabilities.\nAtomiq DeFi secured its lead investor, X21 Digital, during a $3 million seed round that is closing soon. The current seed round includes prominent venture capital firms, such as NXGen, Dutch Crypto Investors (DCI Capital), Spicy Capital, Altcoin Buzz and the AlphaBit fund run by Liam Robertson. Additionally, Atomiq DeFi’s advisory board gains insights from Lester Lim of X21 and Charlie Shrem of the Bitcoin Foundation, who aim to help steer the project to success.\nAs Atomiq DeFi gears up for its next phase, the project is in advanced discussions with tier 1 launchpads — with announcements on the horizon. The Bitcoin DeFi space is tight, and Atomiq DeFi decided to collaborate in strategic partnerships with projects including SatoshiSync, Portal and OrdinalsBot, further enriching the Bitcoin ecosystem.\nBitcoin-centric DeFi ecosystem fund\nIn addition to powering AtomiqDeFi’s growth, Mintlayer Ecosystem Fund offers an incubator, accelerator and grants programs for Bitcoin-centric DeFi projects. The typical grants range from $50,000 to $200,000, although some larger grants can be given to incubated projects like Atomiq DeFi. Mintlayer founder Enrico Rubboli remarked on their trust in Atomiq DeFi, stating:\n“We’re incredibly proud to have Atomiq DeFi as the first project incubated by the Mintlayer Ecosystem Fund, and trust that under Zaid Ismail’s guidance, we’re set to revolutionize Bitcoin DeFi, offering true interoperability with Bitcoin through atomic swaps and offering a truly decentralized way to exchange Bitcoin with any kind of asset issued on Mintlayer.”\nThe fund strategically supports projects that bring new and unique offerings to the ecosystem. Guiding newly developing projects through incubation programs and helping to grow and scale proven projects with its accelerator program, Mintlayer aims to empower the Bitcoin DeFi sector.\nCarrying forward Mintlayer’s future vision, AtomiqDeFi argues that while DApp developers mostly prefer Ethereum, it is time for Bitcoin to take the DeFi crown. AtomiqDeFi plans to be listed on various crypto exchanges following the token generation event, and negotiations are ongoing.\nWith support from Mintlayer, AtomiqDeFi is paving a new path for Bitcoin in the DeFi space and also lays the groundwork for a more interconnected and decentralized financial ecosystem. New collaborations may unlock the untapped potential of the Bitcoin blockchain and shape the future of DeFi based on the original cryptocurrency.\nLearn more about Mintlayer and AtomiqDeFi\n#Bitcoin\n#Blockchain\n#DApps\n#DeFi\n#Layer2\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-15","tags":["#Bitcoin","#Blockchain","#DApps","#DeFi","#Layer2"],"author":"by Emre Günen","category":null}