{"id":"ed3b3603-2f34-4b05-9033-04e1c3a6d7aa","article_link":"https://cointelegraph.com/news/style-protocol-maximizes-nft-utility-with-cross-game-functionality-heres-how-they-do-it","website_source":"Cointelegraph","article_type":"News Article","summary":"Currently, in-game items and avatars are often locked within specific games, limiting their usability. A project called STYLE Protocol addresses this issue by allowing players to transfer and use digital assets across different games and virtual spaces.","title":"STYLE Protocol maximizes NFT utility with cross-game functionality. Here’s how they do it","detailed_content":"“It makes a lot of sense because there’s a lot of NFTs and valuable assets just sitting around,” said Leo Hilse, founder of STYLE Protocol and guest on Cointelegraph’s recent X Spaces, explaining the essence of his project. “Maybe I don’t need the Bored Ape as a skin, but I can allow others to use it in Roblox. So we’re opening up a protocol that other people can use, where you can get commissions based on the use of that asset that you’ve connected. This is our way of building a long-term sustainable gaming infrastructure.”\nhttps://t.co/N9wZKqjqmC\n— Cointelegraph (@Cointelegraph) May 1, 2024\nTo achieve transferability, the STYLE Protocol converts NFTs and 2D images into interoperable 3D models that can work in various game engines and environments. In theory, almost any NFT or image can be used as long as it makes logical sense in a 3D setting. “I think there is a huge overlay of possibilities for fashion items, avatars, in-game assets, and anything that can be used in different environments to enhance the player and user experience,” Hilse said.\nHe identified several stages of how the STYLE Protocol works. First, it connects to various virtual environments like Decentraland or Roblox through an API. Then, STYLE Protocol converts 2D assets into 3D models and customizes existing 3D models using AI and a library of base rigs specific to Unreal, Unity, or other virtual environments. The blockchain layer also allows users to connect their existing NFTs within the STYLE Protocol.\nIn estimating the accuracy of the final 3D asset, Hilse noted the multiple parties involved in the process: “I think it’s 70% automated AI plus API. The rest is a manual verification element done by Tailors.” Tailors are a community of 3D designers and engineers within STYLE Protocol. Anyone who can demonstrate their 3D design skills through a test project can join. Tailors will be financially compensated for their work by being compensated in a stablecoin for their participation and rewards in the platform’s native token, $STYLE, for their contributions.\nTailors refer to the AI analysis before starting their work: AI analyzes the initial 2D image to understand its style and color scheme. After Tailors create the 3D overlay, APIs automatically rig the 3D model, adding the skeleton and structure for compatibility with the chosen virtual environment.\nAccording to Hilse, the turnaround time can vary depending on the complexity of the asset. Converting a simple item like a sneaker could take 12 hours, while a high-poly avatar could take up to 48 hours. Fees also vary depending on the rendering requirements and the virtual environment into which the asset is being integrated. “Ultimately, the goal is to minimize fees and make it more applicable to everyday users,” Hilse noted.\nAmong the virtual environments currently supported are Nifty Island, Decentraland, The Sandbox, MONA and Spatial. Off-chain modding for larger Web2 titles such as GTA is also possible but operates outside the blockchain.\nHilse also highlighted an AI 3D creator tool available on the platform: “If you have a lot of crazy ideas for cool models, you can type in a text prompt and it will spit out a 3D design idea that can be turned into a 3D model.”\n$STYLE tokens are required to access the platform’s core functionality. “The barrier to entry is very low,” said Hilse. Currently, users only need about $10 to access basic features. In the future, users will be able to stake $STYLE tokens to unlock advanced features, such as renting out their NFTs as 3D assets in other games.\n“We recently listed $STYLE on the centralized exchanges and also on the DEXs. It’s very important to me that we make decisions based on what’s sustainable. We will only implement additional token utilities and a potential burn mechanism if market conditions support it,\" he added.\nHilse went further: “I think Web3 and various virtual gaming environments as a whole are growing in volume and user base. There’s going to be a market for infrastructure providers of all kinds. And we’re very early with pretty good tech that speaks for itself, a strong team and funding. Our goal is to be the number one accessible infrastructure provider for people to bridge their virtual assets.”\nLearn more about STYLE Protocol\n#Blockchain\n#Decentralization\n#Games\n#Web3\n#NFT\n#Gaming\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-05-15","tags":["#Blockchain","#Decentralization","#Games","#Web3","#NFT","#Gaming"],"author":"by Victoria Li","category":null}