{"id":"eda8375d-4155-477f-86b6-68c6575f6ea2","article_link":"https://www.wired.com/story/the-hidden-dangers-of-the-decentralized-web/","website_source":"Wired","article_type":"News Article","summary":"From social networks to crypto, independently run servers are being touted as a solution to the internet’s problems. But they’re far from a magic bullet.","title":"The Hidden Dangers of the Decentralized Web","detailed_content":"WHEN ELON MUSK took over Twitter last year, many users migrated to the free and open-source platform Mastodon. Mastodon, like other decentralized social media, isn’t owned by one of the major players in tech and doesn’t rely on one company’s centralized system. Instead, it operates on independently run servers. Other decentralized social media platforms, like Steemit, use blockchain technology to ensure that data can be stored on servers anywhere in the world.\nThe exodus from Twitter to Mastodon was spurred by wariness of Musk and concern that the platform would disintegrate in his hands. Indeed, distrust of established social media in general is high, thanks to data breaches, inconsistent leadership, and dubious geopolitical ties. In response, proponents of decentralized social networks claim that these alternatives increase transparency and give users more control over their online experiences. But decentralization also comes with downsides, many of which reflect larger cultural ills.\nWIRED OPINION\nABOUT\nJessica Maddox is an assistant professor of digital media technology at the University of Alabama.\nChief among the issues fomented by a decentralized web is a rise in conspiratorial thinking. As Virginia Commonwealth University professor David Golumbia argues in his book The Politics of Bitcoin: Software as Right-Wing Extremism, conspiracy theories that are deeply rooted in American life are governed by much of the same logic that underpins decentralized tech. Using cryptocurrency as an example, Golumbia charts how many of the beliefs held by die-hard proponents of bitcoin depend on far-right thinking. Decentralized banking relies on distrust in existing financial institutions, promising crypto-enthusiasts more control over their money. As a result, cryptocurrencies like bitcoin may be attractive to individuals who think the US Federal Reserve is stealing value from ordinary people, or that “elites” have too much power and may be pulling the strings behind the government. More often than not, those elites are coded as “Jewish control,” playing into long-standing anti-Semitic tropes. While many individuals who invest in bitcoin and other cryptocurrencies may not espouse these extremist, far-right views, the systems they are entering into often do.\nFEATURED VIDEO\nHow Online Conspiracy Groups Compare to Cults\nDecentralization emerges as the solution to seemingly questionable established institutions—be they banks or platforms—because it promotes individual ownership. It is predicated on seeking out a place to protect one’s self and one's specific group. Distrust, like that described by Golumbia, and the feelings prompting many to flee Twitter for Mastodon, often manifest into conspiracy, augmented when institutions are inconsistent or have acted badly. Pushing for decentralization doesn’t make users inherently conspiratorial. But when they decamp to a new platform—even one that is decentralized and purportedly more trustworthy—because they’re wary of the old one, they often bring this distrust-qua-conspiracy with them.\nDecentralized social media are also built to be suspect of the outside world. This is evident in Mastodon’s “federated network” of servers, which users connect across, much like how you can write to a Hotmail email from a Gmail account. New users pick one server to join when signing up, based on common interests or professional affiliation. However, these servers can also block each other. This is most likely a content moderation feature to promote safety, but it can also be used to hide things you disagree with or don’t want to see. For example, a Mastodon server of hundreds of journalists who joined after Musk began banning tech reporters on Twitter is currently blocked by over 200 other servers, who claim the reporters are malevolently surveilling others. It’s easy to imagine how decentralized and therefore more siloed online spaces like these federated Mastodon servers could wind up provoking conspiracy thinking.\nOn other decentralized Web3 platforms, conspiratorial ideologies come to the fore in more explicit ways. For example, Steemit’s instructions for new users advise that the first thing you should do when you join is to “write down your master/owner keys on a piece of paper, and keep the paper in a safe, secure place. Anyone can use your password to log in, to transfer money, to comment on others, and fish your friends. What would you call it? ‘Master/owner key’ is not enough.” The platform suggests that users must fence themselves off from the dangers of the digital world because other spaces and users cannot be trusted.These platforms have shortcomings on the practical level, as well. If a user needs a different app for everything they want to do online, we’re looking at a massive increase in app fatigue, the exhaustion that comes when users must download and engage with more platforms to have a semblance of an online presence and community. While the platforms offered by Meta and Alphabet are certainly not without issue, it is hard to deny the convenience of their established existence, which makes it possible to communicate, be entertained, shop, and more all in the same place. By contrast, users of decentralized platforms will need to download a slew of apps for everything they want to do online, because these features will no longer all exist in one place.\nThe specter of app fatigue may also make it more difficult to convince new users to join decentralized social media. While there will always be early adopters interested in coming on board, new platforms will need to meet casual users where they’re at to fully populate the decentralized web. But the language and features of Web3 are not always intuitive to individuals who are not habitually online, which could make it hard to boost uptake. This may be one reason the uptick in Mastodon users has stalled since its initial surge last fall.\nWe can, and should, always strive to build better, more accessible, and more inclusive technology. But decentralizing the web into walled-off silos seems unlikely to accomplish this goal. Platforms can never outrun their origin stories. Web3 will never be able to shed its conspiratorial origins. Distrust of existing tech institutions and separatist urges will always be part and parcel of decentralized social media. What that means moving forward remains to be seen, but conspiracy, distrust, and inclusion can certainly never go hand in hand.\nWIRED Opinion publishes articles by outside contributors representing a wide range of viewpoints. Read more opinions here. Submit an op-ed at ideas@wired.com.","creation_date":"2023-05-19","tags":["","SOCIAL MEDIA","BITCOIN","TWITTER","COMMUNITIES"],"author":"BY JESSICA MADDOX","category":null}