{"id":"eddc6b23-befb-4530-850e-d05193ab8478","article_link":"https://cointelegraph.com/news/kronos-research-hacker-funds-tornado-cash-exploit","website_source":"Cointelegraph","article_type":"News Article","summary":"Kronos Research was exploited for $25 million in November 2023, with one of the six wallets linked to the hacker moving funds to Tornado Cash on May 7.","title":"Kronos Research hacker shifts funds to Tornado Cash","detailed_content":"The hacker behind the $25 million exploit of quantitative trading firm Kronos Research in mid-November 2023 started moving funds nearly six months after the exploit.\nThe hacker wallet first transferred 1,314 Ether\nETH\n$3,033\nworth $4 million to a new address, starting with 0x8F5e4 and later transferred all the ETH to another address starting with 0x164A24b.\nSource: PeckShield\nThe hacker made 10 transactions of 100 ETH from the final wallet and transferred it to Tornado Cash, a crypto-mixing tool.\nThe hacker made several transfers to Tornado Cash. Source: Etherscan\nTornado Cash is an open-source cryptocurrency mixer that operates on networks compatible with the Ethereum Virtual Machine. The mixing services obscure the path of the crypto transactions and make it extremely difficult to trace the source of the funds.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAlthough created as a privacy tool, hackers often use mixing services to launder stolen funds via decentralized exchange platforms.\nThe significant usage of Tornado Cash for transferring illicit funds prompted the United States government to impose sanctions on its use in August 2022. Subsequently, its founders were charged with money laundering and sanctions violations in 2023.\nRelated: Five US enforcement agencies form new digital currency anti-crime task force\nWhile opinions within the crypto community vary regarding adopting privacy tools, there is a consensus against state persecution of developers for creating an application.\nThe crypto analytics firm PeckShield raised an alert regarding the transfer of funds on X. It cautioned that the transfer to Tornado Cash suggests that the hacker is attempting to launder the stolen funds.\nOver the years, exploiters have chosen crypto-mixing services over centralized exchanges, as once they are identified, exchanges block addresses.\nKronos Capital was exploited in November 2023 after the exploiters managed to gain access to the firm’s application programming interface keys. The firm first denied any loss of funds during its early announcement.\nLater, on-chain investigator ZachXBT revealed that roughly 12,800 ETH worth $25 million was stolen and transferred into six unique crypto wallet addresses. Kronos Capital halted its trading services to investigate the loss.\nMagazine: Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-05-07","tags":["#Blockchain","#Hackers","#Hacks","#DeFi","#Regulation","#Tornado Cash"],"author":"by Prashant Jha","category":null}