{"id":"ede566dd-ba57-4a80-b28a-b4061616bb7e","article_link":"https://cointelegraph.com/news/blockchain-association-sue-sec-dealer-rule","website_source":"Cointelegraph","article_type":"News Article","summary":"The Blockchain Association and a Texas-based crypto activist group are suing the SEC over its controversial “Dealer Rule” expansion, arguing it threatens the digital asset industry and innovation.","title":"Blockchain Association and crypto activist group sue SEC over ‘Dealer Rule’","detailed_content":"The Blockchain Association (BA) and the Crypto Freedom Alliance of Texas (CFAT) revealed a new lawsuit against the United States Securities and Exchange Commission (SEC) in the Northern District of Texas, according to a statement. \nOn April 23, the BA announced the lawsuit in a move to challenge the SEC’s recent expansion of the “Dealer Rule,” which the industry groups argue stifles innovation in the U.S. digital asset market.\nThe BA and CFAT argue that the SEC overstepped its authority by implementing a broad interpretation of the term “dealer” within the Securities Exchange Act of 1934.\nIn February the SEC adopted new rules which redefine “dealer” and “government securities dealer” and therefore require more crypto market participants to register, join a self-regulatory organization and comply with federal securities laws. \nThis expansion, the lawsuit claims, creates a vague and burdensome regulatory environment for businesses involved in digital asset trading.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe lawsuit alleges that the SEC failed to adequately address public concerns raised during a limited comment period and neglected to assess the potential negative impacts of the rule.\nKristin Smith, the CEO of the Blockchain Association, said this the latest example of the SEC’s “blatant attempts to unlawfully regulate outside its authority.”\n“The Dealer Rule advances the SEC’s anti-digital asset crusade and unlawfully redefines the boundaries of its statutory authority granted to it by Congress, threatening to drive U.S. companies offshore and incite fear in American innovators.”\nRelated: SEC’s Hester Peirce wants more decentralization in the financial system\nThe lawsuit seeks a court order to overturn the Dealer Rule expansion based on violations of the Administrative Procedure Act (APA). The APA ensures fair and transparent rulemaking by requiring agencies to consider public feedback and provide clear guidelines.\nSmith said that they are seeking “declaratory judgment and injunctive relief” against the regulators to overturn the expansion of the rule and ultimately to prohibit its use against the industry “before more harm can be done by this rabid regulator.”\nThe BA and CFAT represent a significant portion of the cryptocurrency industry, including leading investors, companies, and projects. Overall, their work advocates for a national policy framework within the U.S. that aims to foster local innovation and responsible development within the digital asset space.\nMagazine: Altseason on the horizon, SEC targets Uniswap, and BTC halving news: Hodler’s Digest, April 7-13\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-23","tags":["#Blockchain","#Business","#SEC","#US Government","#United States","#Regulation"],"author":"by Savannah Fortis","category":null}