{"id":"f0deeaa7-c5d8-4a12-9e7c-00fe34feb2d3","article_link":"https://cointelegraph.com/news/eu-securities-watchdog-considers-crypto-inclusion-12t-investment-market","website_source":"Cointelegraph","article_type":"News Article","summary":"If approved, the EU’s UCITS funds would make way for crypto assets to gain exposure to a 12 trillion euro investment product market.","title":"EU seeks stakeholder opinions on adding crypto to 12T euro investment market","detailed_content":"Update 12:55 pm UTC: This article has been updated to include quotes from Nicolas Streschinsky.\nThe European Union security watchdog, the European Securities and Markets Authority (ESMA), is seeking the opinion of experts on whether to add crypto to the 12 trillion euro ($12.8 trillion) investment product market.\nThe ESMA asked industry experts for their views on whether Undertakings for Collective Investment in Transferable Securities (UCITS) — an investment product market valued at 12 trillion euros — can gain exposure to different asset classes such as structured or leveraged loans, catastrophe bonds, emission allowances, commodities, crypto assets and unlisted equities.\nUCITS are a class of investment funds comprising products intended to protect and simplify investing transactions. UCITS are often comprised of mutual, exchange-traded or money market funds. EU regulations govern these funds; however, non-EU investors can also gain exposure.\nUCITS stakeholders have until Aug. 7 to submit their comments. If approved, UCITS would become one of the largest mainstream funds with crypto exposure.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe request for expert opinions comes amid the approval of spot Bitcoin (BTC) exchange-traded funds in the United States and Hong Kong, with securities regulators worldwide appearing to warm up to crypto exposure in traditional investment vehicles.\nRelated: The Runes protocol will ignite a new season for Bitcoin after the halving\nWhile spot BTC ETFs are solely crypto-focused, UCITS investments are divided into numerous fund types, each with a particular asset allocation based on the fund’s risk profile.\nIf approved, there won’t be an independent UCITS fund with 100% crypto allocation but multiple UCITS funds with a percentage allocation in crypto.\nNicolas Streschinsky, the Head of DeFi at Trilitech,  Tezos blockchain R&D and Entrepreneur Hub, told Cointelegraph that UCITS funds are very successful and commonly held by investors outside the EU who trust that type of vehicle.\n“The inclusion of a — likely small — percentage of crypto assets in some UCITS funds could be another catalyst in broadening the holder base of cryptocurrency assets, specifically utility tokens used to pay transaction fees on major blockchains,” he added.\nEU regulations currently prohibit independent crypto-centered investment products. Thus, investors have to access them via exchange-traded notes.\nThe European Union is known for its strict crypto regulatory policy. It is one of the first regions to introduce a complete crypto regulatory framework in the form of its Markets in Crypto-Assets Regulation (MiCA).\nOne of the questions asked by the ESMA in the feedback is how adding specific cryptocurrencies to the framework would or wouldn’t be affected by MiCA.\nMagazine: What do crypto market makers actually do? Liquidity, or manipulation\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Bitcoin","#Blockchain","#Europe","#European Union","#MiCA","#Regulation"],"author":"by Prashant Jha","category":null}