{"id":"f2126164-1242-4978-980f-05650d535f8c","article_link":"https://cointelegraph.com/news/solana-passes-proposal-speed-up-transactions","website_source":"Cointelegraph","article_type":"News Article","summary":"Solana’s validators voted 98% in favor of a proposal that could speed up transaction confirmation times.","title":"Solana validators pass ‘Timely Vote Credits’ plan to speed up transactions","detailed_content":"Solana validators have voted in a proposal aimed at decreasing the latency of consensus “votes” — which could speed up transactions on the blockchain. \nThe proposal calls for a “Timely Vote Credits” mechanism on Solana and was passed on April 9 with 98% votes in favor.\nIt would change how validators are incentivized to make “votes” — a key part of Solana’s consensus mechanism that confirms transactions.\nSolana Timely Vote Credits voting results. Source: Dune Analytics\nAccording to Solana Labs, up until now, validators are given a flat one vote credit whenever they submit a consensus vote on a block that becomes finalized by the network. \nOver time, validators have found they can maximize earnings by delaying their votes just long enough to ensure they’re voting on the correct fork — at no penalty.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe proposal, floated on March 14 by “zantetsu” from Solana validator Shinobi Systems, would implement a variable number of vote credits that are awarded for votes — with more credits given to votes that have less latency.\n“This will discourage intentional ‘lagging,’ because delaying a vote for any slots decreases the number of credits that vote will earn,” Solana Labs explained.\nSolana users have raised concerns with the vote credit system in the past. Source: Reddit\nCurrently, Solana Compass shows the blockchain is producing approximately 1,000 “non-vote,” or user transactions per second and nearly 2,000 “vote” transactions per second.\nRelated: Paradigm leads $225M funding round for new ‘Solana killer’ L1\nIt’s not yet known what the impact of the new mechanism will be, as it’s expected to be implemented sometime after Solana’s v1.18 upgrade slated this month — which includes patches to fix priority fees and network congestion issues on the chain.\nSource: Austin Federa\nMeanwhile, Solana has been battling a string of failed transactions which has been blamed on an “implementation bug” from QUIC, a Google-developed data transfer protocol that loops all nodes in on the current state of the network.\nA bug fix — which involves a reconfiguration for QUIC — is now slated for April 15, should no additional issues come about in testing.\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-10","tags":["#Blockchain","#Altcoin","#Solana"],"author":"by Felix Ng","category":null}