{"id":"f2c2273e-f059-42ef-9802-81eefdc5216a","article_link":"https://cointelegraph.com/news/ubisoft-gameplay-trailer-blockchain-game","website_source":"Cointelegraph","article_type":"News Article","summary":"The AAA game developer aims to launch its first blockchain-based game by the end of 2024.","title":"Ubisoft teases new blockchain game at Paris Blockchain Week","detailed_content":"AAA game studio Ubisoft is edging closer to releasing its first blockchain-based game after releasing the first gameplay trailer for Champion Tactics Grimoria during Paris Blockchain Week.\nThe tactical player-vs-player role-playing game’s lead developers gave Cointelegraph an exclusive playthrough at the conference. The RPG allows players to craft blockchain-based figurines with unique features and characteristics that can be combined into a team of three for the turn-based game.\nSource: ChampionsVerse Champions Tactics\nThe game certainly has the polish and feel of a Ubisoft title, with high-end graphics and animations adding to the depth of gameplay. Players will need to learn what combinations of heroes best complement and counter other players’ picks.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nUbisoft Strategic Innovation Lab vice president Nicolas Pouard said the studio had adopted a patient approach to building a blockchain-based title:\n“We started development last year on the first real game on blockchain. We felt it was too ambitious to start with a AAA title, so we’re testing the waters with Champions Tactics.”\nPouard said the studio had adopted a different approach to other developers building blockchain games by starting with creating a universe around the assets and nonfungible tokens that form the core of the title.\nThe game is centered around champion figurines with various skills and abilities. In the vein of DOTA, different champions combine well with certain classes and specs and counter the figurines chosen by opponents in turn-based matches.\nUbisoft and Oasys, the gaming blockchain protocol on which the former has built the title, gave visitors in Paris a first-hand look at the gameplay. They also announced a new whitelist that will enable prospective players to begin crafting figurines for their champions roster.\nPouard added Ubisoft was not necessarily interested in releasing a game that was driven by financial motivations, but to prove that the studio could release a quality Web3 game that gives players true ownership of digital assets.\n“We must understand the market and how we launch this kind of game,” he said. “That’s really what we want to achieve here. We want to give the players the power to populate the game with figurines and understand what it means to own your gaming assets.”\nOasys also announced a new integration with the omni-chain interoperability protocol LayerZero. This marks a significant step in the former’s 2024 Dragon Update, which focuses on enhancing interoperability across its gaming ecosystem.\nMagazine: ‘Web3 Gaming sucks’ says Ava, 2M Bitcoin Miner players make 13c: Web3 Gamer\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-12","tags":["#Blockchain","#Games","#Blockchain Game","#Web3","#NFT","#GameFi"],"author":"by Gareth Jenkinson","category":null}