{"id":"f341dadb-0c40-496f-80d1-6e0273f968c0","article_link":"https://cointelegraph.com/news/clearstream-ecb-wholesale-cbdc-trials-tokenized-securities","website_source":"Cointelegraph","article_type":"News Article","summary":"The Deutsche Börse subsidiary is the only central securities depository taking part in the first phase of digital euro preparations.","title":"Clearstream joins ECB wholesale CBDC trials with tokenized securities","detailed_content":"Central securities depository Clearstream, a Deutsche Börse Group subsidiary, will take part in European Central Bank (ECB) trials of digital euro wholesale central bank digital currency (CBDC).\nClearstream, which operates the D7 post-trade platform, is the only central securities depository (CSD) participating in the first phase of ECB “preparatory” trials. It, in turn, runs a German CSD, the LuxCSD in Luxembourg and an international CSD. Clearstream’s head of issuer services and new digital markets, Jens Hachmeister, said in the statement:\n“We are expanding our D7 digital securities infrastructure with DLT [distributed ledger technology] components and fostering connections with the main digital payment solutions across the Eurosystem.”\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nClearstream worked with Google Cloud to expand D7’s capacities. It will test the use of distributed ledger technology for wholesale transactions with tokenized securities and link to three European central bank products: Deutsche Bundesbank’s Trigger Solution, Banca d’Italia’s TIPS Hash-link and Banque de France’s Full DLT Interoperability.\nRelated: ECB should have DLT wholesale settlements when the market wants it, official says\nAccording to its statement, Clearstream will conduct “euro-denominated issuances and delivery-versus-payment (DvP) transactions across different use cases and payment models.” Tests are scheduled for May to November of this year and will use real central bank money.\nThe ECB launched the preparatory phase of its digital euro research in October, after a two-year investigative phase. It issued a vendor call in January.\nSource: Clearstream\nBanca d’Italia and Deutsche Bundesbank began working with similar DLT technology in 2021. At the end of 2023, Banca d’Italia signed a memorandum of understanding with the Bank of Korea to explore settlement systems and CBDC.\nClearstream has over 18 trillion euros in assets under custody. It participated in SWIFT experiments with CBDC and tokenized assets in 2022. No decision on launching a digital euro will be made until after ECB trials are completed and the corresponding legislation is adopted.\nThe use of tokenized securities is expanding rapidly. In the United States, the market for tokenized U.S. Treasury bonds grew from $114 million to $845 million in the course of last year.\nMagazine: Are CBDCs kryptonite for crypto?\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#Business","#Security","#Tokens","#DLT","#Stock Exchange"],"author":"by Derek Andersen","category":null}