{"id":"f38050b8-7620-4c06-ae25-b9f7dd09bce6","article_link":"https://cointelegraph.com/news/irs-draft-2025-digital-asset-reporting-form-us-taxpayers","website_source":"Cointelegraph","article_type":"News Article","summary":"The U.S. Internal Revenue Service has been grappling with crypto tax reporting for years, and they may have a ways to go still.","title":"IRS releases draft of 2025 digital asset reporting form for US taxpayers","detailed_content":"The United States Internal Revenue Service (IRS), the country’s tax service, has released a draft of its new Form 1099-DA “Digital Asset Proceeds from Broker Transactions” for reporting income from digital asset transactions. The form is expected to come into use in 2025 for reporting in 2026.\nA broker will prepare Form 1099-DA for every customer who sells or exchanges digital assets. Brokers include kiosk operators, digital asset payment processors, hosted wallet providers, unhosted wallet providers and others, per the form. Copies of the 1099-DA will be sent to customers and the IRS, which will use them for verification purposes.\nThe 2025 draft 1099-DA IRS reporting form. Source: IRS.gov\nThe form asks for token codes, wallet addresses, and blockchain transaction locations. Under the rule proposed in August 2023, cryptocurrencies, nonfungible tokens and stablecoins are reportable. The rule stated:\n“With third party information reporting that specifically identifies digital asset transactions, the IRS could more easily identify taxpayers with digital asset transactions that are otherwise difficult to discover.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nThe crypto community weighed in on the proposed reporting requirements after they were announced. The Blockchain Association said the rule contains “fundamental misunderstandings about the nature of digital assets and decentralized technology.”\nCoinbase chief legal officer Paul Grewal said the proposed rules would set a “dangerous precedent for surveillance of the everyday financial activities of consumers by requiring nearly every digital asset transaction — even the purchase of a cup of coffee — to be reported.”\nCommenters were no happier with the reporting rules for 2024.\nRelated: Study claims 99.5% of crypto investors did not pay taxes in 2022\nTax experts have also posted their comments on the web. According to crypto tax and accounting service Ledgible, reporting decentralized finance, where there may not be an intermediary to fulfill the reporting requirements, will be especially challenged by the new rule. It could also significantly increase brokers’ administrative burden, as many process very large numbers of transactions.\nSource: Peter Van Valkenburgh\nIn addition, brokers will be forced to exchange information on digital asset transfers to determine the cost basis (initial value or purchase price) accurately, according to Gordon Law. They have no mechanism in place for such data sharing. Furthermore, there is no way to differentiate between self-transfers and taxable transfers if a crypto owner transfers assets between exchanges.\nTaxpayers who underreported their crypto income in previous years may be caught when they report their taxes in 2025. Users of foreign exchanges that formally do not serve U.S. citizens will not submit the form, but the IRS may be able to detect the offshore activity if the taxpayer transfers assets to a U.S. exchange.\nThe IRS is continuing to accept comments on the draft form.\nMagazine: Crazy outcomes when current laws applied to NFTs and the metaverse\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-20","tags":["#Blockchain","#IRS","#Taxes","#Business","#United States","#DeFi","#Regulation"],"author":"by Derek Andersen","category":null}