{"id":"f422ad8d-91bc-4c83-a295-01cd67a25236","article_link":"https://cointelegraph.com/news/monochrome-spot-bitcoin-etf-launch-2-months","website_source":"Cointelegraph","article_type":"News Article","summary":"Although Australia already has a couple of ETPs exposed to Bitcoin, Monochrome’s spot BTC ETF will be the first to hold physical Bitcoin in its ETF, similar to the United States-based products.","title":"Australian Monochrome spot Bitcoin ETF expected to launch within 2 months, says CEO","detailed_content":"Australian asset manager Monochrome plans to launch its flagship spot Bitcoin exchange-traded fund (ETF) on the global listing exchange Cboe Australia. Monochrome filed for the spot Bitcoin ETF in July 2023.\nThe Monochrome Bitcoin ETF, if approved, will become Australia’s first spot Bitcoin ETF to permit direct Bitcoin\nBTC\n$62,992\nholding.\nAustralian regulators have already greenlighted two exchange-traded products (ETPs) that give exposure to spot crypto assets on Cboe Australia, but these ETPs do not directly hold Bitcoin; instead, they invest in investment products with exposure to spot Bitcoin ETF.\nTo list their spot Bitcoin ETF in Australia, asset managers must first get approval from the securities regulator and then apply for an exchange listing.\nFOLLOW BITCOIN HALVING COVERAGE IN FULL HERE\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nMonochrome has already received approval from the Australian Securities regulator ASIC and expects Cboe Australia to clear its application by June.\nThe asset manager was earlier slated to launch its spot Bitcoin ETF via Cboe rival ASX; however, Jeff Yew, Monochrome Asset Management CEO, told Cointelegraph that the selection of Cboe Australia as the listing venue for the Monochrome Bitcoin ETF aligns more “closely with our strategic vision, market reach and time frame.” Yew added:\n“We anticipate a decision from Cboe Australia about the Monochrome Bitcoin ETF before the middle of 2024. The Monochrome Bitcoin ETF stands to be the first Bitcoin ETF in Australia authorized to hold Bitcoin directly.”\nYew explained that the key difference between existing ETPs and the Monochrome spot Bitcoin ETF is it provides investors with a straightforward, transparent pathway to exposure. It is identical to “how spot Bitcoin ETFs are structured in the United States.”\nRelated: Blockchain Association files support in suit to lift Tornado Cash sanctions\nSpot Bitcoin ETFs have become a focus of major governments worldwide ever since the U.S. Securities and Exchange Commission approved 11 spot BTC ETFs on Jan. 11.\nThe successful launch of spot BTC ETFs in the U.S. has prompted other countries to consider the possibility of introducing similar products in their own markets.\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-05","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Australia","#Bitcoin ETF","#Adoption","#CBOE","#Regulation"],"author":"by Prashant Jha","category":null}