{"id":"f495097b-1b8e-4d85-9f42-82afbc1763a9","article_link":"https://cointelegraph.com/news/ctfc-cbdc-stablecoins-libertarian-values","website_source":"Cointelegraph","article_type":"News Article","summary":"J. Christian Giancarlo has stressed the importance of upholding values of liberty, privacy and economic freedom in a keynote address in London.","title":"CBDCs, stablecoins must ensure liberty-based values — former CFTC chair","detailed_content":"The former head of the United States Commodities and Futures Trading Commission (CFTC) has urged central bank digital currencies (CBDCs) and stablecoins to uphold values based on liberty by design. \nJ. Christian Giancarlo, who chaired the CFTC between 2014 and 2019, stressed the need for CBDCs and stablecoins to ensure privacy and censorship resistance during a keynote address at the FT Live Crypto and Digital Assets Summit.\nJ. Christian Giancarlo speaks at FT Live Crypto and and Digital Assets Summit in London. Source: Gareth Jenkinson\nGiancarlo drew a comparison to the early days of the internet, saying that 30 years ago, nations like the U.S., England and other leading democracies enabled the “internet of information,” reflectin the values of open and free societies.\n“The free world and free people must again work together to make sure that the future of digital value networks reflects similar standards of financial freedom and economic liberty that are suitable for human worth and dignity,” Giancarlo said.\nRelated: Mastercard joins forces with US banking titans for tokenized settlement trials\nThe former CFTC commissioner, who now leads the Digital Dollar Project, said that American leadership was failing in this regard because the regulatory approach toward the cryptocurrency sector borders on hostile:\n“Let’s set standards for digital currencies, sovereign and non-sovereign CBDCs, and stablecoins that are worthy of human liberty, and people everywhere who aspire to liberty.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nGiancarlo opined over the influence of the internet, saying that the technology is now doing to finance what has already been done to various sectors:\n“With information gathering, think Wikipedia. Retail shopping, think Amazon. Entertainment, think YouTube. Social networks, think Facebook and Twitter.”\nGiancarlo said that cryptocurrencies and blockchain technology have increased speed, efficiency and automation, and have lowered costs, unlocked new business models, challenged traditional market structures and displaced intermediaries.\nThe former CFTC commissioner then questioned whether a new “internet of value” would enhance economic liberty and financial freedom or whether it would take away liberties in the same way that the “second generation of the internet” dominated by tech giants like Facebook and Google have been criticized of doing.\nRelated: CBDCs should protect privacy, not be a surveillance tool: Former CFTC chair\nGiancarlo also highlighted statistics relating to the development of CBDCs around the world and the growing use of public stablecoins. As of 2024, 134 countries representing 98% of the global gross domestic product are actively exploring the issuance of CBDCs compared to 35% in 2020.\nStablecoin use has also increased dramatically, settling 11 trillion in on-chain transactions, which almost surpassed Visa’s settlement volumes. The global market cap of stablecoins has also grown from $3 billion in 2019 to $138 billion in 2024.\nMeanwhile, Bitcoin’s (BTC) market capitalization has surpassed the Swiss franc as the 13th-biggest currency worldwide. Giancarlo said the reality of the landscape is that people around the world will be using a variety of digital currencies in tandem:\n“The sometimes fashionable debate at conferences such as this between CBDCs and stablecoins and crypto is a complete and false choice. The global future is all of the above. Crypto, CBDCs, stablecoins and more.”\nThe former CFTC chair closed by saying that individual economic privacy and censorship resistance should be affirmative design choices and competitive advantage systems worthy of free societies and open economies.\nBy encoding individual economic privacy into its very architecture, CBDCs and stablecoins should serve as desired instruments for people the world over who aspire to financial autonomy and inclusion, consistent with basic human rights and civic values.\n“The public should be able to see for itself whether they're being surveilled and whether they're being manipulated”\nMagazine: Meme coins: Betrayal of crypto’s ideals… or its true purpose?\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-05-08","tags":["#Blockchain","#London","#Financial Times","#CFTC","#Stablecoin","#CBDC","#Regulation"],"author":"by Gareth Jenkinson","category":null}