{"id":"f4e1946e-fc32-4653-a298-d34f07c6049c","article_link":"https://cointelegraph.com/news/this-defi-platform-aims-to-pilot-the-next-generation-of-leveraged-tokens","website_source":"Cointelegraph","article_type":"News Article","summary":"Leveraged tokens enable investors to easily gain leveraged exposure without any active management or margin maintenance.","title":"This DeFi platform aims to pilot the next generation of leveraged tokens","detailed_content":"Optimism-based platform TLX brings leveraged tokens to decentralized finance, bridging the gap between centralized exchanges and DeFi.\nLeveraged trading is a financial strategy that allows investors to take larger positions than their capital would normally permit. This concept is expanded upon with leveraged tokens, which are backed by perpetual futures contracts. Perpetual futures contracts enable users to speculate on the future price of an asset without an expiry date.\nLeveraged tokens bridge the gap between centralized exchanges (CEX) and the innovative, user-friendly approaches of decentralized finance (DeFi).\nDespite their benefits, leveraged tokens may encounter network congestion on blockchains with limited transaction capacity — especially on networks such as Ethereum, where transaction fees peak during congestion, the value of positions can be eroded and leverage support remains limited.\nTo overcome high transaction fees, money markets such as Aave and Compound operate on layer-2 blockchain networks, which are more efficient but still far from perfect. The number of assets supported by money markets such as Aave and Compound is limited, and the amount of leverage that users can acquire is very limited. Leveraged tokens that are built on top of money markets incur expensive rebalancing that can eat away at users' principal.\nIn response to these shortcomings, TLX has introduced leveraged tokens that are backed by perpetual futures contracts, which allows the leveraged tokens model to be both scalable and efficient.\nThe Uniswap for perpetual futures\nTLX, a DeFi platform built on Optimism — a layer-2 network on Ethereum — presents a permissionless, noncustodial leveraged token landscape. Addressing the key challenges preventing leveraged tokens from becoming a mainstream DeFi product, TLX offers users over 50 assets with up to 20x leverage.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nUsers can mint leveraged tokens by selecting the target asset and leverage ratio. Source: TLX\nTLX aims to become 'the Uniswap of the perpetual futures market.' Uniswap is a decentralized exchange (DEX) protocol built on Ethereum that enables users to trade crypto directly from their wallets without the need for an intermediary, using an automated market maker.\nLike Uniswap, TLX works via a simple swap UI. Users can create long or short positions with up to 20x leverage using TLX. All leveraged tokens minted on TLX maintain a constant leveraged factor and do not require any margin management.\nPerpetual futures contracts of the Synthetix protocol back TLX leveraged tokens (LTs). Synthetix is a DeFi protocol that makes it possible to create synthetic assets that simulate the value of underlying assets. Utilizing synthetic assets, users can access a wide range of markets without directly owning the underlying assets.\nSimplifying leveraged trading\nTLX intends to position itself as a transformative platform within the DeFi space. Its main goal is bringing scalable and efficient leveraged tokens to DeFi. While enhancing the inclusivity and accessibility of leveraged trading strategies, TLX also wants to contribute to the overall liquidity and dynamism of the crypto markets.\nComprised of experienced professionals with doctorates in computer science and machine learning, the TLX team works to broaden the adoption of leveraged tokens. Involved in academic research in decentralized finance, the team leverages its experience in delivering a viable LT product to overcome current market challenges.\nPortfolio screen of the TLX platform. Source: TLX\nLooking toward the future, a more accessible leveraged trading experience, as facilitated by platforms like TLX, could significantly benefit the crypto ecosystem. DeFi protocols that support LTs can lower the barriers to entry for retail investors, allowing them to participate in sophisticated trading strategies that were previously out of reach.\nThe adoption of leveraged tokens could transform how market participants access leverage by offering investors a method of leveraged trading that is both simple to use and easy to access. This combined with the composable nature of leveraged tokens could also spur innovation in financial products and the expansion of the DeFi ecosystem.\nLearn more about TLX\n#Blockchain\n#Cryptocurrencies\n#Ethereum\n#Investments\n#Tokens\n#DeFi\n#Layer2\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.","creation_date":"2024-04-23","tags":["#Blockchain","#Cryptocurrencies","#Ethereum","#Investments","#Tokens","#DeFi","#Layer2"],"author":"by Emre Günen","category":null}