{"id":"f4f84506-546f-45db-8915-616e6907daa9","article_link":"https://cointelegraph.com/news/web3-wellness-ring-users-own-health-data","website_source":"Cointelegraph","article_type":"News Article","summary":"A Web3 competitor to the popular Oura wellness ring is making personalized health insights and AI coaching possible through user-owned, monetizable data.","title":"Web3 wellness ring lets users own their health data — and wear it too","detailed_content":"Is the future of wellness technology here? A new Solana-based wellness wearable is taking health data on-chain, allowing users to own and monetize their data.\nThe Cudis ring, developed by BeatBit Wellness Lab, is being touted as a Web3 alternative to the popular Oura ring that has recently taken the health and wellness industry by storm.\nIt uses decentralized physical infrastructure network (DePIN) technology and allows users to monetize their anonymized health data and feed it back into the ecosystem for more informed personalized health insights.\nWellness data is encrypted and anonymously stored on the InterPlanetary File System (IPFS) after indexing on the Solana blockchain. This anonymized data fuels the development of customizable artificial intelligence (AI) modules that generate personalized insights into users’ mental and physical well-being.\nCudis CEO Edison Chen told Cointelegraph that the goal of the Web3 wearable is to focus on users first.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“Traditional smart ring companies operate on a centralized model where they collect and store users’ health data on their servers and analyze it to provide personal health insights through an app,” he explained. “Potentially, they monetize the data without sharing financial benefits with the users.”\n“We’re empowering individuals to take control of their own health data.”\nRelated: How DePINs are connecting farmers and businesses via blockchain\nHe said the ring tracks users’ heart rate, sleep, stress, strain and burned calories. In the beginning, points will be given as rewards for data, which will later become monetizable tokens. \nChen said that users seeking more advanced insights and personalized programs are often forced to pay extra fees for wellness applications. However, “blockchain technology offers the perfect solution” to revolutionize that model.\nAccording to the official announcement for the wearable, it has already had 200 participants at an event at the Solana Hacker House and anticipates the first 10,000 rings to roll out in the second quarter of 2024.\nDePINs continue gaining traction in the Web3 space, with new use cases rapidly emerging.\nEarlier in 2024, decentralized finance executives were predicting that DePINs and AI together would be a “power duo” that would take the space by storm. \nDePINs are already being used to revolutionize internet access in India, weather data collection worldwide and farmers’ connection with consumers.\nMagazine: Memecoins make millionaires, Terraform and Do Kwon liable for fraud, and more: Hodler’s Digest, March 31 – April 6\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nYour go-to source for staying on top of market trends, and emerging artists, and unlocking opportunities in the NFT landscape. Delivered every Wednesday\nSubscribe","creation_date":"2024-04-17","tags":["#Blockchain","#Adoption","#AI","#Health","#Solana","#Fashion"],"author":"by Savannah Fortis","category":null}