{"id":"f54f0096-b804-4ff6-9d3c-7d6fbf0ebff8","article_link":"https://cointelegraph.com/news/hundred-finance-hacker-moves-assets-year-after-exploit","website_source":"Cointelegraph","article_type":"Tweet","summary":"The hacker holds about $4.3 million in various crypto assets in their Ethereum wallet.","title":"Hundred Finance hacker moves stolen assets a year after $7M exploit","detailed_content":"The hacker who stole $7.4 million from the decentralized finance (DeFi) protocol Hundred Finance has started moving the crypto assets after a year of inactivity. \nOn May 1, the hacker moved Ether\nETH\n$3,033\nand Tether\nUSDT\n$1.00\nworth about $800,000 from Curve’s decentralized exchange (DEX) after providing liquidity on the platform more than one year ago.\nToken transactions made by the Hundred Finance hacker. Source: Etherscan\nAfter withdrawing the funds, the hacker converted USDT and other cryptocurrencies into ETH. This increased the exploiter’s ETH by more than $1 million.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe hacker currently holds a total of $4.3 million in assets in the wallet, which includes various crypto assets like Dai\nDAI\n$1.00\n, Wrapped Ether, Frax and Wrapped Bitcoin.\nOn April 15, 2023, the DeFi protocol reported that it had suffered a security breach on the layer-2 network Optimism.\nAccording to the blockchain security firm CertiK, the attacker manipulated the exchange rate between ERC-20 tokens and hTOKENS. This allowed them to withdraw more tokens than were deposited.\nThis is commonly known in the DeFi world as a flash loan attack. This type of attack vector usually involves borrowing large amounts of funds with some form of uncollateralized loan from a lending platform.\nThe attacker then uses the assets to manipulate the price of crypto on DeFi platforms. In the Hundred Finance hack, large loans were taken out under the falsified exchange rate.\nIn 2022, Hundred Finance also suffered an exploit on the Gnosis Chain. The protocol’s liquidity was drained through a reentrancy attack, resulting in a $6 million loss.\nRelated: Pike Finance clarifies ‘USDC vulnerability’ statement on $1.6M exploit\nWhile flash loan attacks have wreaked havoc within the space in the past few years, April 2024 showed a significant decrease in losses from this type of hack.\nAccording to a report from CertiK, flash loan attacks only accounted for $129,000 lost in April. Its largest single incident within the month only caused $55,000 in damages. CertiK said in the report that this was the lowest amount lost to flash loan attacks since February 2022.\nMeanwhile, losses to crypto hacks in general also decreased in April. Security company PeckShield reported that only $60 million was lost to hacks in the month. This represents a sharp decline from February and March, which recorded $360 million and $187 million in losses, respectively.\nMagazine: Woman accused of $6B scam, China loophole for Hong Kong Bitcoin ETFs: Asia Express\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-02","tags":["#Blockchain","#Hackers","#Hacks","#DeFi"],"author":"by Ezra Reguerra","category":null}