{"id":"f561d418-daee-435f-82d0-14e9eeda9e61","article_link":"https://cointelegraph.com/news/chinese-workers-paid-cbdc-cashing-out-real-dollars","website_source":"Cointelegraph","article_type":"News Article","summary":"Some participants of China’s CBDC pilot program are reportedly hesitant to hold onto the digital yuan, citing a range of concerns with using the state-backed digital currency.","title":"Chinese workers paid in CBDC are cashing it out for real money: Report","detailed_content":"China’s digital currency project reportedly still has teething problems, with a report suggesting some state Chinese workers who are paid in “e-CNY” or digital yuan seldom use it and have been converting it to physical cash. \nAccording to a May 13 report from the South China Morning Post, some Chinese cities have begun paying state employees in the country’s CBDC but most of these early adopters convert it to cash immediately.\n“I prefer not to keep the money in the e-CNY app because there’s no interest if I leave it there,” said Sammy Lin — an account manager at a Chinese state bank in Suzhou.\n“There are also not so many places, online or offline, where I can use the e-yuan.”\nCivil servant Andrew Wang said he wasn’t too worried by the idea of digital cash as it was only a small part of his salary being paid in digital yuan.\nHowever, his wife — who receives her full salary in digital yuan — withdraws the full amount as regular cash the moment she’s paid due to a lack of utility with the digital currency.\nThe e-CNY app being used in in Suzhou. Source: Kyodo\n“She can’t deposit the money or buy financial products with the e-CNY wallet,” Wang said.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nWhile China has reportedly been a “functionally cashless” society for the better part of a decade, many Chinese citizens remain hesitant to use a purely digital currency like the digital yuan due to broader fears of surveillance and its limited use cases, SCMP’s report suggested. \nDespite these concerns, more than $250 billion worth of transactions have been conducted by way of the digital yuan as of July 20, 2023, according to Yi Gang, the former governor of the People’s Bank of China.\nYe Dongyan, a researcher at Beijing’s Cheung Kong Graduate School of Business, said there needs to be more effort made to balance privacy and security if the government wants to roll out the digital yuan throughout the rest of China.\n“Paper currency is used anonymously, but the digital yuan is different. The boundaries between information tracking and information security protection need more deliberation,” he said.\nRelated: Hong Kong issuer seeks spot Bitcoin ETF for mainland China\nGang said the privacy issues with the new CBDC were the “biggest challenge” of the digital finance era.\nDespite the privacy concerns shared by participants in the program, Gang said at a March forum in Beijing that the digital yuan was able to “fully protect privacy” through something called “controllable anonymity,” which means there’s no tracking of small payments, but some for larger ones.\nSince the currency’s inception in 2020, several jurisdictions in China have been working to boost the adoption of the CBDC, with multiple cities giving away over 180 million Chinese yuan ($26.5 million) through subsidies and consumption coupons.\nMagazine: The Bitcoin Man, X Hall of Flame: China will intensify Bitcoin bull run, $1M by 2028\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-05-13","tags":["#Blockchain","#Cryptocurrencies","#China","#Adoption","#CBDC"],"author":"by Tom Mitchelhill","category":null}