{"id":"f630455f-9a15-4d1b-9a2a-854aaf03dfc3","article_link":"https://www.wired.com/sponsored/story/four-ways-to-close-the-gender-gap-in-tech-roles/","website_source":"Wired","article_type":"News Article","summary":"Companies Do Better When Their Teams Are Diverse. Here Are Some Strategies…","title":"Four Ways To Close The Gender Gap In Tech Roles","detailed_content":"OVER THE PAST decade, technology has changed radically. Machine learning has taken off, ‘blockchain’ has entered the lexicon, virtual reality has emerged from a winter. But one thing remains the same: a gender gap in the industry.\nIn Europe, for example, the current proportion of women in tech roles is 22 percent, McKinsey research shows. And the women who are there lag their male peers when it comes to promotions – in technical roles, only 52 women were promoted to manager for every 100 men at the same level, according to an analysis by the consultancy in 2021. That compared with 86 women for every 100 men across all job types. \n“To close the gap, we need to create environments that allow women to stay in the industry and to thrive,” says Anne-Marie Imafidon, CEO of Stemettes, a social enterprise she co-founded in 2013 to support girls, young women and non-binary people to pursue careers in science, technology and engineering. “If you do that, problems with retention and promotion will fall away.” \nStemettes is 10 years old, but Imafidon says that the young women the organisation works with are “still asking the same question: ‘Can I do this even though I can’t see anyone who looks like me?’”\nFor the technology industry, fixing the problem is not just a matter of ethics. There is also a business imperative. For one, studies show that more diverse teams tend to perform better. For another, tech companies are facing a shortage of qualified people. In the EU alone, there will be a shortfall of between 1.4 million and 3.9 million tech staff by 2027, McKinsey’s research shows. The consultancy estimates that if the share of women in tech roles could be increased to 45 percent – the equivalent of 3.9 million additional women – by the same year, the skills gap would be closed. \nClearly, working and corporate cultures need to change so that women have an equal chance of being hired and promoted in tech roles. And, of course, the talent pipeline needs to be developed by encouraging and inspiring more women to consider tech as a career in the first place. There are many aspects to the solution, and what follows is by no means an exhaustive set of options. But here are four strategies for companies to consider…\n1. Set radical diversity targets\nTech firms where women account for more than 35 percent of staff are often deemed to be doing comparatively well. In that context, a full gender diversity target is punchy – but a number of businesses are making it work. AI company Mad Street Den, a California headquartered start-up with offices in Chennai, India, New York, and Dubai, was founded on the basis that gender equality would be a defining feature. It has close to a 50/50 split among its 275 staff. \nAshwini Asokan, Mad Street Den’s founder and CEO, says the company had a clear reason for the 50/50 metric, which was “diversity of thought” that would produce better products and technology. “No entity survives when it only has one variety of thought.”Asokan says that recruitment has never been an insurmountable issue – so Mad Street Den focuses its efforts on helping women to stay with the company. Measures include 100 percent pay parity between men and women, an on-site nursery, and detailed discussions at the interview stage about the candidate’s responsibilities and support network outside work. For a period of time when a lot of staff had small babies, there was a nanny in the office.\n“Working in a start-up, the work-life balance can be brutal and you need a strong support system in place to make it work,” says Asokan. “But it’s not an either/or situation – it’s not the case that just because you’re a new mom, you don’t want a director’s role. If you deserve that role in the organisation, what are we going to do to ensure you are supported? How do we keep that person and support them and take care of them?” \n2. Introduce full pay transparency\nA study of senior female technologists by the US bank and credit card company Capital One found that fair and good compensation was a top driver for staying in their job. \nYet in many tech firms, there is a pay gap. One way to address this is pay transparency, and some companies are finding success in taking a particularly radical approach. Consider Buffer, which has published the salaries of all its employees online since 2013. The company, whose software tool helps companies schedule social media posts, also has a formula that sets pay for each role.\nWhile knowing exactly what all of your colleagues earn does “feel foreign” to many staff when they start, it also “broke down barriers for women”, says Jenny Terry, Buffer’s director of business operations. Full pay transparency has had the additional benefit of “really kickstarting recruitment and lifting the number of applications we had” because people knew what they would be paid, she adds.\nStill, in 2018 the company analysed its unadjusted gender pay gap – that is to say, the difference between what women and men are paid overall, not just in direct comparisons of two people doing the same job (known as an adjusted gender pay gap). This assessment showed that women in the company earned nine percent less than men, and in 2019, that figure rose to 15 percent. The reason for the gap was that Buffer had more men in technical roles, which paid better. \n“It was humbling for us because we had relied a bit too much on the formula and the transparency to say ‘we pay equitably’,” said Terry. \nThis further focussed their minds on “making sure we had highly qualified female candidates for technical roles”, she says.\nIt has paid off: Buffer has now narrowed the overall pay gap to less than one percent. The company employs 34 women and 44 men.\n3. Use AI to root out language bias\nIn workplace performance reviews, women are 22 percent more likely to get feedback about their personality than men. As part of that feedback, women are seven times more likely to be described as “opinionated”, 11 times more likely to be described as “abrasive” and 3.5 times more likely to be described as “ambitious”, according to research from Seattle-based Textio.\n“Whether the manager intended it to be positive or negative, that aspect of the feedback was not about the quality of their work or whether they achieved the deliverable in a project,” says Kieran Snyder, CEO of Textio. “The potential for harm is greater in tech organisations because you already have a gender imbalance.”Unconscious bias in language creates problems both in hiring and in retention. The wrong choice of words, however unwitting, may put women off applying for tech jobs in the first place, and performance reviews that turn into personal criticism undermine confidence and can deter employees from applying for promotions. Training is one way that companies try to address this issue – but some companies are turning to artificial intelligence (AI).\nTextio makes AI software to pick up problematic language in recruitment and feedback. Snyder says Textio’s corporate customers see a 30 percent increase in the number of women applying for roles if they use its tool when creating a job ad.\nThe question, as with all AI, is how the humans building the natural language processing tool define the problem – what is biased language? Snyder says the answer lies in having genuine diversity in the team creating the tools. Textio has an equal number of male and female employees.\n4. Intentionally build a pipeline\nA survey last year of more than 2,000 UK school and university students by PwC found that only 27 percent of female students would consider a career in technology. That compares to 61 percent of male students. \nIn addition, just 16 percent of the female students had had a career in technology suggested to them, compared with 33 percent of males. And the lack of role models was notable – only 22 percent of students could name a famous woman working in tech, whereas two-thirds could name a famous man. \nSome companies are taking a proactive approach to addressing this by building a pipeline of female talent for all levels of their organisation. \nThat can start by forging connections with grassroots groups such as Girls Who Code or Stemettes. Anne-Marie Imafidon set up Stemettes to give girls, young women and non-binary people the chance to attend workshops and join mentoring programmes with technology and engineering companies. “If you can see it, you can be it,” she says. \nImafidon also encourages companies hiring for tech roles to be more open-minded to people who may lack a traditional computer science or maths degree, but have other experience and can be trained in the technical skills they need. “It’s not just about HTML – there’s value and benefits in the technology space from a range of experiences – a trained dancer can become a virtual and mixed reality expert,” she says, as that background gives them a deep understanding of movement.\nTo build a pipeline of future leaders, organisations should also ensure that female talent within the business have opportunities to meet and learn from women at the top of their technical specialism.\nThis is something that happens in the British Army. Take Captain Catherine Henderson, who joined the Royal Corps of Signals after gaining her commission at Sandhurst in 2014. The Corps provides battlefield communications and information systems. Through its Inspiring Women in Technology networking group Henderson has had the chance to learn from senior women in both the military and the tech industry.\n“As a young woman embarking on a career in a field that people would label as male-heavy, there is a lot of inspiration to take from women who have been successful in their careers, gained the technical qualifications and done it around having a family,” says Henderson. “They are wearing a lot of hats – mother, commander, technical expert. As a junior officer, it was really nice to have the chance to see that these things were possible.”\nThat sense that these things are possible – whether for girls at school or young women already embarking on careers – will be a vital component to addressing this challenge in the years ahead. There is a mountain to climb, but if aspiration can be created, opportunities extended and attitudes changed, we may have a shot at climbing it. And the idea of increasing the number of women in European tech by 3.9m may start to feel like less of a pipe dream.\nFind out more\nWIRED Consulting brings WIRED's network and knowledge to businesses and thought leaders. It is an independent entity separate from WIRED's newsroom. For more information visit consulting.wired.co.uk\nThis article was originally published by WIRED UK","creation_date":"2023-03-08","tags":["","WIRED CONSULTING"],"author":"BY AMY WILSON","category":null}