{"id":"f648e707-3837-44a8-8656-20554a1c8aea","article_link":"https://cointelegraph.com/news/crypto-history-inflation-debt-evolution","website_source":"Cointelegraph","article_type":"News Article","summary":"The 2022–2023 period saw several bad actors wiped from the cryptocurrency industry, none bigger than FTX’s Sam Bankman-Fried.","title":"History of Crypto: Crippling inflation, rising debt, and the evolving crypto landscape","detailed_content":"The cryptocurrency market took a beating in 2022, falling more than 70% during a time when the industry made headlines around the world for all the wrong reasons — from FTX’s bankruptcy and Sam Bankman-Fried’s arrest to the $50 billion collapse of the Terra ecosystem.\nThe United States also saw inflation hit a 40-year high as the country’s national debt figure continued to rise.\nBut it wasn’t all doom and gloom. In September 2022, Ethereum made the long-awaited transition to a proof-of-stake network, and Bitcoin’s hash rate increased threefold throughout the year. The market also rebounded strongly in 2023.\nHere are some of the major industry events between 2022 and 2023.\nEXPLORE THE HISTORY OF CRYPTO\nU.S. inflation rates have topped out, for now\nCrippling inflation was one of several macroeconomic factors that contributed to the 77.2% price drawdown for Bitcoin\nBTC\n$62,974\nfrom its previous all-time high of $68,990 to a cycle low of $15,740 in November 2022.\nIn fact, the U.S. Consumer Price Index (CPI) inflation rate topped out at 9.1% in June 2022, marking its highest level since 1982, according to the U.S. Bureau of Labor Statistics.\nFortunately, CPI inflation started trending downward after June 2022, bottoming out at around 3% in June 2023. Since then, monthly figures have hovered around the 3% range.\nChange in CPI inflation over the last 20 years. Source: U.S. Bureau of Labor Statistics\nSince June 2023, Bitcoin has soared over 135% from $30,480 to set a new all-time high above $73,000.\nHowever, the CPI inflation rate has risen 11.65% since November 2021, meaning Bitcoin still hasn’t hit its inflation-adjusted all-time high. That will happen when Bitcoin notches $77,026.\nU.S. national debt continues to soar\nThe U.S. national debt continued its exponential rise in 2022 and 2023, increasing 4.35% to $33.2 trillion over those two fiscal years, according to data from the U.S. Treasury.\nChange in U.S. national debt over the last 100 years. Source: U.S. Treasury\nThe debt, which has since risen to $34.5 trillion, has put the U.S. on an “unsustainable fiscal path,” according to U.S. Federal Reserve Chair Jerome Powell.\nFortunately, the U.S. debt to gross domestic product ratio has decreased from about 3.2% to approximately 123%.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nResearchers from the University of Pennsylvania say financial markets can only withstand another 20 years of accumulated deficits projected under current U.S. fiscal policy. After that, the debt dynamics would begin to “unravel.”\nEXPLORE THE HISTORY OF CRYPTO\nCoinbase CEO Brian Armstrong recently voiced that increased Bitcoin\nBTC\n$62,974\nadoption in the U.S. could serve as a “check and balance on excessive deficit spending,” which he believes is essential for the U.S. dollar to remain strong.\nBitcoin’s inclusion would mark a “return to financial discipline,” he added.\nSource: Brian Armstrong \nEl Salvador is a textbook example of this, according to venture capitalist Tim Draper, who believes the country’s Bitcoin investment could help pay off the $215 million in debt it owes to the International Monetary Fund.\n“[If] Bitcoin hits $100,000, they’ll be able to pay off the IMF [and] never have to talk to them again.”\nFTX’s collapse shocks the world as SEC plays cop on crypto industry\nTumbling macroeconomic conditions between 2023 and 2023 arguably impacted every cryptocurrency firm, which led to an array of bankruptcies, liquidations and even prison time for some of the industry’s most controversial figures.\nThe events triggered a wave of regulation by enforcement action by the Gary Gensler-led U.S. Securities and Exchange Commission (SEC), which declared itself the “cop on the beat” for the cryptocurrency industry.\nNo collapse was bigger than FTX, which saw more than $8 billion in misappropriated customer funds wiped from a crashing market. BlockFi also went bankrupt — citing loans it lost from FTX — while Three Arrows Capital filed for Chapter 15 bankruptcy after its excessive leverage on long positions was wiped out.\nCelsius and Voyager were other notable firms that filed for bankruptcy.\nFormer FTX CEO Sam Bankman-Fried was convicted of fraud in November 2023 for his role in orchestrating what some described as the largest fraud in U.S. history.\nSource: Tiffany Fong\nThe $50 billion collapse of the Terra ecosystem and its algorithmic stablecoin TerraUSD (UST) also caused carnage in May 2022.\nThe man largely responsible for that collapse was Do Kwon, the former CEO of Terraform Labs, who spent more than five months on the run in several countries before finally being detained at immigration control in Montenegro for using a fake Costa Rican passport.\nHe faces fraud charges in his home country of South Korea and in the U.S. for the role he played in the Terra collapse.\nThe SEC became even more determined to catch the remaining “hucksters,” “fraudsters” and “scam artists” in the cryptocurrency industry after Bankman-Fried. Most notably, it sued the world’s largest cryptocurrency exchange, Binance, and its former CEO, Changpeng Zhao, who pleaded guilty to money laundering violations in November 2023.\nThe securities regulator also sued Coinbase in June 2023, claiming the trading platform unlawfully listed cryptocurrencies, which it considered to be securities.\nRelated: Bitcoin’s banking crisis surge will ‘attract more institutions’: ARK’s Cathie Wood\nMarch 2023 also saw a local banking crisis, with three cryptocurrency-friendly banks collapsing: Signature Bank, Silvergate Bank and Silicon Valley Bank (SVB). This gave rise to fears that the U.S. banking system may not be as resilient as initially thought.\nEven Fed Chair Powell was left scratching his head over the collapse of SVB.\nEXPLORE THE HISTORY OF CRYPTO\nDespite several industry setbacks, builders kept building.\nMost notably, Ethereum transitioned to a proof-of-stake consensus mechanism in September 2022 and, in doing so, decreased its energy consumption by over 99%.\nThe Bitcoin network also became more secure between 2022 and 2023, with its hash rate increasing 200% to 515 terrahashes per second during that time frame, according to Blockchain.com data.\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-16","tags":["#Blockchain","#Coinbase","#Cryptocurrencies","#Business","#Security","#SEC","#Adoption","#Changpeng Zhao","#Inflation","#National Debt","#Binance","#El Salvador","#Terra","#FTX","#Gary Gensler"],"author":"by Brayden Lindrea","category":null}