{"id":"f66765a1-2c3e-42f3-8e87-e968d06aaa24","article_link":"https://www.wired.com/sponsored/story/four-key-investment-areas-for-business-leaders/","website_source":"Wired","article_type":"News Article","summary":"Research by EY regularly identifies the need for keeping people at the heart of technology-enabled change.","title":"Unlock greater value from your transformation investment","detailed_content":"HOW CAN BUSINESSES keep their technology from becoming stagnant? That’s the question facing senior leaders across the UK who hope to keep pace with technology innovation and retain their organisations’ competitive advantage.\nIt’s no secret that technology moves quickly, and keeping ahead of the curve can be challenging. But trying to predict the future, and where the world of business is headed can often be futile- however, that doesn’t mean companies don’t try.\nBusinesses will routinely invest huge amounts of time, effort and resource on horizon scanning-often with limited success. Horizon scanning, company monitoring and other tools are all the focus of investment budgets, but can only provide so much information. They’re often lagging indicators, telling businesses what things were like in the recent past. They’re also anonymous, detached data points that don’t always link to the unique pressures individual businesses face or provide actionable insight into how things can be changed.\nWhilst senior leaders can sometimes find reassurance in research investment, more often than not, transformative insights can be found from within the company, and derived from the people who keep it turning- your workforce.\n“In a race to induct the most cutting-edge technology, some business leaders can fall into the well-trodden trap of prioritising the technology, and then perceived need for it, over their people, and their actual need for it,” Benoit Laclau, consulting managing partner for the UK and Ireland at EY.\n“We often ask our clients: ‘Are you reframing the future, or is the future reframing you,’” says Laclau. The question is designed to prompt thinking about hoped for growth aspirations against the backdrop of the changing market- and whether the company is leading the way, or being led by change. Establishing that core principle- of what investment is needed where, at what level, to best benefit the business- is done through collaboration with stakeholders across an organisation, including customers, employees and citizens. By putting stakeholders at the heart of transformation projects, EY teams are better able to establish which investment areas should. be prioritized and for what purpose.\nItalian news organisation Agenzia Nazionale Stampa Associata (ANSA) approached EY teams with a complex problem: they needed support to help provide transparency in the origin of the news they were reporting. Staggeringly, falsehoods are 70 percent more likely to be retweeted on social media than the truth, according to research by MIT Media Lab, which can undermine the reputation that news agencies such as ANSA are keen to preserve.\nTo see how ANSA’s news stories spread across the internet, EY teams implemented a blockchain based solution; when an editor publishes a news story it’s fed into the system automatically, with its ID and publication details in a block that is made immutable through notarisation on the blockchain. When these stories are published online, they are given an “ANSACheck” sticker that readers can click on to see who has written and potentially republished them. ANSACheck enables readers to confirm that news origins are true and trusted, and drives a deeper understanding of the news process – which is particularly relevant if a story is controversial.ANSACheck came into its own during the Covid-19 pandemic, when disinformation thrived and many readers asked about the origin of some stories that mentioned ANSA as a source. ANSA was able, through ANSACheck, to confirm that the source of the stories was not authentic. It combined the best of both worlds: a data-driven, human-centric approach can help affect meaningful change.\n“Investment for investment’s sake isn’t worth it,” says Laclau. “It needs to have a purpose for leaders to see a return on their investment. In the Tech Horizons survey conducted by EY teams, 71 per cent of respondents ranked talent and culture in the top three success factors for transformation. Businesses that exceed expectations combine people and technology to grow their business faster. It is rarely the case that technology alone helps businesses to innovate- successful transformation relies on designing technology around user needs and putting people at the heart of change, as ANSA did.”\nBut delivering on the promise of human-centric transformation is often easier said than done. EY teams are brought in to help initiate and deliver change within businesses with whom they work to avoid falling into the trap of rolling out a technology that doesn't meet needs of the business or its stakeholders.\nTo discover how ANSA used blockchain technologies to restore trust in news and deliver a people-centric transformation, read the full case study, then see how EY teams can help you.\nThis article was originally published by WIRED UK","creation_date":"2023-09-11","tags":[""],"author":null,"category":null}