{"id":"f6762e62-80f3-48bd-95ba-8cccbeac4e38","article_link":"https://cointelegraph.com/news/coinbase-ethereum-l2-base-material-share-socialfi-franklin-templeton","website_source":"Cointelegraph","article_type":"News Article","summary":"Base is already home to 46% of transactions related to SocialFi on-chain, but the asset manager says it has even more room to grow.","title":"Base set for ‘material share’ of SocialFi activity: Franklin Templeton","detailed_content":"Trillion-dollar asset manager Franklin Templeton suggests “Base Season” has arrived with the rise of Social Finance (SocialFi) apps, with Base leading other Ethereum layer 2s in the vertical.\n“[It is] positioning itself well to capture a material share of SocialFi activity and remain a leader in the Ethereum L2 sector going forward,” Franklin Templeton said in a May report.\nAbout 46% of transactions related to SocialFi are on Base, which has increasingly stripped market share away from the BNB Chain and Polygon in recent months, according to one of the charts provided by Franklin Templeton.\nFranklin Templeton said support from Coinbase has played a key role in Base capturing nearly half of the SocialFi market share to date.\nFriend.tech is perhaps the most notable SocialFi application built on Base, which allows creators to connect and monetize their content through “key” shares or “tokenized attention.”\n“Base has hit a homerun in the world of SocialFi,” which will remain a “key vertical to watch” for Base’s adoption and growth over the long haul, Franklin Templeton said.\nSource: Franklin Templeton\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nTheta Network, Decentralized Social, Fantasy.top and Steem are among the other popular SocialFi blockchains and protocols. \nFranklin Templeton highlighted the recent memecoin mania as another key contributor to Base’s rise in network activity.\nRelated: Coinbase sees infinite interoperability potential with Ethereum and USDC\nBase is the third largest Ethereum layer 2 network by total value locked now with $5.4 billion, only trailing Arbitrum One and OP Mainnet at $15.9 billion and $6.90 billion respectively, according to L2BEAT.\nHowever, Base has risen from $1 billion to $5.4 billion in less than three months after it taking six months to break the $1 billion milestone,\nMeanwhile, Arbitrum One and OP Mainnet have seen their TVLs tallies fall over the last two months.\nCoinbase officially launched Base last August. The cryptocurrency exchange is the sole sequencer of Base, meaning the chain is fully controlled by the exchange, L2BEAT data shows.\nHowever, Coinbase intends on progressively decentralizing Base over time.\nIt was built using Optimism’s OP stack, and is focused on offering a secure, cost-efficient, and builder-friendly environment for Ethereum Virtual Machine-compatible applications.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-05-09","tags":["#Blockchain","#Coinbase","#Business","#Adoption","#Base","#Memecoin"],"author":"by Brayden Lindrea","category":null}