{"id":"f703a451-13bb-4b97-8e64-e9bfe1910ad4","article_link":"https://cointelegraph.com/news/man-city-okx-limited-edition-jerseys-nfts","website_source":"Cointelegraph","article_type":"News Article","summary":"A limited number of Manchester City’s “Unseen City Shirts” NFTs are algorithmically linked to physical, limited-edition jerseys featuring hand-painted artwork and matchday experiences.","title":"Man City and OKX release limited-edition jerseys tied to rare NFTs","detailed_content":"Premier League football club Manchester City is launching a new nonfungible token (NFT) collection that will allow fans to win a limited number of unique jerseys and matchday experiences.\nThe “Unseen City Shirts” campaign is the latest move in a long-term partnership with cryptocurrency exchange OKX. Users can mint the digital collectibles on the OKX app, which offers a chance to win redesigned, commemorative football shirts depending on the rarity of the NFT.\nMan City stars Sergio Gómez, Erling Haaland and Jérémy Doku model the limited edition “The Roses and the Bees” jerseys, which feature hand-painted elements by artist Christian Jeffery. Source: Manchester City\nCointelegraph spoke exclusively with OKX global chief marketing officer Haider Rafique and Man City chief marketing and fan experience officer Nuria Tarré to discuss the details of the new campaign.\nThe limited collection jerseys feature designs incorporating the Lancashire rose and the Manchester worker bee, hand-painted by artist Christian Jeffery.\nRafique explains that the rarity of the NFTs is determined algorithmically. Five ultra-rare NFTs will give access to a play-on-pitch experience, two tickets to a Manchester City match and a limited-edition City shirt.\n“The Roses and the Bees” NFT jersey as seen on OKX Marketplace. Source: OKX\nA further five rare NFTs include a stadium tour experience, a hospitality ticket and a “The Roses and the Bees” design jersey. OKX users can mint the NFTs at no cost on the OKX Marketplace.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nNuria said that the NFT launch is part of the Premier League club’s strategy to attract audiences that are “more tech-savvy, open to new innovations and technology.” Digital ownership is another dimension that Man City is interested in bringing to its fans. Tarré explained:\n“We think it’s important that you can own this piece digitally. I think that’s one of the beauties of Web3 — it changes the ownership process.”\nMan City’s chief marketing officer said the club will continue to explore the possibilities of Web3, both through its partnership with OKX and other avenues. Tarré said the club has actively experimented with new technology in Web2 and metaverse environments.\nMan City ventured into the world of Roblox in late 2022, with Tarré describing Web3 environments as the most progressing and exciting:\n“Technology keeps on evolving and applications keep on evolving. You can add layers of sophistication, creation and co-creation. We’re definitely willing to explore further.”\nIn recent years, Rafique has actively driven OKX’s high-profile sports partnerships with Manchester City and Formula 1 team McLaren. The exchange has been exploring different marketing initiatives to tap into the fan bases of these sporting brands. \nThe OKX CMO explained that the past three years have been spent laying foundational work to provide utility to sports fans and Web3 users. Starting with basic NFTs attached to physical goods aims to provide the platform to create more utility-based ecosystems. Rafique said:\n“I don’t think it’s a lack of intention. I think it’s a lack of product and technology infrastructure, which will come as the industry progresses and as our partnership progresses.”\nOKX first partnered with Man City in March 2022 before expanding its sponsorship by becoming the club’s official training kit partner for the 2022–2023 season. OKX then sealed a new deal to become City’s official sleeve partner in a new multiyear agreement in June 2023.\nMagazine: Crypto scoring big with European football\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday\nSubscribe","creation_date":"2024-04-22","tags":["#Blockchain","#Football","#Adoption","#Sport","#NFT"],"author":"by Gareth Jenkinson","category":null}