{"id":"f7286e6c-175f-47c9-a88a-41337ba5c6a7","article_link":"https://medium.com/@joshgans/is-twitter-a-public-ledger-5257e1064926","website_source":"Medium","article_type":"Blog Post","summary":"Yes, yes it is and that may be why Musk wants it","title":"Is Twitter a public ledger?","detailed_content":"One of the hallmarks of blockchains is that they are public ledgers. The record of which wallets have which tokens is available for all to see on Bitcoin, Ethereum and anywhere else. You may not know who actually owns the wallets but there is a record there.Which brings me to Twitter. Twitter is a public record of messages associated with an account. You don’t know for sure who owns an account (unless they are verified) but you know that the account has given permission for certain messages to be listed in the ledger. Unlike blockchains, those messages are revocable from the ledger itself. But like blockchains, any message that was once part of the ledger can usually be recovered and so it is hard to remove messages completely once they have been public.Which brings me to Elon Musk. In one of the many statements he made upon agreeing to buy Twitter, Musk wrote:The key phrase is “authenticating all humans.” That could actually mean pretty much anything so I am going to do what any sensible commentator would do in this situation which is to write what I think that means, why it is valuable and, therefore, assert that this is what Musk has in his mind all along.Which brings me to Paul Graham. Graham was the founder of Y-combinator and wrote a very short essay in 2009 on “why Twitter is a big deal.” Here is most of it:You can see the relationship to my previous statement that Twitter is a public record with messages associated with accounts. The messages themselves have records and so are easy to point to by others. That is the heart of communications protocol.Communication protocols work best when you can authenticate when a message comes from a specific person. This is why email and phone spam have threatened previous protocols; phones are pretty much useless but email was recovered. They are the bots taken over which is something Elon Musk, at least, is worried about on Twitter (although one wonders whether that is really a ‘famous’ rather than ordinary people problem there). At times, the same issues have been obvious to Apple (hence, iMessage’s success) and Facebook which at an earlier time wanted to use its own email service to solve that problem.Twitter, being a public record, offers a potentially easy way of authenticating people. You often see people use it with messages like this:This was a service called Mirror that I set up an account on. I was then able to associate that account with my Twitter identity. That still doesn’t verify if either of them is associated with me in the real world but it starts to get at something. It is one of the methods proposed in the soulbound token paper I discussed last week.Herein lies the authentication that Musk might be talking about. If people could have their Twitter accounts verified to be associated with a real human, then by virtue of the Twitter public ledger, that could be used to associate that Twitter account and, by consequence, the human behind it with all manner of other accounts. If you can do that, you can get all of the web3 benefits from identification that have been outlined as well as providing a layer for all manner of identification.Of course, there are many who might not want that. I am not going to argue the pros and cons here. My goal was just to point out the possibility inherent in what Twitter is. It has already started to be used in that way but one can imagine that paired with other blockchain-like technologies it could go further. Is Twitter the best way to achieve all of this? I don’t know. What I do know is that it is there are a few hundred million people who are happy to use it which gives it a considerable headstart.","creation_date":"2022-06-06","tags":[],"author":"Joshua Gans","category":null}