{"id":"f73e2049-9e75-4b84-bd19-e7d7f7a23955","article_link":"https://medium.com/@crypto_algebra/exploring-linea-with-algebra-lynex-orbs-bedrock-beefy-get-your-share-of-3k-rewards-on-galxe-7d9886c4600e","website_source":"Medium","article_type":"Blog Post","summary":"The Algebra team is thrilled to announce our adventure on Galxe, diving deep into the Linea ecosystem with top-notch projects like Orbs…","title":"Exploring Linea with Algebra, Lynex, Orbs, Bedrock & Beefy: Get Your Share of $3k Rewards on Galxe","detailed_content":"The Algebra team is thrilled to announce our adventure on Galxe, diving deep into the Linea ecosystem with top-notch projects like Orbs, Beefy, Bedrock, and our partnering Linea-native DEX powered by Algebra — Lynex. Participants who complete all the tasks in this campaign will be eligible to receive a share of the $3k pool prize — $2k in bveLYNX and $1k in USDC.Learn more below.Behold the efficiency & simplicity of DeFi trading powered by Algebra’s DEX engine on Linea!Complete the social tasks from all projects and trade any tokens on Lynex starting from $15 to get your hands on the provided rewards. It’s as easy as that!Linea serves as one of the next-gen L2s, delivering unrivaled network security with its cryptographically secure zk infrastructure, comprehensive security partnerships, and a security-oriented ecosystem culture. So, it’s only natural that groundbreaking DeFi projects connect within the Linea ecosystem. Let’s give it up for the projects launching the campaign!To claim your share of rewards — $2k in bveLYNX & $1k in USDC — you’ll need to complete all the tasks & get the maximum amount of points — 100. Only users who complete each of the tasks will be eligible for the airdrop.Here’s what you need to do:That’s it! Participants who complete all the tasks & get the maximum of 100 points will receive their rewards after the campaign concludes on May 21st.Duration: May 7th — 21stSee all the details on our “Exploring Linea with Algebra, Lynex, Orbs, Bedrock & Beefy on Galxe” campaign page.Algebra is a pioneering DEX Engine, leading the way with innovative AMM solutions with Concentrated Liquidity for DEXes, boasting $233M TVL, up to $572M Daily Trading Volume & over 8% of all DEX EVM volume.Providing 20+ decentralized exchanges with a CLAMM codebase, it’s the first B2B DeFi protocol offering a comprehensive one-stop DEX-as-a-Service (DaaS). Already empowering THENA, Camelot, QuickSwap, StellaSwap, Lynex, Hercules, Swapsicle, Kim & more.Learn more about:a. Algebra DEX engine as a whole DEX ecosystemb. Integral, the first live V4 AMM platform ever, here.Lynex stands as Linea’s premier liquidity engine, democratizing sophisticated liquidity strategies and seamlessly connecting everyday traders with expert-level capabilities. Our platform features a competitive ecosystem of Automated Liquidity Managers (ALMs) and strategists, all striving to optimize returns, reducing risks such as impermanent loss with the help of Algebra DEX engine’s DeFi solutions, and elevating efficiency for every participant.Orbs is a “Layer-3” public blockchain infrastructure project powered by PoS, pioneering on-chain innovation since 2017.Orbs is a separate execution layer between L1/L2 solutions and the application layer as part of a tiered blockchain stack, enhancing the capabilities of smart contracts and powering protocols such as dLIMIT, dTWAP, and Liquidity Hub.Bedrock is a multiple asset liquid restaking protocol, backed by a non-custodial solution designed in partnership with RockX, supporting multiple assets for both restaking / staking uniBTC, uniETH and uniIOTX.Beefy is a Decentralized, Yield Optimizer that allows its users to earn compound interest on their crypto holdings. Beefy earns you the highest APYs with safety and efficiency in mind.","creation_date":null,"tags":["Galxe","Defi","Uniswap","Linea","Blockchain"],"author":"Algebra","category":null}