{"id":"f77186d3-4023-4279-a2f4-122a781dc21d","article_link":"https://cointelegraph.com/news/north-korean-hackers-deploy-durian-malware-targeting-south-korean-crypto-firms","website_source":"Cointelegraph","article_type":"News Article","summary":"The state-backed North Korean hacking group Kimsuky reportedly used a new malware variant to target at least two South Korean crypto firms.","title":"North Korean hackers deploy ‘Durian’ malware, targeting crypto firms","detailed_content":"North Korean hackers are reportedly utilizing a “striking” new malware variant dubbed “Durian” to launch attacks on South Korean crypto firms.\nThe North Korean hacking group Kimsuky used the new malware in a series of targeted attacks on at least two cryptocurrency firms so far, according to a May 9 threat report from cybersecurity firm Kaspersky.\nThis was done through a “persistent” attack by exploiting legitimate security software used exclusively by crypto firms in South Korea.\nSource: Kaspersky\nThe previously unknown Durian malware acts as an installer that deploys a continued stream of malware, including a backdoor known as “AppleSeed,” a custom proxy tool known as LazyLoad and other legitimate tools such as Chrome Remote Desktop.\n“Durian boasts comprehensive backdoor functionality, enabling the execution of delivered commands, additional file downloads, and exfiltration of files,” wrote Kaspersky.\nAdditionally, Kaspersky noted that LazyLoad was also used by Andariel, a sub-group within fellow North Korean hacking consortium Lazarus Group — suggesting a “tenuous” connection between Kimsuky and the more notorious hacking group.\nRelated: North Korean Lazarus hacker group using LinkedIn to target and steal assets: Report\nFirst emerging in 2009, Lazarus has established itself as one of the most notorious groups of crypto hackers.\nOn April 29, independent blockchain sleuth ZachXBT revealed that the Lazarus group had successfully laundered over $200 million in ill-gotten crypto between 2020 and 2023.\nThe Lazarus Group is accused of stealing over $3 billion in crypto assets in the six years leading up to 2023.\nLazarus was credited with stealing over 17% — a little over $309 million — of the total stolen funds in 2023. Throughout 2023, more than $1.8 billion worth of crypto was lost to hacks and exploits, according to a Dec. 28 report by Immunefi.\nMagazine: Lazarus Group’s favorite exploit revealed — Crypto hacks analysis\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe\nBy subscribing, you agree to our Terms of Services and Privacy Policy","creation_date":"2024-05-13","tags":["#Bitcoin","#Blockchain","#Cryptocurrencies","#Business","#South Korea","#North Korea","#Scams","#Hacks"],"author":"by Tom Mitchelhill","category":null}