{"id":"f7cb6b96-ee5f-41a8-9864-b8ea864bb9b7","article_link":"https://www.wired.com/story/new-moviepass-features/","website_source":"Wired","article_type":"News Article","summary":"After rising from the dead, the theater subscription service is back with a convoluted new business model. Here’s how it works and how to sign up.","title":"Everything You Should Know About the New MoviePass","detailed_content":"MOVIEPASS, THE BELEAGUERED startup that aimed to revolutionize seeing movies at the theater (and sort of did, indirectly) is back. After bankruptcy, a pandemic that shut down movie theaters anyway, and an acquisition, it's taking another crack at the subscription model. Here's what we know about MoviePass 2.0.\nWhat Happened to the Old MoviePass?\nIn case you're not up to speed, here's the short version: For several years, MoviePass offered a simple subscription for watching movies in theaters. The company experimented with different models, such as $15/month for a couple of movies, or $40 to $50 per month for unlimited movies. \nThen, in 2018, the company made a bold, absurd change: up to a movie every day for $10 a month. In many parts of the country, that's less than the price of a single movie ticket. And MoviePass was paying full price to theaters for every ticket. Millions of users signed up, and why wouldn't they? It was essentially free money from MoviePass.\nFEATURED VIDEO\nMeet the Guy Making Horror Movie Masks for 40 Years\nThe plan didn't go well. Over time, MoviePass had to raise prices, customer support started languishing, and the company's alternative plans to generate revenue fell through. Worse (for MoviePass, but great for us), theater chains themselves started offering their own subscriptions. \nThese were more financially viable, since theaters pay less to studios for tickets than MoviePass paid to theaters. Plus, even if theaters took a loss on ticket sales, they would still benefit from increased concessions revenue. (At one point, in an attempt to bring in revenue, MoviePass argued that it should get a cut of theaters' concessions sales. This also didn't go well.)\nEventually MoviePass went into bankruptcy, and one of the company's cofounders, Stacy Spikes, bought back the company. Why is all this history relevant? Well, if you're planning to sign up, it's worth keeping in mind that this is yet another in a long line of attempted business models. It remains to be seen whether this one will work out.\nHow Do I Sign Up for MoviePass?\nThe current iteration of MoviePass (dubbed MoviePass Beta) is rolling out in stages—presumably to help mitigate a similar rush-and-crash that its predecessor experienced, which is certainly a risk factor, since the waitlist itself crashed the minute it went live). On August 25, 2022, the company opened up a waitlist for five days. \nIf you signed up for the waitlist during that window, you're in line to get an invite to the new MoviePass. Once you're in, you'll get a cache of invites that you can send to your friends. If you missed the waitlist period, finding someone with one of these invites will be your best bet until around summer 2023.\nMoviePass Beta isn't launching in all markets at once. The company says that it's gauging interest in different parts of the country based on how many people sign up for the waitlist in an area. Many major cities like Chicago, Atlanta, Dallas, and Austin have already gained access. Prices will also vary somewhat based on what city you're in, particularly in New York and California.There are three main price tiers at around $10, $20, and $30 per month (with a fourth $40 tier “in select markets”). Rather than providing a set number of movies, these plans give you a certain number of credits. These credits can be spent on buying movie tickets, and some of your unused credits will roll over to the next month. It's a more complicated system than in the past, so let's break down how it works.\nHow Does the New MoviePass Work?\nThe details of the system were vague when the company presented its comeback plan back in February 2022. Fortunately, we've gotten into the beta and have a clearer idea of how it works. Note: I'm using the service in Austin, Texas. Some details and prices may differ depending on where you live, or if the service changes before the full public release later this summer.\nFirst, the MoviePass card is back. In black, this time, instead of the previous iconic red. Similar to the old MoviePass, you'll use this card to pay for your ticket instead of your own debit card. Unfortunately, this leads to the biggest limitations of MoviePass: You can only buy tickets in person at the theater, and only for the same day. It's not possible to buy tickets for a movie in advance.\nHowever, there are (apparently) select theaters that support e-ticketing where some of these restrictions may not apply. I wasn't able to test this, as every theater within 50 miles of me—including AMC, Regal, Alamo, and several independent chains—all require the card. \nYour MoviePass subscription gives you a set number of credits and, depending on the movie's showtime, it will cost a certain number of credits to purchase a ticket. Matinees (any movie before 4 pm) generally cost 10 credits, while evening movies cost 15 credits on weekdays and 20 credits on weekends. And Friday night counts as a weekend, naturally.\nThis credits system means that how many movies you can see per month depends on a number of factors. The basic $10/month plan comes with 34 credits, for example. That's enough for three matinees, or one weekend evening movie. However, let's say you spend 20 credits on a weekend movie and have 14 left over. The next month, you'll get another 34, for a total of 48. So that month you could watch two weekend movies.\nWell. Sort of. The company's documentation is a little inconsistent during the beta. On MoviePass' FAQ page, the company says that up to two months' worth of credits will roll over. So, in this example, you could bank up to 68 credits. So you could save up some, but eventually you'll hit a use-it-or-lose-it wall.\nHowever, in my experience on the mobile app, I found different information. On one page showing the subscription options, a note says, “Half of your remaining credits are kepto [sic] to the next month if a subscription is active.” In another part of the app, it tells me that all 34 of my unused credits will roll over.In other words, it's a beta. This isn't a proper review of the service, so I won't hold some inconsistencies or typos against it. But if you're going to try out the beta, it's worth keeping in mind how much the details might change over the next few months. If you were burned by the inconsistencies of MoviePass in the pass, it might be a little more stable now, but you can still expect a bit of turbulence.\nIt's also worth noting that, as of right now, the price (in credits) per ticket isn't changing based on which movie you're watching, but we can't say for certain this won't happen in the future. As of writing, it costs just as many credits to watch Ant-Man and the Wasp: Quantumania on a Friday night as it does to watch Cocaine Bear. Even though one of those is clearly going to be more popular. Here's hoping it stays that way.\nIs Crypto Involved?\nOne of the strangest aspects of MoviePass's February 2022 presentation is that it seemed to be trying very hard not to come off as a crypto company. It touted its new vision as “powered by Web3 technology,”—Web3 usually being a shorthand for blockchain- and/or crypto-based products, two words that MoviePass was careful to steer clear of.\nDuring the presentation, MoviePass mentioned tokens that would be tradable and could roll over from month to month. This sounds like it describes the credits that roll over in the current plan, but there's no trading functionality yet. To be clear, the company hasn't discussed these features beyond that presentation, and at the time of writing the company's FAQ page doesn't mention them. However, they may eventually be part of the package, which would raise questions about how these tokens are supposed to work.\nFor example, during the presentation, the company discussed PreShow, its facial recognition, eye-tracking technology that MoviePass wants to use to show users ads. The more ads a user watches–and really watches, as confirmed by PreShow–the more tokens they earn. Or at least, that was the hypothetical plan laid out in February. There may be other ways that credits can be earned beyond the basic subscription in the future.\nBeyond that, there's no clear info on what Web3 would mean in this context. For now, we're in a wait-and-see formation. Nothing about MoviePass' new model sounds as obviously broken as its plan to charge users $10 for $12 movie tickets, but the success or failure of this iteration of MoviePass is going to be in the details.","creation_date":"2023-04-09","tags":["","MOVIES","FILM","CULTURE","MULTIMEDIA"],"author":"BY ERIC RAVENSCRAFT","category":null}