{"id":"f983c39a-2237-4451-9238-54dd576224bd","article_link":"https://cointelegraph.com/news/binance-gambaryan-bail-application-delayed","website_source":"Cointelegraph","article_type":"News Article","summary":"Gambaryan’s lawyer, Mark Mordi, criticized the prosecution for failing to file a response to the additional affidavit submitted with his bail application.","title":"Binance exec remains in jail as bail appeal fails again","detailed_content":"A Federal High Court in Abuja, Nigeria has once again postponed the bail application hearing for Binance executive Tigran Gambaryan, who remains in custody at the Kuje correctional center. \nOriginally set for April 18, the court has rescheduled the hearing for April 22, according to local news agency Nairametrics.\nDuring the court session, the Economic and Financial Crimes Commission (EFCC) told the court that Gambaryan’s lawyer submitted an additional affidavit to his bail application on April 16.\nSenior counsel E. Iheanacho highlighted new points raised by the defense, requiring time for a proper response in the pursuit of justice.\nThe judge presiding over the case, Justice Emeka Nwite, agreed to postpone the proceedings. However, Gambaryan’s lawyer, Mark Mordi, emphasized that his client has been held in federal government custody for over 14 days.\nHe criticized the prosecution for failing to file a response to the additional affidavit submitted with his bail application.\nTigran Gambaryan leaving the court as his bail hearing adjourned at the federal high court in Abuja, Nigeria on April 18. Source: Nairametrics\nThe trial judge remanded the Binance executive after he pleaded not guilty to money laundering charges by the EFCC. The agency accused Binance, Gambaryan and Nadeem Anjarwalla of concealing the source of $35.4 million revenue in Nigeria, alleging it was the proceeds of unlawful activity.\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nFollowing the court’s acceptance of the EFCC’s arraignment of the defendants, Mordi requested the court to provide his client bail under lenient conditions.\nRelated: Nigeria’s crypto reputation will prevail despite recent setbacks — Exchange exec\nThe court allowed the EFCC to hold the Binance executives for 14 days and ordered Binance to give the government access to data and details of Nigerian traders using its platform.\nBinance and its executives are dealing with two distinct lawsuits: one from the Federal Inland Revenue Service (FIRS) related to tax evasion and another from the EFCC accusing them of money laundering and foreign exchange violations.\nHowever, Gambaryan is also suing the government for violating his fundamental human rights. Gambaryan’s motion claims that his detention in Nigeria and the confiscation of his passport violates the country’s constitution, which guarantees an individual’s right to personal liberty.\nOn Feb. 28, Nigerian officials arrested the two high-ranking Binance executives — Anjarwalla, a 37-year-old British-Kenyan overseeing operations in Africa; and Gambaryan, a 39-year-old American — during a visit to Nigeria.\nThe arrest came after the federal government banned cryptocurrency channels as part of a campaign to curb currency speculation. However, Anjarwalla escaped detention using a fake passport.\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-19","tags":["#Blockchain","#Government","#Nigeria","#Cryptocurrency Exchange","#Binance","#Regulation"],"author":"by Amaka Nwaokocha","category":null}