{"id":"f991124f-3899-4257-9042-71a501fc1fe3","article_link":"https://cointelegraph.com/news/gamefi-ecosystem-comeback-amid-surging-crypto-prices","website_source":"Cointelegraph","article_type":"News Article","summary":"The number of daily active wallets engaging in GameFi has doubled over the past year.","title":"GameFi ecosystem makes a comeback amid surging crypto prices","detailed_content":"After a dormant 2022 and much-muted 2023, GameFi projects are making a comeback as the bull market rages.\nThis week, move-to-earn protocol StepN announced it would partner with Adidas for a 1,000 Genesis Edition nonfungible tokens (NFT) drop on Solana. The launch is part of an ongoing one-year partnership between the two firms that will see a mixture of NFTs and wearable sneaker releases in the future. Each NFT sneaker from Genesis Edition will be valued at 10,000 GMT ($2,200).\nCreated by FSL in 2021, StepN allows users to earn rewards for walking, jogging, or running. Rewards are available after users purchase a virtual Sneaker NFT and link their smartphones. By interacting with the app, users earn GMT tokens, which have an inflationary mechanism, a supply cap of 6 billion and a current diluted market capitalization of $1.2 billion.\n\"Partnership between the most widely used lifestyle app and a global brand like Adidas are now a reality indicates the direction lifestyle rewards are going,” commented Shiti Manghani, CEO of StepN. Last week, the move-to-earn protocol also announced a $30 million airdrop for its loyal users. \nStepN's NFT sneaker mechanics\nFor other protocols, it's more about the hardware.\nEarlier this month, Ordz Games revealed its first Web3 handheld gaming device, “BitBoy One.” Inspired by the first-generation Nintendo GameBoy from 1989, the device allows players to earn Bitcoin\nBTC\n$62,974\nvia retro-style games.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\n“Through BitBoy’s native applications connected to the Bitcoin blockchain, users can play a wide variety of video games that are forever inscribed on the Bitcoin blockchain as ordinals,” wrote Ordz Games staff. “Choices range from HTML games to on-chain emulators and ROM,” they added. Both Bluetooth and WiFi are supported for multiplayer activity.\nIn addition, every BitBoy device comes bundled with a one-to-one 3D rendering of the physical device in the form of ordinal inscriptions, which can then be viewed on a VR device such as Apple Vision Pro. The device saw its official unveiling at Paris Blockchain Week. \nThe BitBoy One game device (X)\nOther projects have shifted their attention to video games.\nARPG Seraph: In the Darkness, built on Arbitrum and developed by Seraph Studio, recently achieved sales of over 11,000 Ether\nETH\n$3,030\nthrough multiple in-game NFT sales consisting of heroes, priority passes, gear, and others. Seraph Studio is backed by Korean gaming giant Actoz Soft. Set for pre-season launch on April 19, the game features a dark medieval setting where players can customize their heroes, battle monsters, and earn loot. \nThe game has teased upcoming features in its pre-season that allow players to rent their in-game NFT equipment to earn rewards as well as discoverable treasure NFTs.\nSeraph: In the Darkness has been in development since 2021, with a total of $8 million spent on operations and research. During this time, developers have also been incorporating new technologies, with features such as multiplayer AI companionship available in the final release. The game is scheduled for launch on PC, iOS, and Android.\nIn the Darkness blockchain gameplay\nAs per data from DappRadar, the number of unique active wallets in GameFi has more than doubled over the past year to 2.54 million. Last December, gaming studio founders Yat Siu and Johnson Yeh predicted that “tens of millions” of players would enter Web3 gaming this year. Despite their enthusiasm, GameFi projects have also been criticized for prioritizing the “finance” aspect of gaming over fun, with several notable collapses in the past year. \nRelated: Is GameFi subject to the same market forces as the traditional game industry?\nExchange or buy GMT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-17","tags":["#Blockchain","#Cryptocurrencies","#Adoption","#DeFi","#Web3","#STEPN","#GameFi"],"author":"by Zhiyuan Sun","category":null}