{"id":"fa1b8921-c92b-49f9-84ce-f3411d38b8ea","article_link":"https://www.wired.com/story/hottest-startups-in-stockholm-2022/","website_source":"Wired","article_type":"News Article","summary":"A city famed for friendliness also has a booming startup scene—and that network of founders supporting founders has led to a slew of firms taking the lead.","title":"The Hottest Startups in Stockholm","detailed_content":"SWEDEN OFTEN TAKES top billing in any global rankings concerned with altruism and business. It’s little surprise then that entrepreneurs with a progressive streak have long stalked the narrow cobbled streets of its capital, Stockholm. Here, a city renowned for great ideas, design, and innovation has become a tightly packed startup haven overlooking the Baltic Sea. World-famous names like Spotify and Klarna have already changed how we listen to music and shop. Now, a fresh crop of mission-focused disruptors want to reshape how we think, from our everyday health and business to our longer-term earthly conservation.\n“Stockholm is big enough not to create negative competition, but small enough so that everyone knows everyone on the entrepreneurial and investor side,” explains Charlotte Ekelund, CEO of workplace collaboration tool Teemyco. “The ecosystem here is based on friendship and helpfulness. We as a people in Sweden are keen on the common good: sustainability and mission is talked about a lot here.”\nTreyd\nFor Treyd cofounder Peter Beckman, the comparisons with Klarna are inevitable. But his startup offers the Buy Now, Pay Later model to businesses rather than consumers. “30 percent of world trade is paid by cash in advance,” explains Beckman. “Banks can’t give loans to companies whose entire assets are in a factory tens of thousands of miles away. So, we provide the capital.”\nTreyd fulfills supplier invoices on behalf of businesses, which have up to 120 days to pay the loan back. In that time, direct-to-consumer brands can receive their goods, sell them, and have cash flow. Founded in 2019 by Beckman and Sameh El-Ansary, Treyd’s early years have coincided with supply chains creaking from the pressures of Covid-19 and the Suez Canal blockage. That’s been good news for Beckman. “We’re at the stage where 20 percent of all our clients ever have come from the previous 30 days. Brands have been forced to place orders much earlier, meaning they’ve had to pay for orders much earlier.” Treyd raised £8.4 million (around $9.45 million) in a Series A round in May ahead of expansion to the UK. treyd.io\nLEIA\nAccording to the World Health Organization, an estimated 140 million babies are born every year worldwide. And according to Astrid Gyllenkrok Kristensen, cofounder of femtech startup LEIA, 90 percent of mothers will experience some mental or physical difficulties within 12 months of giving birth. That was the experience of cofounder, Sandra Wirström, who suffered life-changing postpartum injuries following a medical misdiagnosis. “When I was pregnant, I had instant access to health care, a good understanding of the different trimesters, and hundreds of apps to choose from,” adds Kristensen. “When my pregnancy ended, so did the focus on me as a woman: All the health care, information, and apps shifted to the baby.”\nLEIA, founded in 2021, aims to redress that balance. Its post-pregnancy health app is a personalized digital tracker for new mothers. “By building screening models for postpartum depression and pelvic dysfunction, we can identify women at risk at a much earlier stage—even before health care providers,” adds Kristensen. Since going live in February, 20 percent of users have been identified as being at risk of postpartum depression. LEIA has raised £560,000 (around $630,200) in pre-seed funding. meetleia.comJohan Pihl and Mathias Wikstöm, cofounders of climate fintech Doconomy.PHOTOGRAPH: CHRISTOPHER HUNT\nDoconomy\nClimate fintech Doconomy calculates the environmental cost of every purchase made on its DO credit card. Fed through its API, each transaction is presented in both krona and a carbon footprint rating based on company or merchant category. But the technology aims to do more than raise awareness: Its app also enables customers to take action, offering carbon offsetting options and donations toward global sustainability projects.\nDoconomy’s technology has been integrated across Mastercard’s global network; its Impact API has now processed data from more than 2 billion transactions, reaching over 750 million users. Founded by Mathias Wikström and Johan Pihl in 2018, it’s totaled £15.5 million (around $17.4 million) in funding. “Ultimately it’s about disclosing the blind spots of impact,” Wikström says. “We make sure we help facilitate reduction in line with net-zero targets, for both individuals and corporations.” doconomy.com\nCling Systems\nWilliam Bergh had the idea to develop a trading platform for used EV batteries while completing his master’s thesis, which involved research at Stockholm sustainable battery maker Northvolt. “I saw a gap in the market: There was no clarity on where batteries actually end up with existing systems,” says Bergh. Cling Systems, founded in 2020, connects the ecosystem to ensure batteries are reused, repurposed, and recycled. In a January pre-seed funding round, it raised £1.7 million (around $1.9 million) to help build a real-time map of used batteries to ensure maximum commercial and environmental benefits. Its existing supply includes 2,500 batteries from more than 50 sellers in the Nordics and Netherlands. clingsystems.com\nMindler\nThis digital therapy service connects patients to mental health professionals with just a few taps of the screen. Since launching in 2018, Mindler has hosted more than 375,000 digital psychologist visits; video call sessions are combined with in-app treatment plans. Its popularity surged during Covid lockdowns, with monthly active users having more than quadrupled to 13,000 since the pandemic. Cofounded by physician Rickard Lagerqvist and psychologists Rickard Färdig and Johannes Hatem, it’s since expanded to four more markets—including the UK—and raised nearly £34 million (around $38 million) in funding. mindlercare.com\nClimateView\nFrom Malmö to Dundee, Cincinnati to Nottingham, ClimateView helps cities around the world reach net-zero through its ClimateOS platform. Local authorities manage, track, and then execute data-led climate action plans in the transition toward zero-carbon economies. “Cities need better intelligence to make collaborative climate decisions,” explains ClimateView cofounder Tomer Shalit. A former IT consultant, he previously provided agile solutions to banks and insurance firms. “If they use these methods to solve complex problems effectively, why not apply them to the most important problem of all?” Founded alongside Jeff Goens and Einar Bodstrom, it most recently raised a £8.6 million ($9.7 million) Series A round. climateview.global\nPocketLaw\nFormer M&A lawyer Kira Unger and ex-McKinsey consultant Olga Beck-Friis launched legal tech startup PocketLaw in 2018 to cut through the red tape that often ensnares small- and medium-size businesses. Its contract creation and management platform is now used by more than 6,000 companies, easing the burden of everyday legal needs by digitizing day-to-day paperwork. Since launching in 2020, PocketLaw has quadrupled in size year after year. It’s also opened a London office, with a team of lawyers adapting the tech to the nuances of UK company law. In May, it raised £8.5 million ($9.6 million) in Series A funding. pocketlaw.com\nSelah Rui Li and Marc van Almkerk, cofounders of Ellure.PHOTOGRAPH: CHRISTOPHER HUNT\nEllure\nEllure’s cosmetic IoT-enabled 3D printers are able to design, formulate, and manufacture lipstick on-demand in minutes. Not only does that mean 10,000 shades to pick from, but waste and overproduction typically found in the beauty industry is dramatically reduced—applicator tops, for instance, are 3D-printed from corn-based materials. “Our research shows 7 percent of cosmetics and 14 percent of lipsticks are unsold at retail because customer demand cannot be estimated wholly accurately,” explains cofounder Selah Rui Li, who launched the startup in 2019 alongside Marc van Almkerk. Following a small-scale pilot in the US and funding from the European Institute of Innovation and Technology, Ellure is moving toward its first product launch this year. ellure.io\nDework\nDework has been touted as the LinkedIn for Web3: a decentralized job marketplace for crypto and blockchain gig workers. Founded by Lonis Hamaili and David Fant, the collaboration tool enables decentralized autonomous organizations to recruit, organize teams, manage projects, and pay contributors with native tokens. Conversely, contributors can connect their personal Discord account to the platform, build a profile, and sign smart contracts that match their skillsets. Fresh from a £4 million ($4.5 million) pre-seed funding round led by Paradigm and Pace Capital and joined by former Coinbase CTO Balaji Srinivasan, the platform already boasts 11,000 users following its December 2021 launch. dework.xyz\nValidio\nData engineering is typically a complex business. Validio helps strip that back. Its platform enables even one-man teams to have capabilities closer to a Silicon Valley giant: Through machine learning technology, unknown data failures can be easily caught and data quality can be automatically validated. Founded by Patrik Tran, Urban Eriksson, and Oliver Molander in 2019, it’s now a Google Cloud build partner. Among Validio’s clients are Stockholm escooter startup Voi and digital electricity supplier Tibber. In June, it raised £12.2 million (around $13.8 million) in seed funding led by Lakestar, an early backer of the likes of Spotify and Revolut. Among the angel investors? Swedish football legend Zlatan Ibrahimović. validio.io","creation_date":"2022-10-07","tags":["","EUROPE'S HOTTEST STARTUPS 2022","STARTUPS"],"author":"BY ALEX CHRISTIAN","category":null}