{"id":"fa1e2fa3-6b52-481d-81be-dc5e7ebd969a","article_link":"https://medium.com/@areonnetwork/synthetikai-set-to-be-the-first-tokenized-project-on-areon-chain-838e52f597be","website_source":"Medium","article_type":"Tweet","summary":"Private sale starts on May 14","title":"SynthetikAI set to be the first tokenized project on Areon Chain","detailed_content":"Hey Areonites!As you remember, Areon Foundation announced a new and trusted project to be launched on the Areon Chain for the first time.To expand our ecosystem, the foundation will boost useful and promising projects, promoting them for the benefit of all Web3 space.The first project to be endorsed by Areon Network in this manner will be SynthetikAI: a creative use of generative AI to facilitate creating and minting NFTs easily on available chains.In order to boost the project funding and to reach their roadmap goals faster, the SynthetikAI team will use CryptoHUB launchpad for their IDO event.The event will be held in two rounds: private and public. Exclusive to Areon, certain roles have access to the first round via whitelisted wallets.The private round is on 14th of May while the public round will take place on 16th of May. You can find the details below.Before we get to that, let’s take a closer look at the SynthetikAI project and understand why the Areon Foundation decided to endorse it.SynthetikAI is a platform that enables anyone to easily create NFTs, leveraging the power of generative Artificial Intelligence. While this is nothing new, SynthetikAI added several more steps of convenience for users.You are able to mint your NFT artwork and instantly create a collection too. Then, you can simply use any popular marketplace to sell your NFT creation.Utilizing AI-powered creativity, users can input their vision in the form of a written prompt. Then, they can select among the artwork options and immortalize their collections on the Areon Chain. Supported by the leading AI engines, SynthetikAI simplifies the NFT creation process, allowing users to convert their digital artworks into NFTs within seconds.SynthetikAI is a great example of using publicly available technologies and making something more convenient in a creative and intelligent manner. This is exactly the type of creative environment Areon Foundation hopes to cultivate and stimulate within Areon Network.Visit https://cryptohub.investments/ official website and select Areon Mainnet from the network menu in the top right corner.All tokenization projects boosted by Areon Network will grant exclusive benefits to our validators, delegators and stakers.This launch will have an exclusive whitelist for the private sale from the token price $0.00075 instead of the public round price $0.001.The whitelisted members of our community for this private sale include (1) Areon Chain validators and (2) delegators, (3) $AREA stakers, (4) Areon Champions (brand ambassadors) and (5) giveaway raffle winners from the SynthetikAI team’s tweet post.The maximum amount of tokens you can purchase in the private round is calculated based on how much $AREA you added into stake or validator pools.Special cases such as brand ambassadors or raffle winners will be able to buy fewer tokens, compared to others (unless they are also validators, delegators or stakers).ATTENTION: 24 hours before the private sale starts, we will take a snapshot and start calculating whitelisted wallets! The private sale starts at 14 May, 20:00 UTC.Important note:Due to the ongoing holding activity for AreonX airdrop eligibility, for validator pools or for staking pools, those who wish to join the private round must ensure that they have enough unstaked $AREA in their wallets.The private round purchases WILL NOT be deduced automatically from your staked amounts. During the event, you must actively purchase the tokens via CryptoHub. Please ensure that you are ready BEFORE 13 May 20:00 UTC (snapshot).Crypto Hub is the First Stake-to-Own (S2O) Launchpad in the market, which is powered by the community and tailored to empower Web3 Projects.Since 2020, the platform provides the resources, tools, and guidance Web3 projects need to go to market faster. CryptoHub is also Areon Network’s first launchpad.More about this launchpad : https://docs.cryptohub.investments/1) Make sure you review the SynthetikAI project website and whitepaper at https://synthetik.app2) If you wish to take part in this token sale event, please visit https://cryptohub.investments/ official website and select Areon Mainnet from the network menu in the top right corner.3) Select Launchpad from the website menu, or visit this link: https://cryptohub.investments/presale/all4) Find SynthetikAI presale event and click View. Carefully review the information on this page.5) Connect your wallet and purchase the tokens with your available $AREA.Note: Please remember that your staked coins (in the validator pools or staking pools) will not be automatically used. Similarly, you should also pay attention to not losing your airdrop rights earned by holding for AreonX launch campaign.As the Areon Foundation, we understand that earning and keeping the trust of our holders is everything to us. We endorse SynthetikAI and trust in their project. That is why we are enforcing a refund policy in case of an unforeseen problem, in order to protect our community.SynthetikAI is committed to keep the $STK token price above the presale level for at least two weeks. In the unlikely event of the token price falling below the presale level, Areon Foundation will step in and cancel the presale event, refunding all investors fully.Yes! The SynthetikAI team pledges to give 5 demo credits to holders of minimum 1,000 $STK for creating and minting NFTs using their AI technology.Keep an eye on their social media accounts for the announcement: https://twitter.com/@SynthetikAI","creation_date":null,"tags":[],"author":"Areon Network","category":null}