{"id":"fa307979-ddb5-4327-acec-ac3c1e7bb611","article_link":"https://cointelegraph.com/news/hong-kong-officials-recommend-crypto-industry-self-regulates","website_source":"Cointelegraph","article_type":"News Article","summary":"Hong Kong regulators wrote, “Many economically developed regions in the world have established statutory semi-official industry self-regulatory institutions to focus on industry development.”","title":"Hong Kong officials recommend city’s crypto industry self-regulate","detailed_content":"The Hong Kong Securities & Futures Professionals Association (HKSFPA) has recommended the city's crypto firms set up a self-regulatory committee and monitor one another for compliance. \n“The Hong Kong financial market industry is too focused on supervision,” said the HKSFPA in an April 22 recommendation letter, “but there is no organization to maintain the overall development of the industry.\"\nThe administrative body then noted the need for Hong Kong to stay competitive in the global securities market and “consolidate its status as an international financial center.” In outlining the next steps, the HKSFPA recommended the city’s regulator, the Securities & Futures Commission (SFC), establish \"statutory self-regulating” and autonomous bodies that would instead delegate licensing powers to industry players: \n\"In the case of Hong Kong, the Commission recommends that the Securities and Futures Commission still retains the power to supervise market conduct, but splits the licensing power to solely the securities industry, A self-regulatory institution composed of the futures industry, asset management industry and virtual asset industry.\"\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nAs per a similar recommendation letter last August, the HKSFPA spoke of a “balanced supervision and development\" that prevents the Hong Kong virtual assets industry \"from going to the extreme direction of supervision.\"\nHong Kong Monetary Authority, one of the city's financial regulators (Wikipedia Commons)\nThat said, self-regulation doesn't always come with a balanced risk-reward dynamic. \nFor one, Lithuania is tightening its crypto regulations starting in 2025 after reports of compliance failures and embezzlement. The Baltic nation has issued licenses to more than 580 crypto firms and currently maintains little oversight from its licensees. \nHowever, Hong Kong regulators have been much more tolerant of virtual asset firms than their counterparts in other parts of the world. \nOn April 15, the SFC approved spot Bitcoin and Ether exchange-traded funds for issuers, including Harvest Fund Management, Bosera Asset Management, and China Asset Management (ChinaAMC). Last year, the regulator issued official virtual asset licenses to crypto exchanges Hashkey and OSL. \nMeanwhile, the U.S. Securities and Exchange Commission has not yet approved a spot Ether ETF or offered specific licenses for crypto exchanges to register. In addition, the outlook for their approvals currently remains grim.  \nRelated: Hong Kong investment firm Victory Securities reveals Bitcoin and Ether ETF fees\nExplore more articles like this\nSubscribe to the Cointelegraph Research Newsletter\nSelect the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays\nSubscribe","creation_date":"2024-04-22","tags":["#Blockchain","#Cryptocurrencies","#Hong Kong","#Business","#Adoption"],"author":"by Zhiyuan Sun","category":null}