{"id":"fab532bd-8150-419e-ae48-c3e175004abd","article_link":"https://www.wired.com/story/is-crypto-a-security-a-us-judge-decide-ripple-sec-xrp/","website_source":"Wired","article_type":"News Article","summary":"The Securities and Exchange Commission’s case against Ripple over the XRP token will establish a critical precedent.","title":"A New York Court Is About to Rule on the Future of Crypto","detailed_content":"THREE DAYS BEFORE Christmas 2020, the US Securities and Exchange Commission charged Ripple, a company based in San Francisco that provides the infrastructure for cross-border payments, and two of its executives with conducting a $1.3 billion unregistered securities offering by selling a cryptocurrency, XRP. The same day, Ripple announced it would “fight.”\nAfter more than two years of protracted legal conflict, all of the evidence has been heard, and there remains nothing left but for Judge Analisa Torres of the Southern District of New York to issue a verdict. Those with a stake in the outcome, which will reverberate throughout the crypto sector, have been attempting to divine when a judgment might land, based on the judge’s past ruling patterns. Some believe a resolution is only days away. \nIn bringing the charges, the SEC has staked a claim to jurisdiction over cryptocurrency. At the center of the suit is the question over whether XRP, the crypto token on which Ripple’s services are based, should be classified as a security—a tradable financial instrument like a bond or derivative—or something else entirely.\nFEATURED VIDEO\nFinancial Advisor Answers Money Questions From Twitter\nIf the court rules that XRP is a security, it would follow that almost all other crypto tokens are too, making them subject to the SEC’s supervision. Not only would this impose burdensome registration and reporting requirements on crypto firms, but it also may have legal consequences for entities that have issued tokens or helped people to trade them without SEC approval. Even large US-based exchanges may suddenly find themselves in the crosshairs. \nThat, says defense lawyer John Deaton, who supplied expert testimony on the case on behalf of holders of XRP, would be “very bad news” for crypto businesses.\nIn the absence of legislation that makes clear the classification of crypto assets in the US, the question of whether they should be treated as securities has to be assessed on a case-by-case basis through the application of the Howey test. Under the test, an investment contract (in this context, a security) is defined as “an investment of money, in a common enterprise, with a reasonable expectation of profits, to be derived from the efforts of others.”When the SEC charged Ripple and its executives, it declared that XRP met these criteria and that, by raising funds through the sale of XRP, the company was in violation of federal securities law. \nAlthough Ripple is not itself the issuer of XRP, which sits atop the open source XRP Ledger, some of its executives were part of the group that developed the token. The firm had also received a donation of 80 billion XRP in the early 2010s (worth around $30 billion at present) to develop use cases—some of which it sold off.\nRipple is challenging the SEC’s analysis on two fronts: It is arguing that its sale of XRP does not qualify as an investment contract because no contracts were signed when the transactions took place, and separately, that XRP does not satisfy the prongs of the Howey test.\nStuart Alderoty, chief legal officer at Ripple, says the company is certain that XRP does not meet any of the Howey criteria, but that it is particularly confident that there is no common enterprise—a group undertaking that affects the fortunes of XRP investors—among XRP holders, only “common interest.” \nHowever, the SEC has long said that the majority of cryptocurrencies are securities, because people invest with the goal of turning a profit and, although tokens sit atop decentralized blockchain networks, many projects are in practice sufficiently centralized to meet the definition of a common enterprise.\nThe SEC declined to comment for this article.\nSpeaking at a conference in September, SEC chair Gary Gensler called on crypto businesses to register with the agency. “Given that many crypto tokens are securities, it follows that many crypto intermediaries are transacting in securities and have to register with the SEC in some capacity,” he said.\nHowever, US government bodies have disputed the SEC’s right to regulate crypto. In a lawsuit filed on March 9 against crypto exchange KuCoin, New York Attorney General Letitia James alleged that ether (the cryptocurrency of the Ethereum network), among other crypto assets, should be treated as a security. But the Commodities and Future Trading Commission (CFTC), another US financial regulator, contends that ether is a commodity and should therefore come under its purview.\nThe SEC has been pushing the crypto industry hard over the past four months following the implosion of crypto exchange FTX in November, which took hundreds of millions of dollars in customer funds down with it. Since then, the SEC has launched a series of quickfire actions against crypto businesses serving the US market.\nIn January, the regulator charged crypto exchange Gemini and crypto lender Genesis Global Capital over a service that allowed US customers to earn interest on their assets, which the agency alleged was an unregistered securities offering. In a Twitter thread, Gemini cofounder Tyler Winklevoss called the charges “a manufactured parking ticket” and announced that “we look forward to defending ourselves,” but neither the company nor Genesis responded to a request for comment.This was followed in February by a settlement with another exchange, Kraken, which agreed to halt its crypto staking service in the US, and a threat to sue crypto firm Paxos over its BUSD stablecoin. In both instances, the SEC again claimed the parties were in breach of securities laws. In a statement, Paxos wrote that it “categorically disagrees with the SEC.”\nHowever, the agency has suffered setbacks over the past few weeks in bids to block crypto exchange Binance from purchasing the assets of bankrupt crypto lender Voyager Digital, and asset management firm Grayscale from bringing to market a bitcoin exchange-traded fund (ETF).\nBecause the case is being held in a district court, the outcome will not set a “binding precedent,” says James Filan, a defense lawyer and former federal prosecutor. Therefore, the verdict is not required to be factored into judgments on similar cases moving forward. However, the judgment may establish what’s known as “persuasive precedent,” he says, which could influence the thinking of judges in future cases.\nIf the SEC were to win, it would be handed the advantage in its “turf war” with the CFTC, Filan says. The crypto industry will not escape supervision in either scenario, but the CFTC is seen by the exchanges (including FTX) as a soft touch by comparison.\nIf the SEC is established as crypto's main regulator, companies may need to register their US-facing services with the agency. But many crypto firms have had a “hall pass” to operate in gray areas, says securities attorney Aaron Kaplan. An SEC victory would mean they have to disentangle their various business lines to meet regulatory requirements.\n“This would be very difficult for many crypto companies to accomplish,” Kaplan says. “As such, [they] could choose to move and operate outside the US … Those that don’t will need to evolve and come into compliance—or die.”\nRipple has already announced it will appeal in the event of a loss. Doing so would send the case to the Second Circuit—and then potentially the Supreme Court. Alderoty does not expect the SEC to appeal, but instead to argue the result was an aberration. However, Filan suspects the agency will feel it has little choice if it hopes to preserve its claim to jurisdiction. \nAs a consequence of the lawsuit, Alderoty says, Ripple has been forced to pull back on efforts to expand in the US and focus instead on other territories, like Singapore. Since the charges were brought, the firm has chosen to operate practically “as if the SEC has won,” to ensure the business remains viable no matter the outcome. If Ripple wins the case, it will be able to lean back into the US.\nCrypto markets are likely to react to the judgment when it comes, as traders price in either a renewed clarity over the legality of crypto services provided in the US, or the prospect of further enforcement action.\n“We know the crypto market will quickly incorporate the verdict, and token prices will almost certainly be affected,” says Katherine Snow, director of legal at crypto research firm Messari.\nNobody knows precisely when the verdict will land; it could be days, weeks, or even months. Until then, the crypto industry must wait, because “anybody trying to predict the outcome,” Filan says, “is either going to be lucky or wrong.”","creation_date":"2023-03-21","tags":["","CRYPTO","CRYPTOCURRENCY","REGULATION","SEC","FINANCE"],"author":"BY JOEL KHALILI","category":null}