{"id":"fb30238b-2722-476b-adbe-9737e7461d79","article_link":"https://cointelegraph.com/news/bitcoin-lightning-labs-taproot-stablecoin-functionality","website_source":"Cointelegraph","article_type":"News Article","summary":"Elizabeth Stark unpacked the basics of Bitcoin Lightning at FT Live’s Crypto and Digital Assets Summit and teased a new development on Bitcoin’s leading layer 2.","title":"Stablecoins on Bitcoin coming soon, suggests Lightning Labs CEO","detailed_content":"Stablecoins running on Bitcoin are edging closer to reality through new functionality built by Lightning Labs using the network’s Taproot upgrade implemented in late 2021.\nElizabeth Stark, CEO of Lightning Labs, unpacked the latest development from the Bitcoin development firm at FT Live’s Crypto and Digital Assets Summit in London.\nThe firm’s co-founder also gave an eloquent explainer of Bitcoin and the Lightning Network to an audience of traditional finance players.\nLightning Labs co-founder Elizabeth Stark on stage at FT Live: Source: Gareth Jenkinson\nLightning Labs’ Taproot assets protocol is building functionality to bring stablecoins and tokenized assets to Bitcoin. According to Stark, developers have made significant headway toward this goal, culminating in the testing of transactions on Lightning:\n“We released an early part of the code in October and recently demoed the first-ever transaction on Lightning of an asset. The idea is to have crypto dollars and stablecoins on the Bitcoin blockchain.”\nStark added that traditionally, these digital assets have operated on other blockchains that have suffered from high fees and other issues. She argues that Bitcoin’s network is perhaps best placed to facilitate the use of stablecoins because it “is the most secure and decentralized” blockchain.\nBitcoin and stablecoins value as a store of value\nStark went on to discuss the merits of Bitcoin (BTC) and stablecoins as a store of value, especially in nations grappling with inflation issues and devaluing fiat currencies.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\nThe Lightning Labs CEO said stablecoin adoption has grown dramatically since the COVID-19 pandemic, with users largely being based in emerging markets.\n“The stickiest users have been those looking for a stable store of value. In some cases, they’re using Bitcoin. In other cases, they’re using stablecoins, and in some cases, it’s a combination of both,” Stark explained.\nRelated: What is the Bitcoin Lightning Network, and how does it work?\nThe two largest stablecoin players — Tether (USDT) and Circle’s USD Coin (USDC) — hold more United States Treasury bonds combined than major nations like Germany and South Korea. Stark said this is an intriguing fact, given that end-users don’t benefit from the interest of holding stablecoins.\nFor those in countries grappling with hyperinflation or precarious economic environments, the choice of holding a stablecoin is driven by the need for a store of value.\nLightning-powered stablecoins will be superior\nGiven the significant growth in value of the stablecoin market, Stark said there is a need for the infrastructure to enable the issuance of stablecoins and real-world assets on the Bitcoin blockchain.\n“That’s why we’re building this protocol, this technology right now. We’re not issuing assets, we’re building the rails. Asset issuers will use our technology to issue real-world tokenized assets,” Stark explained.\nRelated: Coinbase integrates Lightning Network for Bitcoin transactions\nThe CEO added that financial institutions could issue gold assets, stablecoins and other fiat-backed assets on Bitcoin and then transact over the Lightning Network.\nPerhaps most telling was the relative cost compared to other blockchains and conventional traditional finance systems, which Stark highlighted:\n“If you look at Visa where fees in the U.S. can be upward of 3%, or even 1%, the fees, transacting with stablecoins on Lightning can be dramatically lower, a cent or less than that.”\nStark added that this could competitively enable people to transact globally at far lower rates than through traditional networks.\nMagazine: 68% of Runes are in the red — Are they really an upgrade for Bitcoin?\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-05-09","tags":["#Bitcoin","#Blockchain","#Bitcoin Analysis","#Adoption","#Bitcoin Payments","#Lightning Network","#Lightning"],"author":"by Gareth Jenkinson","category":null}