{"id":"fd12c395-ddb5-4e18-9cab-db1b69aa38c0","article_link":"https://cointelegraph.com/news/etherscan-ads-phishing-campaign","website_source":"Cointelegraph","article_type":"News Article","summary":"The wallet drainer scam involves luring users into fake websites, prompting them to link their crypto wallets and eventually draining all funds.","title":"Etherscan ads behind massive phishing campaign","detailed_content":"Several Ethereum blockchain explorer Etherscan advertisements have been identified as part of a major phishing campaign targeting Etherscan users.\nOn April 8, X community member McBiblets identified some advertisements on Etherscan as wallet drainers, warning users against being redirected to phishing websites when clicking on such advertisements.\nSource: McBiblets\nFurther investigations revealed that the phishing advertisements appearing on Etherscan were also displayed on various known phishing websites.\nPicking up on McBiblets’ lead, Web3 anti-scam platform Scam Sniffer found that the phishing advertisements spread beyond Etherscan and were showing up on popular search engines such as Google, Bing, DuckDuckGo, as well as social media platform X.\nSource: Scam Sniffer\nScam Sniffer suspected the lack of oversight from advertisement aggregators as the root cause of the large-scale phishing campaign:\n“Etherscan aggregates ads from platforms like Coinzilla and Persona, where insufficient filtering could lead to exposure to phishing attempts.”\nThe wallet drainer scam involves luring users to fake websites and prompting them to link their crypto wallets. Once linked, the scammer can withdraw funds into their personal wallet addresses without user authentication or permission.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nBlockchain security firm SlowMist’s chief information security officer, 23pds, also issued a warning about the phishing advertisements on Etherscan:\n“Be careful, there are phishing ads on etherscan.”\nThe infamous and seasoned cyber phishing organization Angel Drainer is suspected of running the phishing attack campaign against Etherscan users. However, no concrete evidence about the scammers’ identity has yet been discovered.\nREAD COINTELEGRAPH’S GUIDE TO LEARN MORE ABOUT PHISHING ATTACKS AND HOW TO PREVENT THEM.\nRelated: Crypto phishing attacks reached ‘alarming levels’ — CertiK co-founder\nIn 2023 alone, crypto phishing scams stole nearly $300 million from over 324,000 victims through wallet drainers.\nNotable wallet drainers active in 2023. Source: Scam Sniffer\nScam Sniffer also reported that even when drainers close down, “phishing gangs” just take their business elsewhere, as there seems to be no lack of platforms providing services for scammers.\nMagazine: AI didn’t kill the metaverse, it will build it — Alien Worlds, Bittensor vs Eric Wall: AI Eye\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nGet critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday\nSubscribe","creation_date":"2024-04-08","tags":["#Blockchain","#Phishing","#Wallet","#Ethereum","#Transactions","#Advertisement","#Scams"],"author":"by Arijit Sarkar","category":null}