{"id":"fdb1c20b-1386-4644-a7cb-fb013e834490","article_link":"https://cointelegraph.com/news/avail-integrates-layer-2-networks-create-cost-efficient-chains","website_source":"Cointelegraph","article_type":"News Article","summary":"Avail joins forces with leading layer-2 networks for increased Web3 scalability through data availability and rollup unification for a more interconnected blockchain landscape","title":"Avail integrates leading layer-2 networks to create more cost-efficient chains","detailed_content":"Avail, a blockchain solution focused on Web3 unification, announced new strategic collaborations with five leading layer-2 networks in an effort to create more scalable data availability and rollup unification.\nOn April 25, Arbitrum, Optimism, Polygon, StarkWare and zkSync were revealed as new partners that will leverage Avail’s data availability layer and unification architecture. Avail said the collaboration aims to create more scalable, cost-efficient, composable chains that are able to onboard millions of users.\nThis is possible through Avail’s data availability (DA) layer, which will serve as the basis for the unification architecture through mathematical guarantees of data availability, along with a built-in validator ecosystem.\nMarc Boiron, CEO of Polygon Labs, said that a strong DA layer is important for an enhanced developer experience:\n“It’s important to provide this type of optionality to developers when the ultimate goal is to enable a thriving and robust ecosystem of connected blockchains through the AggLayer.”\nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nLimited data availability remains one of the blockchain industry’s biggest roadblocks to mainstream adoption and optimizing networks for mass usage. Without the proper amount of DA, scaling becomes bottlenecked.\nRelated: ‘No bridges or wrapping’ — dWallet and Avail are building native Bitcoin rollups\nAccording to the announcement, Avail is operating with an “un-opinionated base layer” that can support any blockchain. \nEli Ben-Sasson, CEO of StarkWare, said that solutions that optimize data and unify the Web3 are key to building a “seamless user experience for everyone.”\nThe idea of lowering friction for developers to scale for mass adoption of blockchain applications has been widely discussed throughout the last year. It is a major hurdle for networks looking to expand.\nDuring the ETHGlobal conference in London in March, Avail co-founder Anurag Arjun spoke with Cointelegraph, stressing the ecosystem’s need for more infrastructure that unifies rollups. \nIn March, he said that it aims to become a rollup-agnostic platform serving major rollup protocols such as StarkWare, zkSync, Arbitrum and Optimism. This latest announcement marks a step in that direction.\nIt comes shortly after Avail announced an airdrop on April 18 of 600 million of its native AVAIL tokens to users.\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExchange or buy ARB\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-25","tags":["#Blockchain","#DeFi","#Layer2","#Polygon","#zk-Rollup","#Arbitrum"],"author":"by Savannah Fortis","category":null}