{"id":"feba02ae-2211-469b-9c01-bc3a04b52370","article_link":"https://cointelegraph.com/news/sbi-group-xrpl-japan-ripple","website_source":"Cointelegraph","article_type":"News Article","summary":"Ripple has partnered with HashKey DX to introduce XRP Ledger-based blockchain solutions to the Japanese market.","title":"Ripple breaks ground in Japan, SBI Group to use XRPL for supply chain solutions","detailed_content":"SBI Group will become the first Japanese corporation to use XRP Ledger (XRPL) blockchain supply chain solutions as Ripple looks to drive enterprise blockchain solution use cases in Japan.\nSBI will break new ground in Japan after Ripple announced it has entered a strategic partnership with Tokyo-based consulting firm HashKey DX. The latter is set to introduce XRPL enterprise solutions to the Japanese market.\nHashKey will collaborate with Ripple and SBI Ripple Asia, a joint venture between SBI Holdings and Ripple, to build and introduce supply chain finance solutions in the country. The tools will be built on the XRPL, the decentralized blockchain network initially developed by Ripple Labs.\nRelated: Ripple to launch US dollar stablecoin, aims to compete with USDT and USDC\nA statement from HashKey DX head Andy Dan highlighted XRPL’s enterprise track record, settlement speeds, low costs and scalability as key metrics to build its supply chain finance solution.\nAdvertisement\nJump in the Probably Serious Quiz and get 0% fees for USDt on TON and Toncoin exchanges on Changelly\nAd\n“We are confident in our ability to drive meaningful transformation and introduce innovative, cutting-edge solutions for Japanese businesses,” Dan said.\nOver the past five years, HashKey Group has developed and implemented blockchain-powered supply chain finance solutions in mainland China. Since its launch in 2019, the firm has over 4,000 registered companies, including 23 banks and 4,300 suppliers, that use its blockchain services.\nRelated: XRPL blockchain plugs into cross-chain DeFi\nThe company reports that the total trade amount recorded exceeds $7 billion. Its blockchain solution has also financed nearly $3 billion of transactions in China.\nAs Cointelegraph previously explored during Paris Blockchain Week, RippleX senior vice president Markus Infanger believes the future of tokenized markets could exceed $16 trillion in value as traditional finance players begin to actively use blockchain networks.\nInfanger said that TradFi players are finally bringing financial assets on-chain as they look to deploy for production and solve pain points in various value chains. This is not only happening on permissioned, centralized networks but also on decentralized protocols like XRPL, Stellar and Ethereum.\nInfanger said that advanced conversations with various financial institutions are ongoing, and they are exploring tokenization projects to issue assets on the XRP Ledger. These firms already have distribution lined up and can articulate use cases and how they want to use the underlying blockchain.\nCointelegraph has reached out to Ripple Labs for additional information about the partnership with HashKey DX and SBI Ripple Asia.\nMagazine: 7 ICO alternatives for blockchain fundraising: Crypto airdrops, IDOs & more\nExchange or buy XRP\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd","creation_date":"2024-04-30","tags":["#Blockchain","#Japan","#Ripple","#Adoption","#XRP","#SBI"],"author":"by Gareth Jenkinson","category":null}