{"id":"fec0b0d9-c29c-4997-9cfe-f133cf275b97","article_link":"https://cointelegraph.com/news/zachxbt-refutes-assistance-memecoin-devs-throw-tokenholders-under-bus","website_source":"Cointelegraph","article_type":"News Article","summary":"“Together, let’s stand against harassment and prioritize mental health in all aspects of our lives,” wrote Complex’s developers as they shut down the memecoin project.","title":"ZachXBT won’t assist after memecoin devs throw tokenholders under the bus","detailed_content":"Prominent blockchain sleuth ZachXBT has refused to assist holders of the Complex (SIMPLE) memecoin, minted on the Base blockchain, after its developers abruptly shut down the project on April 4.\n“After careful consideration and with heavy hearts, we’ve made the difficult decision to sunset Complex,” the project wrote, adding: “While this project has been a labor of love and a source of inspiration for our team, recent instances of harassment have created an untenable environment that impacts the mental well-being of our members.” \nMeanwhile, SIMPLE will remain liquidity-locked until a later date, allowing users to sell their token holdings until then. At the time of publication, SIMPLE has lost over 90% of its value in the past 24 hours and now has a negligible market cap.\nIt appears that users were very dissatisfied with the developers’ reference to “mental health” as the main reason for the project’s shutdown. “What kind of cringe shit is this?” wrote one user. “You guys didn’t even last a week and rugging using mental health as an excuse, might as well just rug without this pathetic attempt of a post expecting people to clap for you. Idiots.” \nAdvertisement\nTrade smart with Markets Pro instant alerts. Claim your 65% discount now!\nAd\nOther angry users turned to ZachXBT in search of help. However, the blockchain sleuth was also dissatisfied, albeit at the incoming help requests: “No, I do not care about your meme coins stop asking me,” replied Zach. “I simply dislike spending long periods helping people who willingly choose to gamble on vaporware meme coins vs actual victims,\" he continued. “You do not even follow me and then speak poorly of me yet expect me to want to spend time helping you for free?”\nSource: ZackXBT\nAnother user who chimed in appears to have developed a deeper (and more poetic) understanding of the situation. “You expose people, and they attack you; you don’t expose, people attack you; God bless you, ZachXBT, this space wouldn’t be the same without you,” they wrote. \nIt appears that the Complex memecoin project ended just days after its initial debut on March 30. The protocol had previously reached a high of 3,013 tokenholders. Amid the ongoing crypto bull market, memecoins have displayed average returns of 1,312.6%, the highest among the top tokens by market capitalization. \nRelated: Trader turns $13K into $2M within 1 hour as memecoin frenzy continues\nExplore more articles like this\nSubscribe to the Cointelegraph Research Newsletter\nSelect the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays\nSubscribe","creation_date":"2024-04-05","tags":["#Blockchain","#Cryptocurrencies","#Base","#DeFi","#Memecoin"],"author":"by Zhiyuan Sun","category":null}