{"id":"fee71dbf-0754-4ad3-bbed-a2c0f1ce1ea5","article_link":"https://medium.com/cumulo-pro/how-to-manage-your-assets-of-nim-network-the-first-dymension-rollup-4afd25afc9c6","website_source":"Medium","article_type":"Blog Post","summary":"By Cumulo.pro","title":"How to manage your assets of NIM Network, the first Dymension Rollup.","detailed_content":"∘ NIM metrics, supply, TVL and chain-id information\n∘ NIM Explorer\n∘ How to display the NIM token in my wallet\n∘ Another way to display the token.\n∘ How to display the NIM token in my MetaMask wallet\n∘ How to view your NIM balance in Portal\n∘ Send your NIM tokens to the Dymension network.\n∘ Transfer tokens from NIM\n∘ NIM Swap\n∘ How to staking in the NIM network\n∘ NIM PoolThe balance will be reflected in your Keprl wallet.The NIM token should already appear in your wallet, you can check it in the top right corner of your wallet.Your NIM balance will appear on the Nim Network.Dymension uses eIBC to move tokens between its liquidity hub networks.The eIBC transfer may take longer than usual if the network is saturated.When the token transfer is complete, the tokens will appear on the Dymension network and you will be able to see them in your wallet in Portal.A message confirming the transfer will appear.Once we have transferred NIM tokens to the Dymension network we can swap them for another token.Go to Portal.Select the token to swap and the amount, then click on the Swap button.Approve the transaction in your wallet.A message confirming the completed swap operation will be displayed.A message confirming your staking process will appear.And your stake amount will appear in My Delegations.Liquidity pools allow you to perform farming operations in the Pools by accessing the Pools menu:The specified APR is currently based on swap fees + the Pool’s own APR approved in governance, 0.20% of each swap is added to the liquidity pool, which increases your LP position.NOTE: To create a NIM pool you must first transfer it to the Dym network, as indicated in the section: ∘ Send your NIM tokens to the Dymension network.💈Find your NIM pool and add liquidity by clicking on Add liquidity:💈Choose the amounts of the pair to create your new position and sign the liquidity aggregation:💈Once the transaction has been approved, a confirmation message will appear:💈You can already see the pair in My Positions, now you have to activate the Bonded shares to start receiving rewards from the pool, click on Bond to start generating returns:💈In the next panel, indicate the amount of liquidity you wish to stake and click on Bond Liquidity:💈Confirm the transaction in your wallet:💈A message will appear to confirm the operation:💈Click on one of your positions to see more details about it:Pool rewards considerations:💈The rewards from each pool will always be received directly into your wallet in DYM tokens.💈Unlocking a pool to obtain liquidity tokens has an unlocking period of a few minutes.Twitter | Medium | LinkedIn | Discord | Telegram | cumulo.pro","creation_date":null,"tags":["Nimnetwork","Blockchain","Cumulo","Rollup"],"author":"Cumulo","category":null}