{"id":"ff015592-b74a-430d-9054-e565a40fbd3d","article_link":"https://cointelegraph.com/news/chinese-police-probe-filecoin-liquid-staking-platform-stfil","website_source":"Cointelegraph","article_type":"Tweet","summary":"Liquid staking protocol STFIL claimed in a post that the FIL tokens on its platform moved to an external address following an investigation by Chinese authorities.","title":"Chinese police probe spurs mysterious token movements and platform upgrades","detailed_content":"Filecoin liquid staking protocol STFIL claims that there have been token movements and unexplainable protocol upgrades following an investigation of their team members by the Chinese police. \nOn April 9, the protocol expressed its belief that Chinese authorities are still investigating its core technical team members. According to the X post, the detained members have already received legal assistance. It wrote:\n“We believe that the STFIL core technical team is under investigation by local Chinese police, and we understand lawyers have been hired to understand the current situation and provide legal assistance to the individuals under detention.”\nThe liquid staking protocol also said that while its team members were detained last week, Filecoin\nFIL\n$5.92\n tokens on the STFIL platform were transferred to an “unknown, external address.” At the time of writing, the address holds 2.5 million FIL tokens worth about $23 million.\nAddress holding the tokens from the staking platform. Source: Filecoin Explorer\nFurthermore, STFIL also claimed that there were “abnormal, unscheduled upgrades” in the past few days within the protocol amid the investigation.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nThe staking platform said they are seeking assistance and urged the community to help monitor the address that received the tokens. “We hope that the community can help track this unknown address and discuss ways to protect the interests of stakeholders,” it wrote.\nSource: STFIL Protocol\nCommunity members on X claiming to have staked their FIL tokens on the platform have been discussing how they could recover their funds. Some have questioned how the police can take their funds.\nRelated: Crypto staking rewards are now 450% higher than S&P 500 dividends\nMeanwhile, the Filecoin token remains strong despite the issues. On April 9, FIL recorded a seven-day high of $9.32 and had a 24-hour volume of $265 million.\nCurrently, the token hovers aroun $9.12, according to coin information tracker CoinGecko.\nFilecoin’s seven-day price chart. Source: CoinGecko\nThis is not the first time Chinese authorities have cracked down on crypto projects. In 2023, cross-chain protocol Multichain announced that it was forced to halt its operations due to a lack of funds.\nThis happened after its CEO and co-founder, Zhaojun He, was taken into custody by Chinese police. With information scarce, the project had no choice but to wind down activities.\nMagazine: 1 in 6 new Base meme coins are scams, 91% have vulnerabilities\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nArm yourself with the latest on crypto laws and guidelines to make smart choices for your crypto ventures. Delivered every Monday\nSubscribe","creation_date":"2024-04-09","tags":["#Blockchain","#China","#Filecoin","#Staking"],"author":"by Ezra Reguerra","category":null}