{"id":"ffdfd942-f490-4578-9461-f573e8d56cf4","article_link":"https://cointelegraph.com/news/crypto-sleuth-warns-scammers-defi-protocol","website_source":"Cointelegraph","article_type":"Tweet","summary":"The group has been linked to several rug pulls, among them Magnate, Kokomo, Solfire and Lendora.","title":"Crypto sleuth warns of scammers behind DeFi protocol","detailed_content":"Pseudonymous blockchain investigator ZachXBT issued a warning about a group of scammers attempting to entrap more victims in a new fraud using millions of stolen funds. \nIn a thread on X, ZachXBT disclosed the findings of an investigation over Leaper Finance, a lending protocol based on Blast. According to the analysis, the group is behind several rug pulls, including those that hit users of Magnate ($6.5 million), Kokomo ($4 million), Solfire ($4.8 million) and Lendora.\n“In the past they let the TVL grow to 7 figs before stealing all of users funds deposited to the protocol and falsify KYC documents + use low tier audit firms. They now have launched scams on Base, Solana, Scroll, Optimism, Arbitrum, Ethereum, Avalanche, etc,” noted ZachXBT.\nThe group is also believed to be responsible for scams on Hash DAO, Glori Finance and ZebraDAO. Losses attributed to the group are estimated at over $20 million.\nSource: Leaper Finance\nA rug pull takes place when the developers of a blockchain-based protocol suddenly withdraw all of their funds from a liquidity pool or project wallet, essentially draining the funds invested by others. This usually happens without any warning, leaving investors with worthless tokens or assets.\nADVERTISEMENT\n3 HOURS AGO\nInnovative crypto exchange features debut at Token2049 in Dubai\nToken2049 Dubai saw innovative approaches to blend social media and trading, highlighting the evolution of crypto into a comprehensive social ecosystem.\nToken2049 Dubai hosted a dynamic gathering of more than 5,000 companies on April 18-19 at the iconic Madinat Jumeirah, showcasing the latest innovations in blockchain and crypto.\nAmong the prominent participants was Phemex, a global crypto derivatives exchange that actively engaged attendees with insightful sessions and discussions throughout the two-day event.\nPhemex’s Bulls & Bears pre-party, held at the SLS Hotel on April 17, set the stage for Token2049 with an evening of insights and celebration despite the unforeseen weather conditions. The event kicked off with a glamorous red carpet walk, followed by opening remarks from the Phemex founder.\nThrilled by our Bulls & Bears: A Trader’s Affair side-event at #Token2049! Big #Phemex updates, deep #Pulse insights, BlackCard reveals, + top networking.\n\nA big shout out to our esteemed speakers Yana from @Cointelegraph Andrew from @CoinDesk, and @MartiniGuyYT. Grateful to… pic.twitter.com/ulkj3lZ55e\n— Phemex (@Phemex_official)\nApril 19, 2024\nThe evening featured a range of activities, including expert insights from prominent figures, such as Cointelegraph CEO Yana Prikhodchenko, who shared her perspective on the growing trends in crypto media. A panel discussion featuring well-known crypto pioneers further explored cutting-edge topics in the industry.\nAt the event, Stella Chan, the chief operating officer of Phemex and co-founder of Pulse, proudly introduced the holders of the Phemex BlackCard. She also offered valuable insights into the innovative features of Pulse and the newly launched Phemex Lending Protocol.\nWhen asked about Pulse, the SocialFi platform launched in March, co-founder Stella Chan shared their plans: “Pulse shifts the paradigm from the tightly controlled and centralized framework of traditional social media to a user-empowered experience. It grants users the freedom to tailor their feeds and disseminate insights that are pertinent to the crypto community.”\n  Read more\nAs part of the latest scam endeavor, the group reportedly funded a Leaper Finance address on the Blast network with nearly $1 million laundered from previous scams, adding further liquidity to lure victims.\nShortly after Leaper Finance’s connection to the scams was revealed, the group replied to ZachXBT, harassing the investigator while announcing a “token launch.”\n“Nice work! My comrades here at Lazarus fear you yet admire you!” they said in reference to the North Korean hacker group Lazarus. Leaper Finance and Glori Finance accounts on X have been deactivated, and the projects’ websites have also gone dark.\nSource: ZachXBT\nAccording to a Feb. 29 research report by blockchain security firm Immunefi, over $200 million worth of cryptocurrency was lost to hacks and rug pulls within the first two months of 2024 across 32 individual incidents.\nMagazine: 5 dangers to beware when apeing into Solana memecoins\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nWeekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday\nSubscribe","creation_date":"2024-04-15","tags":["#Blockchain","#Hackers","#Scams","#Hacks","#DeFi"],"author":"by Ana Paula Pereira","category":null}